
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДополнительныеПараметрыФормы",ДополнительныеПараметрыФормы);
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаСопоставлений = РеквизитОбъект.ПолучитьМакет("МакетТаблицСопоставления");
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаСопоставленийВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Область.Расшифровка) Тогда
		Попытка
			ПоказатьЗначение(,Область.Расшифровка);
		Исключение
			
		КонецПопытки;
	Иначе
		//Не следует изменять защищенные ячейки, откажем в обработке
		Если Область.Защита = Истина Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ТаблицаСопоставленийПриИзменении(Элемент)
	
	Для ИндексСтрокиТаблицы = 2 По ТаблицаСопоставлений.ВысотаТаблицы Цикл
		
		ОбластьСтроки = ТаблицаСопоставлений.Область(ИндексСтрокиТаблицы,2);
		
		Если ЗначениеЗаполнено(ОбластьСтроки.Текст) Тогда
			ОбластьСтроки.Расшифровка = ПолучитьСсылку_НоменклатураПоНаименованию(ОбластьСтроки.Текст);
			
			Если ЗначениеЗаполнено(ОбластьСтроки.Расшифровка) Тогда
				Цвет = WebЦвета.Роса;
			Иначе
				Цвет = WebЦвета.ТусклоРозовый;
			КонецЕсли;
			
			ОбластьСтроки.ЦветФона = Цвет;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция ПолучитьСсылку_НоменклатураПоНаименованию(Наименование)
	СсылкаНаНоменклатуру = Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина);
	Возврат СсылкаНаНоменклатуру;
КонецФункции


&НаКлиенте
Процедура ЗагрузитьСопоставления(Команда)
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("АдресВХ",ПоместитьДанныеСопоставленияВТаблицуЗначений(ВладелецФормы.УникальныйИдентификатор));
	ПараметрыОповещения.Вставить("ДопПараметры",ДополнительныеПараметрыФормы);
	
	Оповестить("ЗагрузкаВнешнейТаблицы",ПараметрыОповещения);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
&НаСервере
Функция ПоместитьДанныеСопоставленияВТаблицуЗначений(УникальныйИдентификаторФормыВладельца)
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Ссылка");
	ТаблицаЗначений.Колонки.Добавить("Наименование");
	ТаблицаЗначений.Колонки.Добавить("КонтрагентИД");
	ТаблицаЗначений.Колонки.Добавить("Характеристика");
	
	Для ИндексСтрокиТаблицы = 2 По ТаблицаСопоставлений.ВысотаТаблицы Цикл
		
		ОбластьНаименование = ТаблицаСопоставлений.Область(ИндексСтрокиТаблицы,1);
		ОбластьНоменклатура = ТаблицаСопоставлений.Область(ИндексСтрокиТаблицы,2);
		ОбластьКонтрагентИД = ТаблицаСопоставлений.Область(ИндексСтрокиТаблицы,3);
		
		//Переносим только строки с заполненными значениями
		Если ЗначениеЗаполнено(ОбластьНоменклатура.Расшифровка)
			И ЗначениеЗаполнено(ОбластьНаименование.Текст) Тогда
			
			НоваяСтрока = ТаблицаЗначений.Добавить();
			НоваяСтрока.Ссылка = ОбластьНоменклатура.Расшифровка;
			НоваяСтрока.Наименование = ОбластьНаименование.Текст;
			НоваяСтрока.КонтрагентИД = ОбластьКонтрагентИД.Текст;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаЗначений,УникальныйИдентификаторФормыВладельца);
	
КонецФункции