&НаКлиенте
Перем
мДанныеСохранены				// Признак того, что форму можно закрывать после выполнения вопроса
;		

// ================= _ЗФ_УФ_ ===================

&НаКлиенте
Функция _ЗФ_ОбработатьАсинхронныйВызов(ТипВызова,ПараметрыВызова)
	
	//Для реализации возможности открытия этой формы внешней обработке на платформах, не поддерживающих ОписаниеОповещения,
	//(не будет пройден синтаксический контроль), обработчики асинхронных вызовов вынесены в эту процедуру.
	//Для прохождения аудита 1С:Фреш эта процедура заменяется на аналогичную, но без методов Вычислить(). Profit!
	
	Если ТипВызова = "Вопрос" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			ПоказатьВопрос(ОписаниеОповещения,ПараметрыВызова.ТекстВопроса,ПараметрыВызова.Кнопки);
		Иначе
			Вопрос(ПараметрыВызова.ТекстВопроса,ПараметрыВызова.Кнопки);
		КонецЕсли;
		
	ИначеЕсли ТипВызова = "ВыборИзМеню" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			
			ЭлементФормы = Неопределено;
			ПараметрыВызова.ДопПараметры.Свойство("ЭлементФормы",ЭлементФормы);
			
			ПоказатьВыборИзМеню(ОписаниеОповещения,ПараметрыВызова.СписокВыбора,ЭлементФормы);
		Иначе
			ВыбратьИзМеню(ПараметрыВызова.СписокВыбора);
		КонецЕсли;
		
	ИначеЕсли ТипВызова = "ВводЧисла" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			ПоказатьВводЧисла(ОписаниеОповещения,ПараметрыВызова.Число,ПараметрыВызова.Подсказка,ПараметрыВызова.Длина,ПараметрыВызова.Точность);
		Иначе
			ВвестиЧисло(ПараметрыВызова.Число,ПараметрыВызова.Подсказка,ПараметрыВызова.Длина,ПараметрыВызова.Точность);
		КонецЕсли;
	
	ИначеЕсли ТипВызова = "ПоместитьФайлы" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещенияНачало = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова_3Параметра"",ЭтаФорма,ПараметрыВызова.ПараметрыВызоваНачало)");
			ОписаниеОповещенияОкончание = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова.ПараметрыВызоваЗавершение)");
			НачатьПомещениеФайлов(ОписаниеОповещенияОкончание,,Истина,УникальныйИдентификатор,ОписаниеОповещенияНачало);
		Иначе
			ПоместитьФайлы(ПараметрыВызова.ПомещаемыеФайлы,Истина,УникальныйИдентификатор);
		КонецЕсли;
				
	ИначеЕсли ТипВызова = "ДиалогВыбораФайла" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			ПараметрыВызова.ДиалогВыбораФайла.Показать(ОписаниеОповещения);
		Иначе
			ПоместитьФайлы(ПараметрыВызова.ПомещаемыеФайлы,Истина,УникальныйИдентификатор);
		КонецЕсли;
		          
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработатьРезультатАсинхронногоВызова(Результат,ПараметрыВызова) Экспорт
		
	//Сюда в условия переносятся все присутствующие в форме обработчики результатов асинхронных вызовов
	Если ПараметрыВызова.Обработчик = "ОбработатьВыборФайлов" Тогда
		ОбработатьВыборФайлов(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ОбработатьВыборФайлов_ВебКлиент" Тогда
		ОбработатьВыборФайлов_ВебКлиент(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ПродолжитьЗаписьТаблицыСоответствий" Тогда
		ПродолжитьЗаписьТаблицыСоответствий(Результат,ПараметрыВызова.ДопПараметры);		
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ПродолжитьЗагрузкуТаблицы_ДобавлениеЗамещение" Тогда
		ПродолжитьЗагрузкуТаблицы_ДобавлениеЗамещение(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ПродолжитьЗагрузкуВнешнейТаблицы_ДобавлениеЗамещение" Тогда
		ПродолжитьЗагрузкуВнешнейТаблицы_ДобавлениеЗамещение(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "СловаМаркерыТипНоменклатуры_ЗначенияПоУмолчанию_ПродолжитьЗагрузку" Тогда
		СловаМаркерыТипНоменклатуры_ЗначенияПоУмолчанию_ПродолжитьЗагрузку(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ПродолжитьЗакрытиеФормы" Тогда
		ПродолжитьЗакрытиеФормы(Результат,ПараметрыВызова.ДопПараметры);		
		
	ИначеЕсли ПараметрыВызова.Обработчик = "Заглушка_ОписаниеОповещения" Тогда
		//Ничего не выполняем
		
	КонецЕсли;
	
КонецФункции
&НаКлиенте
Функция ОбработатьРезультатАсинхронногоВызова_3Параметра(Результат,Отказ,ПараметрыВызова) Экспорт
	Если ПараметрыВызова.Обработчик = "ОбработатьНачалоВыбораФайлов_ВебКлиент" Тогда
		ОбработатьНачалоВыбораФайлов_ВебКлиент(Результат,Отказ,ПараметрыВызова.ДопПараметры);
	КонецЕсли;	
КонецФункции


// ================= События формы ===================

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДоступноОписаниеОповещения",ДоступноОписаниеОповещения);
	Параметры.Свойство("ПрефиксИмениФорм",ПрефиксИмениФорм);
	Параметры.Свойство("СтруктураНастроек",СтруктураНастроек);
	Параметры.Свойство("НовыйМаркер",НовыйМаркер);
	
	Элементы.ТаблицаСоответствий.СписокВыбора.Добавить("СвязьНоменклатуры","Связь номенклатуры");
	Элементы.ТаблицаСоответствий.СписокВыбора.Добавить("СвязьКонтрагентов","Связь контрагентов");
	Элементы.ТаблицаСоответствий.СписокВыбора.Добавить("СвязьОрганизаций","Связь организаций");
	Элементы.ТаблицаСоответствий.СписокВыбора.Добавить("СвязьЕдиницыИзмерения","Связь единицы измерения");
	Элементы.ТаблицаСоответствий.СписокВыбора.Добавить("СловаМаркеры","Слова-маркеры");
	Элементы.ТаблицаСоответствий.СписокВыбора.Добавить("СловаМаркерыТипНоменклатуры","Маркер услуга/товар");
	
	//Установим ограничение типа для Характеристик номенклатуры
	Если Метаданные.Справочники.Найти("ХарактеристикиНоменклатуры") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элементы.СвязьНоменклатурыХарактеристика.ОграничениеТипа = ОписаниеТипов;
	КонецЕсли;
	
	//E1C-145: проблема: если обработку подключить в расширение, то нужно тащить туда же
	//все справочники для корректного назначения типа элементам. Обойдемся, просто назначив все типы при создании формы
	Элементы.СвязьОрганизацийСсылка.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Организации");
	Элементы.СвязьКонтрагентовСсылка.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	Элементы.СвязьНоменклатурыСсылка.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	Элементы.СловаМаркерыНоменклатура.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	
	Элементы.СловаМаркерыТипНоменклатурыТипНоменклатуры.СписокВыбора.Добавить("Товар");
	Элементы.СловаМаркерыТипНоменклатурыТипНоменклатуры.СписокВыбора.Добавить("Услуга");
	//Пока не включаем
	Если Ложь Тогда
		Если СтруктураНастроек.ТипДокумента_ВыбиратьУслугиДляДопРасходов = Истина Тогда
			Элементы.СловаМаркерыТипНоменклатурыТипНоменклатуры.СписокВыбора.Добавить("Расходы");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(НовыйМаркер) Тогда
		ТаблицаСоответствий = "СловаМаркеры";
		ТаблицаСоответствийПриИзменении(Неопределено);
		
		НоваяСтрока = СловаМаркеры.Добавить();
		НоваяСтрока.Маркер = НовыйМаркер.Маркер;
		НоваяСтрока.Номенклатура = НовыйМаркер.Номенклатура;
		
		Модифицированность = Истина;
		
	Иначе
		ТаблицаСоответствий = Элементы.ТаблицаСоответствий.СписокВыбора[0].Значение;
		ТаблицаСоответствийПриИзменении(Неопределено);
	КонецЕсли;
	
	//Отображаем колонку Характеристика, если они используются при работе
	Если СтруктураНастроек.Свойство("ЗаполнениеТЧ_ИспользоватьХарактеристики")
		И СтруктураНастроек.ЗаполнениеТЧ_ИспользоватьХарактеристики = Истина Тогда
		Элементы.СвязьНоменклатурыХарактеристика.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗагрузкаВнешнейТаблицы" Тогда
		Если Параметр <> Неопределено Тогда
			ЗагрузитьТаблицуНаСервере(Параметр.АдресВХ,Параметр.ДопПараметры.ОчищатьТаблицу);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность = Истина Тогда
		
		Если мДанныеСохранены <> Истина Тогда
			
			Отказ = Истина;
		
			ДопПараметры = Новый Структура;
		
			ТекстВопроса = "Есть несохраненные изменения, сохранить?";
			Кнопки = РежимДиалогаВопрос.ДаНетОтмена;
			ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","ПродолжитьЗакрытиеФормы",ДопПараметры,ТекстВопроса,Кнопки);
					
			_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПродолжитьЗакрытиеФормы(Результат,ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьТаблицуСоответствийНаСервере();
		
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
		//Пользователь отказался от закрытия формы, а мы еще раньше отменили закрытие Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	мДанныеСохранены = Истина;
	ЭтаФорма.Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаСоответствийПриИзменении(Элемент)
	
	Для Каждого ЭлементСписка Из Элементы.ТаблицаСоответствий.СписокВыбора Цикл
		Элементы[ЭлементСписка.Значение].Видимость = Ложь;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ТаблицаСоответствий) Тогда
		ТаблицаСоответствий = Элементы.ТаблицаСоответствий.СписокВыбора[0].Значение;
	КонецЕсли;
	
	Элементы[ТаблицаСоответствий].Видимость = Истина;
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СвязьКонтрагентовПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
&НаКлиенте
Процедура СвязьНоменклатурыПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
&НаКлиенте
Процедура СвязьОрганизацийПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
&НаКлиенте
Процедура СвязьЕдиницыИзмеренияПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
&НаКлиенте
Процедура СловаМаркерыПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
&НаКлиенте
Процедура СловаМаркерыТипНоменклатурыПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура Команда_Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");	
	
	//отобразим текущее содержимое сохраненной таблицы сопоставлений
	Если ТаблицаСоответствий = "СвязьНоменклатуры" Тогда
		
		//таблица хранится по исходной схеме в настройках текущего пользователя
		ДанныеСвязей = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СвязьНоменклатуры");
		
		Если ДанныеСвязей <> Неопределено Тогда
			СвязьНоменклатуры.Загрузить(ДанныеСвязей);
		КонецЕсли;
		
	ИначеЕсли ТаблицаСоответствий = "СвязьКонтрагентов" Тогда
		
		//таблица хранится по исходной схеме в настройках текущего пользователя
		ДанныеСвязей = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СвязьКонтрагентов");
		
		Если ДанныеСвязей <> Неопределено Тогда
			СвязьКонтрагентов.Загрузить(ДанныеСвязей);
		КонецЕсли;
		
	ИначеЕсли ТаблицаСоответствий = "СвязьОрганизаций" Тогда
		
		//таблица хранится по исходной схеме в настройках текущего пользователя
		ДанныеСвязей = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СвязьОрганизаций");
		
		Если ДанныеСвязей <> Неопределено Тогда
			СвязьОрганизаций.Загрузить(ДанныеСвязей);
		КонецЕсли;
		
	ИначеЕсли ТаблицаСоответствий = "СвязьЕдиницыИзмерения" Тогда
		
		//таблица хранится по исходной схеме в настройках текущего пользователя
		ДанныеСвязей = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СвязьЕдиницыИзмерения");
		
		Если ДанныеСвязей <> Неопределено Тогда
			СвязьЕдиницыИзмерения.Загрузить(ДанныеСвязей);
		КонецЕсли;
		
	ИначеЕсли ТаблицаСоответствий = "СловаМаркеры" Тогда
		
		//таблица хранится по исходной схеме в настройках текущего пользователя
		ДанныеСвязей = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СловаМаркеры");
		
		Если ДанныеСвязей <> Неопределено Тогда
			СловаМаркеры.Загрузить(ДанныеСвязей);
		КонецЕсли;
		
	ИначеЕсли ТаблицаСоответствий = "СловаМаркерыТипНоменклатуры" Тогда
		
		//таблица хранится по исходной схеме в настройках текущего пользователя
		ДанныеСвязей = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СловаМаркерыТипНоменклатуры");
		
		Если ДанныеСвязей <> Неопределено Тогда
			СловаМаркерыТипНоменклатуры.Загрузить(ДанныеСвязей);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


// ================= Запись измененной таблицы соответствий ===================

&НаКлиенте
Процедура Команда_Записать(Команда)
	
	ДопПараметры = Новый Структура;
	
	ТекстВопроса = "Данные соответствий будут перезаполнены текущими данными, при отсутствии актуальной резервной копии
				   |эту операцию нельзя отменить. Продолжить запись данных таблицы соответствий?";
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","ПродолжитьЗаписьТаблицыСоответствий",ДопПараметры,ТекстВопроса,Кнопки);
			
	_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);

КонецПроцедуры
&НаКлиенте
Процедура ПродолжитьЗаписьТаблицыСоответствий(Результат,ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьТаблицуСоответствийНаСервере();
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ЗаписатьТаблицуСоответствийНаСервере()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");	
	
	//Перезаписываем таблицы соответствий
	Если ТаблицаСоответствий = "СвязьНоменклатуры" Тогда
		РеквизитОбъект.ЗаписатьДанныеВОбщееХранилище("СвязьНоменклатуры",СвязьНоменклатуры.Выгрузить());
		
		//сохраняем по исходной схеме, в настройках пользователя
		ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","СвязьНоменклатуры",СвязьНоменклатуры.Выгрузить());
		
	ИначеЕсли ТаблицаСоответствий = "СвязьКонтрагентов" Тогда
		РеквизитОбъект.ЗаписатьДанныеВОбщееХранилище("СвязьКонтрагентов",СвязьКонтрагентов.Выгрузить());
		
		//сохраняем по исходной схеме, в настройках пользователя
		ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","СвязьКонтрагентов",СвязьКонтрагентов.Выгрузить());
		
	ИначеЕсли ТаблицаСоответствий = "СвязьОрганизаций" Тогда
		РеквизитОбъект.ЗаписатьДанныеВОбщееХранилище("СвязьОрганизаций",СвязьОрганизаций.Выгрузить());
		
		//сохраняем по исходной схеме, в настройках пользователя
		ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","СвязьОрганизаций",СвязьОрганизаций.Выгрузить());
		
	ИначеЕсли ТаблицаСоответствий = "СвязьЕдиницыИзмерения" Тогда
		РеквизитОбъект.ЗаписатьДанныеВОбщееХранилище("СвязьЕдиницыИзмерения",СвязьЕдиницыИзмерения.Выгрузить());
		
		//сохраняем по исходной схеме, в настройках пользователя
		ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","СвязьЕдиницыИзмерения",СвязьЕдиницыИзмерения.Выгрузить());
		
	ИначеЕсли ТаблицаСоответствий = "СловаМаркеры" Тогда
		РеквизитОбъект.ЗаписатьДанныеВОбщееХранилище("СловаМаркеры",СловаМаркеры.Выгрузить());
		//маркеры хранятся у каждого пользователя свои?
		ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","СловаМаркеры",СловаМаркеры.Выгрузить());
		
	ИначеЕсли ТаблицаСоответствий = "СловаМаркерыТипНоменклатуры" Тогда
		РеквизитОбъект.ЗаписатьДанныеВОбщееХранилище("СловаМаркерыТипНоменклатуры",СловаМаркерыТипНоменклатуры.Выгрузить());
		//маркеры хранятся у каждого пользователя свои?
		ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","СловаМаркерыТипНоменклатуры",СловаМаркерыТипНоменклатуры.Выгрузить());
		
	КонецЕсли;
	
	Модифицированность = Ложь;
	
КонецПроцедуры


// ================= Выгрузка таблицы соответствий в файл ===================

&НаКлиенте
Процедура Команда_ВыгрузитьТаблицу(Команда)
	//выгружаем таблицу в файл
	АдресВХ = ВыгрузитьТаблицуНаСервере();
		
	Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
		ИмяФайла = Строка(ТаблицаСоответствий) + "_" + Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd_HH-mm") + ".xml";
		ПолучитьФайл(АдресВХ,ИмяФайла,Истина);
		
	КонецЕсли;

КонецПроцедуры
&НаСервере
Функция ВыгрузитьТаблицуНаСервере()
	
	ФайлЭкспорта = ПолучитьИмяВременногоФайла("xml");
	
	Если ТаблицаСоответствий = "СвязьНоменклатуры" Тогда
		ЭкспортируемыеДанные = СвязьНоменклатуры.Выгрузить();
	ИначеЕсли ТаблицаСоответствий = "СвязьКонтрагентов" Тогда
		ЭкспортируемыеДанные = СвязьКонтрагентов.Выгрузить();
	ИначеЕсли ТаблицаСоответствий = "СвязьОрганизаций" Тогда
		ЭкспортируемыеДанные = СвязьОрганизаций.Выгрузить();
	ИначеЕсли ТаблицаСоответствий = "СвязьЕдиницыИзмерения" Тогда
		ЭкспортируемыеДанные = СвязьЕдиницыИзмерения.Выгрузить();
	ИначеЕсли ТаблицаСоответствий = "СловаМаркеры" Тогда
		ЭкспортируемыеДанные = СловаМаркеры.Выгрузить();
	ИначеЕсли ТаблицаСоответствий = "СловаМаркерыТипНоменклатуры" Тогда
		ЭкспортируемыеДанные = СловаМаркерыТипНоменклатуры.Выгрузить();
	КонецЕсли;
	
	Если ТипЗнч(ЭкспортируемыеДанные) = Тип("ТаблицаЗначений")
		И ЭкспортируемыеДанные.Количество() = 0 Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Поле = "ТаблицаСоответствий";
		СообщениеПользователю.Текст = "Выгружаемая таблица пустая, или содержит еще не сохраненные данные.";
		СообщениеПользователю.Сообщить();
		
		Возврат Неопределено;
	Иначе
		
		//E1C-255: Выгружаем таблицу как массив структур, чтобы не завязываться на все типы, присутствующие в текущей версии конфигурации,
		//которые будут выгружены сериализатором при выгрузке ТаблицыЗначений. После обновления конфигурации если были изменения в структуре
		//метаданных конфигурации файл, выгруженный в старой конфигурации не сможет быть загружен (измененный/удаленный тип не будет найден)
		ЭкспортируемыеДанные = ПреобразоватьТаблицуВМассивСтруктур(ЭкспортируемыеДанные);
		
		ОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(ЭкспортируемыеДанные);
	    ЗаписьXML = Новый ЗаписьXML;
	    ЗаписьXML.ОткрытьФайл(ФайлЭкспорта);
	    ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO);
		
		ЗаписьXML.Закрыть();
		
	КонецЕсли;
	
	АдресВХ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлЭкспорта));
	
	//Прибираемся
	Попытка УдалитьФайлы(ФайлЭкспорта); Исключение; КонецПопытки;
	
	Возврат АдресВХ;
	
КонецФункции


// ================= Загрузка таблицы соответствий из файла ===================

&НаКлиенте
Процедура Команда_ЗагрузитьТаблицу(Команда)
	
	Если Не ЗначениеЗаполнено(ТаблицаСоответствий) Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Поле = "ТаблицаСоответствий";
		СообщениеПользователю.Текст = "Не выбрана заполняемая таблица";
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	
	Если ЭтаФорма[ТаблицаСоответствий].Количество() > 0 Тогда
		
		ТекстВопроса = "Таблица не пустая, заменить существующие данные загружаемыми?";
		Кнопки = РежимДиалогаВопрос.ДаНетОтмена;
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","ПродолжитьЗагрузкуТаблицы_ДобавлениеЗамещение",ДопПараметры,ТекстВопроса,Кнопки);
				
		_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
		
	Иначе
		ПродолжитьЗагрузкуТаблицы_ДобавлениеЗамещение(КодВозвратаДиалога.Да,ДопПараметры);
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПродолжитьЗагрузкуТаблицы_ДобавлениеЗамещение(Результат,ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
		
	Иначе
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("РежимВыбораФайла","Открытие");
		ДопПараметры.Вставить("ОчищатьТаблицу",Результат = КодВозвратаДиалога.Да);
		
		Если ВладелецФормы.ЭтоВебКлиент Тогда
			ПараметрыВызоваНачало = Новый Структура("Обработчик,ДопПараметры","ОбработатьНачалоВыбораФайлов_ВебКлиент",ДопПараметры);
			ПараметрыВызоваЗавершение = Новый Структура("Обработчик,ДопПараметры","ОбработатьВыборФайлов_ВебКлиент",ДопПараметры);
			ПараметрыВызова = Новый Структура("ПараметрыВызоваНачало,ПараметрыВызоваЗавершение",ПараметрыВызоваНачало,ПараметрыВызоваЗавершение);
			_ЗФ_ОбработатьАсинхронныйВызов("ПоместитьФайлы",ПараметрыВызова);
			
		Иначе		
			Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
			Диалог.МножественныйВыбор = Ложь;
			
			ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ДиалогВыбораФайла","ОбработатьВыборФайлов",ДопПараметры,Диалог);
			_ЗФ_ОбработатьАсинхронныйВызов("ДиалогВыбораФайла",ПараметрыВызова);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗагрузитьТаблицуНаСервере(АдресВХ,ОчищатьТаблицу)
	
	Результат = Новый Структура("Успешно,ТекстОшибки",Ложь,"");
		
	ДанныеДляЗагрузки = ПолучитьИзВременногоХранилища(АдресВХ);
	
	Если ТипЗнч(ДанныеДляЗагрузки) = Тип("ТаблицаЗначений") Тогда
		//Из формы УФ_СопоставленияИзТаблицы передана таблица сопоставлений, загруженная из внешней таблицы
		ИмпортируемыеДанные = ДанныеДляЗагрузки;
		
	Иначе
		ФайлИмпорта = ПолучитьИмяВременногоФайла("xml");
		ДанныеДляЗагрузки.Записать(ФайлИмпорта);
		
		ЧтениеXMLДанных = Новый ЧтениеXML; 
	    ЧтениеXMLДанных.ОткрытьФайл(ФайлИмпорта); 
		Попытка
			ИмпортируемыеДанные = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных);
			
			//Возможно, сопоставления сохранены уже в новом формате
			Если ТипЗнч(ИмпортируемыеДанные) = Тип("Массив") Тогда
				ИмпортируемыеДанные = ПреобразоватьМассивСтруктурВТаблицуЗначений(ИмпортируемыеДанные);
			КонецЕсли;
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Результат.ТекстОшибки = "При чтении файла таблицы произошла ошибка, файл таблицы имеет некорректный формат" + Символы.ПС + ТекстОшибки;
		КонецПопытки;
		
		//Прибираемся
		Попытка УдалитьФайлы(ФайлИмпорта); Исключение; КонецПопытки;
	
	КонецЕсли;
		    	
	Если ТипЗнч(ИмпортируемыеДанные) = Тип("ТаблицаЗначений") Тогда
		
		Попытка
			Если ОчищатьТаблицу Тогда
				ЭтаФорма[ТаблицаСоответствий].Загрузить(ИмпортируемыеДанные);
				
			Иначе
				СтруктураПоиска = Новый Структура;
				Для Каждого КолонкаТаблицы Из ИмпортируемыеДанные.Колонки Цикл
					СтруктураПоиска.Вставить(КолонкаТаблицы.Имя);
				КонецЦикла;
				
				Для Каждого СтрокаТаблицы Из ИмпортируемыеДанные Цикл
					
					ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрокаТаблицы);					
					НайденныеСтроки = ЭтаФорма[ТаблицаСоответствий].НайтиСтроки(СтруктураПоиска);
					
					Если НайденныеСтроки.Количество() = 0 Тогда
						НоваяСтрока = ЭтаФорма[ТаблицаСоответствий].Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы);
					КонецЕсли;
					
				КонецЦикла;
			
			КонецЕсли;
			
			Модифицированность = Истина;			
			Результат.Успешно = Истина;
			
		Исключение
			Результат.ТекстОшибки = "При заполнении таблицы из файла произошла ошибка: " + ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборФайлов(Результат,ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда	
		
		Если ДопПараметры.РежимВыбораФайла = "Сохранение" Тогда
			
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДопПараметры.АдресВХ);
			ДвоичныеДанные.Записать(Результат[0]);			
			
		ИначеЕсли ДопПараметры.РежимВыбораФайла = "Открытие" Тогда
			
			ИмяФайла = Результат[0];
			АдресВХ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла));
			Результат = ЗагрузитьТаблицуНаСервере(АдресВХ,ДопПараметры.ОчищатьТаблицу);
			
			Если Результат.Успешно Тогда
				ПоказатьОповещениеПользователя("Таблица заполнена");
				Модифицированность = Истина;
				
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
				Сообщение.Текст = Результат.ТекстОшибки;
				Сообщение.Сообщить();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьНачалоВыбораФайлов_ВебКлиент(ПомещенныеФайлы,Отказ,ДопПараметры) Экспорт
	Соответствия = Новый Соответствие;
	Для Каждого ФайлДляПередачи Из ПомещенныеФайлы Цикл
		Соответствия.Вставить(Строка(ФайлДляПередачи.ИдентификаторФайла),ФайлДляПередачи.Имя);
	КонецЦикла;
	ДопПараметры.Вставить("Соответствия",Соответствия);
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьВыборФайлов_ВебКлиент(ПомещенныеФайлы,ДопПараметры) Экспорт
	
	Если ПомещенныеФайлы <> Неопределено Тогда
		
		Если ДопПараметры.РежимВыбораФайла = "Открытие" Тогда
		
			АдресВХ = ПомещенныеФайлы[0].Хранение;
			
			Результат = ЗагрузитьТаблицуНаСервере(АдресВХ,ДопПараметры.ОчищатьТаблицу);
				
			Если Результат.Успешно Тогда
				ПоказатьОповещениеПользователя("Таблица заполнена");
				
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
				Сообщение.Текст = Результат.ТекстОшибки;
				Сообщение.Сообщить();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


// ================= Предзаполнение по умолчанию ===================

&НаКлиенте
Процедура СловаМаркерыТипНоменклатуры_ЗначенияПоУмолчанию(Команда)
	
	ДопПараметры = Новый Структура;
	
	Если СловаМаркерыТипНоменклатуры.Количество() > 0 Тогда
		
		ТекстВопроса = "Таблица не пустая, заменить существующие данные значениями по умолчанию?";
		Кнопки = РежимДиалогаВопрос.ДаНетОтмена;
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","СловаМаркерыТипНоменклатуры_ЗначенияПоУмолчанию_ПродолжитьЗагрузку",ДопПараметры,ТекстВопроса,Кнопки);
				
		_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
		
	Иначе
		СловаМаркерыТипНоменклатуры_ЗначенияПоУмолчанию_ПродолжитьЗагрузку(КодВозвратаДиалога.Да,ДопПараметры);
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура СловаМаркерыТипНоменклатуры_ЗначенияПоУмолчанию_ПродолжитьЗагрузку(Результат,ДоПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
		
	Иначе
		АдресВХ = СловаМаркерыТипНоменклатуры_ЗначенияПоУмолчанию_ПолучитьДанныеМакета();
		ЗагрузитьТаблицуНаСервере(АдресВХ,Результат = КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Функция СловаМаркерыТипНоменклатуры_ЗначенияПоУмолчанию_ПолучитьДанныеМакета()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	АдресВХ = РеквизитОбъект.СловаМаркерыТипНоменклатуры_ЗначенияПоУмолчанию_ПолучитьДанныеМакета(УникальныйИдентификатор);
	
	Возврат АдресВХ;
	
КонецФункции


// ================= Новый формат сохраняемых данных ===================

&НаСервере
Функция ПреобразоватьТаблицуВМассивСтруктур(Таблица)
	
	Массив = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Структура = Новый Структура;
		Для Каждого КолонкаТаблицы Из Таблица.Колонки Цикл
			ЗначениеАтрибута = ЗначениеВСтрокуXML(СтрокаТаблицы[КолонкаТаблицы.Имя]);
			Структура.Вставить(КолонкаТаблицы.Имя,ЗначениеАтрибута);
		КонецЦикла;
		Массив.Добавить(Структура);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции
&НаСервере
Функция ЗначениеВСтрокуXML(Значение) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение, НазначениеТипаXML.Явное);
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

&НаСервере
Функция ПреобразоватьМассивСтруктурВТаблицуЗначений(Массив)
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	Если Массив.Количество() > 0 Тогда
		
		//Инициализируем таблицу значений
		Для Каждого ЭлементКоллекции Из Массив[0] Цикл
			ТаблицаЗначений.Колонки.Добавить(ЭлементКоллекции.Ключ);
		КонецЦикла;
	
		Для Каждого ЭлементМассива Из Массив Цикл
			НоваяСтрока = ТаблицаЗначений.Добавить();
			
			Для Каждого Структура Из ЭлементМассива Цикл
				НоваяСтрока[Структура.Ключ] = ЗначениеИзСтрокиXML(Структура.Значение);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаЗначений;
	
КонецФункции
&НаСервере
Функция ЗначениеИзСтрокиXML(СтрокаXML) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	Возврат СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
КонецФункции


// ================= Загрузка таблицы соответствий из внешней таблицы ===================

&НаКлиенте
Процедура Команда_ЗагрузитьСопоставленияИзТаблицы(Команда)
	
	Если Не ЗначениеЗаполнено(ТаблицаСоответствий) Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Поле = "ТаблицаСоответствий";
		СообщениеПользователю.Текст = "Не выбрана заполняемая таблица";
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	
	Если ЭтаФорма[ТаблицаСоответствий].Количество() > 0 Тогда
		
		ТекстВопроса = "Таблица не пустая, заменить существующие данные загружаемыми?";
		Кнопки = РежимДиалогаВопрос.ДаНетОтмена;
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","ПродолжитьЗагрузкуВнешнейТаблицы_ДобавлениеЗамещение",ДопПараметры,ТекстВопроса,Кнопки);
				
		_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
		
	Иначе
		ПродолжитьЗагрузкуВнешнейТаблицы_ДобавлениеЗамещение(КодВозвратаДиалога.Да,ДопПараметры);
		
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ПродолжитьЗагрузкуВнешнейТаблицы_ДобавлениеЗамещение(Результат,ДопПараметры)
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
		
	Иначе
		ПараметрыОткрытия = Новый Структура("ДополнительныеПараметрыФормы");
		ПараметрыОткрытия.ДополнительныеПараметрыФормы = Новый Структура;
		ПараметрыОткрытия.ДополнительныеПараметрыФормы.Вставить("ОчищатьТаблицу",Результат = КодВозвратаДиалога.Да);
		ПараметрыОткрытия.ДополнительныеПараметрыФормы.Вставить("ДопПараметры",ДопПараметры);
		
		ФормаТаблицы = ПолучитьФорму(ПрефиксИмениФорм + "УФ_СопоставленияИзТаблицы", ПараметрыОткрытия, ЭтаФорма);
		ФормаТаблицы.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		ФормаТаблицы.ЗакрыватьПриЗакрытииВладельца = Истина;
		ФормаТаблицы.Открыть();
		
	КонецЕсли;

КонецПроцедуры
