Перем ВерсияМодуля Экспорт;

Перем Кэш_МодульКастомизации Экспорт;


// ================= Сведения о внешней обработке ===================

Функция СведенияОВнешнейОбработке() Экспорт
	//Для аудитора: данная функция используется в процедуре ПриСозданииНаСервере модуля формы УФ_ОсновнаяФорма
	Возврат _ЗФ_СведенияОВнешнейОбработке();
КонецФункции

Функция _ЗФ_СведенияОВнешнейОбработке()
	
	ПараметрыРегистрации = Новый Структура("ВерсияБСП,Наименование,Информация,Вид,Версия,БезопасныйРежим,Команды,Разрешения");
	ПараметрыРегистрации.ВерсияБСП = "2.2.2.1";
	
	ПараметрыРегистрации.Наименование = НСтр("ru = 'Entera: Загрузка документов'");
	ПараметрыРегистрации.Информация = НСтр("ru = 'Дополнительная внешняя обработка для обмена документами с порталом Entera.pro'");
	ПараметрыРегистрации.Вид = "ДополнительнаяОбработка";
	ПараметрыРегистрации.Версия = "1." + ВерсияМодуля.Версия;
	ПараметрыРегистрации.БезопасныйРежим = Истина;
		
	// Команды
	ПараметрыРегистрации.Команды = Новый ТаблицаЗначений;
	ПараметрыРегистрации.Команды.Колонки.Добавить("Представление", 			Новый ОписаниеТипов("Строка")); 
	ПараметрыРегистрации.Команды.Колонки.Добавить("Идентификатор", 			Новый ОписаниеТипов("Строка"));
	ПараметрыРегистрации.Команды.Колонки.Добавить("Использование", 			Новый ОписаниеТипов("Строка"));
	ПараметрыРегистрации.Команды.Колонки.Добавить("ПоказыватьОповещение", 	Новый ОписаниеТипов("Булево"));
	ПараметрыРегистрации.Команды.Колонки.Добавить("Модификатор", 			Новый ОписаниеТипов("Строка"));
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Entera: Загрузка документов'");
	Команда.Идентификатор = "0";
	Команда.Использование = "ОткрытиеФормы";
	Команда.ПоказыватьОповещение = Ложь;
	
	//Команда отключена, пока нет необходимости в периодической выгрузке номенклатуры
	//// Регламентное задание
	//Команда = ПараметрыРегистрации.Команды.Добавить();
	//Команда.Представление = НСтр("ru = 'Entera: Фоновая выгрузка номенклатуры на портал (Регламентное задание)
	//								   |Серверу 1с должно быть разрешено подключение к порталу entera.pro.'");
	//Команда.Идентификатор = "1";
	//Команда.Использование = "ВызовСерверногоМетода";
	//Команда.ПоказыватьОповещение = Ложь;
	
	// Разрешения
	МассивРазрешений = _УФ_ПолучитьМассивТребуемыхРазрешений();
	ПараметрыРегистрации.Вставить("Разрешения",МассивРазрешений);
	
	Если МассивРазрешений.Количество() = 0 Тогда
		ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	КонецЕсли;
		
	// В обработке для Фреш СведенияОВнешнейОбработке заполняются с помощью метода конфигурации
	ПараметрыРегистрации.Вставить("НеФреш");
	
	Возврат ПараметрыРегистрации;
КонецФункции

Функция _ЗФ_ПолучитьОбщийМодульКонфигурации(ИмяОбщегоМодуля) Экспорт
	Если Метаданные.ОбщиеМодули.Найти(ИмяОбщегоМодуля) <> Неопределено Тогда
		ТребуемыйОбщийМодуль = Вычислить(ИмяОбщегоМодуля);
	КонецЕсли;
	
	Возврат ТребуемыйОбщийМодуль;
КонецФункции

Функция _ЗФ_ПолучитьСпособКодированияСтроки() Экспорт
	//2021.06.29 ( экранирование от синтаксического контроля для старых версий платформ
	Попытка СпособКодирования = Вычислить("СпособКодированияСтроки.КодировкаURL"); Исключение; КонецПопытки;
	Возврат СпособКодирования;
КонецФункции

Функция _ЗФ_ПолучитьHTTPСоединение(СтруктураПодключения,СтруктураНастроек)
	
	//Для серверной базы может быть задана настройка прокси
	МодульПолучениеФайловИзИнтернета = _ЗФ_ПолучитьОбщийМодульКонфигурации("ПолучениеФайловИзИнтернета");
	
	Если МодульПолучениеФайловИзИнтернета <> Неопределено Тогда
		Попытка
			Прокси = МодульПолучениеФайловИзИнтернета.ПолучитьПрокси("HTTPS");
		Исключение
			//Не обрабатываем
		КонецПопытки;
	КонецЕсли;
	
	Таймаут = 120;
	
	Если СтруктураНастроек.Свойство("СистемныеНастройки_СоединениеАутентификацияОС")
		И СтруктураНастроек.СистемныеНастройки_СоединениеАутентификацияОС = Истина Тогда
		//доступно начиная с 8.3.7, для более старых платформ экранируем конструктор от синтаксического контроля
		Соединение = Вычислить("Новый HTTPСоединение(СтруктураПодключения.АдресСервера,СтруктураПодключения.Порт,СтруктураПодключения.АутентификацияИмяПользователя,СтруктураПодключения.АутентификацияПароль,Прокси,Таймаут,СтруктураПодключения.SSL,Истина)");
	Иначе
		Соединение = Новый HTTPСоединение(СтруктураПодключения.АдресСервера, СтруктураПодключения.Порт,СтруктураПодключения.АутентификацияИмяПользователя,СтруктураПодключения.АутентификацияПароль,Прокси,Таймаут,СтруктураПодключения.SSL);
	КонецЕсли;
	
	Возврат Соединение;
	
КонецФункции

Функция _УФ_МодульКастомизации_Получить(СтруктураНастроек) Экспорт
			
	//Описание: в основной обработке описывается базовый алгоритм заполнения тех или иных объектов конфигурации, учесть все пожелания каждого клиента
	//в рамках одной универсальной обработки невозможно, разрабатывать и поддерживать отдельную обработку для всех пользователей основной обработки
	//слишком трудоемко.
	//В качестве расширения функционала этой обработки для конечного пользователя предлагается пустой шаблон второй обработки (есть в макете этой обработки),
	//содержащей процедуры-обработчики событий, возникающих в этой "главной" обработке, например, "ПередЗаписьюДокумента", "ПослеЗаписиДокумента" и т.д.
	//То есть разработчик организации-клиента может самостоятельно при необходимости описать требуемый ему алгоритм заполнения объекта,
	//подключить вторую обработку в справочник внешних обработок базы 1с (в случае FRESH - ему необходимо будет отправить ее на аудит)
	//и выбрать ее использование в настройках этой обработки. Таким образом эта "основная" обработка может быть обновлена без ущерба
	//дополненному алгоритму заполнения.
	
	Результат = Новый Структура("Успешно,ТекстОшибки,Обработка",Ложь,"");
	
	Если Кэш_МодульКастомизации <> Неопределено Тогда
		Результат.Обработка = Кэш_МодульКастомизации;
		Результат.Успешно = Истина;
	Иначе
		
		Попытка
			ИмяФайла = ПолучитьИмяВременногоФайла();
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(СтруктураНастроек.АдресХранилищаДвоичныхДанныхМодуляКастомизации);
			
			Если ДвоичныеДанные = Неопределено Тогда
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Модуль","Модуль кастомизации не был получен из временного хранилища","ПолучениеМК");
				
			Иначе
				ДвоичныеДанные.Записать(ИмяФайла);
				
				//в свете вопросов, возникших при прохождении аудита FRESH обращаю внимание аудитора:
				//если проанализировать код, подключение модуля кастомизации выполняется не из макета внешней обработки, как показалось кому-то,
				//а из справочника внешних обработок. Значение используемого ключа СтруктураНастроек.АдресХранилищаДвоичныхДанныхМодуляКастомизации
				//задается в функции МодульКастомизации_ПолучитьДанныеОбработки в форме УФ_Настройки при формировании структуры настроек работы.
				
				//Для НЕ Фреш-конфигураций использование МК может подразумевать выполнение запросов порталу,
				//поэтому подключение МК может быть выполнено не в Безопасном режиме, для таких клиентов в подключаемом МК
				//в описании СведенияОВнешнейОбработки признак БезопасныйРежим при его подключении устанавливается в Ложь
				БезопасныйРежим = Ложь;
				МодульКастомизации = ВнешниеОбработки.Создать(ИмяФайла,БезопасныйРежим);
				Кэш_МодульКастомизации = МодульКастомизации;
			КонецЕсли;
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Результат.ТекстОшибки = "При получении модуля кастомизации произошла ошибка: " + ТекстОшибки;
			
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Модуль",ТекстОшибки,"Ошибка");
		КонецПопытки;
		
		Если МодульКастомизации <> Неопределено Тогда
			
			Результат.Обработка = МодульКастомизации;
			Результат.Успешно = Истина;
			
			//Прибираемся
			Попытка УдалитьФайлы(ИмяФайла); Исключение; КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция _УФ_ПолучитьМассивТребуемыхРазрешений()
		
	Если Метаданные.ПакетыXDTO.Найти("ApplicationPermissions_1_0_0_2") <> Неопределено Тогда
		Пакет = Метаданные.ПакетыXDTO.ApplicationPermissions_1_0_0_2.ПространствоИмен;
	ИначеЕсли Метаданные.ПакетыXDTO.Найти("ApplicationPermissions_1_0_0_1") <> Неопределено Тогда
		Пакет = Метаданные.ПакетыXDTO.ApplicationPermissions_1_0_0_1.ПространствоИмен;
	КонецЕсли;
	
	Разрешения = Новый Массив;
	
	Если Пакет <> Неопределено Тогда
						
		//Доступ к каталогу временных файлов
		НовоеРазрешение = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(Пакет, "FileSystemAccess"));
		НовоеРазрешение.Description = "Требуется хранение и обработка временных файлов, создаваемых в процессе работы обработки";
		НовоеРазрешение.Path = "/temp";
		НовоеРазрешение.AllowedRead = Истина;
		НовоеРазрешение.AllowedWrite = Истина;
	
		Разрешения.Добавить(НовоеРазрешение);
		
		//Включение привилегированного режима
		НовоеРазрешение = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(Пакет, "ExternalModulePrivilegedModeAllowed"));
		НовоеРазрешение.Description = "Для успешного выполнения ряда операций с создаваемыми документами может потребоваться включение привилегированного режима";
	
		Разрешения.Добавить(НовоеРазрешение);
		
		Разрешение = _УФ_Разрешение_InternetResourceAccess(Пакет,"HTTPS","id.entera.pro",443,"Ресурс используется для авторизации на портале entera.pro");
		Разрешения.Добавить(Разрешение);
		
		Разрешение = _УФ_Разрешение_InternetResourceAccess(Пакет,"HTTPS","app.entera.pro",443,"Ресурс используется для обмен с порталом данными о распознаваемых документах entera.pro");
		Разрешения.Добавить(Разрешение);
		
	КонецЕсли;
		
	Возврат Разрешения;
	
КонецФункции

Функция _УФ_Разрешение_InternetResourceAccess(Пакет,Protocol,Host,Port,Description) Экспорт
	
	//Использование интернет-ресурса
	НовоеРазрешение = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(Пакет, "InternetResourceAccess"));
	НовоеРазрешение.Description = Description;
    НовоеРазрешение.Protocol = Protocol;
	НовоеРазрешение.Host = Host;
	НовоеРазрешение.Port = Port;
	
	Возврат НовоеРазрешение;
	
КонецФункции

Функция _УФ_ВыполнитьВНебезопасномРежиме(ПроизвольныйКод,Параметры) Экспорт
	Попытка
		Выполнить(ПроизвольныйКод);
	Исключение
		
	КонецПопытки;
КонецФункции

Функция _УФ_ВыполнитьЗапрос_WinHTTP(Назначение,ТипЗапроса,МетодAPI,ТелоЗапроса,ПараметрыЗапроса) Экспорт
						
	РезультатЗапроса = Новый Структура("Успешно,СтатусСервера,ТекстОшибки");
	Успешно = Ложь;
	
	//Подключение выполняется к тестовому порталу?
	ТестовыйРежим = 0;
	ПараметрыЗапроса.Свойство("ТестовыйРежим",ТестовыйРежим);
	
	СтруктураПодключения = ЗаполнитьСтруктуруПодключения(ТестовыйРежим);
	
	Если ПараметрыЗапроса.Свойство("АдресСервера") Тогда
		АдресСервера = ПараметрыЗапроса.АдресСервера;
	ИначеЕсли Назначение = "Авторизация" Тогда
		АдресСервера = СтруктураПодключения.АдресСервераАвторизации;
	Иначе
		АдресСервера = СтруктураПодключения.Адрес;
	КонецЕсли;
	
	МетодAPI = СтрЗаменить(МетодAPI,Символы.НПП,"");
		
	//Аутентификация при установке соединения
	Если ПараметрыЗапроса.Свойство("АутентификацияИмяПользователя") Тогда
		АутентификацияИмяПользователя = ПараметрыЗапроса.АутентификацияИмяПользователя;
	КонецЕсли;
	
	Если ПараметрыЗапроса.Свойство("АутентификацияПароль") Тогда
		АутентификацияПароль = ПараметрыЗапроса.АутентификацияПароль;
	КонецЕсли;
		
	Попытка
		WinHttp = Новый COMОбъект("MSXML2.ServerXMLHTTP.6.0");
		КорректнаяКодировкаОтвета = Истина;
	Исключение
		WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
		WinHttp.Option(2,"UTF-8");
		//При использовании WinHTTP кодировка ответа не всегда UTF-8, может потребоваться перекодировка
		КорректнаяКодировкаОтвета = Ложь;
	КонецПопытки;
	
	WinHttp.SetTimeouts(30000, 60000, 30000, 120000);
	
	Адрес  = СтруктураПодключения.Протокол + АдресСервера + ?(ЗначениеЗаполнено(СтруктураПодключения.Порт),":" + СтрЗаменить(СтруктураПодключения.Порт,Символы.НПП,""),"") + МетодAPI;
	WinHttp.Open(ТипЗапроса, Адрес, 0);
					
	//Авторизация по токену
	Если ПараметрыЗапроса.Свойство("Токен") Тогда
		WinHttp.setRequestHeader("Cookie", СтруктураПодключения.Токен_Cookie + ПараметрыЗапроса.Токен);
	КонецЕсли;
	
	Если ТипЗапроса <> "GET" Тогда
		WinHttp.setRequestHeader("Content-Type","application/json");
	КонецЕсли;
	
	Если ПараметрыЗапроса.Свойство("ДопЗаголовки") Тогда
		Для Каждого Элемент Из ПараметрыЗапроса.ДопЗаголовки Цикл
			WinHttp.setRequestHeader(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	//+++ нужна отправка файлов WinHTTP
	Если ПараметрыЗапроса.Свойство("ФайлыДляПередачи") Тогда //отправка будет выполняться методом multiple
		
		Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
		
		ИмяФайлаОтправки = ПолучитьИмяВременногоФайла("txt");
		
		МассивВременныхФайлов = Новый Массив;
		
		ИмяФайла_Начало = ПолучитьИмяВременногоФайла("txt"); 
		ЗаписьТекста_Начало = Новый ЗаписьТекста(ИмяФайла_Начало, "CESU-8", Символы.ПС, Ложь); 
		ЗаписьТекста_Начало.ЗаписатьСтроку("");
		ЗаписьТекста_Начало.Закрыть();
		МассивВременныхФайлов.Добавить(ИмяФайла_Начало);
		
		Для Каждого ЭлементМассиваФайлов Из ПараметрыЗапроса.ФайлыДляПередачи Цикл
			
			Индекс = "file" + (ПараметрыЗапроса.ФайлыДляПередачи.Найти(ЭлементМассиваФайлов) + 1);
			
			ФайлДляПередачи = ПолучитьИмяВременногоФайла("tmp");
		
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ЭлементМассиваФайлов.АдресВХ);
			ДвоичныеДанные.Записать(ФайлДляПередачи);
															
			ИмяФайла_НачалоФайла = ПолучитьИмяВременногоФайла("txt"); 
					
			ФайлОтправкиНачало = Новый ЗаписьТекста(ИмяФайла_НачалоФайла, "CESU-8", Символы.ПС, Ложь); 
			
			//Определяем раздел двоичных данных
			ФайлОтправкиНачало.ЗаписатьСтроку("");
			ФайлОтправкиНачало.ЗаписатьСтроку("--" + Boundary); 
			ФайлОтправкиНачало.ЗаписатьСтроку("Content-Disposition: form-data; name=""" + Индекс + """; filename=""" + ЭлементМассиваФайлов.ИмяФайла + """"); 
			ФайлОтправкиНачало.ЗаписатьСтроку(""); 
			ФайлОтправкиНачало.Закрыть(); 

			МассивВременныхФайлов.Добавить(ИмяФайла_НачалоФайла); 
			МассивВременныхФайлов.Добавить(ФайлДляПередачи); 
			
		КонецЦикла;
		
		//Формируем конечный фрагмент файла POST-запроса 
		ИмяФайлаОтправкиКонец = ПолучитьИмяВременногоФайла("txt"); 
		ФайлОтправкиКонец = Новый ЗаписьТекста(ИмяФайлаОтправкиКонец, "CESU-8", Символы.ПС, Ложь); 
		
		//Завершение раздела двоичных данных
		ФайлОтправкиКонец.ЗаписатьСтроку(Символы.ПС + "--" + Boundary + "--");
		ФайлОтправкиКонец.Закрыть(); 

		МассивВременныхФайлов.Добавить(ИмяФайлаОтправкиКонец); 

		//Теперь сформированные фрагменты сообщения для сервера объединяем в один файл POST-запроса 
		ОбъединитьФайлы(МассивВременныхФайлов, ИмяФайлаОтправки); 
		
		//После выполнения запроса файлы массива будут удалены
		МассивВременныхФайлов.Добавить(ИмяФайлаОтправки);
		
		WinHttp.setRequestHeader("Content-Type", "multipart/form-data; boundary=" + Boundary);
		
		Попытка
			WinHttp.Send();
			Успешно = Истина;
		Исключение
			ТекстОшибки = КраткоеОписаниеОшибки(ОписаниеОшибки());
		КонецПопытки;
		
		Для Каждого Файл ИЗ МассивВременныхФайлов Цикл
			Попытка УдалитьФайлы(Файл.ПолноеИмя); Исключение; КонецПопытки;
		КонецЦикла;
	
	ИначеЕсли ПараметрыЗапроса.Свойство("ФайлДляПередачи") Тогда
		
		МассивВременныхФайлов = Новый Массив;
		
		ФайлДляОтправки = ПолучитьИмяВременногоФайла("tmp");
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПараметрыЗапроса.ФайлДляПередачи.АдресВХ);
		ДвоичныеДанные.Записать(ФайлДляОтправки);
		
		Файл = Новый Файл(ФайлДляОтправки);		
											
		Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
		
		ИмяФайлаОтправки = ПолучитьИмяВременногоФайла("txt");
		ИмяФайлаОтправкиНачало = ПолучитьИмяВременногоФайла("txt"); 
				
		ФайлОтправкиНачало = Новый ЗаписьТекста(ИмяФайлаОтправкиНачало, КодировкаТекста.UTF8, Символы.ПС, Ложь); 
		
		//Определяем раздел двоичных данных
		ФайлОтправкиНачало.ЗаписатьСтроку("");
		ФайлОтправкиНачало.ЗаписатьСтроку("");
		ФайлОтправкиНачало.ЗаписатьСтроку("--" + Boundary); 
		ФайлОтправкиНачало.ЗаписатьСтроку("Content-Disposition: form-data; name=""file""; filename=""" + ПараметрыЗапроса.ФайлДляПередачи.ИмяФайла + """"); 
		ФайлОтправкиНачало.ЗаписатьСтроку(""); 
		ФайлОтправкиНачало.Закрыть(); 

		МассивВременныхФайлов.Добавить(ИмяФайлаОтправкиНачало); 
		МассивВременныхФайлов.Добавить(ФайлДляОтправки); 

		//Формируем конечный фрагмент файла POST-запроса 
		ИмяФайлаОтправкиКонец = ПолучитьИмяВременногоФайла("txt"); 
		ФайлОтправкиКонец = Новый ЗаписьТекста(ИмяФайлаОтправкиКонец, КодировкаТекста.UTF8, Символы.ПС, Ложь); 

		//Завершение раздела двоичных данных 
		ФайлОтправкиКонец.ЗаписатьСтроку(Символы.ПС + "--" + Boundary + "--");
		ФайлОтправкиКонец.Закрыть(); 

		МассивВременныхФайлов.Добавить(ИмяФайлаОтправкиКонец); 

		//Теперь сформированные фрагменты сообщения для сервера объединяем в один файл POST-запроса 
		ОбъединитьФайлы(МассивВременныхФайлов, ИмяФайлаОтправки); 
		
		//После выполнения запроса файлы массива будут удалены
		МассивВременныхФайлов.Добавить(ИмяФайлаОтправки);

		WinHttp.setRequestHeader("Content-Type", "multipart/form-data; boundary=" + Boundary);
		
		Попытка
			WinHttp.Send();
			Успешно = Истина;
		Исключение
			ТекстОшибки = КраткоеОписаниеОшибки(ОписаниеОшибки());
		КонецПопытки;
		
		Для Каждого Файл ИЗ МассивВременныхФайлов Цикл
			Попытка УдалитьФайлы(Файл.ПолноеИмя); Исключение; КонецПопытки;
		КонецЦикла;
		
	Иначе
				
		Попытка
			WinHttp.Send(ТелоЗапроса);
			Успешно = Истина;
		Исключение
			ТекстОшибки = КраткоеОписаниеОшибки(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
		
	Если Успешно Тогда
				
		ПараметрыОтвета = Новый Структура("МетодAPI,КодСостояния,ТипСодержимого,ContentDisposition,Cookie,ТелоОтветаСтрока,ТелоОтветаДвоичныеДанные");
		ПараметрыОтвета.МетодAPI = МетодAPI;
		ПараметрыОтвета.КодСостояния = WinHttp.Status;
		ПараметрыОтвета.ТипСодержимого = WinHttp.getResponseHeader("Content-Type");
		ПараметрыОтвета.ContentDisposition = WinHttp.getResponseHeader("Content-Disposition");
		ПараметрыОтвета.Cookie = WinHttp.getResponseHeader("Set-Cookie");
				
		Если ПараметрыЗапроса.Свойство("ЗапросФайла") Тогда
			//+++ доработать получение двоичных данных
			//ПараметрыОтвета.ТелоОтветаДвоичныеДанные = ПоместитьВоВременноеХранилище(Ответ.ПолучитьТелоКакДвоичныеДанные());
		Иначе
			ПараметрыОтвета.ТелоОтветаСтрока = WinHttp.ResponseText();
		КонецЕсли;
		
		ОбработатьОтветПортала(ПараметрыЗапроса,ПараметрыОтвета,РезультатЗапроса);
		
		РезультатЗапроса.Вставить("ПараметрыОтвета",ПараметрыОтвета);
		
	Иначе
		РезультатЗапроса.Вставить("Успешно",Ложь);
		РезультатЗапроса.Вставить("ТекстОшибки",ТекстОшибки);
	КонецЕсли;
		
	Возврат РезультатЗапроса;
КонецФункции


// ================= Команды обработки ===================

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	Если ИдентификаторКоманды = "1" Тогда
		ВыполнитьРегламентноеЗадание_ВыгрузкаНоменклатуры();
	КонецЕсли;	
	
КонецПроцедуры


// ================= Обмен данными с порталом ===================

Функция ВыполнитьЗапрос(Назначение,ТипЗапроса,МетодAPI,ТелоЗапроса,ПараметрыЗапроса) Экспорт
						
	РезультатЗапроса = Новый Структура("Успешно,СтатусСервера,ТекстОшибки");
	Успешно = Ложь;
		
	//Подключение выполняется к тестовому порталу?
	ТестовыйРежим = 0;
	ПараметрыЗапроса.Свойство("ТестовыйРежим",ТестовыйРежим);
	
	СтруктураПодключения = ЗаполнитьСтруктуруПодключения(ТестовыйРежим);
	
	Если ПараметрыЗапроса.Свойство("АдресСервера") Тогда
		АдресСервера = ПараметрыЗапроса.АдресСервера;
		
	ИначеЕсли Назначение = "Авторизация"
		Или Назначение = "ПодтверждениеТелефона"
		Или Назначение = "ПодтверждениеТелефонаКод" Тогда
		АдресСервера = СтруктураПодключения.АдресСервераАвторизации;
		
	Иначе
		АдресСервера = СтруктураПодключения.Адрес;
		
	КонецЕсли;
	
	МетодAPI = СтрЗаменить(МетодAPI,Символы.НПП,"");
		
	//Аутентификация при установке соединения
	Если ПараметрыЗапроса.Свойство("АутентификацияИмяПользователя") Тогда
		АутентификацияИмяПользователя = ПараметрыЗапроса.АутентификацияИмяПользователя;
	КонецЕсли;
	
	Если ПараметрыЗапроса.Свойство("АутентификацияПароль") Тогда
		АутентификацияПароль = ПараметрыЗапроса.АутентификацияПароль;
	КонецЕсли;
	
	СтруктураНастроек = ПараметрыЗапроса.СтруктураНастроек;
		
	СтруктураПодключения.Вставить("АдресСервера",АдресСервера);
	СтруктураПодключения.Вставить("АутентификацияИмяПользователя",АутентификацияИмяПользователя);
	СтруктураПодключения.Вставить("АутентификацияПароль",АутентификацияПароль);
	
	Соединение = _ЗФ_ПолучитьHTTPСоединение(СтруктураПодключения,СтруктураНастроек);
				
	//Заголовки запроса
	ЗаголовкиHTTP = Новый Соответствие();
	
	//Авторизация по токену
	Если ПараметрыЗапроса.Свойство("Токен") Тогда
		ЗаголовкиHTTP.Вставить("Cookie", СтруктураПодключения.Токен_Cookie + ПараметрыЗапроса.Токен);
	КонецЕсли;
	
	Если ТипЗапроса = "POST" Или ТипЗапроса = "PUT" Или ТипЗапроса = "PATCH" Тогда
		ЗаголовкиHTTP.Вставить("Content-Type", "application/json");
	КонецЕсли;
	
	Если ПараметрыЗапроса.Свойство("ДопЗаголовки") Тогда
		Для Каждого Элемент Из ПараметрыЗапроса.ДопЗаголовки Цикл
			ЗаголовкиHTTP.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
		
	Если ПараметрыЗапроса.Свойство("ФайлыДляПередачи") Тогда //отправка будет выполняться методом multiple
		
		Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
		
		ИмяФайлаОтправки = ПолучитьИмяВременногоФайла("txt");
		
		МассивВременныхФайлов = Новый Массив;
		
		ИмяФайла_Начало = ПолучитьИмяВременногоФайла("txt"); 
		ЗаписьТекста_Начало = Новый ЗаписьТекста(ИмяФайла_Начало, "CESU-8", Символы.ПС, Ложь); 
		ЗаписьТекста_Начало.ЗаписатьСтроку("");
		ЗаписьТекста_Начало.Закрыть();
		МассивВременныхФайлов.Добавить(ИмяФайла_Начало);
		
		СтрокаИменОтправляемыхФайлов = "";
		
		Для Каждого ЭлементМассиваФайлов Из ПараметрыЗапроса.ФайлыДляПередачи Цикл
			
			Индекс = "file" + (ПараметрыЗапроса.ФайлыДляПередачи.Найти(ЭлементМассиваФайлов) + 1);
			
			ФайлДляПередачи = ПолучитьИмяВременногоФайла("tmp");
		
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ЭлементМассиваФайлов.АдресВХ);
			ДвоичныеДанные.Записать(ФайлДляПередачи);
															
			ИмяФайла_НачалоФайла = ПолучитьИмяВременногоФайла("txt"); 
					
			ФайлОтправкиНачало = Новый ЗаписьТекста(ИмяФайла_НачалоФайла, "CESU-8", Символы.ПС, Ложь); 
			
			//Определяем раздел двоичных данных
			ФайлОтправкиНачало.ЗаписатьСтроку("");
			ФайлОтправкиНачало.ЗаписатьСтроку("--" + Boundary); 
			ФайлОтправкиНачало.ЗаписатьСтроку("Content-Disposition: form-data; name=""" + Индекс + """; filename=""" + ЭлементМассиваФайлов.ИмяФайла + """"); 
			ФайлОтправкиНачало.ЗаписатьСтроку(""); 
			ФайлОтправкиНачало.Закрыть(); 

			МассивВременныхФайлов.Добавить(ИмяФайла_НачалоФайла); 
			МассивВременныхФайлов.Добавить(ФайлДляПередачи); 
			
			СтрокаИменОтправляемыхФайлов = СтрокаИменОтправляемыхФайлов + ?(СтрокаИменОтправляемыхФайлов <> "",", ","") + ЭлементМассиваФайлов.ИмяФайла;
			
		КонецЦикла;
		
		//Формируем конечный фрагмент файла POST-запроса 
		ИмяФайлаОтправкиКонец = ПолучитьИмяВременногоФайла("txt"); 
		ФайлОтправкиКонец = Новый ЗаписьТекста(ИмяФайлаОтправкиКонец, "CESU-8", Символы.ПС, Ложь); 
		
		//Завершение раздела двоичных данных
		ФайлОтправкиКонец.ЗаписатьСтроку(Символы.ПС + "--" + Boundary + "--");
		ФайлОтправкиКонец.Закрыть(); 

		МассивВременныхФайлов.Добавить(ИмяФайлаОтправкиКонец); 

		//Теперь сформированные фрагменты сообщения для сервера объединяем в один файл POST-запроса 
		ОбъединитьФайлы(МассивВременныхФайлов, ИмяФайлаОтправки); 
		
		//После выполнения запроса файлы массива будут удалены
		МассивВременныхФайлов.Добавить(ИмяФайлаОтправки);

		ЗаголовкиHTTP.Вставить("Content-Type", "multipart/form-data; boundary=" + Boundary); 
		
		Запрос = Новый HTTPЗапрос(МетодAPI,ЗаголовкиHTTP);
		Запрос.УстановитьИмяФайлаТела(ИмяФайлаОтправки);
		
		ОписаниеЗапроса = ТипЗапроса + " " + МетодAPI + " " + СтрокаИменОтправляемыхФайлов;
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ОписаниеЗапроса,"Запрос");
		
		Попытка
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);
			Успешно = Истина;
		Исключение
			ТекстОшибки = КраткоеОписаниеОшибки(ОписаниеОшибки());
			
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ТекстОшибки,"Ошибка");
		КонецПопытки;
		
		Для Каждого Файл ИЗ МассивВременныхФайлов Цикл
			Попытка УдалитьФайлы(Файл); Исключение; КонецПопытки;
		КонецЦикла;
	
	ИначеЕсли ПараметрыЗапроса.Свойство("ФайлДляПередачи") Тогда
		
		МассивВременныхФайлов = Новый Массив;
		
		ФайлДляОтправки = ПолучитьИмяВременногоФайла("tmp");
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПараметрыЗапроса.ФайлДляПередачи.АдресВХ);
		ДвоичныеДанные.Записать(ФайлДляОтправки);
		
		Файл = Новый Файл(ФайлДляОтправки);		
											
		Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
		
		ИмяФайлаОтправки = ПолучитьИмяВременногоФайла("txt");
		ИмяФайлаОтправкиНачало = ПолучитьИмяВременногоФайла("txt"); 
				
		ФайлОтправкиНачало = Новый ЗаписьТекста(ИмяФайлаОтправкиНачало, КодировкаТекста.UTF8, Символы.ПС, Ложь); 
		
		//Определяем раздел двоичных данных
		ФайлОтправкиНачало.ЗаписатьСтроку("");
		ФайлОтправкиНачало.ЗаписатьСтроку("");
		ФайлОтправкиНачало.ЗаписатьСтроку("--" + Boundary); 
		ФайлОтправкиНачало.ЗаписатьСтроку("Content-Disposition: form-data; name=""file""; filename=""" + ПараметрыЗапроса.ФайлДляПередачи.ИмяФайла + """"); 
		ФайлОтправкиНачало.ЗаписатьСтроку(""); 
		ФайлОтправкиНачало.Закрыть(); 

		МассивВременныхФайлов.Добавить(ИмяФайлаОтправкиНачало); 
		
		МассивВременныхФайлов.Добавить(ФайлДляОтправки); 

		//Формируем конечный фрагмент файла POST-запроса 
		ИмяФайлаОтправкиКонец = ПолучитьИмяВременногоФайла("txt"); 
		ФайлОтправкиКонец = Новый ЗаписьТекста(ИмяФайлаОтправкиКонец, КодировкаТекста.UTF8, Символы.ПС, Ложь); 

		//Завершение раздела двоичных данных 
		ФайлОтправкиКонец.ЗаписатьСтроку(Символы.ПС + "--" + Boundary + "--");
		ФайлОтправкиКонец.Закрыть(); 

		МассивВременныхФайлов.Добавить(ИмяФайлаОтправкиКонец); 

		//Теперь сформированные фрагменты сообщения для сервера объединяем в один файл POST-запроса 
		ОбъединитьФайлы(МассивВременныхФайлов, ИмяФайлаОтправки); 
		
		//После выполнения запроса файлы массива будут удалены
		МассивВременныхФайлов.Добавить(ИмяФайлаОтправки);

		ЗаголовкиHTTP.Вставить("Content-Type", "multipart/form-data; boundary=" + Boundary); 
		
		Запрос = Новый HTTPЗапрос(МетодAPI,ЗаголовкиHTTP);
		Запрос.УстановитьИмяФайлаТела(ИмяФайлаОтправки);
		
		ОписаниеЗапроса = ТипЗапроса + " " + МетодAPI + " " + ПараметрыЗапроса.ФайлДляПередачи.ИмяФайла;
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ОписаниеЗапроса,"Запрос");
		
		Попытка
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);
			Успешно = Истина;
		Исключение
			ТекстОшибки = КраткоеОписаниеОшибки(ОписаниеОшибки());
			
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ТекстОшибки,"Ошибка");
		КонецПопытки;
		
		Для Каждого Файл ИЗ МассивВременныхФайлов Цикл
			Попытка УдалитьФайлы(Файл.ПолноеИмя); Исключение; КонецПопытки;
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый HTTPЗапрос(МетодAPI, ЗаголовкиHTTP);
		
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		
		ОписаниеЗапроса = ТипЗапроса + " " + МетодAPI + " " + ?(Назначение = "Авторизация","{*** данные скрыты ***}",ТелоЗапроса);
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ОписаниеЗапроса,"Запрос");
		
		Если ТипЗапроса = "GET" Тогда
			
			Попытка
				Ответ = Соединение.Получить(Запрос);
				Успешно = Истина;
			Исключение
				ТекстОшибки = КраткоеОписаниеОшибки(ОписаниеОшибки());
				
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ТекстОшибки,"Ошибка");
			КонецПопытки;
			
		ИначеЕсли ТипЗапроса = "PUT" Тогда
			
			Попытка
				Ответ = Соединение.Записать(Запрос);
				Успешно = Истина;
			Исключение
				ТекстОшибки = КраткоеОписаниеОшибки(ОписаниеОшибки());
				
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ТекстОшибки,"Ошибка");
			КонецПопытки;
			
		ИначеЕсли ТипЗапроса = "PATCH" Тогда
			
			Попытка
				Ответ = Соединение.Изменить(Запрос);
				Успешно = Истина;
			Исключение
				ТекстОшибки = КраткоеОписаниеОшибки(ОписаниеОшибки());
				
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ТекстОшибки,"Ошибка");
			КонецПопытки;
			
		ИначеЕсли ТипЗапроса = "DELETE" Тогда
			
			Попытка
				Ответ = Соединение.Удалить(Запрос);
				Успешно = Истина;
			Исключение
				ТекстОшибки = КраткоеОписаниеОшибки(ОписаниеОшибки());
				
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ТекстОшибки,"Ошибка");
			КонецПопытки;
			
		Иначе //POST
			Попытка
				Ответ = Соединение.ОтправитьДляОбработки(Запрос);
				Успешно = Истина;
			Исключение
				ТекстОшибки = КраткоеОписаниеОшибки(ОписаниеОшибки());
				
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ТекстОшибки,"Ошибка");
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
		
	Если Успешно Тогда
		
		ПараметрыОтвета = Новый Структура("МетодAPI,КодСостояния,ТипСодержимого,ContentDisposition,Cookie,ТелоОтветаСтрока,ТелоОтветаДвоичныеДанные");
		ПараметрыОтвета.МетодAPI = МетодAPI;
		ПараметрыОтвета.КодСостояния = Ответ.КодСостояния;
		ПараметрыОтвета.ТипСодержимого = Ответ.Заголовки.Получить("Content-Type");
		ПараметрыОтвета.ContentDisposition = Ответ.Заголовки.Получить("Content-Disposition");
		ПараметрыОтвета.Cookie = Ответ.Заголовки.Получить("Set-Cookie");
				
		Если ПараметрыЗапроса.Свойство("ЗапросФайла") Тогда
			
			//разберем xml, возможно, там текст ошибки
			Если ПараметрыОтвета.ТипСодержимого = "text/xml" Тогда
				ПараметрыОтвета.ТелоОтветаСтрока = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			КонецЕсли;
			
			ПараметрыОтвета.ТелоОтветаДвоичныеДанные = ПоместитьВоВременноеХранилище(Ответ.ПолучитьТелоКакДвоичныеДанные(),Новый УникальныйИдентификатор);
			
		Иначе
			ПараметрыОтвета.ТелоОтветаСтрока = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		КонецЕсли;
		
		ОписаниеЗапроса = "[" + ПараметрыОтвета.КодСостояния + "]: " + ПараметрыОтвета.ТипСодержимого
			+ ?(ЗначениеЗаполнено(ПараметрыОтвета.ТелоОтветаСтрока),Символы.ПС + ПараметрыОтвета.ТелоОтветаСтрока,"")
			+ ?(ЗначениеЗаполнено(ПараметрыОтвета.ТелоОтветаДвоичныеДанные),Символы.ПС + ПараметрыОтвета.ТелоОтветаДвоичныеДанные,"");
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ОписаниеЗапроса,"Запрос");
		
		ОбработатьОтветПортала(ПараметрыЗапроса,ПараметрыОтвета,РезультатЗапроса);
		
		РезультатЗапроса.Вставить("ПараметрыОтвета",ПараметрыОтвета);
		
	Иначе
		РезультатЗапроса.Вставить("Успешно",Ложь);
		РезультатЗапроса.Вставить("ТекстОшибки",ТекстОшибки);
		
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ТекстОшибки,"Ошибка");
	КонецЕсли;
		
	Возврат РезультатЗапроса;
КонецФункции


Функция ОбработатьОтветПортала(ПараметрыЗапроса,ПараметрыОтвета,РезультатЗапроса) Экспорт
	
	КодСостояния = ПараметрыОтвета.КодСостояния;
	
	РезультатЗапроса.Вставить("Успешно",Ложь);
			
	Если КодСостояния = 200 тогда
		
		РезультатЗапроса.Вставить("Успешно",Истина);
		
		Если ПараметрыЗапроса.Свойство("ЗапросФайла") Тогда
			
			ИмяФайла = "scan";
			КодированноеИмяФайла = "";
			
			//Разберем заголовок Content-disposition для получения имени файла
			Если ЗначениеЗаполненоXDTO(ПараметрыОтвета.ContentDisposition) Тогда
				СодержимоеЗаголовка = Энтера_РазложитьСтрокуВМассивПодстрок(ПараметрыОтвета.ContentDisposition,";");
				Для Каждого ЭлементСодержимогоЗаголовка Из СодержимоеЗаголовка Цикл
					НачалоИмениФайла = Найти(ЭлементСодержимогоЗаголовка,"filename=");
					Если НачалоИмениФайла > 0 Тогда
						
						КодированноеИмяФайла = СтрЗаменить(Сред(ЭлементСодержимогоЗаголовка,11),"""","");
						ИмяФайла = КодированноеИмяФайла;
												
						//немного костылей с encode кириллического имени файла, которые отдает портал
						Если Найти(ИмяФайла,"utf-8") > 0 Тогда
							//определим хотя бы расширение
							НрегИмяФайла = Нрег(ИмяФайла);
							Если Найти(НрегИмяФайла,"pdf") Тогда
								ИмяФайла = "file.pdf";
							ИначеЕсли Найти(НрегИмяФайла,"xlsx") Тогда
								ИмяФайла = "file.xlsx";
							ИначеЕсли Найти(НрегИмяФайла,"xls") Тогда
								ИмяФайла = "file.xls";
							ИначеЕсли Найти(НрегИмяФайла,"docx") Тогда
								ИмяФайла = "file.docx";
							ИначеЕсли Найти(НрегИмяФайла,"doc") Тогда
								ИмяФайла = "file.doc";
							ИначеЕсли Найти(НрегИмяФайла,"jpg") Тогда
								ИмяФайла = "file.jpg";
							ИначеЕсли Найти(НрегИмяФайла,"jpeg") Тогда
								ИмяФайла = "file.jpeg";
							ИначеЕсли Найти(НрегИмяФайла,"png") Тогда
								ИмяФайла = "file.png";
							КонецЕсли;
							
						Иначе
							ИмяФайла = ДекодироватьСтрокуURL(ИмяФайла);
							
						КонецЕсли;
						
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ПараметрыОтвета.Вставить("КодированноеИмяФайла",КодированноеИмяФайла);
			ПараметрыОтвета.Вставить("ИмяФайла",ИмяФайла);
						
			РезультатЗапроса.Вставить("Файл",ПараметрыОтвета.ТелоОтветаДвоичныеДанные);
			РезультатЗапроса.Вставить("ИмяФайла",ИмяФайла);
			
		КонецЕсли;
		
	ИначеЕсли КодСостояния = 201 Тогда //HTTP 201 Created
		
		РезультатЗапроса.Вставить("Успешно",Истина);
		
	//Отдельный обработчик ответа: если выполнялся запрос файла, и портал не смог изготовить печатную форму, то он может вернуть код ошибки
	//в зависимости от него определяем, будет ли готова печатная форма, в этом случае нужно предложить пользователю повторить запрос чуть позже	
	ИначеЕсли КодСостояния = 400 И ПараметрыЗапроса.Свойство("ЗапросФайла") Тогда
		
		Если ПараметрыОтвета.ТипСодержимого = "text/xml"
			И ЗначениеЗаполнено(ПараметрыОтвета.ТелоОтветаСтрока) Тогда
			
			Если ПараметрыЗапроса.Назначение = "ПолучениеФайлаСкана" Тогда
				
				Попытка
					Чтение = Новый ЧтениеXML;
					Чтение.УстановитьСтроку(ПараметрыОтвета.ТелоОтветаСтрока);
					Дерево = ФабрикаXDTO.ПрочитатьXML(Чтение);
					
					КодОшибки = Дерево.errorCode;
					РезультатЗапроса.Вставить("КодОшибки",КодОшибки);
					
					Если КодОшибки = "40408.40505" Тогда
						//Печатная форма не будет готова никогда, просто выдаем то же сообщение, что и раньше
						ТекстОшибки = "<" + ПараметрыЗапроса.ПредставлениеДокумента + ">: печатная форма не может быть изготовлена для данного документа";
							
					ИначеЕсли КодОшибки = "40408.40504" Тогда
						//Печатная форма еще готовится, нужно предложить подождать, или создать документ без скана
						ТекстОшибки = "<" + ПараметрыЗапроса.ПредставлениеДокумента + ">: печатная форма еще не была сформирована";
							
						//В силу того, что портал в этом случае вернул Bad request, чтобы не анализировать в дальнейшем код состояния ответа портала
						//установим Успешно = Истина и будем проверять в обработчике формы наличие поля в структуре ответа ПредложитьПовторитьЗапрос
						РезультатЗапроса.Вставить("Успешно",Истина);
						
						ПараметрыОтвета.Вставить("ПредложитьПовторитьЗапрос",Истина);
						ПараметрыОтвета.Вставить("ТекстОшибки",ТекстОшибки);
						
					Иначе
						ТекстОшибки = "Ошибка при получении файла документа <" + ПараметрыЗапроса.ПредставлениеДокумента + ">: " + ПрочитатьТекстОшибкиИзОтветаСервера(ПараметрыОтвета.ТелоОтветаСтрока,КодСостояния,ПараметрыОтвета.ТипСодержимого);
						
					КонецЕсли;
					
				Исключение
					ТекстОшибки = "При чтении описания ошибки при получении файла возникла ошибка. Код состояния: " + КодСостояния + ", тип заголовка ответа: " + Строка(ПараметрыОтвета.ТипСодержимого);
				КонецПопытки;
				
			Иначе
				ТекстОшибки = "Печатная форма не была изготовлена. Ответ сервера не содержит кода причины отсутствия печатной формы.";
				
			КонецЕсли;
		Иначе
			ТекстОшибки = ПрочитатьТекстОшибкиИзОтветаСервера(ПараметрыОтвета.ТелоОтветаСтрока,КодСостояния,ПараметрыОтвета.ТипСодержимого);
			
		КонецЕсли;
		
		РезультатЗапроса.Вставить("ТекстОшибки",ТекстОшибки);
		
	Иначе
		Если ПараметрыОтвета.ТипСодержимого = "text/xml" Тогда //можем читать xml
			ТекстОшибки = ПрочитатьТекстОшибкиИзОтветаСервера(ПараметрыОтвета.ТелоОтветаСтрока,КодСостояния,ПараметрыОтвета.ТипСодержимого);
			
		Иначе //не можем читать xml			
			Если КодСостояния = 500 Тогда
				ТекстОшибки = "На сервере произошла ошибка. Пожалуйста, попробуйте позже.";
			ИначеЕсли КодСостояния = 502 Тогда
				ТекстОшибки = "Сервис временно недоступен. Пожалуйста, попробуйте позже.";
			ИначеЕсли КодСостояния = 400 Тогда
				ТекстОшибки = "Сервер обнаружил в запросе клиента синтаксическую ошибку." + ?(ПараметрыОтвета.Свойство("ТелоЗапроса")," Текст запроса для отладки: " + Символы.ПС + ПараметрыОтвета.ТелоЗапроса,"");
				//2019.02.27 (
				Если ПараметрыОтвета.Свойство("ТелоОтветаСтрока") И ЗначениеЗаполнено(ПараметрыОтвета.ТелоОтветаСтрока) Тогда
					ТекстОшибки = ТекстОшибки + Символы.ПС + ПараметрыОтвета.ТелоОтветаСтрока;
				КонецЕсли;
				// ) 2019.02.27
			ИначеЕсли КодСостояния = 401 Тогда
				ТекстОшибки = "Не удалось выполнить запрос из-за ошибки авторизации. Возможно устарела текущая сессия, попробуйте повторно выполнить вход по логину и паролю";
			ИначеЕсли КодСостояния = 403 Тогда
				ТекстОшибки = "Недостаточно прав для получения запрашиваемых данных (403)" + ?(ПараметрыОтвета.Свойство("ТелоЗапроса"), ": " + Символы.ПС + ПараметрыОтвета.ТелоЗапроса,"");
			ИначеЕсли КодСостояния = 404 Тогда
				ТекстОшибки = "'" + ПараметрыОтвета.МетодAPI + "': запрашиваемый ресурс на портале не найден (404).";
			ИначеЕсли КодСостояния = 413 Тогда
				ТекстОшибки = "Сервер сообщил, что выполяемый запрос слишком большой. Попробуйте уменьшить объем передаваемых данных и попробовать снова (413).";
			Иначе
				ТекстОшибки = "При отправке данных возникла ошибка. Код состояния: " + КодСостояния + ", тип содержимого ответа: " + Строка(ПараметрыОтвета.ТипСодержимого);
			КонецЕсли;
		КонецЕсли;
		
		РезультатЗапроса.Вставить("ТекстОшибки",ТекстОшибки);

	КонецЕсли;
		
КонецФункции

Функция ПрочитатьТекстОшибкиИзОтветаСервера(ТелоОтветаСтрока,КодСостояния = Неопределено, ТипСодержимого = Неопределено)
	
	Если ТипЗнч(ТелоОтветаСтрока) = Тип("ОбъектXDTO") Тогда
		Дерево = ТелоОтветаСтрока;
	Иначе
		Попытка
			Чтение = Новый ЧтениеXML;
			Чтение.УстановитьСтроку(ТелоОтветаСтрока);
			Дерево = ФабрикаXDTO.ПрочитатьXML(Чтение);
		Исключение
			ТекстОшибки = "При чтении ответа сервера возникла ошибка. Код состояния: " + КодСостояния + ", тип заголовка ответа: " + Строка(ТипСодержимого);
		КонецПопытки;
	КонецЕсли;
	
	Если Дерево <> Неопределено Тогда
		
		ТекстОшибки = "При обмене данными с порталом возникла ошибка." + ?(ЗначениеЗаполнено(КодСостояния)," Код состояния: " + КодСостояния,"");
		
		Если Дерево.Свойства().Получить("errorMessage") <> Неопределено И ЗначениеЗаполненоXDTO(Дерево.errorMessage) Тогда
			ТекстОшибки = Дерево.errorMessage;
		КонецЕсли;
		
		Если Дерево.Свойства().Получить("errors") <> Неопределено И ЗначениеЗаполненоXDTO(Дерево.errors) Тогда
			СписокОшибок = ПолучитьКоллекциюXDTO(Дерево.errors.error);
			Для Каждого СтрокаОшибки Из СписокОшибок Цикл
				ТекстОшибки = ТекстОшибки + Символы.ПС + СтрокаОшибки.errorMessage;
			КонецЦикла;
			
		ИначеЕсли Дерево.Свойства().Получить("details") <> Неопределено И ЗначениеЗаполненоXDTO(Дерево.details) Тогда
			СписокОшибок = ПолучитьКоллекциюXDTO(Дерево.details.detail);
			Для Каждого СтрокаОшибки Из СписокОшибок Цикл
				ТекстОшибки = ТекстОшибки + Символы.ПС + СтрокаОшибки.errorMessage;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстОшибки;
КонецФункции


// ================= Обработка ответов портала ===================

Функция ПрочитатьОтветПортала(Назначение,ПараметрыЗапроса,ПараметрыОтвета) Экспорт
	
	РезультатЧтения = Новый Структура("Успешно,ТекстОшибки",Истина);
	
	Если Назначение = "Авторизация"
		Или Назначение = "ПодтверждениеТелефонаКод" Тогда
			
		// Только разбираем куку для получения токена ENTERA_JWT
		Если ЗначениеЗаполнено(ПараметрыОтвета.Cookie) Тогда
			КоллекцияКук = Энтера_РазложитьСтрокуВМассивПодстрок(ПараметрыОтвета.Cookie,",");
			Для Каждого ЭлементКоллекцииКук Из КоллекцияКук Цикл
				СодержимоеЗаголовка = Энтера_РазложитьСтрокуВМассивПодстрок(ЭлементКоллекцииКук,";");
				Для Каждого ЭлементСодержимогоЗаголовка Из СодержимоеЗаголовка Цикл
					НачалоИмениФайла = Найти(ЭлементСодержимогоЗаголовка,"ENTERA_JWT=");
					Если НачалоИмениФайла > 0 Тогда
						Токен = СтрЗаменить(Сред(СокрЛП(ЭлементСодержимогоЗаголовка),12),"""","");
						РезультатЧтения.Вставить("Токен",Токен);
						Прервать;
					Иначе
						// 2019.04.18 ( ОТЛАДКА: возможно запуск на тестовом портале
						НачалоИмениФайла = Найти(ЭлементСодержимогоЗаголовка,"ENTERA_JWT_TEST=");
						Если НачалоИмениФайла > 0 Тогда
							Токен = СтрЗаменить(Сред(СокрЛП(ЭлементСодержимогоЗаголовка),17),"""","");
							РезультатЧтения.Вставить("Токен",Токен);
							Прервать;
						КонецЕсли;
						// ) 2019.04.18
					КонецЕсли;
				КонецЦикла;
				
				Если Токен <> Неопределено Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли Назначение = "bitrix24" Тогда
		
		Если ПараметрыОтвета.КодСостояния <> 200 Тогда
			РезультатЧтения.Вставить("Успешно",Ложь);
			РезультатЧтения.Вставить("ТекстОшибки","От сервера был получен ответ: " + Символы.ПС + ПараметрыОтвета.ТелоОтветаСтрока);
		КонецЕсли;
		
	Иначе
		
		Если ПараметрыЗапроса.Свойство("ЗапросФайла") Тогда
			
			Если ПараметрыОтвета.Свойство("ПредложитьПовторитьЗапрос") Тогда
				РезультатЧтения.Вставить("ПредложитьПовторитьЗапрос",Истина);
				РезультатЧтения.Вставить("ТекстОшибки",ПараметрыОтвета.ТекстОшибки);
				
			Иначе
				РезультатЧтения.Вставить("АдресВХ",ПараметрыОтвета.ТелоОтветаДвоичныеДанные);
				РезультатЧтения.Вставить("ИмяФайла",ПараметрыОтвета.ИмяФайла);
				
			КонецЕсли;
		Иначе
			
			Чтение = Новый ЧтениеXML;
			Чтение.УстановитьСтроку(ПараметрыОтвета.ТелоОтветаСтрока);
			
			Попытка
				РезультатЧтения.Вставить("Дерево",ФабрикаXDTO.ПрочитатьXML(Чтение));
			Исключение
				РезультатЧтения.Вставить("Успешно",Ложь);
				РезультатЧтения.Вставить("ТекстОшибки","Ошибка при чтении ответа портала: XML содержит ошибки формата." + Символы.ПС + КраткоеОписаниеОшибки(ОписаниеОшибки()));
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатЧтения;
КонецФункции

Функция ПрочитатьДанныеПользователя(Дерево) Экспорт
	
	СтруктураДанных = Инициализировать_ДанныеПользователя();
	
	Если СвойствоXDTOСуществует(Дерево,"user") Тогда
		
		user = Дерево.user;
		
		СтруктураДанных.id = ?(СвойствоXDTOСуществует(user,"id"),user.id,Неопределено); //+++ на 2018.11.21 нет в API
		СтруктураДанных.email = user.email;
		СтруктураДанных.phone = user.phone;
		СтруктураДанных.surname = user.surname;
		СтруктураДанных.name = user.name;
		СтруктураДанных.patronymic = user.patronymic;
		СтруктураДанных.lang = user.lang;
		СтруктураДанных.isNew = user.isNew = "true";
		СтруктураДанных.phoneConfirm = user.phoneConfirm = "true";
		
		Если СвойствоXDTOСуществует(user.spaces,"space") Тогда
			spaces = ПолучитьКоллекциюXDTO(user.spaces.space);
			Для Каждого space Из spaces Цикл
				СтруктураДанных.spaces.Добавить(space.id,space.name);
				
				//2019.09.09 ( Теперь space содержит настройки распознавания для этого Пространства
				recognitionSettings = Новый Структура("customsDeclarationParse,kppParse,hasTransferBase");
				Если ЗначениеЗаполненоXDTO(space.recognitionSettings) Тогда
					ЗаполнитьЗначенияСвойств(recognitionSettings,space.recognitionSettings);
					
					//E1C-484: если по пространству для типа УПД hasTransferBase = TRUE, то значение в настройке меняется на "Да".
					//Если hasTransferBase = null или false, то значение в настройке останется "Нет"
					hasTransferBase = Неопределено;
					Если СвойствоXDTOСуществует(space.recognitionSettings,"tableParseByType")
						И ЗначениеЗаполненоXDTO(space.recognitionSettings.tableParseByType)
						И СвойствоXDTOСуществует(space.recognitionSettings.tableParseByType,"UTD")
						И СвойствоXDTOСуществует(space.recognitionSettings.tableParseByType.UTD,"hasTransferBase") Тогда
						hasTransferBase = space.recognitionSettings.tableParseByType.UTD.hasTransferBase;
					КонецЕсли;
					recognitionSettings.Вставить("hasTransferBase",hasTransferBase);
					
				КонецЕсли;
				
				СтруктураДанных.recognitionSettings.Вставить(space.id,recognitionSettings);
				// ) 2019.09.09
				
				//E1C-421: Извлекаем код страны, пока основная цель - определить пространства Казахстана
				Если ЗначениеЗаполненоXDTO(space.country)
					И space.country.alpha3Code = "KAZ" Тогда
					СтруктураДанных.spaceCountries.Вставить(space.id,"KAZ");
				Иначе
				    СтруктураДанных.spaceCountries.Вставить(space.id,"RUS");
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		//E1C-294: Теперь в этом методе прилетает "сториз" broadcastMessages для интерактивного взаимодействия с пользователями
		Если ЗначениеЗаполненоXDTO(user.broadcastMessages) Тогда
			broadcastMessages = ПолучитьКоллекциюXDTO(user.broadcastMessages.broadcastMessage);
			Для Каждого broadcastMessage Из broadcastMessages Цикл
				СтруктураСообщения = Новый Структура("id,title,content,finishDate,startDate");
				ЗаполнитьЗначенияСвойств(СтруктураСообщения,broadcastMessage);
				СтруктураДанных.broadcastMessages.Добавить(СтруктураСообщения);
			КонецЦикла;
		КонецЕсли;
		
		//E1C-353: Отображение Безлимитного тарифа в ui пользователя
		Если ЗначениеЗаполненоXDTO(user.client) Тогда
			client = user.client;
			СтруктураДанных.unlimited = client.unlimited = "true";
			СтруктураДанных.balanceExpirationDate = ПолучитьДатуИзДатыПортала(client.balanceExpirationDate);
		КонецЕсли;
		
		//E1C-385: Изменение интерфейса баланса в модуле Entera в 1С
		МассивТранзакций = Новый Массив;
		
		transactionExpirationDate = Дата(1,1,1);
		Если ЗначениеЗаполненоXDTO(user.clientActiveTransactionList) Тогда
			clientActiveTransactions = ПолучитьКоллекциюXDTO(user.clientActiveTransactionList.clientActiveTransaction);
			Для Каждого clientActiveTransaction Из clientActiveTransactions Цикл
				ДанныеТранзакции = Новый Структура("id,createdDate,deletedDate,expirationDate,expiredDate,price,comment,creatorEmail,delta,unlimited");
				ДанныеТранзакции.id = ПолучитьЗначениеПоляXDTO(clientActiveTransaction,"id");
				ДанныеТранзакции.createdDate = ПолучитьДатуИзДатыПортала(ПолучитьЗначениеПоляXDTO(clientActiveTransaction,"createdDate"));
				ДанныеТранзакции.deletedDate = ПолучитьДатуИзДатыПортала(ПолучитьЗначениеПоляXDTO(clientActiveTransaction,"deletedDate"));
				ДанныеТранзакции.expirationDate = ПолучитьДатуИзДатыПортала(ПолучитьЗначениеПоляXDTO(clientActiveTransaction,"expirationDate"));
				ДанныеТранзакции.expiredDate = ПолучитьДатуИзДатыПортала(ПолучитьЗначениеПоляXDTO(clientActiveTransaction,"expiredDate"));
				ДанныеТранзакции.price = ПолучитьЗначениеПоляXDTO(clientActiveTransaction,"price");
				ДанныеТранзакции.comment = ПолучитьЗначениеПоляXDTO(clientActiveTransaction,"comment");
				ДанныеТранзакции.creatorEmail = ПолучитьЗначениеПоляXDTO(clientActiveTransaction,"creatorEmail");
				ДанныеТранзакции.delta = ПолучитьЗначениеПоляXDTO(clientActiveTransaction,"delta",Истина);
				ДанныеТранзакции.unlimited = ПолучитьЗначениеПоляXDTO(clientActiveTransaction,"unlimited") = "true";
				
				МассивТранзакций.Добавить(ДанныеТранзакции);
				
				//Определяем максимальный срок доступных транзакций
				transactionExpirationDate = Макс(transactionExpirationDate,ПолучитьДатуИзДатыПортала(clientActiveTransaction.expirationDate));
			КонецЦикла;
		КонецЕсли;
		
		СтруктураДанных.clientActiveTransactionList = МассивТранзакций;
		СтруктураДанных.transactionExpirationDate = transactionExpirationDate;
		
	КонецЕсли;
	
	Возврат СтруктураДанных;
КонецФункции

Функция ПрочитатьДанныеДокументов(Дерево,ДанныеПортала,СправочникиПортала,СтруктураНастроек,ПараметрыЗапроса) Экспорт
	
	РезультатЧтения = Новый Структура("Успешно,ЗагрузкаДанныхЗавершена,ОтветПустой,ТекстОшибки",Истина,Ложь,Ложь,"");
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	
	Если ДанныеПортала = Неопределено Тогда
		ДанныеПортала = Инициализировать_ТаблицыДанныхПортала();
	КонецЕсли;
	
	//2021.05.06 ( В каких-то кейсах встречается, что из структуры настроек выпадают соответствия статусов ЭДО-документов.
	//На всякий случай, если этих полей на этом этапе нет в структуре настроек - инициализируем и добавим их туда
	Если Не СтруктураНастроек.Свойство("Диадок_СоответствиеСтатусов") Тогда
		СтруктураНастроек.Вставить("Диадок_СоответствиеСтатусов",Диадок_ИнициализироватьСоответствияСтатусов());
	КонецЕсли;
	
	Если Не СтруктураНастроек.Свойство("СБИС_СоответствиеСтатусов") Тогда
		СтруктураНастроек.Вставить("СБИС_СоответствиеСтатусов",СБИС_ИнициализироватьСоответствияСтатусов());
	КонецЕсли;
	// ) 2021.05.06
	
	//2024.10.08 (
	Если Не СтруктураНастроек.Свойство("КодыТиповДокументов") Тогда
		СтруктураНастроек.Вставить("КодыТиповДокументов",КодыДокументов_ИнициализироватьСоответствияКодовДокументов());
	КонецЕсли;
	// ) 2024.10.08
	
	//E1C-448: Добавить столбец "Источник" с информацией откуда был загружен документ на распознавание
	Если Не СтруктураНастроек.Свойство("ИсточникиДокументов") Тогда
		СтруктураНастроек.Вставить("ИсточникиДокументов",ИсточникиДокументов_ИнициализироватьСоответствияИсточниковДокументов());
	КонецЕсли;
	
	Если СвойствоXDTOСуществует(Дерево,"document")
		И ЗначениеЗаполненоXDTO(Дерево.document) Тогда
		//получен один документ
		enteraDocuments = ПолучитьКоллекциюXDTO(Дерево.document);
	ИначеЕсли СвойствоXDTOСуществует(Дерево,"documents")
		И ЗначениеЗаполненоXDTO(Дерево.documents) Тогда
		//получена коллекция документов
		enteraDocuments = ПолучитьКоллекциюXDTO(Дерево.documents.document);
	Иначе
		ОтветПустой = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполненоXDTO(enteraDocuments) Тогда
		ОтветПустой = Истина;
	Иначе
		КоличествоЭлементов = enteraDocuments.Количество();
		ОтветПустой = КоличествоЭлементов = 0;
	КонецЕсли;
		
	Если ОтветПустой Тогда
		РезультатЧтения.Успешно = Истина;
		РезультатЧтения.ЗагрузкаДанныхЗавершена = Истина;
		РезультатЧтения.ОтветПустой = Истина;
		
		Возврат РезультатЧтения;
	КонецЕсли;
	
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыМК.Вставить("ДанныеПортала",ДанныеПортала);
		
	//Обходим коллекцию документов
	Для Каждого document Из enteraDocuments Цикл
		
		documentId = document.id;
		
		//2019.08.30 ( Проверим, нет ли в таблице уже такого документа
		Если ДанныеПортала.documents.Найти(documentId,"id") <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		// ) 2019.08.30
		
		//E1C-315: Не выводим связанные документы в список, если они удалены на портале
		state = ПолучитьЗначениеПоляXDTO(document,"state");
		Если ПараметрыЗапроса.Свойство("ПолучениеСвязанныхДокументов")
			И ПараметрыЗапроса.ПолучениеСвязанныхДокументов = Истина Тогда
			Если state = "DELETED" Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
						
		НоваяСтрокаДокумент = ДанныеПортала.documents.Добавить();
		
		ПараметрыМК.Вставить("document",document);
		ПараметрыМК.Вставить("НоваяСтрокаДокумент",НоваяСтрокаДокумент);
		
		НоваяСтрокаДокумент.id = documentId;
		НоваяСтрокаДокумент.spaceId = document.space.id;
		НоваяСтрокаДокумент.createdDate = ПолучитьДатуИзДатыПортала(ПолучитьЗначениеПоляXDTO(document,"createdDate"),Истина);
		
		//При дальнейшем объединении документов флаг определяет документ, содержащий данные шапки для группы документов
		НоваяСтрокаДокумент.СодержитДанныеШапкиОбъединенногоДокумента = Ложь;
		
		Если ЗначениеЗаполненоXDTO(document.recognitionTask) Тогда
			НоваяСтрокаДокумент.recognitionTaskId = document.recognitionTask.id;
			
			//E1C-448: Добавить столбец "Источник" с информацией откуда был загружен документ на распознавание
			НоваяСтрокаДокумент.source = ПолучитьЗначениеПоляXDTO(document.recognitionTask,"source");
			НоваяСтрокаДокумент.ПредставлениеИсточника = ПолучитьЗначениеСоответствия(СтруктураНастроек.ИсточникиДокументов,НоваяСтрокаДокумент.source);
		КонецЕсли;
		
		//Пока портал ссылку не возвращает - сформируем ссылку сами
		НоваяСтрокаДокумент.url = "https://app.entera.pro/spaces/" + НоваяСтрокаДокумент.spaceId + "/documents/" + НоваяСтрокаДокумент.id;
		
		//E1C-396: отображаем в интерфейсе готовность печатной формы документа
		НоваяСтрокаДокумент.printFormId = ПолучитьЗначениеПоляXDTO(document,"printFormId");
		
		//E1C-466: Отображение в реестре документов замечаний по распознаванию документа
		validationNotificationSeverity = 0;
		validationNotificationTextFull = "";
		
		Если ЗначениеЗаполненоXDTO(document.validationNotifications) Тогда
			validationNotifications = ПолучитьКоллекциюXDTO(document.validationNotifications.validationNotification);
			
			Для Каждого validationNotification Из validationNotifications Цикл
				ДополнитьТекстОшибки(validationNotificationTextFull,validationNotification.fullText);
				
				Если validationNotification.severity = "WARNING" Тогда
					validationNotificationSeverity = 2;
				ИначеЕсли validationNotification.severity = "ERROR" Тогда
					validationNotificationSeverity = 1;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		НоваяСтрокаДокумент.validationNotificationSeverity = validationNotificationSeverity;
		НоваяСтрокаДокумент.validationNotificationTextFull = validationNotificationTextFull;
		
		
		//2020.09.25 ( Запишем xml-данные XDTO документа для возможности работы
		//в модуле кастомизации с полными данными, полученными от портала
		Если Ложь Тогда //Пока такой потребности нет - не выполняем
		    ЗаписьXML = Новый ЗаписьXML;
		    ЗаписьXML.УстановитьСтроку();
		    ЗаписьXML.ЗаписатьОбъявлениеXML(); 
			XDTO = Новый ФабрикаXDTO;
			XDTO.ЗаписатьXML(ЗаписьXML,document);
		    НоваяСтрокаДокумент.xml = ЗаписьXML.Закрыть();
		КонецЕсли;
		// ) 2020.09.25
		
		Если СвойствоXDTOСуществует(document,"creator") И ЗначениеЗаполненоXDTO(document.creator) Тогда
			НоваяСтрокаДокумент.creatorId = document.creator.Id;
			НоваяСтрокаДокумент.creatorEmail = document.creator.email;
			НоваяСтрокаДокумент.creatorFullName = document.creator.name;
		КонецЕсли;
		
		НоваяСтрокаДокумент.number = ПолучитьЗначениеПоляXDTO(document,"number");
		НоваяСтрокаДокумент.recognizedNumber = ПолучитьЗначениеПоляXDTO(document,"recognizedNumber");
		НоваяСтрокаДокумент.date = ПолучитьДатуИзДатыПортала(document.date);
		НоваяСтрокаДокумент.recognizedDate = ПолучитьДатуИзДатыПортала(ПолучитьЗначениеПоляXDTO(document,"recognizedDate"));
		НоваяСтрокаДокумент.paymentOrderId = ПолучитьЗначениеПоляXDTO(document,"paymentOrderId");
		
		НоваяСтрокаДокумент.comment = ПолучитьЗначениеПоляXDTO(document,"comment");
				
		НоваяСтрокаДокумент.type = ПолучитьЗначениеПоляXDTO(document,"type");
		НоваяСтрокаДокумент.state = ПолучитьЗначениеПоляXDTO(document,"state");
		НоваяСтрокаДокумент.receiptState = ПолучитьЗначениеПоляXDTO(document,"receiptState");
		НоваяСтрокаДокумент.verified = ПолучитьЗначениеПоляXDTO(document,"verified") = "true";
		НоваяСтрокаДокумент.uploaded = ПолучитьЗначениеПоляXDTO(document,"uploaded") = "true";
		
		НоваяСтрокаДокумент.documentCreator = ПолучитьЗначениеПоляXDTO(document,"documentCreator");
				
		Если СвойствоXDTOСуществует(document,"parent") И ЗначениеЗаполненоXDTO(document.parent) Тогда
			НоваяСтрокаДокумент.parent = ПолучитьЗначениеПоляXDTO(document.parent,"id");
		КонецЕсли;
		
		//в children допускается коллекция элементов, но ситуация, в которой она может возникнуть пока неизвестна, берем первый элемент коллекции
		Если СвойствоXDTOСуществует(document,"children") И ЗначениеЗаполненоXDTO(document.children) Тогда
			children = ПолучитьКоллекциюXDTO(document.children.children);
			Если children.Количество() > 0 Тогда
				НоваяСтрокаДокумент.children = ПолучитьЗначениеПоляXDTO(children[0],"id");
			КонецЕсли;
		КонецЕсли;
		
		//Сохраняем исходную дату документа, в случае необходимости ее использования при дальнейшем заполнении
		НоваяСтрокаДокумент.sourceDate = НоваяСтрокаДокумент.date;
		
		//E1C-484: Сопоставление и создание Договора в 1С по распознанным данным "Основание передачи"
		//Несмотря на название List основание всегда одно, поэтому в коллекцию его не преобразовываем
		Если ЗначениеЗаполненоXDTO(document.transferBaseList) Тогда
			transferBases = ПолучитьКоллекциюXDTO(document.transferBaseList.transferBase);
			//В соответствии с постановкой продолжаем обрабатывать только первый элемент
			transferBase = transferBases[0];
			НоваяСтрокаДокумент.transferBaseId = ПолучитьЗначениеПоляXDTO(transferBase,"id");
			НоваяСтрокаДокумент.transferBaseDate = ПолучитьДатуИзДатыПортала(ПолучитьЗначениеПоляXDTO(transferBase,"date"));
			НоваяСтрокаДокумент.transferBaseName = ПолучитьЗначениеПоляXDTO(transferBase,"name");
			НоваяСтрокаДокумент.transferBaseNumber = ПолучитьЗначениеПоляXDTO(transferBase,"number");
			НоваяСтрокаДокумент.transferBaseAdditionalInfo = ПолучитьЗначениеПоляXDTO(transferBase,"additionalInfo");
			
			НоваяСтрокаДокумент.ОснованиеПередачиЗаполнено = Истина;
			
			НоваяСтрокаДокумент.ПредставлениеДоговора = ЗаполнениеДокумента_Договор_СформироватьПредставление(НоваяСтрокаДокумент,СтруктураНастроек);
			
		Иначе
			//Исходный шаблон, заданный пользователем
			НоваяСтрокаДокумент.ПредставлениеДоговора = СтруктураНастроек.ЗаполнениеШапки_НаименованиеНовогоДоговора;
			НоваяСтрокаДокумент.ОснованиеПередачиЗаполнено = Ложь;
		КонецЕсли;
						
						
		НоваяСтрокаДокумент.amountWithoutVat = ПолучитьЗначениеПоляXDTO(document,"amountWithoutVat",Истина);
		НоваяСтрокаДокумент.recognizedAmountWithoutVat = ПолучитьЗначениеПоляXDTO(document,"recognizedAmountWithoutVat",Истина);
		НоваяСтрокаДокумент.vat = ПолучитьЗначениеПоляXDTO(document,"vat",Истина);
		НоваяСтрокаДокумент.recognizedVat = ПолучитьЗначениеПоляXDTO(document,"recognizedVat",Истина);
		НоваяСтрокаДокумент.amount = ПолучитьЗначениеПоляXDTO(document,"amount",Истина);
		НоваяСтрокаДокумент.recognizedAmount = ПолучитьЗначениеПоляXDTO(document,"recognizedAmount",Истина);
		
		//Пользовательские представления данных портала
		НоваяСтрокаДокумент.ПредставлениеТипа = СправочникиПортала.ТипДокумента.Получить(НоваяСтрокаДокумент.type);
		НоваяСтрокаДокумент.ПредставлениеСтатуса = СправочникиПортала.СтатусДокумента.Получить(НоваяСтрокаДокумент.state);
		НоваяСтрокаДокумент.ПредставлениеДокумента = СформироватьПредставлениеДокументаПортала(НоваяСтрокаДокумент);
		
		//2022.02.07 ( На портале выпилили один из статусов: UPLOADED, теперь это флажок. Статусов осталось 3
		Если НоваяСтрокаДокумент.uploaded Тогда
			НоваяСтрокаДокумент.state = "UPLOADED";
			НоваяСтрокаДокумент.ПредставлениеСтатуса = "Выгружен";
		КонецЕсли;
		// ) 2022.02.07
		
		//E1C-48: статус чека отсутствует в справочниках портала, определим его представление самостоятельно по статусу
		//NOT_CHECKED - чек не проверен в ФНС.
		//INCORRECT - чек не корректен по данным ФНС. Финальное состояние.
		//IN_PROCESSING - чек корректен. Данные из ФНС на обработке, то есть не получены.
		//WITHOUT_DATA - чек корректен. Данные из ФНС не были получены в течени 24 часов. Попыток получения данных больше не будет. Финальное состояние.
		//WITH_DATA - чек корректен. Данные из ФНС были получены. Финальное состояние.
		Если НоваяСтрокаДокумент.state = "UPLOADED" Тогда
			НоваяСтрокаДокумент.ПредставлениеСтатусаЧека = НоваяСтрокаДокумент.ПредставлениеСтатуса;
			
		Иначе
			Если НоваяСтрокаДокумент.receiptState = "NOT_CHECKED" Тогда
				НоваяСтрокаДокумент.ПредставлениеСтатусаЧека = "Проверка чека";
			ИначеЕсли НоваяСтрокаДокумент.receiptState = "INCORRECT" Тогда
				НоваяСтрокаДокумент.ПредставлениеСтатусаЧека = "Чек некорректен";
			ИначеЕсли НоваяСтрокаДокумент.receiptState = "IN_PROCESSING" Тогда
				НоваяСтрокаДокумент.ПредставлениеСтатусаЧека = "Ожидание ОФД";
			ИначеЕсли НоваяСтрокаДокумент.receiptState = "WITHOUT_DATA" Тогда
				НоваяСтрокаДокумент.ПредставлениеСтатусаЧека = "Нет данных";
			ИначеЕсли НоваяСтрокаДокумент.receiptState = "WITH_DATA" Тогда
				НоваяСтрокаДокумент.ПредставлениеСтатусаЧека = "Данные получены из ОФД";
			Иначе
				//Покажем статус самого документа
				НоваяСтрокаДокумент.ПредставлениеСтатусаЧека = СправочникиПортала.СтатусДокумента.Получить(НоваяСтрокаДокумент.state);
			КонецЕсли;
			
		КонецЕсли;
		
		//E1C-544: извлекаем данные чека, если они доступны
		Если ЗначениеЗаполненоXDTO(document.receiptData) Тогда
			НоваяСтрокаДокумент.fiscalDocumentNumber = ПолучитьЗначениеПоляXDTO(document.receiptData,"fiscalDocumentNumber");
		КонецЕсли;
		
		//E1C-207: документы, отправленные через ЭДО имеют стандартные статусы распознанных документов,
		//для отбора в форме списка документов установим им статус EDI_SEND
		НоваяСтрокаДокумент.forSendingToEdi = ПолучитьЗначениеПоляXDTO(document,"forSendingToEdi") = "true";
		Если НоваяСтрокаДокумент.forSendingToEdi = Истина Тогда
			НоваяСтрокаДокумент.state = "EDI_SEND";
		КонецЕсли;
		
		ДанныеПортала.ПредставленияДокументов.Вставить(documentId,НоваяСтрокаДокумент.ПредставлениеДокумента);
		
		//Покупатель
		Если ЗначениеЗаполненоXDTO(document.customer) Тогда
			НоваяСтрокаДокумент.customerId = Строка(ПолучитьЗначениеПоляXDTO(document.customer,"id"));
			НоваяСтрокаДокумент.customerName = Строка(ПолучитьЗначениеПоляXDTO(document.customer,"name"));
			НоваяСтрокаДокумент.customerShortName = Строка(ПолучитьЗначениеПоляXDTO(document.customer,"shortName"));
			НоваяСтрокаДокумент.customerInn = ПолучитьЗначениеПоляXDTO(document.customer,"inn");
			НоваяСтрокаДокумент.customerKpp = ПолучитьЗначениеПоляXDTO(document.customer,"kpp");
			
			НоваяСтрокаДокумент.customerTaxId = ПолучитьЗначениеПоляXDTO(document.customer,"taxId");
			НоваяСтрокаДокумент.customerTaxIdPrimary = ПолучитьЗначениеПоляXDTO(document.customer,"taxIdPrimary");
			НоваяСтрокаДокумент.customerTaxIdSecondary = ПолучитьЗначениеПоляXDTO(document.customer,"taxIdSecondary");
			
			//Для Казахстана используем в представлении компании ИИН/БИН
			Если СтруктураНастроек.РегионПространства = "KAZ" Тогда
				НоваяСтрокаДокумент.ПредставлениеПлательщика = НоваяСтрокаДокумент.customerShortName + " (ИИН/БИН" + НоваяСтрокаДокумент.customerTaxId + ")";
			Иначе
				НоваяСтрокаДокумент.ПредставлениеПлательщика = НоваяСтрокаДокумент.customerShortName + " (ИНН" + НоваяСтрокаДокумент.customerInn
					+ ?(ЗначениеЗаполненоXDTO(НоваяСтрокаДокумент.customerKpp),"/КПП" + НоваяСтрокаДокумент.customerKpp,"")+ ")";
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполненоXDTO(document.recognizedCustomer) Тогда
			НоваяСтрокаДокумент.recognizedCustomerId = document.recognizedCustomer.id;
			НоваяСтрокаДокумент.recognizedCustomerName = document.recognizedCustomer.name;
			НоваяСтрокаДокумент.recognizedCustomerShortName = ПолучитьЗначениеПоляXDTO(document.recognizedCustomer,"shortName");
			НоваяСтрокаДокумент.recognizedCustomerInn = document.recognizedCustomer.inn;
			НоваяСтрокаДокумент.recognizedCustomerKpp = document.recognizedCustomer.kpp;
			НоваяСтрокаДокумент.recognizedCustomerTaxId = document.recognizedCustomer.taxId;
		КонецЕсли;
		
		//Поставщик
		Если ЗначениеЗаполненоXDTO(document.supplier) Тогда
			НоваяСтрокаДокумент.supplierId = document.supplier.id;
			НоваяСтрокаДокумент.supplierName = Строка(ПолучитьЗначениеПоляXDTO(document.supplier,"name"));
			НоваяСтрокаДокумент.supplierShortName = Строка(ПолучитьЗначениеПоляXDTO(document.supplier,"shortName"));
			НоваяСтрокаДокумент.supplierInn = ПолучитьЗначениеПоляXDTO(document.supplier,"inn");
			НоваяСтрокаДокумент.supplierKpp = ПолучитьЗначениеПоляXDTO(document.supplier,"kpp");
			
			НоваяСтрокаДокумент.supplierTaxId = ПолучитьЗначениеПоляXDTO(document.supplier,"taxId");
			НоваяСтрокаДокумент.supplierTaxIdPrimary = ПолучитьЗначениеПоляXDTO(document.supplier,"taxIdPrimary");
			НоваяСтрокаДокумент.supplierTaxIdSecondary = ПолучитьЗначениеПоляXDTO(document.supplier,"taxIdSecondary");
			
			//Для Казахстана используем в представлении компании ИИН/БИН
			Если СтруктураНастроек.РегионПространства = "KAZ" Тогда
				НоваяСтрокаДокумент.ПредставлениеПоставщика = НоваяСтрокаДокумент.supplierShortName + " (ИИН/БИН" + НоваяСтрокаДокумент.supplierTaxId + ")";
			Иначе
				НоваяСтрокаДокумент.ПредставлениеПоставщика = НоваяСтрокаДокумент.supplierShortName + " (ИНН" + НоваяСтрокаДокумент.supplierInn
					+ ?(ЗначениеЗаполненоXDTO(НоваяСтрокаДокумент.supplierKpp),"/КПП" + НоваяСтрокаДокумент.supplierKpp,"")+ ")";
			КонецЕсли;
		КонецЕсли;
				
		Если ЗначениеЗаполненоXDTO(document.recognizedSupplier) Тогда
			НоваяСтрокаДокумент.recognizedSupplierId = document.recognizedSupplier.id;
			НоваяСтрокаДокумент.recognizedSupplierName = document.recognizedSupplier.name;
			НоваяСтрокаДокумент.recognizedSupplierShortName = ПолучитьЗначениеПоляXDTO(document.recognizedSupplier,"shortName");
			НоваяСтрокаДокумент.recognizedSupplierInn = document.recognizedSupplier.inn;
			НоваяСтрокаДокумент.recognizedSupplierKpp = document.recognizedSupplier.kpp;
			НоваяСтрокаДокумент.recognizedSupplierTaxId = document.recognizedSupplier.taxId;
		КонецЕсли;
		
		//Данные о банковском счете поставщика
		Если ЗначениеЗаполненоXDTO(document.recognizedSupplierAccountDetails) Тогда
			AccountDetails = document.recognizedSupplierAccountDetails;
			НоваяСтрокаДокумент.supplierAccountBic = ПолучитьЗначениеПоляXDTO(AccountDetails,"bic");
			НоваяСтрокаДокумент.supplierAccountNumber = ПолучитьЗначениеПоляXDTO(AccountDetails,"account");
			НоваяСтрокаДокумент.supplierAccountBankName = ПолучитьЗначениеПоляXDTO(AccountDetails,"name");
			НоваяСтрокаДокумент.supplierAccountBankIndex = ПолучитьЗначениеПоляXDTO(AccountDetails,"index");
			НоваяСтрокаДокумент.supplierAccountSettlementType = ПолучитьЗначениеПоляXDTO(AccountDetails,"settlementType");
			НоваяСтрокаДокумент.supplierAccountSettlementName = ПолучитьЗначениеПоляXDTO(AccountDetails,"settlementName");
			НоваяСтрокаДокумент.supplierAccountAddress = ПолучитьЗначениеПоляXDTO(AccountDetails,"address");
			НоваяСтрокаДокумент.supplierAccountCorrespondentAccount = ПолучитьЗначениеПоляXDTO(AccountDetails,"correspondentAccount");
			НоваяСтрокаДокумент.supplierAccountFullAddress = ПолучитьЗначениеПоляXDTO(AccountDetails,"fullAddress");
		КонецЕсли;
				
		//Коллекция страниц документа
		НоваяСтрокаДокумент.pagesCount = 0;
		Если ЗначениеЗаполненоXDTO(document.pages) Тогда
			pages = ПолучитьКоллекциюXDTO(document.pages.page);
			НоваяСтрокаДокумент.pagesCount = pages.Количество();
			
			Для Каждого page Из pages Цикл
				НоваяСтрокаСтраница = ДанныеПортала.documentPages.Добавить();
				
				НоваяСтрокаСтраница.documentId = documentId;
				НоваяСтрокаСтраница.number = ПолучитьЗначениеПоляXDTO(page,"number");
				НоваяСтрокаСтраница.rotationAngle = ПолучитьЗначениеПоляXDTO(page,"rotationAngle");
				НоваяСтрокаСтраница.url = ПолучитьЗначениеПоляXDTO(page,"url");
				
				Если ЗначениеЗаполненоXDTO(page.file) Тогда
					НоваяСтрокаСтраница.fileName = page.file.name;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//E1C-127: источник данных документа для формирования комментария
		Если document.type = "RECEIPT" Тогда
			НоваяСтрокаДокумент.ИсточникДокумента = "QR Сканер чеков";
		Иначе
			НоваяСтрокаДокумент.ИсточникДокумента = "Скан-копия документа";
		КонецЕсли;
		
		//E1C-442: добавлен параметр для формирования комментария/назначения платежа: Код типа документа.
		//Заполняется из макета предварительно захардкоженных соответствий типов документа портала и кодов ФНС
		НоваяСтрокаДокумент.КодТипаДокумента = ПолучитьЗначениеСоответствия(СтруктураНастроек.КодыТиповДокументов,НоваяСтрокаДокумент.type);
		
		//2019.12.14 ( Ответ API содержит массив дополнительной информации в поле externalSystemInfos
		Если ЗначениеЗаполненоXDTO(document.externalSystemInfos) Тогда
			externalSystemInfos = ПолучитьКоллекциюXDTO(document.externalSystemInfos.externalSystemInfo);
			
			Для Каждого info Из externalSystemInfos Цикл
				Если СвойствоXDTOСуществует(info,"type") Тогда
					infoType = info.type;
				
					Если infoType = "ONEC" Тогда
						//+++ Дополнительная информация из 1с о выгруженных документах в базы 1с
						//пока нет необходимости ее разбирать
						
					ИначеЕсли infoType = "DIADOC" Тогда
						
						//Статус документа в Диадок в поле data объекта info
						Если СвойствоXDTOСуществует(info,"data") Тогда
							infoData = info.data;
							Если СвойствоXDTOСуществует(infoData,"attachmentType") И СвойствоXDTOСуществует(infoData,"status") Тогда
								НоваяСтрокаДокумент.Диадок_Статус = Диадок_ПолучитьСтатусДокумента(СтруктураНастроек.Диадок_СоответствиеСтатусов,infoData.attachmentType,infoData.status);
							КонецЕсли;
							
							Если СвойствоXDTOСуществует(info,"url") Тогда
								НоваяСтрокаДокумент.Диадок_url = info.url;
							КонецЕсли;
						КонецЕсли;
						
						НоваяСтрокаДокумент.ИсточникДокумента = "Документ из Диадок";
						
					ИначеЕсли infoType = "SBIS" Тогда
						
						//Статус документа в СБИС в поле data объекта info
						Если СвойствоXDTOСуществует(info,"data") Тогда
							infoData = info.data;
							Если СвойствоXDTOСуществует(infoData,"statusCode") Тогда
								НоваяСтрокаДокумент.Диадок_Статус = СБИС_ПолучитьСтатусДокумента(СтруктураНастроек.СБИС_СоответствиеСтатусов,infoData.statusCode);
							КонецЕсли;
							
							Если СвойствоXDTOСуществует(infoData,"pdfFileLink") Тогда
								НоваяСтрокаДокумент.Диадок_url = infoData.pdfFileLink;
							КонецЕсли;
						КонецЕсли;
						
						НоваяСтрокаДокумент.ИсточникДокумента = "Документ из СБИС";
						
					//2021.03.26 ( в поле ENTERA_EDI могут быть переданы данные об исходном документе,
					//попробуем его найти в этой базе, если найдем - покажем на него ссылку
					ИначеЕсли infoType = "ENTERA_EDI" Тогда
						
						//Идентификатор документа при отправке передается в виде строки, состоящей из типа документа
						//и его GUID-идентификатора, разделенных точкой
						Если СвойствоXDTOСуществует(info,"externalId")
							И ЗначениеЗаполненоXDTO(info.externalId) Тогда
							МассивПолей = Энтера_РазложитьСтрокуВМассивПодстрок(info.externalId,".");
							
							Если МассивПолей.Количество() = 2 Тогда
								ИмяТипа = МассивПолей[0];
								GUID = МассивПолей[1];
								
								НоваяСтрокаДокумент.ДокументСсылка = ПолучитьСсылку_ОбъектПоУникальномуИдентификатору(GUID,ИмяТипа,"Документы");
							КонецЕсли;
						КонецЕсли;
					// ) 2021.03.26
					
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;		
		// ) 2019.12.14
		
		//2020.10.21 ( читаем дополнительную информацию clientData в СтруктураДополнительныхДанных
		//Чтение выполняем в МК, так как структура дополнительной информации персональна
		Если ЗначениеЗаполненоXDTO(document.clientData) Тогда
			ПараметрыМК.Вставить("clientData",document.clientData);
			ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
			МодульКастомизации_ОбработатьСобытие("ЧтениеДанныхДокумента_clientData",ПараметрыМК);
			
			Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
				//Тут будет штатный обработчик clientData
			КонецЕсли;
			
		КонецЕсли;
		// ) 2020.10.21
		
		//E1C-487: Казахстан: дата оборота для типа документа ЭСФ
		Если СвойствоXDTOСуществует(document,"esfKzDocument") И ЗначениеЗаполненоXDTO(document.esfKzDocument) Тогда
			НоваяСтрокаДокумент.esfKzRegistrationNumber = ПолучитьЗначениеПоляXDTO(document.esfKzDocument,"registrationNumber",Ложь);
			НоваяСтрокаДокумент.esfKzTurnoverDate = ПолучитьДатуИзДатыПортала(ПолучитьЗначениеПоляXDTO(document.esfKzDocument,"turnoverDate",Ложь));
			
			//E1C-503: Для распознанного типа документа ЭСФ для заполнения  "Вх номер" = значение берется из deliveryDocNum,
			//Вх. дата = значение берется из deliveryDocDate. Указанные поля в document.esfKzDocument.invoiceData.invoiceBody
			Если СвойствоXDTOСуществует(document.esfKzDocument,"invoiceData") И ЗначениеЗаполненоXDTO(document.esfKzDocument.invoiceData) Тогда
				invoiceData = document.esfKzDocument.invoiceData;
				Если СвойствоXDTOСуществует(invoiceData,"invoiceBody") И ЗначениеЗаполненоXDTO(invoiceData.invoiceBody) Тогда	
					НоваяСтрокаДокумент.esfKzDeliveryDocNum = ПолучитьЗначениеПоляXDTO(invoiceData.invoiceBody,"deliveryDocNum",Ложь);
					НоваяСтрокаДокумент.esfKzDeliveryDocDate = ПолучитьДатуИзДатыПортала(ПолучитьЗначениеПоляXDTO(invoiceData.invoiceBody,"deliveryDocDate",Ложь));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//В документе может присутствовать набор полей customFields, индивидуальный для разных клиентов
		//согласовано, что имена ключей не будут содержать символов, недопустимых для чтения в структуру
		Если ЗначениеЗаполненоXDTO(document.customFields) Тогда
			Попытка
				customFields = Новый Структура;
				Если ТипЗнч(document.customFields) = Тип("ОбъектXDTO") Тогда
					Для Каждого СвойствоКастомногоПоля Из document.customFields.Свойства() Цикл
						customFields.Вставить(СвойствоКастомногоПоля.ЛокальноеИмя,ПолучитьЗначениеПоляXDTO(document.customFields,СвойствоКастомногоПоля.ЛокальноеИмя));
					КонецЦикла;
				КонецЕсли;
				НоваяСтрокаДокумент.customFields = customFields;
			Исключение
				ТекстОшибки = "Ошибка при чтении значений customFields документа <" + documentId + ">:" + Символы.ПС + ОписаниеОшибки();
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"ЧтениеОтвета",ТекстОшибки,"Ошибка");
				ДополнитьТекстОшибки(РезультатЧтения.ТекстОшибки,ТекстОшибки);
			КонецПопытки;
		КонецЕсли;
		
		
		//Коллекция товарных позиций документа
		Если ЗначениеЗаполненоXDTO(document.items) Тогда
			items = ПолучитьКоллекциюXDTO(document.items.item);
		Иначе
			items = Новый Массив;
		КонецЕсли;
		
		//По умолчанию предполагаем, что номенклатуру для документа нужно создавать
		НоваяСтрокаДокумент.ТребуетсяСозданиеНоменклатуры = Истина;
		
		//E1C-275: Если в настройках ставим "Сворачивание данные табличной части в одну строку",
		//и, при отсутствии распознанной итоговой строки, для создания документа
		//считать все итоговые показатели (amountWithoutVat, vat, amount) по всем позициям.
		Если Не ЗначениеЗаполненоXDTO(НоваяСтрокаДокумент.amount)
			Или Не ЗначениеЗаполненоXDTO(НоваяСтрокаДокумент.vat)
			Или Не ЗначениеЗаполненоXDTO(НоваяСтрокаДокумент.amountWithoutVat) Тогда
			
			amount = 0;
			vat = 0;
			amountWithoutVat = 0;
			
			Для Каждого item Из items Цикл
				Попытка amount = amount + Число(item.amount); Исключение; КонецПопытки;
				Попытка vat = vat + Число(item.vat); Исключение; КонецПопытки;
				Попытка amountWithoutVat = amountWithoutVat + Число(item.amountWithoutVat); Исключение; КонецПопытки;
			КонецЦикла;
			
			НоваяСтрокаДокумент.amount = amount;
			НоваяСтрокаДокумент.vat = vat;
			НоваяСтрокаДокумент.amountWithoutVat = amountWithoutVat;
			
		КонецЕсли;
		
		//2019.11.12 ( В случае использования свернутой ТЧ помещаем в таблицу items только одну строку с предопределенной в настройках номенклатурой
		Если СтруктураНастроек.ЗаполнениеТЧ_СворачиватьТЧВОднуСтроку <> "Нет" Тогда
			
			Если СтруктураНастроек.ЗаполнениеТЧ_СворачиватьТЧВОднуСтроку = "Да, оставляя количество = 1" Тогда
				quantity = 1;
				recognizedQuantity = 1;
				price = НоваяСтрокаДокумент.amount;
				
			//E1C-555: Добавить новый вариант сворачивания в настройке "Сворачивать данные табличной части в одну строку"
			ИначеЕсли СтруктураНастроек.ЗаполнениеТЧ_СворачиватьТЧВОднуСтроку = "Да, оставляя цену = 1" Тогда
				quantity = НоваяСтрокаДокумент.amount;
				recognizedQuantity = НоваяСтрокаДокумент.amount;
				price = 1;
				
			Иначе
				quantity = 0;
				recognizedQuantity = 0;
				Для Каждого item Из items Цикл
					Попытка quantity = quantity + Число(item.quantity); Исключение; КонецПопытки;
					Попытка recognizedQuantity = recognizedQuantity + Число(item.recognizedQuantity); Исключение; КонецПопытки;
				КонецЦикла;
				price = ?(quantity = 0,НоваяСтрокаДокумент.amount,НоваяСтрокаДокумент.amount / quantity);
			КонецЕсли;
			
			ВыбраннаяНоменклатура = СтруктураНастроек.ЗаполнениеТЧ_СворачиватьТЧНоменклатура;
						
			НоваяСтрокаНоменклатура = ДанныеПортала.documentItems.Добавить();		
			
			НоваяСтрокаНоменклатура.documentId = documentId;
			НоваяСтрокаНоменклатура.id = Строка(Новый УникальныйИдентификатор);
			НоваяСтрокаНоменклатура.recognizedName = Строка(ВыбраннаяНоменклатура);
			НоваяСтрокаНоменклатура.name = Строка(ВыбраннаяНоменклатура);
			НоваяСтрокаНоменклатура.supplierInn = НоваяСтрокаДокумент.supplierInn;
			НоваяСтрокаНоменклатура.НоменклатураСсылка = ВыбраннаяНоменклатура;
										
			НоваяСтрокаНоменклатура.quantity = quantity;
			НоваяСтрокаНоменклатура.recognizedQuantity = recognizedQuantity;
			НоваяСтрокаНоменклатура.price = price;
			НоваяСтрокаНоменклатура.recognizedPrice = price;
			НоваяСтрокаНоменклатура.vat = НоваяСтрокаДокумент.vat;
			НоваяСтрокаНоменклатура.recognizedVat = НоваяСтрокаДокумент.recognizedVat;
			НоваяСтрокаНоменклатура.amount = НоваяСтрокаДокумент.amount;
			НоваяСтрокаНоменклатура.recognizedAmount = НоваяСтрокаДокумент.recognizedAmount;
			НоваяСтрокаНоменклатура.recognizedAmountWithoutVat = НоваяСтрокаДокумент.recognizedAmountWithoutVat;
			
			//amountWithoutVat может быть не заполнена, расчитаем
			Если ЗначениеЗаполненоXDTO(НоваяСтрокаДокумент.amountWithoutVat) Тогда
				НоваяСтрокаНоменклатура.amountWithoutVat = НоваяСтрокаДокумент.amountWithoutVat;
			Иначе
				Попытка
					//Неявное преобразование к типу Число может вызвать ошибку
					НоваяСтрокаНоменклатура.amountWithoutVat = НоваяСтрокаДокумент.amount - НоваяСтрокаДокумент.vat;
				Исключение
					//не обрабатываем
				КонецПопытки;
			КонецЕсли;
			
			//Далее в зависимости от конфигурации
			
			ЕдиницаИзмеренияСсылка = Неопределено;
			СтавкаНДССсылка = Неопределено;
			
			Если Конф = "БП30" Тогда
				Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
					ЕдиницаИзмеренияСсылка = ВыбраннаяНоменклатура.БазоваяЕдиницаИзмерения;
				Иначе
					ЕдиницаИзмеренияСсылка = ВыбраннаяНоменклатура.ЕдиницаИзмерения;
				КонецЕсли;
				
				//Старая бухня еще может использовать реквизит СтавкаНДС, а не ВидСтавкиНДС
				Если РеквизитСуществует("Справочники","Номенклатура","ВидСтавкиНДС") Тогда
					СтавкаНДССсылка = Перечисления.СтавкиНДС.СтавкаНДС(ВыбраннаяНоменклатура.ВидСтавкиНДС, НоваяСтрокаДокумент.date);
				Иначе
					СтавкаНДССсылка = ВыбраннаяНоменклатура.СтавкаНДС;
				КонецЕсли;
				
			ИначеЕсли Конф = "УНФ" Тогда
				ЕдиницаИзмеренияСсылка = ВыбраннаяНоменклатура.ЕдиницаИзмерения;
				Если РеквизитСуществует("Перечисления","СтавкиНДС") Тогда
					СтавкаНДССсылка = Перечисления.СтавкиНДС.СтавкаНДС(ВыбраннаяНоменклатура.ВидСтавкиНДС, НоваяСтрокаДокумент.date);
				Иначе
					СтавкаНДССсылка = Справочники.СтавкиНДС.СтавкаНДС(ВыбраннаяНоменклатура.ВидСтавкиНДС, НоваяСтрокаДокумент.date);
				КонецЕсли;
				
			ИначеЕсли Конф = "РОЗН2" Или Конф = "РОЗН3" Тогда
				ЕдиницаИзмеренияСсылка = ВыбраннаяНоменклатура.ЕдиницаИзмерения;
				СтавкаНДССсылка = ВыбраннаяНоменклатура.СтавкаНДС;
			
			ИначеЕсли Конф = "ЭДО" Тогда
				ЕдиницаИзмеренияСсылка = ВыбраннаяНоменклатура.ЕдиницаИзмерения;
				СтавкаНДССсылка = ВыбраннаяНоменклатура.СтавкаНДС;
				
			ИначеЕсли Конф = "УТ11" Или Конф = "КА2" Или Конф = "ERP" Тогда
				ЕдиницаИзмеренияСсылка = ВыбраннаяНоменклатура.ЕдиницаИзмерения;
				Если РеквизитСуществует("Справочники","Номенклатура","СтавкаНДС") Тогда
					СтавкаНДССсылка = ВыбраннаяНоменклатура.СтавкаНДС;
				Иначе
					СтавкаНДССсылка = Перечисления.СтавкиНДС.СтавкаНДС(ВыбраннаяНоменклатура.ВидСтавкиНДС, НоваяСтрокаДокумент.date);
				КонецЕсли;
				
			ИначеЕсли Конф = "УТ10" Или Конф = "КА1" Или Конф = "УПП" Тогда
				ЕдиницаИзмеренияСсылка = ВыбраннаяНоменклатура.ЕдиницаХраненияОстатков;
				СтавкаНДССсылка = ВыбраннаяНоменклатура.СтавкаНДС;
				
			ИначеЕсли Конф = "Автосалон" Или Конф = "КомбинатПитания" Или Конф = "КомбинатПитания" Тогда
				ЕдиницаИзмеренияСсылка = ВыбраннаяНоменклатура.ОсновнаяЕдиницаИзмерения;
				СтавкаНДССсылка = ВыбраннаяНоменклатура.СтавкаНДС;
			
			ИначеЕсли Конф = "БП20" Тогда
				ЕдиницаИзмеренияСсылка = ВыбраннаяНоменклатура.БазоваяЕдиницаИзмерения;
				СтавкаНДССсылка = ВыбраннаяНоменклатура.СтавкаНДС;
				
			Иначе //Не определили конфигурацию, пробуем поискать в метаданных Номенклатуры требуемые реквизиты
				Если Метаданные.Справочники.Номенклатура.Реквизиты.Найти("ЕдиницаИзмерения") <> Неопределено Тогда
					ЕдиницаИзмеренияСсылка = ВыбраннаяНоменклатура.ЕдиницаИзмерения;
				КонецЕсли;
				
				Если Метаданные.Справочники.Номенклатура.Реквизиты.Найти("СтавкаНДС") <> Неопределено Тогда
					СтавкаНДССсылка = ВыбраннаяНоменклатура.СтавкаНДС;
				КонецЕсли;
			КонецЕсли;
			
			Если ЕдиницаИзмеренияСсылка <> Неопределено Тогда
				НоваяСтрокаНоменклатура.unitId = Строка(ЕдиницаИзмеренияСсылка.УникальныйИдентификатор());
				НоваяСтрокаНоменклатура.unitName = Строка(ЕдиницаИзмеренияСсылка);
				НоваяСтрокаНоменклатура.unitCode = ЕдиницаИзмеренияСсылка.Код;
				НоваяСтрокаНоменклатура.unitExternalId = ЕдиницаИзмеренияСсылка.УникальныйИдентификатор();
				
				НоваяСтрокаНоменклатура.userUnitName = Строка(ЕдиницаИзмеренияСсылка);
			КонецЕсли;
			
			НоваяСтрокаНоменклатура.ЕдиницаИзмеренияСсылка = ЕдиницаИзмеренияСсылка;
			
			//Ставку НДС придется попробовать расчитать исходя из суммы НДС документа и общей суммы
			Попытка
				Шапка_Сумма = Число(НоваяСтрокаДокумент.amountWithoutVat);
				Шапка_СуммаНДС = Число(НоваяСтрокаДокумент.vat);
				
				vatRate = Неопределено;
				
				Если Шапка_Сумма > 0 И Шапка_СуммаНДС > 0 Тогда
					
					ПроцентНДС = Окр(Шапка_СуммаНДС / Шапка_Сумма,2) * 100;
					
					Если ПроцентНДС = 22 Тогда
						vatRate = "PERCENT_22";
					ИначеЕсли ПроцентНДС = 20 Тогда
						vatRate = "PERCENT_20";
					ИначеЕсли ПроцентНДС = 18 Тогда
						vatRate = "PERCENT_18";
					ИначеЕсли ПроцентНДС = 10 Тогда
						vatRate = "PERCENT_10";
					ИначеЕсли ПроцентНДС = 12 Тогда
						vatRate = "PERCENT_12";
					ИначеЕсли ПроцентНДС = 16 Тогда
						vatRate = "PERCENT_16";
					ИначеЕсли ПроцентНДС = 5 Тогда
						vatRate = "PERCENT_5";
					ИначеЕсли ПроцентНДС = 7 Тогда
						vatRate = "PERCENT_7";
					КонецЕсли;
					
				КонецЕсли;
				
				НоваяСтрокаНоменклатура.СтавкаНДССсылка = ПолучитьСсылку_СтавкаНДС(vatRate,СтруктураНастроек.СведенияОКонфигурации.СтавкиНДС);
				
				//2022.02.21 ( также установим vatRate для данных распознанного документа
				НоваяСтрокаНоменклатура.vatRate = vatRate;
				// ) 2022.02.21
				
				ОписаниеСобытия = "Ставка НДС <" + НоваяСтрокаНоменклатура.СтавкаНДССсылка
					+ "> расчитана для свернутой ТЧ: сумма [" + НоваяСтрокаДокумент.amountWithoutVat + "],"
					+ "сумма НДС [" + НоваяСтрокаДокумент.vat + "], процент НДС [" + ПроцентНДС + "]";
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"ЧтениеОтвета",ОписаниеСобытия,"ЧтениеОтвета");
				
			Исключение
				ОписаниеСобытия = "Ошибка при расчете ставки НДС для свернутой ТЧ: сумма [" + НоваяСтрокаДокумент.amountWithoutVat + "],"
					+ "сумма НДС [" + НоваяСтрокаДокумент.vat + "]." + Символы.ПС + ОписаниеОшибки();
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"ЧтениеОтвета",ОписаниеСобытия,"ЧтениеОтвета");
				
				НоваяСтрокаНоменклатура.СтавкаНДССсылка = СтавкаНДССсылка;
				
			КонецПопытки;
						
		Иначе
		// ) 2019.11.12
		
				
			Для Каждого item Из items Цикл
				НоваяСтрокаНоменклатура = ДанныеПортала.documentItems.Добавить();
				
				НоваяСтрокаНоменклатура.documentId = documentId;
				НоваяСтрокаНоменклатура.id =  ПолучитьЗначениеПоляXDTO(item,"id");
				НоваяСтрокаНоменклатура.serialNumber =  ПолучитьЗначениеПоляXDTO(item,"serialNumber");
				НоваяСтрокаНоменклатура.recognizedSerialNumber = ПолучитьЗначениеПоляXDTO(item,"recognizedSerialNumber");
				НоваяСтрокаНоменклатура.recognizedName = ПолучитьЗначениеПоляXDTO(item,"recognizedName");
				НоваяСтрокаНоменклатура.name = ПолучитьЗначениеПоляXDTO(item,"name");
				НоваяСтрокаНоменклатура.supplierInn = НоваяСтрокаДокумент.supplierInn;
				
				// E1C-45: брать код товара из goodCode а если он пустой, то из recognizedGoodCode
				НоваяСтрокаНоменклатура.recognizedGoodCode = ПолучитьЗначениеПоляXDTO(item,"goodCode");
				Если Не ЗначениеЗаполнено(НоваяСтрокаНоменклатура.recognizedGoodCode) Тогда
					НоваяСтрокаНоменклатура.recognizedGoodCode = ПолучитьЗначениеПоляXDTO(item,"recognizedGoodCode");
				КонецЕсли;
				
				//E1C-103: сохраняем для отправки измененных данных статус goodCodeIsNull
				НоваяСтрокаНоменклатура.goodCodeIsNull = item.goodCode = Неопределено;
				
				//Вероятные совпадения номенклатуры
				Если СвойствоXDTOСуществует(item,"potentialNomenclatures") И ЗначениеЗаполненоXDTO(item.potentialNomenclatures) Тогда
					potentialNomenclatures = ПолучитьКоллекциюXDTO(item.potentialNomenclatures.potentialNomenclature);
					
					Для Каждого potentialNomenclature Из potentialNomenclatures Цикл
						Если СвойствоXDTOСуществует(potentialNomenclature,"nomenclature")
							И ЗначениеЗаполненоXDTO(potentialNomenclature.nomenclature) Тогда
							
							НоваяСтрокаВероятнаяНоменклатура = ДанныеПортала.potentialNomenclatures.Добавить();
							
							НоваяСтрокаВероятнаяНоменклатура.documentId = documentId;
							НоваяСтрокаВероятнаяНоменклатура.documentItemId = item.id;
							НоваяСтрокаВероятнаяНоменклатура.nomenclatureId = potentialNomenclature.nomenclature.id;
							НоваяСтрокаВероятнаяНоменклатура.nomenclatureName = potentialNomenclature.nomenclature.name;
							НоваяСтрокаВероятнаяНоменклатура.nomenclatureCode = potentialNomenclature.nomenclature.code;
							НоваяСтрокаВероятнаяНоменклатура.nomenclatureExternalId = potentialNomenclature.nomenclature.externalId;
							НоваяСтрокаВероятнаяНоменклатура.probability = potentialNomenclature.probability;
							
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				//Установленое соответствие номенклатуры
				Если СвойствоXDTOСуществует(item,"nomenclature") И ЗначениеЗаполненоXDTO(item.nomenclature) Тогда
					НоваяСтрокаНоменклатура.nomenclatureId = item.nomenclature.id;
					НоваяСтрокаНоменклатура.nomenclatureName = item.nomenclature.name;
					НоваяСтрокаНоменклатура.nomenclatureCode = item.nomenclature.code;
					НоваяСтрокаНоменклатура.nomenclatureExternalId = item.nomenclature.externalId;
				КонецЕсли;
								
				НоваяСтрокаНоменклатура.recognizedGoodTypeCode = ПолучитьЗначениеПоляXDTO(item,"recognizedGoodTypeCode");
				НоваяСтрокаНоменклатура.recognizedUnitCode = ПолучитьЗначениеПоляXDTO(item,"recognizedUnitCode");
				НоваяСтрокаНоменклатура.recognizedUnit = ПолучитьЗначениеПоляXDTO(item,"recognizedUnit");
				
				
				//Установленое соответствие единицы измерения
				Если СвойствоXDTOСуществует(item,"unit") И ЗначениеЗаполненоXDTO(item.unit) Тогда
					НоваяСтрокаНоменклатура.unitId = item.unit.id;
					НоваяСтрокаНоменклатура.unitName = item.unit.name;
					НоваяСтрокаНоменклатура.unitCode = item.unit.code;
					НоваяСтрокаНоменклатура.unitExternalId = item.unit.externalId;
				Иначе
					НоваяСтрокаНоменклатура.unitName = ПолучитьЗначениеПоляXDTO(item,"unitName");
				КонецЕсли;
				
				НоваяСтрокаНоменклатура.userUnitName = ПолучитьЗначениеПоляXDTO(item,"unitName");
								
				НоваяСтрокаНоменклатура.quantity =  ПолучитьЗначениеПоляXDTO(item,"quantity",Истина);
				НоваяСтрокаНоменклатура.recognizedQuantity = ПолучитьЗначениеПоляXDTO(item,"recognizedQuantity",Истина);
				НоваяСтрокаНоменклатура.price =  ПолучитьЗначениеПоляXDTO(item,"price",Истина);
				НоваяСтрокаНоменклатура.recognizedPrice = ПолучитьЗначениеПоляXDTO(item,"recognizedPrice",Истина);
				НоваяСтрокаНоменклатура.amountWithoutVat =  ПолучитьЗначениеПоляXDTO(item,"amountWithoutVat",Истина);
				НоваяСтрокаНоменклатура.recognizedAmountWithoutVat = ПолучитьЗначениеПоляXDTO(item,"recognizedAmountWithoutVat",Истина);
				НоваяСтрокаНоменклатура.excise =  ПолучитьЗначениеПоляXDTO(item,"excise");
				НоваяСтрокаНоменклатура.recognizedExcise = ПолучитьЗначениеПоляXDTO(item,"recognizedExcise");
				НоваяСтрокаНоменклатура.vatRate =  ПолучитьЗначениеПоляXDTO(item,"vatRate");
				НоваяСтрокаНоменклатура.recognizedVatRate = ПолучитьЗначениеПоляXDTO(item,"recognizedVatRate");
				НоваяСтрокаНоменклатура.vat =  ПолучитьЗначениеПоляXDTO(item,"vat",Истина);
				НоваяСтрокаНоменклатура.recognizedVat = ПолучитьЗначениеПоляXDTO(item,"recognizedVat",Истина);
				НоваяСтрокаНоменклатура.amount =  ПолучитьЗначениеПоляXDTO(item,"amount",Истина);
				НоваяСтрокаНоменклатура.recognizedAmount = ПолучитьЗначениеПоляXDTO(item,"recognizedAmount",Истина);
				
				НоваяСтрокаНоменклатура.СтавкаНДССсылка = ПолучитьСсылку_СтавкаНДС(НоваяСтрокаНоменклатура.vatRate,СтруктураНастроек.СведенияОКонфигурации.СтавкиНДС);
				
				// данные о номере ГТД и стране происхождения.
				//E1C-366: Изначально выполнялось получение значения из recognizedCustomsDeclaration,
				//теперь - из валидированного customsDeclaration. Поскольку в некоторых модулях кастомизации клиентов идет взаимодействие
				//с полем данных документа recognizedCustomsDeclaration, имя поля в таблице оставляем прежним, только изменяем источник его значения
				recognizedCustomsDeclaration = ПолучитьЗначениеПоляXDTO(item,"customsDeclaration");
				
				// В номере ГТД цифры и знак /, распознанные прочерки и тире пропускаем
				ПрисутствуютДанныеГТД = ЗначениеЗаполнено(recognizedCustomsDeclaration)
					И Найти(recognizedCustomsDeclaration,"-") = 0
					И Найти(recognizedCustomsDeclaration,Символ(8212)) = 0;
					
				Если ПрисутствуютДанныеГТД Тогда
					НоваяСтрокаНоменклатура.recognizedCountryCode = ПолучитьЗначениеПоляXDTO(item,"recognizedCountryCode");
					НоваяСтрокаНоменклатура.recognizedCountryShortName = ПолучитьЗначениеПоляXDTO(item,"recognizedCountryShortName");
					НоваяСтрокаНоменклатура.recognizedCustomsDeclaration = recognizedCustomsDeclaration;					
				КонецЕсли;
				
				//E1C-477: Казахстан: 1С. БП 3.0 для КЗ. Работа с ЭСФ и Источником происхождения
				Если СвойствоXDTOСуществует(item,"esfKzDocumentItem") И ЗначениеЗаполненоXDTO(item.esfKzDocumentItem) Тогда					
					НоваяСтрокаНоменклатура.esfKzAdditional = ПолучитьЗначениеПоляXDTO(item.esfKzDocumentItem,"additional",Ложь);
					НоваяСтрокаНоменклатура.esfKzAdditionalUnitNomenclature = ПолучитьЗначениеПоляXDTO(item.esfKzDocumentItem,"additionalUnitNomenclature",Ложь);
					НоваяСтрокаНоменклатура.esfKzCatalogTruId = ПолучитьЗначениеПоляXDTO(item.esfKzDocumentItem,"catalogTruId",Ложь);
					НоваяСтрокаНоменклатура.esfKzExciseRate = ПолучитьЗначениеПоляXDTO(item.esfKzDocumentItem,"exciseRate",Ложь);
					НоваяСтрокаНоменклатура.esfKzKpvedCode = ПолучитьЗначениеПоляXDTO(item.esfKzDocumentItem,"kpvedCode",Ложь);
					НоваяСтрокаНоменклатура.esfKzproductDeclaration = ПолучитьЗначениеПоляXDTO(item.esfKzDocumentItem,"productDeclaration",Ложь);
					НоваяСтрокаНоменклатура.esfKzproductNumberInDeclaration = ПолучитьЗначениеПоляXDTO(item.esfKzDocumentItem,"productNumberInDeclaration",Ложь);
					НоваяСтрокаНоменклатура.esfKzProductNumberInSnt = ПолучитьЗначениеПоляXDTO(item.esfKzDocumentItem,"productNumberInSnt",Ложь);
					НоваяСтрокаНоменклатура.esfKzTnvedName = ПолучитьЗначениеПоляXDTO(item.esfKzDocumentItem,"tnvedName",Ложь);
					НоваяСтрокаНоменклатура.esfKzTruOriginCode = ПолучитьЗначениеПоляXDTO(item.esfKzDocumentItem,"truOriginCode",Ложь);
					НоваяСтрокаНоменклатура.esfKzTurnoverAdjustment = ПолучитьЗначениеПоляXDTO(item.esfKzDocumentItem,"turnoverAdjustment",Ложь);
					НоваяСтрокаНоменклатура.esfKzTurnoverCode = ПолучитьЗначениеПоляXDTO(item.esfKzDocumentItem,"turnoverCode",Ложь);
					НоваяСтрокаНоменклатура.esfKzTurnoverSize = ПолучитьЗначениеПоляXDTO(item.esfKzDocumentItem,"turnoverSize",Ложь);
					НоваяСтрокаНоменклатура.esfKzUnitCode = ПолучитьЗначениеПоляXDTO(item.esfKzDocumentItem,"unitCode",Ложь);
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		//2021.06.07 ( свой обработчик чтения строки документа
		МодульКастомизации_ОбработатьСобытие("ЧтениеДанныхДокумента",ПараметрыМК);
		// ) 2021.06.07
		
		//2021.11.11 ( Попробуем тут в общей функции "сгруппировать" строки комплектов, передвинув child-строки к их parent
		//при последующем заполнении реестров в формах порядок будет соответствовать заданному тут.
		//Пока отключено
		Если Ложь Тогда
			Если СтруктураНастроек.СозданиеДокумента_ИспользоватьПоискКомплектов = Истина
				И ЗначениеЗаполнено(НоваяСтрокаДокумент.parent) Тогда
				//Ищем строку с документом-родителем, расчитываем смещение и сдвигаем новую строку к нему
				СтрокаДокументаРодителя = ДанныеПортала.documents.Найти(НоваяСтрокаДокумент.parent,"id");
				Если СтрокаДокументаРодителя <> Неопределено Тогда
					Смещение = ДанныеПортала.documents.Индекс(СтрокаДокументаРодителя) - ДанныеПортала.documents.Индекс(НоваяСтрокаДокумент) + 1;
					ДанныеПортала.documents.Сдвинуть(НоваяСтрокаДокумент,Смещение);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// ) 2021.11.11
		
	КонецЦикла;
	
	//Установим флаг завершения, если количество документов меньше размера запрашиваемой таблицы (100)
	Если КоличествоЭлементов < 100 Тогда
		РезультатЧтения.ЗагрузкаДанныхЗавершена = Истина;
	КонецЕсли;
	
	Возврат РезультатЧтения;
	
КонецФункции

Функция ПрочитатьСправочникПортала(Дерево,Назначение) Экспорт
	
	Результат = Новый Структура("Успешно,ИмяСправочника,Справочник",Ложь);
	
	Если Назначение = "СправочникиПортала_ТипыДокументов" Тогда
		Результат.ИмяСправочника = "ТипДокумента";
		ИмяКоллекции = "documentTypes";
		ИмяЭлементаКоллекции = "documentType";
		
	ИначеЕсли Назначение = "СправочникиПортала_СтатусыДокументов" Тогда
		Результат.ИмяСправочника = "СтатусДокумента";
		ИмяКоллекции = "documentStates";
		ИмяЭлементаКоллекции = "documentState";
		
	Иначе
		Возврат Результат;
		
	КонецЕсли;
	
	Результат.Справочник = Новый Соответствие;
	
	Если ЗначениеЗаполненоXDTO(Дерево[ИмяКоллекции]) Тогда
		elements = ПолучитьКоллекциюXDTO(Дерево[ИмяКоллекции][ИмяЭлементаКоллекции]);
				
		Для каждого element из elements Цикл
			Результат.Справочник.Вставить(element.id,element.name);
		КонецЦикла;
		
		Результат.Успешно = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПрочитатьСправочникПортала_Компании(Дерево,Назначение) Экспорт
	
	Результат = Новый Структура("Успешно,ИмяСправочника,Справочник",Ложь);
	
	Если Назначение = "СправочникиПортала_Плательщики" Тогда
		Результат.ИмяСправочника = "Плательщики";
		
	ИначеЕсли Назначение = "СправочникиПортала_Поставщики" Тогда
		Результат.ИмяСправочника = "Поставщики";
		
	Иначе
		Возврат Результат;
		
	КонецЕсли;
	
	ИмяКоллекции = "companies";
	ИмяЭлементаКоллекции = "company";		
	
	Результат.Справочник = Новый СписокЗначений;
	
	Если ЗначениеЗаполненоXDTO(Дерево[ИмяКоллекции]) Тогда
		elements = ПолучитьКоллекциюXDTO(Дерево[ИмяКоллекции][ИмяЭлементаКоллекции]);
				
		Для каждого element из elements Цикл
			
			//Эти реквизиты зависимы от другого сервиса, который, как выяснилось, может возвращать null
			shortName = Строка(ПолучитьЗначениеПоляXDTO(element,"shortName"));
			name = Строка(ПолучитьЗначениеПоляXDTO(element,"name"));
			inn = Строка(ПолучитьЗначениеПоляXDTO(element,"inn"));
			kpp = Строка(ПолучитьЗначениеПоляXDTO(element,"kpp"));
			taxId = Строка(ПолучитьЗначениеПоляXDTO(element,"taxId"));
			
			companyName = ?(ЗначениеЗаполнено(shortName),shortName,name);
			
			Если ЗначениеЗаполнено(taxId) Тогда
				companyName = companyName + "(" + taxId + ")";
			Иначе
				 companyName = companyName + ?(ЗначениеЗаполнено(inn),"(" + inn
					 + ?(ЗначениеЗаполнено(kpp),"/" + kpp,"")
					 + ")","");
			КонецЕсли;
				 
			Результат.Справочник.Добавить(element.id,companyName);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции


// ================= Инициализация структур данных ===================

Функция Инициализировать_ДанныеПользователя()
	СтруктураДанных = Новый Структура("id,email,phone,surname,name,patronymic,lang,isNew,phoneConfirm,spaces,recognitionSettings,broadcastMessages,
		|spaceCountries,balanceExpirationDate,transactionExpirationDate,clientActiveTransactionList,unlimited");
	СтруктураДанных.isNew = Ложь;
	СтруктураДанных.phoneConfirm = Ложь;
	СтруктураДанных.unlimited = Ложь;
	СтруктураДанных.spaces = Новый СписокЗначений;
	СтруктураДанных.recognitionSettings = Новый Соответствие;
	СтруктураДанных.spaceCountries = Новый Соответствие;
	СтруктураДанных.broadcastMessages = Новый Массив;
	
	Возврат СтруктураДанных;
КонецФункции


Функция Инициализировать_ТаблицыДанныхПортала()
	ДанныеПортала = Новый Структура();
	ДанныеПортала.Вставить("documents",Инициализировать_Таблица_documents());
	ДанныеПортала.Вставить("documentItems",Инициализировать_Таблица_documentItems());
	ДанныеПортала.Вставить("potentialNomenclatures",Инициализировать_Таблица_documentItems_potentialNomenclatures());
	ДанныеПортала.Вставить("documentPages",Инициализировать_Таблица_documentPages());
	
	ДанныеПортала.Вставить("ПредставленияДокументов",Новый Соответствие);
	
	Возврат ДанныеПортала;
КонецФункции

Функция Инициализировать_Таблица_documents(ВернутьСтруктуру = Ложь)
	СтруктураКолонок = Новый Структура("id,recognitionTaskId,source,printFormId,spaceId,url,xml,pagesCount,number,recognizedNumber,date,recognizedDate,customFields,
		|type,state,receiptState,fiscalDocumentNumber,paymentOrderId,comment,customerId,customerName,customerShortName,customerInn,customerKpp,customerTaxId,customerTaxIdPrimary,customerTaxIdSecondary,
		|recognizedCustomerId,recognizedCustomerName,recognizedCustomerShortName,recognizedCustomerInn,recognizedCustomerKpp,recognizedCustomerTaxId,
		|supplierId,supplierName,supplierShortName,supplierInn,supplierKpp,recognizedSupplierId,supplierTaxId,supplierTaxIdPrimary,supplierTaxIdSecondary,
		|recognizedSupplierId,recognizedSupplierName,recognizedSupplierShortName,recognizedSupplierInn,recognizedSupplierKpp,recognizedSupplierTaxId,
		|supplierAccountBic,supplierAccountNumber,supplierAccountBankName,supplierAccountBankIndex,
		|supplierAccountSettlementType,supplierAccountSettlementName,supplierAccountAddress,supplierAccountCorrespondentAccount,supplierAccountFullAddress,
		|amountWithoutVat,recognizedAmountWithoutVat,vat,recognizedVat,amount,recognizedAmount,parent,children,verified,uploaded,documentCreator,
		|creatorId,creatorEmail,creatorFullName,createdDate,forSendingToEdi,validationNotificationSeverity,validationNotificationTextFull,
		|esfKzRegistrationNumber,esfKzTurnoverDate,esfKzDeliveryDocNum,esfKzDeliveryDocDate,sourceDate,transferBaseId,transferBaseDate,transferBaseName,transferBaseNumber,transferBaseAdditionalInfo,
		|ОснованиеПередачиЗаполнено,АдресХранилищаСканаДокумента,ИмяФайлаСканаДокумента,ПредставлениеДокумента,ПредставлениеДоговора,ПредставлениеТипа,КодТипаДокумента,ПредставлениеИсточника,
		|ТипСоздаваемогоДокумента,ВидОперацииПринудительно,СправочникТоварныхПозиций,Направление,ИдентификаторОбъединения,СодержитДанныеШапкиОбъединенногоДокумента,
		|ПредставлениеСтатуса,ПредставлениеСтатусаЧека,СтавкаНДССсылка,УчитыватьНДС,ПредставлениеПлательщика,ПредставлениеПоставщика,ПлательщикСсылка,ПоставщикСсылка,
		|ПодразделениеСсылка,ПодразделениеОрганизацииСсылка,СкладСсылка,ПодотчетноеЛицоСсылка,БанковскийСчетКонтрагентаСсылка,ПартнерСсылка,ДоговорСсылка,СоглашениеСсылка,ДокументОснованиеСсылка,
		|ИФОСсылка,НоменклатурнаяГруппаСсылка,НаправлениеДеятельностиСсылка,ОбъектРасчетовСсылка,ДоговорНеТребуется,ДокументСсылка,СтруктураДополнительныхДанных,ВидОперацииСсылка,
		|ИмяТабличнойЧасти,ДатаДокумента,ТребуетсяСозданиеНоменклатуры,ИсточникДокумента,ОригиналПолучен,Диадок_Статус,Диадок_url,
		|НазначениеАванса,НазначениеПлатежа,ЗаказСсылка,ДокументыПоступленияДляДопРасходов,СодержаниеУслугиДляДопРасходов,ВедетсяУчетПредметовАренды");
	Если ВернутьСтруктуру Тогда
		Возврат СтруктураКолонок;
	Иначе
		Возврат ИнициализироватьТаблицуПоСтруктуреКолонок(СтруктураКолонок);
	КонецЕсли;
КонецФункции

Функция Инициализировать_Таблица_documentItems(ВернутьСтруктуру = Ложь)
	СтруктураКолонок = Новый Структура("documentId,id,serialNumber,recognizedSerialNumber,recognizedGoodCode,goodCodeIsNull,
		|name,recognizedName,nomenclatureId,nomenclatureName,nomenclatureCode,nomenclatureExternalId,recognizedGoodTypeCode,
		|recognizedUnitCode,recognizedUnit,unitId,unitName,unitCode,unitExternalId,userUnitName,quantity,recognizedQuantity,price,recognizedPrice,
		|amountWithoutVat,recognizedAmountWithoutVat,excise,recognizedExcise,vatRate,recognizedVatRate,vat,recognizedVat,
		|amount,recognizedAmount,recognizedCountryCode,recognizedCountryShortName,recognizedCustomsDeclaration,supplierInn,
		|esfKzAdditional,esfKzAdditionalUnitNomenclature,esfKzCatalogTruId,esfKzproductDeclaration,esfKzproductNumberInDeclaration,esfKzProductNumberInSnt,
		|esfKzExciseRate,esfKzKpvedCode,esfKzTnvedName,esfKzTruOriginCode,esfKzTurnoverAdjustment,esfKzTurnoverCode,esfKzTurnoverSize,esfKzUnitCode,
		|НоменклатураСсылка,ЕдиницаИзмеренияСсылка,СтавкаНДССсылка,ОсновноеСредствоСсылка,ИнвентарныйНомер,СрокСлужбы,ЭтоУслуга,ЭтоАгентскаяУслуга,
		|СчетУчетаСсылка,СчетУчетаНДССсылка,СтатьяЗатратСсылка,НоменклатурнаяГруппаСсылка,ОбъектСсылка,СтатьяРасходовСсылка,АналитикаРасходовСсылка,СтатьяДоходовСсылка,ПодразделениеЗатратСсылка,
		|СкладСсылка,СпособУчетаНДС,НомерГТДСсылка,СтранаПроисхожденияСсылка,СерияНоменклатурыСсылка,ИсточникПроисхожденияСсылка,ПеренестиНаДопРасходы,КомитентСсылка,ДоговорКомитентаСсылка,
		|КоэффициентПересчета,ХарактеристикаСсылка,НоменклатураПоставщикаСсылка,Направление,ИдентификаторОбъединения,СтруктураДополнительныхДанных,
		|КПССсылка,КФОСсылка,КЭКСсылка,НДСВидПоступленияСсылка");
	Если ВернутьСтруктуру Тогда
		Возврат СтруктураКолонок;
	Иначе
		Возврат ИнициализироватьТаблицуПоСтруктуреКолонок(СтруктураКолонок);
	КонецЕсли;
КонецФункции

Функция Инициализировать_Таблица_documentItems_potentialNomenclatures()
	СтруктураКолонок = Новый Структура("documentId,documentItemId,nomenclatureId,nomenclatureName,nomenclatureCode,nomenclatureExternalId,probability,НоменклатураСсылка");
	Возврат ИнициализироватьТаблицуПоСтруктуреКолонок(СтруктураКолонок);
КонецФункции

Функция Инициализировать_Таблица_documentPages()
	СтруктураКолонок = Новый Структура("documentId,number,fileName,rotationAngle,url,АдресВХ");
	Возврат ИнициализироватьТаблицуПоСтруктуреКолонок(СтруктураКолонок);
КонецФункции

Функция ИнициализироватьТаблицуПоСтруктуреКолонок(СтруктураКолонок) Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	
	Для Каждого ЭлементКоллекции Из СтруктураКолонок Цикл	
		Таблица.Колонки.Добавить(ЭлементКоллекции.Ключ);
	КонецЦикла;
	
	Возврат Таблица;

КонецФункции


Функция Инициализировать_ПротоколРаботы() Экспорт
	СтруктураКолонок = Новый Структура("Дата,Событие,Описание,Состояние");
	Возврат ИнициализироватьТаблицуПоСтруктуреКолонок(СтруктураКолонок);
КонецФункции


// ================= Поиск ссылок на объекты базы 1с ===================

Процедура ВыполнитьПоискСсылок_Документы(СтруктураНастроек,ДанныеПортала,ПараметрыПоиска = Неопределено) Экспорт
	
	Если ПараметрыПоиска = Неопределено Тогда
		ПараметрыПоиска = Новый Структура;
	КонецЕсли;
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
			
	//Обходим коллекцию документов
	Для Каждого СтрокаДокумент Из ДанныеПортала.documents Цикл
		
		//Если передали документ для обновления - выполняем поиск только для него
		Если ПараметрыПоиска.Свойство("documentId") И ПараметрыПоиска.documentId <> Неопределено И СтрокаДокумент.id <> ПараметрыПоиска.documentId Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаДокумент.ДокументСсылка) Тогда
			СтрокаДокумент.ДокументСсылка = ПолучитьСсылку_ОбъектПоСвойствуИдентификаторуПортала(СтруктураНастроек,СтрокаДокумент.id);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДокумент.ДокументСсылка) Тогда
			Если СтрокаДокумент.state = "EDI_SEND" Тогда
				//E1C-450: Это не касается исходящих ЭДО-документов				
			Иначе
				СтрокаДокумент.state = "UPLOADED";
				СтрокаДокумент.ПредставлениеСтатуса = "Выгружен";
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьПоискСсылокПоДаннымПортала(СтруктураНастроек,ДанныеПортала,ПараметрыПоиска = Неопределено) Экспорт
		
	Если ПараметрыПоиска = Неопределено Тогда
		ПараметрыПоиска = Новый Структура;
	КонецЕсли;
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
		
	//Получаем таблицу соответствий
	ИспользоватьРучныеСоответствия = Ложь;
	Если СтруктураНастроек.Номенклатура_ЗапоминатьУстановленныеВручнуюСоответствия Тогда
		СвязьНоменклатуры = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СвязьНоменклатуры");
		Если ТипЗнч(СвязьНоменклатуры) = Тип("ТаблицаЗначений")
			И СвязьНоменклатуры.Количество() > 0 Тогда
			ИспользоватьРучныеСоответствия = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Получаем таблицу "маркеров" - подстрок поиска номенклатуры
	ИспользоватьПоискПоМаркерам = Ложь;
	
	СловаМаркеры = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СловаМаркеры");
	Если ТипЗнч(СловаМаркеры) = Тип("ТаблицаЗначений")
		И СловаМаркеры.Количество() > 0 Тогда
		ИспользоватьПоискПоМаркерам = Истина;
	КонецЕсли;
		
	//Обходим коллекцию документов
	Для Каждого СтрокаДокумент Из ДанныеПортала.documents Цикл
		
		//Если передали документ для обновления - выполняем поиск только для него
		Если ПараметрыПоиска.Свойство("documentId") И ПараметрыПоиска.documentId <> Неопределено И СтрокаДокумент.id <> ПараметрыПоиска.documentId Тогда
			Продолжить;
		КонецЕсли;
				
		Если ПараметрыПоиска.Свойство("НаправлениеСоздаваемогоДокумента") Тогда
			Направление = ПараметрыПоиска.НаправлениеСоздаваемогоДокумента;
		Иначе
			//На этом этапе направление еще не было определено
			Направление = ОпределитьНаправлениеСоздаваемогоДокумента(СтрокаДокумент,СтруктураНастроек);
		КонецЕсли;
				
		//2019.10.25 ( модуль кастомизации: можно переопределить установленное стандартным поиском значение
		ПараметрыМК = Новый Структура;
		ПараметрыМК.Вставить("ДокументИД",СтрокаДокумент.id);
		ПараметрыМК.Вставить("ДанныеПортала",ДанныеПортала);
		ПараметрыМК.Вставить("СтрокаДокумент",СтрокаДокумент);
		ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
		ПараметрыМК.Вставить("ПараметрыПоиска",ПараметрыПоиска);
		ПараметрыМК.Вставить("Направление",Направление);
		ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
				
		МодульКастомизации_ОбработатьСобытие("ПоискСсылок_ОпределениеНаправления",ПараметрыМК);
		Направление = ПараметрыМК.Направление;
		СтрокаДокумент.Направление = Направление;
		// ) 2019.10.25
		
		
		Если Направление = "Входящий" Тогда
			СправочникПлательщик = СтруктураНастроек.СведенияОКонфигурации.Организации_ИмяСправочника;
			СправочникПоставщик = "Контрагенты";
		Иначе
			СправочникПлательщик = "Контрагенты";
			СправочникПоставщик = СтруктураНастроек.СведенияОКонфигурации.Организации_ИмяСправочника;
		КонецЕсли;
				
		ПоляПоискаПлательщик = Новый Структура("ИНН,КПП,ИдентификационныйКодЛичности,Наименование,НаименованиеПолное",СтрокаДокумент.customerInn,СтрокаДокумент.customerKpp,СтрокаДокумент.customerTaxId,СтрокаДокумент.customerShortName,СтрокаДокумент.customerName);
		ПоляПоискаПоставщик = Новый Структура("ИНН,КПП,ИдентификационныйКодЛичности,Наименование,НаименованиеПолное",СтрокаДокумент.supplierInn,СтрокаДокумент.supplierKpp,СтрокаДокумент.supplierTaxId,СтрокаДокумент.supplierShortName,СтрокаДокумент.supplierName);
		
		ПлательщикСсылка = ПолучитьСсылку_КонтрагентОрганизацияПоИННКПП(СправочникПлательщик,ПоляПоискаПлательщик,СтруктураНастроек);				
		ПоставщикСсылка = ПолучитьСсылку_КонтрагентОрганизацияПоИННКПП(СправочникПоставщик,ПоляПоискаПоставщик,СтруктураНастроек);
			
		// EN-153: сопоставление по организации плательщика, т.е. если такая организация есть,
		//то в поступлении в поле организация она автоматически проставлялась
		Если Направление = "Входящий" Тогда
			// Задача 4637: с версии 1.39 если значение по умолчанию задано в настройках, то всегда используем его
			Если ЗначениеЗаполнено(СтруктураНастроек.ЗаполнениеШапки_ОрганизацияПоУмолчанию) Тогда
				ПлательщикСсылка = СтруктураНастроек.ЗаполнениеШапки_ОрганизацияПоУмолчанию;
			КонецЕсли;
			
			СтрокаДокумент.УчитыватьНДС = ОпределитьФлаг_УчитыватьНДС(СтруктураНастроек,ПлательщикСсылка,СтрокаДокумент.date);
			
			//Если нашли контрагента и есть номер счета - поищем его банковский счет
			Если ЗначениеЗаполнено(ПоставщикСсылка) И ЗначениеЗаполнено(СтрокаДокумент.supplierAccountNumber) Тогда
				ПоляПоиска = Новый Структура("Владелец,НомерСчета,БИК",ПоставщикСсылка,СтрокаДокумент.supplierAccountNumber,СтрокаДокумент.supplierAccountBic);
				СтрокаДокумент.БанковскийСчетКонтрагентаСсылка = ПолучитьСсылку_БанковскийСчет(ПоляПоиска,СтруктураНастроек);
			КонецЕсли;
			
		Иначе
			// Задача 4637: с версии 1.39 если значение по умолчанию задано в настройках, то всегда используем его
			Если ЗначениеЗаполнено(СтруктураНастроек.ЗаполнениеШапки_ОрганизацияПоУмолчанию) Тогда
				ПоставщикСсылка = СтруктураНастроек.ЗаполнениеШапки_ОрганизацияПоУмолчанию;
			КонецЕсли;
			
			СтрокаДокумент.УчитыватьНДС = ОпределитьФлаг_УчитыватьНДС(СтруктураНастроек,ПоставщикСсылка,СтрокаДокумент.date);
		КонецЕсли;
		// ) EN-153
				
		//2019.10.25 ( модуль кастомизации: можно переопределить установленное стандартным поиском значение
		ПараметрыМК.Вставить("ПлательщикСсылка",ПлательщикСсылка);
		ПараметрыМК.Вставить("ПоставщикСсылка",ПоставщикСсылка);
		ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
				
		МодульКастомизации_ОбработатьСобытие("ПоискСсылок_ОпределениеПлательщикаПоставщика",ПараметрыМК);
		ПлательщикСсылка = ПараметрыМК.ПлательщикСсылка;
		ПоставщикСсылка = ПараметрыМК.ПоставщикСсылка;
		// ) 2019.10.25
		
		СтрокаДокумент.ПлательщикСсылка = ПлательщикСсылка;
		СтрокаДокумент.ПоставщикСсылка = ПоставщикСсылка;
		
		Если Конф = "УТ11" Или Конф = "КА2" Или Конф = "ERP" Тогда
			Если Направление = "Входящий" Тогда
				СтрокаДокумент.ПартнерСсылка = ?(ЗначениеЗаполнено(ПоставщикСсылка),ПоставщикСсылка.Партнер,Справочники.Партнеры.ПустаяСсылка());
			Иначе
				СтрокаДокумент.ПартнерСсылка = ?(ЗначениеЗаполнено(ПлательщикСсылка),ПлательщикСсылка.Партнер,Справочники.Партнеры.ПустаяСсылка());
			КонецЕсли;
		КонецЕсли;
		
		
		//Договор контрагента
		Если ЗначениеЗаполнено(ПоставщикСсылка) И ЗначениеЗаполнено(ПлательщикСсылка) Тогда
			СтрокаДокумент.ДоговорСсылка = ПолучитьСсылку_Договор(СтрокаДокумент,Направление,СтруктураНастроек);		
		КонецЕсли;
		
		//Переопределение модулем кастомизации ссылки на договор перенесено в функцию ПолучитьСсылку_Договор()
		
	КонецЦикла;
	
	//2019.02.20 ( с этим параметром выполняется только поиск ссылок на Организацию/Контрагента и договор
	Если Не ПараметрыПоиска.Свойство("ТолькоРеквизитыШапки") Тогда
	// ) 2019.02.20
	
		//2021.01.20 ( Зафиксированы случаи, когда ключа СловарьСинонимовЕИ на этом этапе еще нет в структуре настроек,
		//поймать такую ситуацию не удалось, но если так получилось - заполним словарь синонимов тут и поместим в Настройки
		Если Не СтруктураНастроек.Свойство("СловарьСинонимовЕИ") Тогда
			СтруктураНастроек.Вставить("СловарьСинонимовЕИ",Классификатор_ИнициализироватьСоответствияСинонимовЕдиницИзмерения());
		КонецЕсли;			
		// ) 2021.01.20
		
		ПерваяСтрокаДокумента = Неопределено;
		КоличествоПозицийДокумента = 0;
		
		//Коллекция товарных позиций документа
		Для Каждого СтрокаНоменклатура Из ДанныеПортала.documentItems Цикл
			
			//Если передали документ для обновления - выполняем поиск только для него
			Если ПараметрыПоиска.Свойство("documentId") И ПараметрыПоиска.documentId <> Неопределено И СтрокаНоменклатура.documentId <> ПараметрыПоиска.documentId Тогда
				Продолжить;
			КонецЕсли;
			
			КоличествоПозицийДокумента = КоличествоПозицийДокумента + 1;
			
			Если ПерваяСтрокаДокумента = Неопределено Тогда
				ПерваяСтрокаДокумента = СтрокаНоменклатура;
			КонецЕсли;
			
			ДанныеДокумента = ДанныеПортала.documents.Найти(СтрокаНоменклатура.documentId,"id");
			
			ПараметрыМК.Вставить("СтрокаНоменклатура",СтрокаНоменклатура);
			
			//Пустые ссылки ЕИ устанавливаются далее при поиске в ПолучитьСсылку_УпаковкаЕдиницаИзмерения
			СтрокаНоменклатура.ЭтоУслуга = Ложь;
			СтрокаНоменклатура.ЭтоАгентскаяУслуга = Ложь;
			СтрокаНоменклатура.НомерГТДСсылка = Неопределено;
			СтрокаНоменклатура.СтранаПроисхожденияСсылка = Неопределено;
			
			СтрокаНоменклатура.СчетУчетаСсылка = Неопределено;
			
			//E1C-407: Теперь у нас может выполняться поиск и для Основных средств
			Если ПараметрыПоиска.Свойство("СправочникТоварныхПозиций")
				И ПараметрыПоиска.СправочникТоварныхПозиций = "ОсновныеСредства" Тогда
				
				СтрокаНоменклатура.ОсновноеСредствоСсылка = Справочники.ОсновныеСредства.ПустаяСсылка();
				
				Если ЗначениеЗаполнено(СтрокаНоменклатура.nomenclatureExternalId) Тогда
					СтрокаНоменклатура.ОсновноеСредствоСсылка = ПолучитьСсылку_ОбъектПоУникальномуИдентификатору(СтрокаНоменклатура.nomenclatureExternalId,"ОсновныеСредства");
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаНоменклатура.ОсновноеСредствоСсылка) Тогда
					СтрокаНоменклатура.ОсновноеСредствоСсылка = ПолучитьСсылку_ОсновноеСредствоПоЗаданномуАлгоритмуПоиска(СтрокаНоменклатура,СтруктураНастроек);
				КонецЕсли;
				
				//модуль кастомизации: можно переопределить установленное стандартным поиском значение
				ПараметрыМК.Вставить("ОсновноеСредствоСсылка",СтрокаНоменклатура.ОсновноеСредствоСсылка);
				ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
						
				МодульКастомизации_ОбработатьСобытие("ПоискСсылок_ОпределениеОсновногоСредства",ПараметрыМК);
				СтрокаНоменклатура.ОсновноеСредствоСсылка = ПараметрыМК.ОсновноеСредствоСсылка;
				
			Иначе
			
				//Очистим ранее найденные позиции, если это повторно выполняемый поиск ссылок
				СтрокаНоменклатура.НоменклатураСсылка = Справочники.Номенклатура.ПустаяСсылка();
								
				//Ищем номенклатуру
				НоменклатураСсылка = Справочники.Номенклатура.ПустаяСсылка();
				ХарактеристикаСсылка = Неопределено;
				
				Если ЗначениеЗаполнено(СтрокаНоменклатура.nomenclatureExternalId) Тогда
					НоменклатураСсылка = ПолучитьСсылку_ОбъектПоУникальномуИдентификатору(СтрокаНоменклатура.nomenclatureExternalId,"Номенклатура");
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(НоменклатураСсылка) Тогда
					//Для поиска номенклатуры поставщика потребуется ссылка на Партнера
					НоменклатураСсылка = ПолучитьСсылку_НоменклатураПоЗаданномуАлгоритмуПоиска(СтрокаНоменклатура,ДанныеДокумента,СтруктураНастроек);
				КонецЕсли;
				
				//2019.02.15 ( Ищем установленную вручную связь, она будет приоритетной над остальными способами поиска, поэтому замещает полученный ранее результат
				Если ИспользоватьРучныеСоответствия Тогда
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("Наименование",СтрокаНоменклатура.name);
					СтруктураПоиска.Вставить("КонтрагентИД",?(ЗначениеЗаполнено(СтрокаНоменклатура.supplierInn),СтрокаНоменклатура.supplierInn,""));
					
					НайденныеСтроки = СвязьНоменклатуры.НайтиСтроки(СтруктураПоиска);
					
					Если НайденныеСтроки.Количество() > 0 И ЗначениеЗаполнено(НайденныеСтроки[0].Ссылка) Тогда
						НоменклатураСсылка = НайденныеСтроки[0].Ссылка;
						
						//2020.01.13 ( добавлена работа с характеристиками
						Если СтруктураНастроек.Свойство("ЗаполнениеТЧ_ИспользоватьХарактеристики")
							И СтруктураНастроек.ЗаполнениеТЧ_ИспользоватьХарактеристики = Истина Тогда
							
							//в сохраненной ранее таблице связей такой колонки может не быть
							Если СвязьНоменклатуры.Колонки.Найти("Характеристика") <> Неопределено Тогда
								ХарактеристикаСсылка = НайденныеСтроки[0].Характеристика;
							КонецЕсли;
						КонецЕсли;
						// ) 2020.01.13
					КонецЕсли;
				КонецЕсли;	
				//2019.02.15
				
				//2019.10.17 ( По настройке поиск по подстроке "маркеру", входящему в наименование
				Если ИспользоватьПоискПоМаркерам Тогда
					СтрокаДляПоиска = Нрег(СтрокаНоменклатура.name);
					Для Каждого СтрокаМаркер Из СловаМаркеры Цикл
						Если СтрокаМаркер.Маркер <> ""
							И ЗначениеЗаполнено(СтрокаМаркер.Номенклатура)
							И СтрокаМаркер.Номенклатура.ЭтоГруппа = Ложь Тогда
							
							//2019.11.20 ( Новая логика: пробел в маркере разбивает маркер на подстроки поиска, поиск по этим подстрокам
							//должен выполняться по вхождению всех подстрок в наименование номенклатуры поставщика
							МассивПодстрок = Энтера_РазложитьСтрокуВМассивПодстрок(Нрег(СтрокаМаркер.Маркер)," ",Истина,Истина);
							ВсеПодстрокиНайдены = Истина;
							Для Каждого Подстрока Из МассивПодстрок Цикл
								Если Найти(СтрокаДляПоиска,Подстрока) = 0 Тогда
									ВсеПодстрокиНайдены = Ложь;
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
							Если ВсеПодстрокиНайдены Тогда
								НоменклатураСсылка = СтрокаМаркер.Номенклатура;
							КонецЕсли;
							// ) 2019.11.20
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				// ) 2019.10.17
				
				//2019.10.25 ( модуль кастомизации: можно переопределить установленное стандартным поиском значение
				ПараметрыМК.Вставить("НоменклатураСсылка",НоменклатураСсылка);
				ПараметрыМК.Вставить("ХарактеристикаСсылка",ХарактеристикаСсылка);
				ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
						
				МодульКастомизации_ОбработатьСобытие("ПоискСсылок_ОпределениеНоменклатуры",ПараметрыМК);
				СтрокаНоменклатура.НоменклатураСсылка = ПараметрыМК.НоменклатураСсылка;
				СтрокаНоменклатура.ХарактеристикаСсылка = ПараметрыМК.ХарактеристикаСсылка;
				// ) 2019.10.25
							
				ЕдиницаИзмеренияСсылка = СтрокаНоменклатура.ЕдиницаИзмеренияСсылка;
				
				Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияСсылка) Тогда
					ЕдиницаИзмеренияСсылка = ПолучитьСсылку_УпаковкаЕдиницаИзмерения(СтрокаНоменклатура,СтруктураНастроек);
				КонецЕсли;
				
				//2019.10.25 ( модуль кастомизации: можно переопределить установленное стандартным поиском значение
				ПараметрыМК.Вставить("ЕдиницаИзмеренияСсылка",ЕдиницаИзмеренияСсылка);
				ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
						
				МодульКастомизации_ОбработатьСобытие("ПоискСсылок_ОпределениеЕдиницыИзмерения",ПараметрыМК);
				СтрокаНоменклатура.ЕдиницаИзмеренияСсылка = ПараметрыМК.ЕдиницаИзмеренияСсылка;
				// ) 2019.10.25
			
			КонецЕсли;
			
			
			Если ЗначениеЗаполнено(СтрокаНоменклатура.СтавкаНДССсылка)
				И СтруктураНастроек.ЗаполнениеТЧ_СворачиватьТЧВОднуСтроку <> "Нет" Тогда
				//Ставка НДС могла быть расчитана на этапе приведения к одной строке номенклатуры
				СтавкаНДССсылка = СтрокаНоменклатура.СтавкаНДССсылка;
			Иначе
				СтавкаНДССсылка = ПолучитьСсылку_СтавкаНДС(СтрокаНоменклатура.vatRate,СтруктураНастроек.СведенияОКонфигурации.СтавкиНДС);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДанныеДокумента.СтавкаНДССсылка) Тогда
				ДанныеДокумента.СтавкаНДССсылка = СтавкаНДССсылка;
			КонецЕсли;
			
			//2019.10.25 ( модуль кастомизации: можно переопределить установленное стандартным поиском значение
			ПараметрыМК.Вставить("СтавкаНДССсылка",СтавкаНДССсылка);
			ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
					
			МодульКастомизации_ОбработатьСобытие("ПоискСсылок_ОпределениеСтавкиНДС",ПараметрыМК);
			СтрокаНоменклатура.СтавкаНДССсылка = ПараметрыМК.СтавкаНДССсылка;
			// ) 2019.10.25
			
			
			// В номере ГТД цифры и знак /, распознанные порталом прочерки и тире пропускаем
			ПрисутствуютДанныеГТД = ЗначениеЗаполнено(СтрокаНоменклатура.recognizedCustomsDeclaration)
				И Найти(СтрокаНоменклатура.recognizedCustomsDeclaration,"-") = 0
				И Найти(СтрокаНоменклатура.recognizedCustomsDeclaration,Символ(8212)) = 0;
				
			Если ПрисутствуютДанныеГТД Тогда
				Если РеквизитСуществует("Справочники","НомераГТД") И ЗначениеЗаполнено(СтрокаНоменклатура.recognizedCustomsDeclaration) Тогда
					НомерГТДСсылка = Справочники.НомераГТД.НайтиПоКоду(СтрокаНоменклатура.recognizedCustomsDeclaration);
				ИначеЕсли РеквизитСуществует("Справочники","ГТД") И ЗначениеЗаполнено(СтрокаНоменклатура.recognizedCustomsDeclaration) Тогда
					НомерГТДСсылка = Справочники.ГТД.НайтиПоНаименованию(СтрокаНоменклатура.recognizedCustomsDeclaration);
				КонецЕсли;
				
				//2019.10.25 ( модуль кастомизации: можно переопределить установленное стандартным поиском значение
				ПараметрыМК.Вставить("НомерГТДСсылка",НомерГТДСсылка);
				ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
						
				МодульКастомизации_ОбработатьСобытие("ПоискСсылок_ОпределениеНомераГТД",ПараметрыМК);
				СтрокаНоменклатура.НомерГТДСсылка = ПараметрыМК.НомерГТДСсылка;
				// ) 2019.10.25
				
				
				СправочникСтраныМира = СтруктураНастроек.СведенияОКонфигурации.СправочникСтраныМира;
				
				Если ЗначениеЗаполнено(СправочникСтраныМира) Тогда
					Если ЗначениеЗаполнено(СтрокаНоменклатура.recognizedCountryCode) Тогда
						СтранаПроисхожденияСсылка = Справочники[СправочникСтраныМира].НайтиПоКоду(СтрокаНоменклатура.recognizedCountryCode,Истина);
					КонецЕсли;
					
					//Если не нашли страну по коду - повторим поиск по наименованию
					Если Не ЗначениеЗаполнено(СтранаПроисхожденияСсылка) И ЗначениеЗаполнено(СтрокаНоменклатура.recognizedCountryShortName) Тогда
						СтранаПроисхожденияСсылка = Справочники[СправочникСтраныМира].НайтиПоНаименованию(СтрокаНоменклатура.recognizedCountryShortName,Истина);
					КонецЕсли;
					
					//2019.10.25 ( модуль кастомизации: можно переопределить установленное стандартным поиском значение
					ПараметрыМК.Вставить("СтранаПроисхожденияСсылка",СтранаПроисхожденияСсылка);
					ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
							
					МодульКастомизации_ОбработатьСобытие("ПоискСсылок_ОпределениеСтраныПроисхождения",ПараметрыМК);
					СтрокаНоменклатура.СтранаПроисхожденияСсылка = ПараметрыМК.СтранаПроисхожденияСсылка;
					// ) 2019.10.25
				КонецЕсли;
				
				Если Конф = "УТ10" Тогда
					ПараметрыПоиска = Новый Структура("Номенклатура,НомерГТД,СтранаПроисхождения",СтрокаНоменклатура.НоменклатураСсылка,СтрокаНоменклатура.НомерГТДСсылка,СтрокаНоменклатура.СтранаПроисхожденияСсылка);
					СтрокаНоменклатура.СерияНоменклатурыСсылка = ПолучитьСсылку_СерияНоменклатуры(СтрокаНоменклатура,СтруктураНастроек,ПараметрыПоиска);					
				КонецЕсли;
				
			КонецЕсли;
			
			//E1C-477: Казахстан: 1С. БП 3.0 для КЗ. Работа с ЭСФ и Источником происхождения
			Если СтруктураНастроек.ЗаполнениеТЧ_ЗаполнятьДанныеИсточникПроисхождения = Истина Тогда
				Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.СправочникИсточникиПроисхождения) Тогда
					//Для каждой строки "Источник происхождения" должен происходить поиск и сопоставление Источника,
					//Поиск происходит по соответствию всех реквизитов: Номер ГТД/сертификата, код ТНВЭД, Номер строки ГТД/Заявления.
					ПараметрыПоиска = Новый Структура("Код,КодТНВЭД,НомерСтрокиГТД",
						СтрокаНоменклатура.esfKzProductDeclaration,СтрокаНоменклатура.esfKzUnitCode,СтрокаНоменклатура.esfKzProductNumberInDeclaration);
					СтрокаНоменклатура.ИсточникПроисхожденияСсылка = ПолучитьСсылку_ИсточникПроисхождения(ПараметрыПоиска);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		//E1C-527: Заполнять ставку НДС в Платежном поручении ставкой НДС из номенклатуры, если в распознанном документе одна позиция
		Если КоличествоПозицийДокумента = 1 И ПерваяСтрокаДокумента <> Неопределено Тогда
			ДанныеДокумента.СтавкаНДССсылка = ПерваяСтрокаДокумента.СтавкаНДССсылка;
		КонецЕсли;
			
		//Вероятные совпадения номенклатуры
		Для Каждого СтрокаВероятнаяНоменклатура Из ДанныеПортала.potentialNomenclatures Цикл
			
			СтрокаВероятнаяНоменклатура.НоменклатураСсылка = Неопределено;
			
			Если ЗначениеЗаполнено(СтрокаВероятнаяНоменклатура.nomenclatureExternalId) Тогда
				СтрокаВероятнаяНоменклатура.НоменклатураСсылка = ПолучитьСсылку_ОбъектПоУникальномуИдентификатору(СтрокаВероятнаяНоменклатура.nomenclatureExternalId,"Номенклатура");
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаВероятнаяНоменклатура.НоменклатураСсылка) Тогда
				//+++ Продолжить поиск номенклатуры по заданным для общей номенклатуры алгоритму?
				СтрокаВероятнаяНоменклатура.НоменклатураСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(СтрокаВероятнаяНоменклатура.nomenclatureName,"Номенклатура");
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//модуль кастомизации: можно переопределить установленные стандартным поиском значение
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("ДанныеПортала",ДанныеПортала);
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыМК.Вставить("ПараметрыПоиска",ПараметрыПоиска);
	ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
			
	МодульКастомизации_ОбработатьСобытие("ПоискСсылок_ПослеОбработкиВсехОбъектов",ПараметрыМК);
							
КонецПроцедуры

Функция ПолучитьСсылку_ОбъектПоУникальномуИдентификатору(GUID,ОбъектМетаданных,РазделМетаданных = "Справочники")
	
	Результат = Неопределено;
			
	Попытка
		УИ = Новый УникальныйИдентификатор(GUID);
	Исключение
		//Некорректный ГУИД
	КонецПопытки;
	
	Если Метаданные[РазделМетаданных].Найти(ОбъектМетаданных) <> Неопределено Тогда
		Если Нрег(РазделМетаданных) = "справочники" Тогда
			
			Если ЗначениеЗаполнено(УИ) Тогда
				Ссылка = Справочники[ОбъектМетаданных].ПолучитьСсылку(УИ);
			КонецЕсли;
			
			Результат = Справочники[ОбъектМетаданных].ПустаяСсылка();
			
		ИначеЕсли Нрег(РазделМетаданных) = "документы" Тогда
			
			Если ЗначениеЗаполнено(УИ) Тогда
				Ссылка = Документы[ОбъектМетаданных].ПолучитьСсылку(УИ);
			КонецЕсли;
			
			Результат = Документы[ОбъектМетаданных].ПустаяСсылка();
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка) И Не ОбъектНеНайден(Ссылка) Тогда
			Результат = Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьСсылку_ОбъектПоРеквизиту(Значение,ТипОбъекта,ИмяРеквизита = "Наименование",РазделМетаданных = "Справочник", ДополнительныйОтбор = Неопределено) Экспорт
	
	//В дополнительном отборе можно передать набор ключей и значений для их указания в параметрах запроса
	Если ДополнительныйОтбор = Неопределено Тогда
		ДополнительныйОтбор = Новый Структура;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Значение) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИскомыйОбъект.Ссылка КАК Ссылка
		               |ИЗ
		               |	РазделМетаданных.ТипОбъекта КАК ИскомыйОбъект
		               |ГДЕ
		               |	НЕ ИскомыйОбъект.ПометкаУдаления
		               |	И ИскомыйОбъект.ИмяРеквизита = &Значение";
		
		//2022.06.29 ( Если тип искомого значения - строка - зададим ограничение поля строки реквизита,
		//чтобы избежать ошибки сравнения поля неограниченной длины
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ИскомыйОбъект.ИмяРеквизита","Выразить (ИскомыйОбъект.ИмяРеквизита КАК Строка(1000))");
		// ) 2022.06.29
		
		//E1C-490: Артикул может быть передан коллекцией элементов
		ИначеЕсли ТипЗнч(Значение) = Тип("Массив") Тогда
		    Запрос.Текст = СтрЗаменить(Запрос.Текст,"ИскомыйОбъект.ИмяРеквизита = &Значение","Выразить (ИскомыйОбъект.ИмяРеквизита КАК Строка(1000)) В (&Значение)");
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РазделМетаданных",РазделМетаданных);
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ТипОбъекта",ТипОбъекта);
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ИмяРеквизита",ИмяРеквизита);
		
		Если РазделМетаданных = "Справочник" И Метаданные.Справочники[ТипОбъекта].Иерархический Тогда
			Запрос.Текст = Запрос.Текст + " И НЕ ИскомыйОбъект.ЭтоГруппа";
		КонецЕсли;
		
		Для Каждого ЭлементСтруктуры Из ДополнительныйОтбор Цикл
			
			//2021.10.05 ( Костыль: нужно "вклинить" возможность поиска ссылки в иерахии,
			//определим это ключем структуры "В_ИЕРАРХИИ" с переданным списком/значением групп иерархии
			Если ЭлементСтруктуры.Ключ = "В_ИЕРАРХИИ" И Не ЭлементСтруктуры.Значение = Неопределено Тогда
				Запрос.Текст = Запрос.Текст + " И ИскомыйОбъект.Ссылка В ИЕРАРХИИ (&Иерархия_Ссылка)";
				Запрос.УстановитьПараметр("Иерархия_Ссылка",ЭлементСтруктуры.Значение);
			Иначе
			// ) 2021.10.05
			
				Запрос.Текст = Запрос.Текст + " И ИскомыйОбъект." + ЭлементСтруктуры.Ключ + " = &" + ЭлементСтруктуры.Ключ;
				Запрос.УстановитьПараметр(ЭлементСтруктуры.Ключ,ЭлементСтруктуры.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Запрос.УстановитьПараметр("Значение",Значение);
		Попытка
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Результат = Выборка.Ссылка;
			КонецЕсли;
		Исключение
			
		КонецПопытки;
	КонецЕсли;
	
	//Определим тип пустого значения
	Если Результат = Неопределено Тогда
		Попытка
			Если РазделМетаданных = "Справочник" Тогда
				Результат = Справочники[ТипОбъекта].ПустаяСсылка();
			КонецЕсли;
		Исключение
			
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбъектНеНайден(Ссылка) Экспорт
	
	//Комментарий для аудитора: проверка значения может быть выполнена для недоступного пользователю объекта, установим привилегированный режим,
	//разрешение на его использование присутствует в списке запрашиваемых разрешений для публикуемого расширения
	УстановитьПривилегированныйРежим(Истина);
	
	Если Ссылка.Пустая() Тогда
		Возврат Ложь;
	Иначе
		Попытка
			Объект = Ссылка.ПолучитьОбъект();
			Возврат Объект = Неопределено;
		Исключение
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
КонецФункции


Функция ПолучитьСсылку_КонтрагентОрганизацияПоИННКПП(ИмяСправочника,ПоляПоиска,СтруктураНастроек) Экспорт
	
	Перем ИНН,КПП,ИдентификационныйКодЛичности;
	
	ПоляПоиска.Свойство("ИНН",ИНН);
	ПоляПоиска.Свойство("КПП",КПП);
	ПоляПоиска.Свойство("ИдентификационныйКодЛичности",ИдентификационныйКодЛичности);
	
	Результат = Справочники[ИмяСправочника].ПустаяСсылка();
	
	//E1C-224: Изменить приоритет подстановки контрагента,
	//добавлен пункт для первоначального поиска по сопоставлению, потом по ИНН
	Если СтруктураНастроек.ЗаполнениеШапки_АлгоритмПоискаКонтрагента = "Наименование,ИНН" Тогда
		Результат = ПолучитьСсылку_КонтрагентОрганизацияПоНаименованию(ИмяСправочника,ПоляПоиска,СтруктураНастроек);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		
		НуженПоискПоНаименованию = СтруктураНастроек.ЗаполнениеШапки_АлгоритмПоискаКонтрагента = "ИНН,Наименование";
		
		Если ЗначениеЗаполнено(ИНН) Тогда
			
			//В странных отраслевых решениях (БИТСтоматология) у Организации нет ИНН
			Если Результат.Метаданные().Реквизиты.Найти("ИНН") <> Неопределено Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				               |	Контрагенты.Ссылка КАК Ссылка
				               |ИЗ
				               |	Справочник.Контрагенты КАК Контрагенты
				               |ГДЕ
				               |	НЕ Контрагенты.ПометкаУдаления
				               |	И Контрагенты.ИНН = &ИНН";
				Запрос.УстановитьПараметр("ИНН", Строка(ИНН));
				
				Если СтруктураНастроек.ЗаполнениеШапки_АлгоритмПоискаКонтрагента = "ИНН+КПП" И ЗначениеЗаполнено(КПП) Тогда
					Запрос.Текст = Запрос.Текст + Символы.ПС
						+ "И Контрагенты.КПП = &КПП";
					Запрос.УстановитьПараметр("КПП",Строка(КПП));
				КонецЕсли;
				
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"Контрагенты",ИмяСправочника);
					
				Выборка = Запрос.Выполнить().Выбрать();
				Выборка.Следующий();
				Результат = Выборка.Ссылка;
				
			КонецЕсли;
			
			//Если не нашли - по настройке продолжаем искать по наименованию
			Если Не ЗначениеЗаполнено(Результат) И НуженПоискПоНаименованию Тогда
				Результат = ПолучитьСсылку_КонтрагентОрганизацияПоНаименованию(ИмяСправочника,ПоляПоиска,СтруктураНастроек);
			КонецЕсли;
		
		ИначеЕсли ЗначениеЗаполнено(ИдентификационныйКодЛичности) Тогда
			
			//У Контрагента и Организации этот реквизит называется по-разному: ИдентификационныйНомер и ИдентификационныйКодЛичности
			Если Результат.Метаданные().Реквизиты.Найти("ИдентификационныйКодЛичности") <> Неопределено Тогда
				ИмяРеквизитаИИНБИН  = "ИдентификационныйКодЛичности";
			ИначеЕсли Результат.Метаданные().Реквизиты.Найти("ИдентификационныйНомер") <> Неопределено Тогда
				ИмяРеквизитаИИНБИН  = "ИдентификационныйНомер";	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ИмяРеквизитаИИНБИН) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				               |	Контрагенты.Ссылка КАК Ссылка
				               |ИЗ
				               |	Справочник.Контрагенты КАК Контрагенты
				               |ГДЕ
				               |	НЕ Контрагенты.ПометкаУдаления
				               |	И Контрагенты.ИдентификационныйКодЛичности = &ИдентификационныйКодЛичности";
				Запрос.УстановитьПараметр("ИдентификационныйКодЛичности", Строка(ИдентификационныйКодЛичности));
				
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"Контрагенты",ИмяСправочника);
				Запрос.Текст = СтрЗаменить(Запрос.Текст,".ИдентификационныйКодЛичности","." + ИмяРеквизитаИИНБИН);
					
				Выборка = Запрос.Выполнить().Выбрать();
				Выборка.Следующий();
				Результат = Выборка.Ссылка;
				
			КонецЕсли;
			
			//Если не нашли - по настройке продолжаем искать по наименованию
			Если Не ЗначениеЗаполнено(Результат) И НуженПоискПоНаименованию Тогда
				Результат = ПолучитьСсылку_КонтрагентОрганизацияПоНаименованию(ИмяСправочника,ПоляПоиска,СтруктураНастроек)
			КонецЕсли;
		
		ИначеЕсли НуженПоискПоНаименованию Тогда
			Результат = ПолучитьСсылку_КонтрагентОрганизацияПоНаименованию(ИмяСправочника,ПоляПоиска,СтруктураНастроек);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьСсылку_КонтрагентОрганизацияПоНаименованию(ИмяСправочника,ПоляПоиска,СтруктураНастроек)
	
	Перем Наименование,НаименованиеПолное;
	
	ПоляПоиска.Свойство("Наименование",Наименование);
	ПоляПоиска.Свойство("НаименованиеПолное",НаименованиеПолное);
	
	Результат = Справочники[ИмяСправочника].ПустаяСсылка();
	
	//Получаем таблицу соответствий
	ИспользоватьРучныеСоответствия = Ложь;
	
	Если ИмяСправочника = "Контрагенты" Тогда
	
		ТаблицаСвязи = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СвязьКонтрагентов");
		Если ТипЗнч(ТаблицаСвязи) = Тип("ТаблицаЗначений")
			И ТаблицаСвязи.Количество() > 0 Тогда
			ИспользоватьРучныеСоответствия = Истина;
		КонецЕсли;
		
	ИначеЕсли ИмяСправочника = "Организации" Тогда
		
		ТаблицаСвязи = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СвязьОрганизаций");
		Если ТипЗнч(ТаблицаСвязи) = Тип("ТаблицаЗначений")
			И ТаблицаСвязи.Количество() > 0 Тогда
			ИспользоватьРучныеСоответствия = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		
		Если ИспользоватьРучныеСоответствия Тогда
			СтрокиТаблицы = ТаблицаСвязи.НайтиСтроки(Новый Структура("Наименование",Наименование));
			Если СтрокиТаблицы.Количество() > 0 Тогда
				НайденноеЗначение = СтрокиТаблицы[0].Ссылка;
				Если ТипЗнч(НайденноеЗначение) = ТипЗнч(Результат) Тогда
					Результат = НайденноеЗначение;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			               |	Контрагенты.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.Контрагенты КАК Контрагенты
			               |ГДЕ
			               |	НЕ Контрагенты.ПометкаУдаления
			               |	И Контрагенты.Наименование = &Наименование";
			Запрос.УстановитьПараметр("Наименование", Наименование);
					
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"Контрагенты",ИмяСправочника);
				
			Выборка = Запрос.Выполнить().Выбрать();
		
			Если Выборка.Следующий() Тогда
				Результат = Выборка.Ссылка;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСсылку_Договор(СтрокаДокумент,Направление,СтруктураНастроек) Экспорт
	
	//Модуль кастомизации: можно переопределить установленное стандартным поиском значение
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("ДокументИД",СтрокаДокумент.id);
	ПараметрыМК.Вставить("СтрокаДокумент",СтрокаДокумент);
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыМК.Вставить("Направление",Направление);
	ПараметрыМК.Вставить("ДоговорСсылка",СтрокаДокумент.ДоговорСсылка);
	ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
			
	МодульКастомизации_ОбработатьСобытие("ПоискСсылок_ОпределениеДоговора",ПараметрыМК);
	
	Если ПараметрыМК.СтандартнаяОбработка <> Истина Тогда
		ДоговорСсылка = ПараметрыМК.ДоговорСсылка;
		
	Иначе
		
		Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
		Лок = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок;
		
		//E1C-484: Сопоставление и создание Договора в 1С по распознанным данным "Основание передачи"
		//Требуется производить поиск похожего Договора в справочнике Договоров между поставщиком и плательщиком по параметрам:
		//1) Искать похожий договор по совпадению "Наименование договора" (если возможно, игнорируя пробелы и символы вида точки, запятой, №).
		//2) Если ничего не найдено, подбирать договор с идентичными реквизитами Дата и номер (игнорировать язык написания символов в номере).
		//3) Если ничего не найдено, то подбирать договор с идентичным реквизитом Дата.
		//4) Если ничего не найдено, то подбирать наиболее похожий договор из базы (как сейчас у нас работает).
		Если СтруктураНастроек.ЗаполнениеШапки_ИспользоватьДанныеОснованияДляДоговора = Истина Тогда
			ДоговорСсылка = ПолучитьСсылку_ДоговорПоРаспознаннымДанным(СтрокаДокумент,Направление,СтруктураНастроек);
			
		Иначе
			
			//Использование общего модуля РаботаВБезопасномРежиме в новых версиях конфигураций больше не поддерживается,
			//используем рекомендуемый ОбщегоНазначения.ВыполнитьВБезопасномРежиме
			Попытка
				МодульРаботыВБезопасномРежиме = _ЗФ_ПолучитьОбщийМодульКонфигурации("ОбщегоНазначения");
			Исключение
				//Не обрабатываем
			КонецПопытки;
			
			//2020.06.29 ( Для старых конфигураций все-таки придется попробовать получить РаботаВБезопасномРежиме на случай,
			//если в ОбщегоНазначения пока еще не перенесены экспортные ВыполнитьВБезопасномРежиме и ВычислитьВБезопасномРежиме
			Если МодульРаботыВБезопасномРежиме <> Неопределено Тогда
				Попытка
					//проверяем наличие экспортной функции ОбщегоНазначения.ВычислитьВБезопасномРежиме()
					МодульРаботыВБезопасномРежиме.ВычислитьВБезопасномРежиме("1 + 1");
				Исключение
					МодульРаботыВБезопасномРежиме = _ЗФ_ПолучитьОбщийМодульКонфигурации("РаботаВБезопасномРежиме");
				КонецПопытки;
			КонецЕсли;
			// ) 2020.06.29
			
			ПараметрыВыполнения = Новый Структура;
			ПараметрыВыполнения.Вставить("ДоговорСсылка");
			
			//БП 3.0
			Если Конф = "БП30" Тогда				
				
				//Заполняем для тех документов, где есть реквизит Договор
				Если ЗначениеЗаполнено(СтрокаДокумент.ТипСоздаваемогоДокумента) Тогда
					Если Метаданные.Документы[СтрокаДокумент.ТипСоздаваемогоДокумента].Реквизиты.Найти("ДоговорКонтрагента") <> Неопределено Тогда
						
						СтрокаДокумент.ДоговорНеТребуется = Ложь;
						
						Если МодульРаботыВБезопасномРежиме <> Неопределено Тогда
							
							МассивВидовДоговоров = Новый Массив;
							
							//E1C-327: Для документа ОтчетКомиссионераОПродажах ищем в договорах с видом СКомиссионером
							Если СтрокаДокумент.ТипСоздаваемогоДокумента = "ОтчетКомиссионераОПродажах" Тогда
								МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером"));
												
								ПараметрыВыполнения.Вставить("КонтрагентСсылка",СтрокаДокумент.ПоставщикСсылка);
								ПараметрыВыполнения.Вставить("ОрганизацияСсылка",СтрокаДокумент.ПлательщикСсылка);
								
							Иначе
							// ) E1C-327
							
								Если Направление = "Входящий" Тогда
									МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
													
									ПараметрыВыполнения.Вставить("КонтрагентСсылка",СтрокаДокумент.ПоставщикСсылка);
									ПараметрыВыполнения.Вставить("ОрганизацияСсылка",СтрокаДокумент.ПлательщикСсылка);
									
								Иначе
									МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
													
									ПараметрыВыполнения.Вставить("КонтрагентСсылка",СтрокаДокумент.ПлательщикСсылка);
									ПараметрыВыполнения.Вставить("ОрганизацияСсылка",СтрокаДокумент.ПоставщикСсылка);
									
								КонецЕсли;
								
							КонецЕсли;
							
							ПараметрыВыполнения.Вставить("МассивВидовДоговоров",МассивВидовДоговоров);
						
							Попытка
								Если Метаданные.ОбщиеМодули.Найти("РаботаСДоговорамиКонтрагентовБП") <> Неопределено Тогда
									МодульРаботыВБезопасномРежиме.ВыполнитьВБезопасномРежиме("РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(Параметры.ДоговорСсылка,Параметры.КонтрагентСсылка,Параметры.ОрганизацияСсылка,Параметры.МассивВидовДоговоров)",ПараметрыВыполнения);
								ИначеЕсли Метаданные.ОбщиеМодули.Найти("БухгалтерскийУчетПереопределяемый") <> Неопределено Тогда
									МодульРаботыВБезопасномРежиме.ВыполнитьВБезопасномРежиме("БухгалтерскийУчетПереопределяемый.УстановитьДоговорКонтрагента(Параметры.ДоговорСсылка,Параметры.КонтрагентСсылка,Параметры.ОрганизацияСсылка,Параметры.МассивВидовДоговоров);",ПараметрыВыполнения);
								ИначеЕсли Метаданные.ОбщиеМодули.Найти("РаботаСДоговорамиКонтрагентов") <> Неопределено Тогда
									МодульРаботыВБезопасномРежиме.ВыполнитьВБезопасномРежиме("РаботаСДоговорамиКонтрагентов.УстановитьДоговорКонтрагента(Параметры.ДоговорСсылка,Параметры.КонтрагентСсылка,Параметры.ОрганизацияСсылка,Параметры.МассивВидовДоговоров)",ПараметрыВыполнения);
								КонецЕсли;
							Исключение
								
							КонецПопытки;
							
							//+++ Выполнить поиск подходящего запросом, если договоров вдруг больше одного?
							
						КонецЕсли;
					Иначе
						// Договор не нужно создавать, если этот тип документа не требует наличия договора
						СтрокаДокумент.ДоговорНеТребуется = Истина;
					КонецЕсли;
				КонецЕсли;
				
			//УТ 11
			ИначеЕсли Конф = "УТ11" Или Конф = "КА2" Или Конф = "ERP" Тогда
				
				Если МодульРаботыВБезопасномРежиме <> Неопределено Тогда
					
					СтруктураПоискаДоговора = Новый Структура;
					СтруктураПоискаДоговора.Вставить("Партнер",СтрокаДокумент.ПартнерСсылка);
					СтруктураПоискаДоговора.Вставить("Договор");
					
					Если Направление = "Входящий" Тогда
						СтруктураПоискаДоговора.Вставить("Контрагент",СтрокаДокумент.ПоставщикСсылка);
						СтруктураПоискаДоговора.Вставить("Организация",СтрокаДокумент.ПлательщикСсылка);
						
						ПараметрыВыполнения.Вставить("ДокументСсылка",СтруктураПоискаДоговора);
						
						Если СтрокаДокумент.ТипСоздаваемогоДокумента = "ПоступлениеУслугПоАренде" Тогда
							Справочники.ДоговорыАренды.ДоговорПоУмолчанию(СтруктураПоискаДоговора.Организация,
								СтруктураПоискаДоговора.Партнер,СтруктураПоискаДоговора.Контрагент,ПараметрыВыполнения.ДоговорСсылка);
								
							//Дальнейший поиск Договора не имеет смысла, так как для этого типа документа используется другой справочник
							Возврат ПараметрыВыполнения.ДоговорСсылка;
							
						Иначе
							//E1C-337: ( Для документа ОтчетКомиссионераОПродажах ищем в договорах с хозяйственной операцией 
							Если СтрокаДокумент.ТипСоздаваемогоДокумента = "ОтчетКомиссионера" Тогда
								ПараметрыВыполнения.Вставить("ХозяйственнаяОперация",ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию"));
							Иначе
							// ) E1C-337
								ПараметрыВыполнения.Вставить("ХозяйственнаяОперация",ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика"));
							КонецЕсли;
							
							Попытка
								МодульРаботыВБезопасномРежиме.ВыполнитьВБезопасномРежиме("Параметры.ДоговорСсылка = ЗакупкиСервер.ПолучитьДоговорПоУмолчанию(Параметры.ДокументСсылка,Параметры.ХозяйственнаяОперация)",ПараметрыВыполнения);
							Исключение
								// если при выполнении будет вызвано исключение продолжим работу
							КонецПопытки;
						КонецЕсли;
						
					Иначе
						СтруктураПоискаДоговора.Вставить("Контрагент",СтрокаДокумент.ПлательщикСсылка);
						СтруктураПоискаДоговора.Вставить("Организация",СтрокаДокумент.ПоставщикСсылка);
						
						ПараметрыВыполнения.Вставить("ДокументСсылка",СтруктураПоискаДоговора);
						ПараметрыВыполнения.Вставить("ХозяйственнаяОперация",ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияКлиенту"));
						
						Попытка
							МодульРаботыВБезопасномРежиме.ВыполнитьВБезопасномРежиме("Параметры.ДоговорСсылка = ПродажиСервер.ПолучитьДоговорПоУмолчанию(Параметры.ДокументСсылка,Параметры.ХозяйственнаяОперация)",ПараметрыВыполнения);
						Исключение
							// если при выполнении будет вызвано исключение продолжим работу
						КонецПопытки;
						
					КонецЕсли;
					
					//Если не нашли штатным образом, то либо договора не существует, либо их больше одного.
					//Чтобы не создавать дубль найдем запросом первый подходящий
					Если Не ЗначениеЗаполнено(ПараметрыВыполнения.ДоговорСсылка) Тогда
						
						Запрос = Новый Запрос;
						Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
						               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
						               |ИЗ
						               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
						               |ГДЕ
						               |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
						               |	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
						               |	И ДоговорыКонтрагентов.Партнер = &Партнер
						               |	И ДоговорыКонтрагентов.Контрагент = &Контрагент
						               |	И ДоговорыКонтрагентов.Организация = &Организация
						               |	И ДоговорыКонтрагентов.ХозяйственнаяОперация = &ХозяйственнаяОперация";
						
						Запрос.УстановитьПараметр("Партнер",СтруктураПоискаДоговора.Партнер);
						Запрос.УстановитьПараметр("Контрагент",СтруктураПоискаДоговора.Контрагент);
						Запрос.УстановитьПараметр("Организация",СтруктураПоискаДоговора.Организация);
						Запрос.УстановитьПараметр("ХозяйственнаяОперация",ПараметрыВыполнения.ХозяйственнаяОперация);
						
						Выборка = Запрос.Выполнить().Выбрать();
						Если Выборка.Следующий() Тогда
							ПараметрыВыполнения.ДоговорСсылка = Выборка.Ссылка;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			//УНФ
			ИначеЕсли Конф = "УНФ" Тогда
				
				Если Направление = "Входящий" Тогда
					КонтрагентСсылка = СтрокаДокумент.ПоставщикСсылка;
					ОрганизацияСсылка = СтрокаДокумент.ПлательщикСсылка;
					ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
				Иначе
					КонтрагентСсылка = СтрокаДокумент.ПлательщикСсылка;
					ОрганизацияСсылка = СтрокаДокумент.ПоставщикСсылка;
					ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю;
				КонецЕсли;
				
				Если КонтрагентСсылка.ВестиРасчетыПоДоговорам = Истина Тогда
					СписокВидовДоговоров = Справочники.ДоговорыКонтрагентов.ПолучитьСписокВидовДоговораДляДокумента(СтрокаДокумент.ДокументСсылка,ВидОперации);
					ПараметрыВыполнения.ДоговорСсылка = Справочники.ДоговорыКонтрагентов.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(КонтрагентСсылка,ОрганизацияСсылка,СписокВидовДоговоров);
					
				Иначе
					ПараметрыВыполнения.ДоговорСсылка = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(КонтрагентСсылка);
					
				КонецЕсли;				
				
			//БП 2.0
			ИначеЕсли Конф = "БП20" Тогда
				
				Если Лок = "BLR" Тогда
					ПараметрыВыполнения.ДоговорСсылка = Справочники.Договора.ПустаяСсылка();
				Иначе
					ПараметрыВыполнения.ДоговорСсылка = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
				КонецЕсли;
				
				МассивВидовДоговоров = Новый Массив;
				
				Если Направление = "Входящий" Тогда
					
					//E1C-327: Для документа ОтчетКомиссионераОПродажах ищем в договорах с видом СКомиссионером
					Если СтрокаДокумент.ТипСоздаваемогоДокумента = "ОтчетКомиссионераОПродажах" Тогда
						МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером"));				
					Иначе
					// ) E1C-327
					
						Если Лок = "BLR" Тогда
							МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговора.Покупки"));
						Иначе
							МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
						КонецЕсли;
					КонецЕсли;
					
					ПараметрыВыполнения.Вставить("КонтрагентСсылка",СтрокаДокумент.ПоставщикСсылка);
					ПараметрыВыполнения.Вставить("ОрганизацияСсылка",СтрокаДокумент.ПлательщикСсылка);
					
				Иначе
					Если Лок = "BLR" Тогда
						МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговора.Продажи"));
					Иначе
						МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
					КонецЕсли;
									
					ПараметрыВыполнения.Вставить("КонтрагентСсылка",СтрокаДокумент.ПлательщикСсылка);
					ПараметрыВыполнения.Вставить("ОрганизацияСсылка",СтрокаДокумент.ПоставщикСсылка);
					
				КонецЕсли;
				
				ПараметрыВыполнения.Вставить("СписокВидовДоговоров",МассивВидовДоговоров);
				
				Если Лок = "BLR" Тогда
					Если ЗначениеЗаполнено(ПараметрыВыполнения.КонтрагентСсылка) Тогда
						ПараметрыВыполнения.ДоговорСсылка = ПараметрыВыполнения.КонтрагентСсылка.ОсновнойДоговор;
					КонецЕсли;
				Иначе
					ЭтотОбъект._УФ_ВыполнитьВНебезопасномРежиме("УправлениеВзаиморасчетами.УстановитьДоговорКонтрагента(Параметры.ДоговорСсылка,Параметры.КонтрагентСсылка,Параметры.ОрганизацияСсылка,Параметры.СписокВидовДоговоров)",ПараметрыВыполнения);
				КонецЕсли;
				
			//УТ 10
			ИначеЕсли Конф = "УТ10" Или Конф = "КА1" Или Конф = "УПП" Тогда
			
				Если СтрокаДокумент.ТипСоздаваемогоДокумента = "РасходныйОрдерНаТовары" Тогда
					// Договор не нужно создавать, если этот тип документа не требует наличия договора
					СтрокаДокумент.ДоговорНеТребуется = Истина;
					
				Иначе
				
					МассивВидовДоговоров = Новый Массив;
					
					Если Направление = "Входящий" Тогда
						
						//E1C-327: Для документа ОтчетКомиссионераОПродажах ищем в договорах с видом СКомиссионером
						Если СтрокаДокумент.ТипСоздаваемогоДокумента = "ОтчетКомиссионераОПродажах" Тогда
							МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером"));				
						Иначе
						// ) E1C-327
						
							МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
						КонецЕсли;
						
						ПараметрыВыполнения.Вставить("КонтрагентСсылка",СтрокаДокумент.ПоставщикСсылка);
						ПараметрыВыполнения.Вставить("ОрганизацияСсылка",СтрокаДокумент.ПлательщикСсылка);
						
					Иначе
						МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
						
						ПараметрыВыполнения.Вставить("КонтрагентСсылка",СтрокаДокумент.ПлательщикСсылка);
						ПараметрыВыполнения.Вставить("ОрганизацияСсылка",СтрокаДокумент.ПоставщикСсылка);
						
					КонецЕсли;
					
					СтруктураПараметровДляПолученияДоговора = Новый Структура("СписокДопустимыхВидовДоговоров",МассивВидовДоговоров);
					
					
					ПараметрыВыполнения.Вставить("СтруктураПараметровДляПолученияДоговора",СтруктураПараметровДляПолученияДоговора);
					
					ЭтотОбъект._УФ_ВыполнитьВНебезопасномРежиме("ПараметрыВыполнения.ДоговорСсылка = ЗаполнениеДокументов.ПолучитьДоговорПоОрганизацииИКонтрагенту(Параметры.ОрганизацияСсылка,Параметры.КонтрагентСсылка,Параметры.СтруктураПараметровДляПолученияДоговора);",ПараметрыВыполнения);
					
					//Если не нашли штатным образом, то либо договора не существует, либо их больше одного.
					//Чтобы не создавать дубль найдем запросом первый подходящий
					Если Не ЗначениеЗаполнено(ПараметрыВыполнения.ДоговорСсылка) Тогда
						
						Запрос = Новый Запрос;
						Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
						               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
						               |ИЗ
						               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
						               |ГДЕ
						               |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
						               |	И ДоговорыКонтрагентов.Владелец = &Контрагент
						               |	И ДоговорыКонтрагентов.Организация = &Организация
									   |	И ДоговорыКонтрагентов.ВидДоговора В (&МассивВидовДоговоров)";
						
						Если ЗначениеЗаполнено(МассивВидовДоговоров) Тогда
							Запрос.УстановитьПараметр("МассивВидовДоговоров",МассивВидовДоговоров);
						Иначе
							Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ДоговорыКонтрагентов.ВидДоговора В (&МассивВидовДоговоров)","");
						КонецЕсли;
						
						Запрос.УстановитьПараметр("Контрагент",ПараметрыВыполнения.КонтрагентСсылка);
						Запрос.УстановитьПараметр("Организация",ПараметрыВыполнения.ОрганизацияСсылка);
						
						Выборка = Запрос.Выполнить().Выбрать();
						Если Выборка.Следующий() Тогда
							ПараметрыВыполнения.ДоговорСсылка = Выборка.Ссылка;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли Конф = "Автосалон" Или Конф = "КомбинатПитания" Или Конф = "УправлениеРестораном" Тогда
				
				МассивВидовДоговоров = Новый Массив;
				
				Если Направление = "Входящий" Тогда
					МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Покупка"));
					
					ПараметрыВыполнения.Вставить("КонтрагентСсылка",СтрокаДокумент.ПоставщикСсылка);
					ПараметрыВыполнения.Вставить("ОрганизацияСсылка",СтрокаДокумент.ПлательщикСсылка);
					
				Иначе
					МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Продажа"));
					
					ПараметрыВыполнения.Вставить("КонтрагентСсылка",СтрокаДокумент.ПлательщикСсылка);
					ПараметрыВыполнения.Вставить("ОрганизацияСсылка",СтрокаДокумент.ПоставщикСсылка);
					
				КонецЕсли;
				
				СтруктураПараметровДляПолученияДоговора = Новый Структура("СписокДопустимыхВидовДоговоров",МассивВидовДоговоров);
				
				
				ПараметрыВыполнения.Вставить("СтруктураПараметровДляПолученияДоговора",СтруктураПараметровДляПолученияДоговора);
				
				ЭтотОбъект._УФ_ВыполнитьВНебезопасномРежиме("Параметры.ДоговорСсылка = ЗаполнениеДокументов.ПолучитьДоговорПоОрганизацииИКонтрагенту(Параметры.ОрганизацияСсылка,Параметры.КонтрагентСсылка,Параметры.СтруктураПараметровДляПолученияДоговора);",ПараметрыВыполнения);
				
				//Если не нашли штатным образом, то либо договора не существует, либо их больше одного.
				//Чтобы не создавать дубль найдем запросом первый подходящий
				Если Не ЗначениеЗаполнено(ПараметрыВыполнения.ДоговорСсылка) Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
					               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
					               |ИЗ
					               |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыКонтрагентов
					               |ГДЕ
					               |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
					               |	И ДоговорыКонтрагентов.Владелец = &Контрагент
					               |	И ДоговорыКонтрагентов.Организация = &Организация";
					
					Запрос.УстановитьПараметр("Контрагент",ПараметрыВыполнения.КонтрагентСсылка);
					Запрос.УстановитьПараметр("Организация",ПараметрыВыполнения.ОрганизацияСсылка);
					
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						ПараметрыВыполнения.ДоговорСсылка = Выборка.Ссылка;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				//что-то совсем нетиповое
				
				Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Имя = "МояБухгалтерия" Тогда
					
					Если Направление = "Входящий" Тогда
						ПараметрыВыполнения.Вставить("КонтрагентСсылка",СтрокаДокумент.ПоставщикСсылка);
						ПараметрыВыполнения.Вставить("ОрганизацияСсылка",СтрокаДокумент.ПлательщикСсылка);
						
					Иначе
						ПараметрыВыполнения.Вставить("КонтрагентСсылка",СтрокаДокумент.ПлательщикСсылка);
						ПараметрыВыполнения.Вставить("ОрганизацияСсылка",СтрокаДокумент.ПоставщикСсылка);
						
					КонецЕсли;
						
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
					               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
					               |ИЗ
					               |	Справочник.Договора КАК ДоговорыКонтрагентов
					               |ГДЕ
					               |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
					               |	И ДоговорыКонтрагентов.Владелец = &Контрагент
					               |	И ДоговорыКонтрагентов.Организация = &Организация";
					
					Запрос.УстановитьПараметр("Контрагент",ПараметрыВыполнения.КонтрагентСсылка);
					Запрос.УстановитьПараметр("Организация",ПараметрыВыполнения.ОрганизацияСсылка);
					
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						ПараметрыВыполнения.ДоговорСсылка = Выборка.Ссылка;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			ДоговорСсылка = ПараметрыВыполнения.ДоговорСсылка;
			
		КонецЕсли; //Исходный вариант поиска
		
	КонецЕсли; //Стандартный поиск без кастомизации
	
	Возврат ДоговорСсылка;
	
КонецФункции

Функция ПолучитьСсылку_ДоговорПоРаспознаннымДанным(СтрокаДокумент,Направление,СтруктураНастроек)
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	Лок = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок;
	
	//E1C-484: Сопоставление и создание Договора в 1С по распознанным данным "Основание передачи"
	//Требуется производить поиск похожего Договора в справочнике Договоров между поставщиком и плательщиком по параметрам:
	//1) Искать похожий договор по совпадению "Наименование договора" (если возможно, игнорируя пробелы и символы вида точки, запятой, №).
	//2) Если ничего не найдено, подбирать договор с идентичными реквизитами Дата и номер (игнорировать язык написания символов в номере).
	//3) Если ничего не найдено, то подбирать договор с идентичным реквизитом Дата.
	
	//Поскольку запрашиваемые варианты поиска не зависят явным образом от используемой конфигурации, а оперируют сравнением с распознанными данными,
	//рассматриваем такой порядок работы: получаем определяемую структурой конфигурации коллекцию договоров между Организацией и Контрагентом
	//и выполняем общий обработчик этой выборки для поиска подходящего договора по заданным условиям
	
	//По новым вводным из задачи 305690: дополнительно ищем основной договор: "помеченный в 1С флагом "использовать как основной" в договорах с КА"
	
	//БП30
	Если Конф = "БП30" Тогда
	
		МассивВидовДоговоров = Новый Массив;
								
		//Для документа ОтчетКомиссионераОПродажах ищем в договорах с видом СКомиссионером
		Если СтрокаДокумент.ТипСоздаваемогоДокумента = "ОтчетКомиссионераОПродажах" Тогда
			МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером"));
							
			КонтрагентСсылка = СтрокаДокумент.ПоставщикСсылка;
			ОрганизацияСсылка = СтрокаДокумент.ПлательщикСсылка;
			
		Иначе
		
			Если Направление = "Входящий" Тогда
				МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
								
				КонтрагентСсылка = СтрокаДокумент.ПоставщикСсылка;
				ОрганизацияСсылка = СтрокаДокумент.ПлательщикСсылка;
				
			Иначе
				МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
								
				КонтрагентСсылка = СтрокаДокумент.ПлательщикСсылка;
				ОрганизацияСсылка = СтрокаДокумент.ПоставщикСсылка;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//По новым вводным дополнительно ищем основной договор
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
		               |	ДоговорыКонтрагентов.Наименование КАК Наименование,
		               |	ДоговорыКонтрагентов.Номер КАК Номер,
		               |	НАЧАЛОПЕРИОДА(ДоговорыКонтрагентов.Дата, ДЕНЬ) КАК Дата
		               |ИЗ
		               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		               |ГДЕ
		               |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
		               |	И ДоговорыКонтрагентов.Организация = &Организация
		               |	И ДоговорыКонтрагентов.Владелец = &Владелец
		               |	И ДоговорыКонтрагентов.ВидДоговора В(&ВидДоговора)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ОсновныеДоговорыКонтрагента.Договор КАК Договор
		               |ИЗ
		               |	РегистрСведений.ОсновныеДоговорыКонтрагента КАК ОсновныеДоговорыКонтрагента
		               |ГДЕ
		               |	ОсновныеДоговорыКонтрагента.Организация = &Организация
		               |	И ОсновныеДоговорыКонтрагента.Контрагент = &Владелец
		               |	И ОсновныеДоговорыКонтрагента.ВидДоговора В(&ВидДоговора)";
		Запрос.УстановитьПараметр("Организация",ОрганизацияСсылка);
		Запрос.УстановитьПараметр("Владелец",КонтрагентСсылка);
		Запрос.УстановитьПараметр("ВидДоговора",МассивВидовДоговоров);
		
		//В KAZ-версии Бухгалтерии имя реквизита Номер и Дата у договора НомерДоговора и ДатаДоговора
		Если Лок = "KAZ" Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ДоговорыКонтрагентов.Номер","ДоговорыКонтрагентов.НомерДоговора");
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ДоговорыКонтрагентов.Дата","ДоговорыКонтрагентов.ДатаДоговора");
		КонецЕсли;
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		Выборка = РезультатЗапроса[0].Выбрать();
		ВыборкаОсновнойДоговор = РезультатЗапроса[1].Выбрать();
		
		Если ВыборкаОсновнойДоговор.Следующий() Тогда
			ОсновнойДоговорСсылка = ВыборкаОсновнойДоговор.Договор;
		КонецЕсли;		
		
	//УТ 11
	ИначеЕсли Конф = "УТ11" Или Конф = "КА2" Или Конф = "ERP" Тогда
		
		ПартнерСсылка = СтрокаДокумент.ПартнерСсылка;
							
		Если Направление = "Входящий" Тогда
			КонтрагентСсылка = СтрокаДокумент.ПоставщикСсылка;
			ОрганизацияСсылка = СтрокаДокумент.ПлательщикСсылка;
						
			//Для документа ОтчетКомиссионераОПродажах ищем в договорах с хозяйственной операцией 
			Если СтрокаДокумент.ТипСоздаваемогоДокумента = "ОтчетКомиссионера" Тогда
				ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию");
			Иначе
				ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика");
			КонецЕсли;
				
		Иначе
			КонтрагентСсылка = СтрокаДокумент.ПлательщикСсылка;
			ОрганизацияСсылка = СтрокаДокумент.ПоставщикСсылка;
						
			ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияКлиенту");
						
		КонецЕсли;
					
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
					   |	ДоговорыКонтрагентов.Наименование КАК Наименование,
		               |	ДоговорыКонтрагентов.Номер КАК Номер,
		               |	НАЧАЛОПЕРИОДА(ДоговорыКонтрагентов.Дата, ДЕНЬ) КАК Дата
		               |ИЗ
		               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		               |ГДЕ
		               |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
		               |	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
		               |	И ДоговорыКонтрагентов.Партнер = &Партнер
		               |	И ДоговорыКонтрагентов.Контрагент = &Контрагент
		               |	И ДоговорыКонтрагентов.Организация = &Организация
		               |	И ДоговорыКонтрагентов.ХозяйственнаяОперация = &ХозяйственнаяОперация";
		
		Запрос.УстановитьПараметр("Партнер",ПартнерСсылка);
		Запрос.УстановитьПараметр("Контрагент",КонтрагентСсылка);
		Запрос.УстановитьПараметр("Организация",ОрганизацияСсылка);
		Запрос.УстановитьПараметр("ХозяйственнаяОперация",ХозяйственнаяОперация);
		
		Выборка = Запрос.Выполнить().Выбрать();						
		
		//По новым вводным дополнительно ищем основной договор. В УТ11 нет регистра ОсновныеДоговорыКонтрагентов,
		//просто получим первый из выбранных того же запроса, если договор не будет определен по требуемому алгоритму
		ВыборкаОсновнойДоговор = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаОсновнойДоговор.Следующий() Тогда
			ОсновнойДоговорСсылка = ВыборкаОсновнойДоговор.Ссылка;
		КонецЕсли;		
		
	//УНФ
	ИначеЕсли Конф = "УНФ" Тогда
		
		Если Направление = "Входящий" Тогда
			КонтрагентСсылка = СтрокаДокумент.ПоставщикСсылка;
			ОрганизацияСсылка = СтрокаДокумент.ПлательщикСсылка;
			ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
		Иначе
			КонтрагентСсылка = СтрокаДокумент.ПлательщикСсылка;
			ОрганизацияСсылка = СтрокаДокумент.ПоставщикСсылка;
			ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю;
		КонецЕсли;
		
		Если КонтрагентСсылка.ВестиРасчетыПоДоговорам = Истина Тогда
			СписокВидовДоговоров = Справочники.ДоговорыКонтрагентов.ПолучитьСписокВидовДоговораДляДокумента(СтрокаДокумент.ДокументСсылка,ВидОперации);
			ДоговорСсылка = Справочники.ДоговорыКонтрагентов.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(КонтрагентСсылка,ОрганизацияСсылка,СписокВидовДоговоров);
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
			               |	ДоговорыКонтрагентов.Наименование КАК Наименование,
			               |	ДоговорыКонтрагентов.НомерДоговора КАК Номер,
			               |	НАЧАЛОПЕРИОДА(ДоговорыКонтрагентов.ДатаДоговора, ДЕНЬ) КАК Дата
			               |ИЗ
			               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			               |ГДЕ
			               |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
			               |	И ДоговорыКонтрагентов.Организация = &Организация
			               |	И ДоговорыКонтрагентов.Владелец = &Владелец
			               |	И ДоговорыКонтрагентов.ВидДоговора В(&ВидДоговора)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ОсновныеДоговорыКонтрагента.Договор КАК Договор
			               |ИЗ
			               |	РегистрСведений.ОсновныеДоговорыКонтрагента КАК ОсновныеДоговорыКонтрагента
			               |ГДЕ
			               |	ОсновныеДоговорыКонтрагента.Организация = &Организация
			               |	И ОсновныеДоговорыКонтрагента.Контрагент = &Владелец
			               |	И ОсновныеДоговорыКонтрагента.ВидДоговора В(&ВидДоговора)";
			Запрос.УстановитьПараметр("Организация",ОрганизацияСсылка);
			Запрос.УстановитьПараметр("Владелец",КонтрагентСсылка);
			Запрос.УстановитьПараметр("ВидДоговора",СписокВидовДоговоров);
			
			РезультатЗапроса = Запрос.ВыполнитьПакет();
			Выборка = РезультатЗапроса[0].Выбрать();
			ВыборкаОсновнойДоговор = РезультатЗапроса[1].Выбрать();
			
			Если ВыборкаОсновнойДоговор.Следующий() Тогда
				ОсновнойДоговорСсылка = ВыборкаОсновнойДоговор.Договор;
			КонецЕсли;
			
		Иначе
			ДоговорСсылка = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(КонтрагентСсылка);
			
		КонецЕсли;
		
		//БП 2.0
	ИначеЕсли Конф = "БП20" Тогда
		
		МассивВидовДоговоров = Новый Массив;
		
		Если Направление = "Входящий" Тогда
			
			//Для документа ОтчетКомиссионераОПродажах ищем в договорах с видом СКомиссионером
			Если СтрокаДокумент.ТипСоздаваемогоДокумента = "ОтчетКомиссионераОПродажах" Тогда
				МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером"));				
			Иначе
				Если Лок = "BLR" Тогда
					МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговора.Покупки"));
				Иначе
					МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
				КонецЕсли;
			КонецЕсли;
			
			КонтрагентСсылка = СтрокаДокумент.ПоставщикСсылка;
			ОрганизацияСсылка = СтрокаДокумент.ПлательщикСсылка;
			
		Иначе
			Если Лок = "BLR" Тогда
				МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговора.Продажи"));
			Иначе
				МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
			КонецЕсли;
							
			КонтрагентСсылка = СтрокаДокумент.ПлательщикСсылка;
			ОрганизацияСсылка = СтрокаДокумент.ПоставщикСсылка;
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация",ОрганизацияСсылка);
		Запрос.УстановитьПараметр("Владелец",КонтрагентСсылка);
		Запрос.УстановитьПараметр("ВидДоговора",МассивВидовДоговоров);
		
		Если Лок = "BLR" Тогда
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
			               |	ДоговорыКонтрагентов.Наименование КАК Наименование,
			               |	ДоговорыКонтрагентов.НомерДоговора КАК Номер,
			               |	НАЧАЛОПЕРИОДА(ДоговорыКонтрагентов.ДатаДоговора, ДЕНЬ) КАК Дата
			               |ИЗ
			               |	Справочник.Договора КАК ДоговорыКонтрагентов
			               |ГДЕ
			               |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
			               |	И ДоговорыКонтрагентов.Организация = &Организация
			               |	И ДоговорыКонтрагентов.Владелец = &Владелец
			               |	И ДоговорыКонтрагентов.ВидДоговора В(&ВидДоговора)";
			
			//По новым вводным дополнительно ищем основной договор
			Если ЗначениеЗаполнено(КонтрагентСсылка.ОсновнойДоговор)
				И КонтрагентСсылка.ОсновнойДоговор.Организация = ОрганизацияСсылка Тогда
				ОсновнойДоговорСсылка = КонтрагентСсылка.ОсновнойДоговор;
			КонецЕсли;
			
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
			               |	ДоговорыКонтрагентов.Наименование КАК Наименование,
			               |	ДоговорыКонтрагентов.Номер КАК Номер,
			               |	НАЧАЛОПЕРИОДА(ДоговорыКонтрагентов.Дата, ДЕНЬ) КАК Дата
			               |ИЗ
			               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			               |ГДЕ
			               |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
			               |	И ДоговорыКонтрагентов.Организация = &Организация
			               |	И ДоговорыКонтрагентов.Владелец = &Владелец
			               |	И ДоговорыКонтрагентов.ВидДоговора В(&ВидДоговора)";
			
			//По новым вводным дополнительно ищем основной договор
			Если ЗначениеЗаполнено(КонтрагентСсылка.ОсновнойДоговорКонтрагента)
				И КонтрагентСсылка.ОсновнойДоговорКонтрагента.Организация = ОрганизацияСсылка Тогда
				ОсновнойДоговорСсылка = КонтрагентСсылка.ОсновнойДоговорКонтрагента;
			КонецЕсли;
			
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
	//УТ 10
	ИначеЕсли Конф = "УТ10" Или Конф = "КА1" Или Конф = "УПП" Тогда
	
		Если СтрокаДокумент.ТипСоздаваемогоДокумента = "РасходныйОрдерНаТовары" Тогда
			// Договор не нужно создавать, если этот тип документа не требует наличия договора
			СтрокаДокумент.ДоговорНеТребуется = Истина;
			
		Иначе
		
			МассивВидовДоговоров = Новый Массив;
			
			Если Направление = "Входящий" Тогда
				
				//Для документа ОтчетКомиссионераОПродажах ищем в договорах с видом СКомиссионером
				Если СтрокаДокумент.ТипСоздаваемогоДокумента = "ОтчетКомиссионераОПродажах" Тогда
					МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером"));				
				Иначе
					МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
				КонецЕсли;
				
				КонтрагентСсылка = СтрокаДокумент.ПоставщикСсылка;
				ОрганизацияСсылка = СтрокаДокумент.ПлательщикСсылка;
				
			Иначе
				МассивВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
				
				КонтрагентСсылка = СтрокаДокумент.ПлательщикСсылка;
				ОрганизацияСсылка = СтрокаДокумент.ПоставщикСсылка;
				
			КонецЕсли;
			
			СтруктураПараметровДляПолученияДоговора = Новый Структура("СписокДопустимыхВидовДоговоров",МассивВидовДоговоров);
				
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
			               |	ДоговорыКонтрагентов.Наименование КАК Наименование,
			               |	ДоговорыКонтрагентов.Номер КАК Номер,
			               |	НАЧАЛОПЕРИОДА(ДоговорыКонтрагентов.Дата, ДЕНЬ) КАК Дата
			               |ИЗ
			               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			               |ГДЕ
			               |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
			               |	И ДоговорыКонтрагентов.Владелец = &Контрагент
			               |	И ДоговорыКонтрагентов.Организация = &Организация
			               |	И ДоговорыКонтрагентов.ВидДоговора В(&МассивВидовДоговоров)";
			
			Если ЗначениеЗаполнено(МассивВидовДоговоров) Тогда
				Запрос.УстановитьПараметр("МассивВидовДоговоров",МассивВидовДоговоров);
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ДоговорыКонтрагентов.ВидДоговора В (&МассивВидовДоговоров)","");
			КонецЕсли;
				
			Запрос.УстановитьПараметр("Контрагент",КонтрагентСсылка);
			Запрос.УстановитьПараметр("Организация",ОрганизацияСсылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			//По новым вводным дополнительно ищем основной договор
			Если ЗначениеЗаполнено(КонтрагентСсылка.ОсновнойДоговорКонтрагента)
				И КонтрагентСсылка.ОсновнойДоговорКонтрагента.Организация = ОрганизацияСсылка Тогда
				ОсновнойДоговорСсылка = КонтрагентСсылка.ОсновнойДоговорКонтрагента;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Выборка <> Неопределено Тогда
		
		ИскомоеНаименование = СтрокаДокумент.ПредставлениеДоговора;
		ИскомыеНомера = ПолучитьМассивВариантовНаписанияНомера(СтрокаДокумент.transferBaseNumber);
		Если ЗначениеЗаполнено(СтрокаДокумент.transferBaseDate) Тогда
			ИскомаяДата = НачалоДня(СтрокаДокумент.transferBaseDate);
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Наименование = ИскомоеНаименование Тогда
				СсылкаПоНаименованию = Выборка.Ссылка;
			КонецЕсли;
				
			Если Выборка.Дата = ИскомаяДата И ИскомыеНомера.Найти(Выборка.Номер) <> Неопределено Тогда
				СсылкаПоНомеруДате = Выборка.Ссылка;
			КонецЕсли;
			
			Если ИскомыеНомера.Найти(Выборка.Номер) <> Неопределено Тогда
				СсылкаПоНомеру = Выборка.Ссылка;
			КонецЕсли;
			
			Если Выборка.Дата = ИскомаяДата Тогда
				СсылкаПоДате = Выборка.Ссылка;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СсылкаПоНаименованию) Тогда
			ДоговорСсылка = СсылкаПоНаименованию;
		ИначеЕсли ЗначениеЗаполнено(СсылкаПоНомеруДате) Тогда
			ДоговорСсылка = СсылкаПоНомеруДате;
		ИначеЕсли ЗначениеЗаполнено(СсылкаПоДате) Тогда
			ДоговорСсылка = СсылкаПоДате;
		ИначеЕсли ЗначениеЗаполнено(СсылкаПоНомеру) Тогда
			ДоговорСсылка = СсылкаПоНомеру;
			
		//По новым вводным дополнительно ищем основной договор
		Иначе
			ДоговорСсылка = ОсновнойДоговорСсылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДоговорСсылка;
	
КонецФункции

Функция ПолучитьСсылку_БанковскийСчет(ПоляПоиска,СтруктураНастроек) Экспорт
		
	СведенияОКонфигурации = СтруктураНастроек.СведенияОКонфигурации;
	
	Если ЗначениеЗаполнено(СведенияОКонфигурации.Банк_ИмяСправочникаБанковскиеСчетаКонтрагентов) Тогда
		
		//БГУ
		Если СведенияОКонфигурации.Конфигурация.Крат = "БГУ"
			Или СведенияОКонфигурации.Конфигурация.Крат = "БГУ2" Тогда
			ИмяРеквизита_НомерСчета = "Код";
		Иначе
			ИмяРеквизита_НомерСчета = "НомерСчета";
		КонецЕсли;
		
		//Выполнять поиск по БИК
		ИмяРеквизитаБанк = СведенияОКонфигурации.БанковскийСчет_ИмяРеквизитаБанк;
		ИмяРеквизитаБИК = СведенияОКонфигурации.Банк_ИмяРеквизитаБИК;
		ПоискПоБИК = ЗначениеЗаполнено(ИмяРеквизитаБанк) И ЗначениеЗаполнено(ИмяРеквизитаБИК);
		
		Результат = Справочники[СведенияОКонфигурации.Банк_ИмяСправочникаБанковскиеСчетаКонтрагентов].ПустаяСсылка();
		
		Выборка = Справочники[СведенияОКонфигурации.Банк_ИмяСправочникаБанковскиеСчетаКонтрагентов].Выбрать(,ПоляПоиска.Владелец);
		
		Пока Выборка.Следующий() Цикл
			
			Если СокрЛП(Выборка[ИмяРеквизита_НомерСчета]) = ПоляПоиска.НомерСчета И Не Выборка.ПометкаУдаления Тогда
				
				Если ПоискПоБИК Тогда
					Если Выборка[ИмяРеквизитаБанк][ИмяРеквизитаБИК] = ПоляПоиска.БИК Тогда
						Результат = Выборка.Ссылка;
						Прервать;
					КонецЕсли;
				Иначе
					Результат = Выборка.Ссылка;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
		
	Возврат Результат;
КонецФункции

Функция ПолучитьСсылку_НоменклатураПоЗаданномуАлгоритмуПоиска(СтрокаНоменклатура,ДанныеДокумента,СтруктураНастроек) Экспорт
	
	//E1C-79: добавлен поиск по справочнику Номенклатура поставщиков
	Если СтруктураНастроек.Номенклатура_ИспользоватьНоменклатуруПоставщиков = Истина
		И ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_ДлинаНаименованияНоменклатуры) Тогда
		ИмяСправочникаДляПоиска = СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_ИмяСправочника;
		ДлинаНаименованияНоменклатуры = СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_ДлинаНаименованияНоменклатуры;
		ИмяРеквизитаАртикул = СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_ИмяРеквизитаАртикул;
				
		ПоискПоНоменклатуреПоставщиков = Истина;
	Иначе
		ИмяСправочникаДляПоиска = "Номенклатура";	
		ДлинаНаименованияНоменклатуры = СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ДлинаНаименованияНоменклатуры;
		ИмяРеквизитаАртикул = СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаАртикул;
		
		ПоискПоНоменклатуреПоставщиков = Ложь;
	КонецЕсли;
	
	//E1C-490: При поиске сопоставлений по Артикулу игнорировать язык распознанных символов:
	Если Найти(СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры,"Артикул") > 0 Тогда
		МассивИскомыхАртикулов = ПолучитьМассивВариантовНаписанияНомера(СтрокаНоменклатура.recognizedGoodCode);
	КонецЕсли;
	
	
	Если ПоискПоНоменклатуреПоставщиков Тогда
		
		//УТ11,KA2,ERP: Дополнительный отбор по владельцу-партнеру, без него поиск не выполняем
		ДополнительныйОтбор = Неопределено;
		
		//2021.12.08 ( БП30: поиск по владельцу-контрагенту для тех, кто включил использование НоменклатурыПоставщика в БП30
		Если СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_Владелец = "Контрагент" Тогда
			ДополнительныйОтбор = Новый Структура("Владелец",ДанныеДокумента.ПоставщикСсылка);
		// ) 2021.12.08 
		
		ИначеЕсли ЗначениеЗаполнено(ДанныеДокумента.ПартнерСсылка) Тогда
			ДополнительныйОтбор = Новый Структура("Владелец",ДанныеДокумента.ПартнерСсылка);
			
		КонецЕсли;
		
		Если ДополнительныйОтбор <> Неопределено Тогда
			Если Не ЗначениеЗаполнено(СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры)
				Или СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Наименование" Тогда
				НоменклатураПоставщикаСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(Лев(СтрокаНоменклатура.name,ДлинаНаименованияНоменклатуры),ИмяСправочникаДляПоиска,,,ДополнительныйОтбор);
			
			//Поиск по артикулу выполняется только если определили реквизит Артикул номенклатуры при анализе конфигурации	
			ИначеЕсли ЗначениеЗаполнено(ИмяРеквизитаАртикул) Тогда
				
				Если СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Артикул" Тогда
					НоменклатураПоставщикаСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(МассивИскомыхАртикулов,ИмяСправочникаДляПоиска,ИмяРеквизитаАртикул,,ДополнительныйОтбор);
					
				ИначеЕсли СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Артикул,Наименование" Тогда
					НоменклатураПоставщикаСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(МассивИскомыхАртикулов,ИмяСправочникаДляПоиска,ИмяРеквизитаАртикул,,ДополнительныйОтбор);
					
					Если Не ЗначениеЗаполнено(НоменклатураПоставщикаСсылка) Тогда
						НоменклатураПоставщикаСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(Лев(СтрокаНоменклатура.name,ДлинаНаименованияНоменклатуры),ИмяСправочникаДляПоиска,,,ДополнительныйОтбор);
					КонецЕсли;
					
				ИначеЕсли СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Наименование,Артикул" Тогда
					
					НоменклатураПоставщикаСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(Лев(СтрокаНоменклатура.name,ДлинаНаименованияНоменклатуры),ИмяСправочникаДляПоиска,,,ДополнительныйОтбор);
					
					Если Не ЗначениеЗаполнено(НоменклатураПоставщикаСсылка) Тогда
						НоменклатураПоставщикаСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(МассивИскомыхАртикулов,ИмяСправочникаДляПоиска,ИмяРеквизитаАртикул,,ДополнительныйОтбор);
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				//оставляем исходный вариант, просто поиск по наименованию
				НоменклатураПоставщикаСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(Лев(СтрокаНоменклатура.name,ДлинаНаименованияНоменклатуры),ИмяСправочникаДляПоиска,,,ДополнительныйОтбор);
				
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаНоменклатура.НоменклатураПоставщикаСсылка = НоменклатураПоставщикаСсылка;
		
		//Нужно вернуть ссылку на номенклатуру
		Если ЗначениеЗаполнено(НоменклатураПоставщикаСсылка) Тогда
			НоменклатураСсылка =  НоменклатураПоставщикаСсылка.Номенклатура;
		КонецЕсли; 
		
	Иначе
		
		ДополнительныйОтбор = Неопределено;
		
		//E1C-271: определим список групп для поиска этой номенклатуры - передадим его в дополнительных параметрах поиска
		СписокГрупп = ПолучитьСписокГруппДляПоискаНоменклатуры(СтрокаНоменклатура,СтруктураНастроек);
		Если СписокГрупп.Количество() > 0 Тогда
			ДополнительныйОтбор = Новый Структура("В_ИЕРАРХИИ",СписокГрупп);
		КонецЕсли;
		
		//УНФ: отбор по реквизиту 
		Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаНедействителен) Тогда
			КлючОтбора = СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаНедействителен;
			Если ДополнительныйОтбор = Неопределено Тогда
				ДополнительныйОтбор = Новый Структура(КлючОтбора,Ложь);
			Иначе
				ДополнительныйОтбор.Вставить(КлючОтбора,Ложь);
			КонецЕсли;
		КонецЕсли;
		
		
		Если Не ЗначениеЗаполнено(СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры)
			Или СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Наименование" Тогда
			НоменклатураСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(Лев(СтрокаНоменклатура.name,ДлинаНаименованияНоменклатуры),ИмяСправочникаДляПоиска,,,ДополнительныйОтбор);
			
		//2022.06.29 ( Поиск по полному наименованию	
		ИначеЕсли СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Наименование полное" Тогда
			НоменклатураСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(СтрокаНоменклатура.name,ИмяСправочникаДляПоиска,"НаименованиеПолное",,ДополнительныйОтбор);
		// ) 2022.06.29
			
		//Поиск по артикулу выполняется только если определили реквизит Артикул номенклатуры при анализе конфигурации	
		ИначеЕсли ЗначениеЗаполнено(ИмяРеквизитаАртикул) Тогда
			
			Если СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Артикул" Тогда
				НоменклатураСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(МассивИскомыхАртикулов,ИмяСправочникаДляПоиска,ИмяРеквизитаАртикул,,ДополнительныйОтбор);
				
			ИначеЕсли СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Артикул,Наименование" Тогда
				НоменклатураСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(МассивИскомыхАртикулов,ИмяСправочникаДляПоиска,ИмяРеквизитаАртикул,,ДополнительныйОтбор);
				
				Если Не ЗначениеЗаполнено(НоменклатураСсылка) Тогда
					НоменклатураСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(Лев(СтрокаНоменклатура.name,ДлинаНаименованияНоменклатуры),ИмяСправочникаДляПоиска,,,ДополнительныйОтбор);
				КонецЕсли;
				
			ИначеЕсли СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Наименование,Артикул" Тогда
				
				НоменклатураСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(Лев(СтрокаНоменклатура.name,ДлинаНаименованияНоменклатуры),ИмяСправочникаДляПоиска,,,ДополнительныйОтбор);
				
				Если Не ЗначениеЗаполнено(НоменклатураСсылка) Тогда
					НоменклатураСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(МассивИскомыхАртикулов,ИмяСправочникаДляПоиска,ИмяРеквизитаАртикул,,ДополнительныйОтбор);
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			//оставляем исходный вариант, просто поиск по наименованию
			НоменклатураСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(Лев(СтрокаНоменклатура.name,ДлинаНаименованияНоменклатуры),ИмяСправочникаДляПоиска,,,ДополнительныйОтбор);
			
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат НоменклатураСсылка;
		
КонецФункции

Функция ПолучитьСсылку_ОсновноеСредствоПоЗаданномуАлгоритмуПоиска(СтрокаНоменклатура,СтруктураНастроек) Экспорт
	
	ИмяСправочникаДляПоиска = "ОсновныеСредства";
	ДлинаНаименования = Метаданные.Справочники.ОсновныеСредства.ДлинаНаименования;
	
	ДополнительныйОтбор = Неопределено;	
	
	Если Не ЗначениеЗаполнено(СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры)
		Или СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Наименование" Тогда
		ОсновноеСредствоСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(Лев(СтрокаНоменклатура.name,ДлинаНаименования),ИмяСправочникаДляПоиска,,,ДополнительныйОтбор);
		
	//Поиск по полному наименованию	
	ИначеЕсли СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Наименование полное" Тогда
		ОсновноеСредствоСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(СтрокаНоменклатура.name,ИмяСправочникаДляПоиска,"НаименованиеПолное",,ДополнительныйОтбор);
		
	Иначе
		//оставляем исходный вариант, просто поиск по наименованию
		ОсновноеСредствоСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(Лев(СтрокаНоменклатура.name,ДлинаНаименования),ИмяСправочникаДляПоиска,,,ДополнительныйОтбор);
		
	КонецЕсли;
	
	Возврат ОсновноеСредствоСсылка;
		
КонецФункции

Функция ПолучитьСсылку_УпаковкаЕдиницаИзмерения(СтрокаНоменклатура,СтруктураНастроек,ПовторныйВызовПоискаПоСинонимам = Ложь) Экспорт
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	Лок = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок;
	
	Если ЗначениеЗаполнено(СтрокаНоменклатура.unitExternalId) Тогда
		Если Конф = "БП30" Тогда
			ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоУникальномуИдентификатору(СтрокаНоменклатура.unitExternalId,"КлассификаторЕдиницИзмерения");
			
		ИначеЕсли Конф = "УНФ" Тогда
			ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоУникальномуИдентификатору(СтрокаНоменклатура.unitExternalId,"КлассификаторЕдиницИзмерения");
			
		ИначеЕсли Конф = "РОЗН3" Тогда
			ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоУникальномуИдентификатору(СтрокаНоменклатура.unitExternalId,"КлассификаторЕдиницИзмерения");
			
		ИначеЕсли Конф = "РОЗН2" Тогда
			ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоУникальномуИдентификатору(СтрокаНоменклатура.unitExternalId,"БазовыеЕдиницыИзмерения");
		
		ИначеЕсли Конф = "ЭДО" Тогда
			ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоУникальномуИдентификатору(СтрокаНоменклатура.unitExternalId,"ЕдиницыИзмерения");
			
		ИначеЕсли Конф = "УТ11" Или Конф = "КА2" Или Конф = "ERP" Тогда
			ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоУникальномуИдентификатору(СтрокаНоменклатура.unitExternalId,"УпаковкиЕдиницыИзмерения");
			
		ИначеЕсли Конф = "БП30" Тогда
			ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоУникальномуИдентификатору(СтрокаНоменклатура.unitExternalId,"КлассификаторЕдиницИзмерения");
			
		ИначеЕсли Конф = "УТ10" Или Конф = "КА1" Или Конф = "УПП" Или Конф = "Автосалон" Или Конф = "КомбинатПитания" Или Конф = "УправлениеРестораном" Тогда
			ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоУникальномуИдентификатору(СтрокаНоменклатура.unitExternalId,"ЕдиницыИзмерения");
		
		КонецЕсли;
	КонецЕсли;
	
	// Поиск единицы измерения/упаковки по наименованию
	Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияСсылка) Тогда
		
		Если Конф = "БП30" Тогда
			ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(СтрокаНоменклатура.userUnitName,"КлассификаторЕдиницИзмерения");
			
		ИначеЕсли Конф = "БГУ2" Тогда
			ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(СтрокаНоменклатура.userUnitName,"КлассификаторЕдиницИзмерения");
			
		ИначеЕсли Конф = "ITОтдел" Тогда
			ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(СтрокаНоменклатура.userUnitName,"КлассификаторЕдиницИзмерения");
			
		ИначеЕсли Конф = "УНФ"
			//2024.10.22 (
			Или Конф = "РОЗН3" Тогда
			// ) 2024.10.22
			
			//E1C-90: сперва поищем в подчиненном справочнике единиц измерения
			Если ЗначениеЗаполнено(СтрокаНоменклатура.НоменклатураСсылка) Тогда // владелец упаковки найден
									
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	ЕдиницыИзмерения.Ссылка КАК Ссылка
				               |ИЗ
				               |	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
				               |ГДЕ
				               |	ЕдиницыИзмерения.Владелец = &Владелец
				               |	И ЕдиницыИзмерения.Наименование = &Наименование";
				Запрос.УстановитьПараметр("Владелец",СтрокаНоменклатура.НоменклатураСсылка);
				Запрос.УстановитьПараметр("Наименование",СтрокаНоменклатура.userUnitName);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда 
					ЕдиницаИзмеренияСсылка = Выборка.Ссылка;
				КонецЕсли;
					
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияСсылка) Тогда
				ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(СтрокаНоменклатура.userUnitName,"КлассификаторЕдиницИзмерения");
			КонецЕсли;
			
		ИначеЕсли Конф = "РОЗН2" Тогда
			ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(СтрокаНоменклатура.userUnitName,"БазовыеЕдиницыИзмерения");
			
		ИначеЕсли Конф = "ЭДО" Тогда
			ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(СтрокаНоменклатура.userUnitName,"ЕдиницыИзмерения");
			
		ИначеЕсли Конф = "УТ11" Или Конф = "КА2" Или Конф = "ERP" Тогда
			
			Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Полн = "УТ11.1" Тогда
				ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(СтрокаНоменклатура.userUnitName,"ЕдиницыИзмерения");
				
			Иначе
				Если ЗначениеЗаполнено(СтрокаНоменклатура.НоменклатураСсылка) Тогда // владелец упаковки найден
									
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
					               |ИЗ
					               |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
					               |ГДЕ
					               |	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
					               |	И УпаковкиЕдиницыИзмерения.Наименование = &Наименование";
					Запрос.УстановитьПараметр("Владелец",СтрокаНоменклатура.НоменклатураСсылка);
					Запрос.УстановитьПараметр("Наименование",СтрокаНоменклатура.userUnitName);
					
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда 
						ЕдиницаИзмеренияСсылка = Выборка.Ссылка;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли Конф = "БП20" Тогда
			
			Если Лок = "BLR" Тогда
				Если ЗначениеЗаполнено(СтрокаНоменклатура.НоменклатураСсылка) Тогда // владелец единицы измерения найден
								
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ЕдиницыИзмерения.Ссылка КАК Ссылка
					               |ИЗ
					               |	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
					               |ГДЕ
					               |	ЕдиницыИзмерения.Владелец = &Владелец
					               |	И ЕдиницыИзмерения.Наименование = &Наименование";
					Запрос.УстановитьПараметр("Владелец",СтрокаНоменклатура.НоменклатураСсылка);
					Запрос.УстановитьПараметр("Наименование",СтрокаНоменклатура.userUnitName);
					
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда 
						ЕдиницаИзмеренияСсылка = Выборка.Ссылка;
					КонецЕсли;
					
				Иначе
					//Для пустого владельца поищем единицу измерения из классификатора для заполнения базовой единицы измерения
					ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(СтрокаНоменклатура.userUnitName,"ОКЕИ");
				КонецЕсли;
				
			Иначе
				ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(СтрокаНоменклатура.userUnitName,"КлассификаторЕдиницИзмерения");
			КонецЕсли;
			
		ИначеЕсли СтруктураНастроек.СведенияОКонфигурации.ЕдиницыИзмерения_ВладелецНоменклатура Тогда
			
			Если ЗначениеЗаполнено(СтрокаНоменклатура.НоменклатураСсылка) Тогда // владелец единицы измерения найден
								
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	ЕдиницыИзмерения.Ссылка КАК Ссылка
				               |ИЗ
				               |	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
				               |ГДЕ
				               |	ЕдиницыИзмерения.Владелец = &Владелец
				               |	И ЕдиницыИзмерения.Наименование = &Наименование";
				Запрос.УстановитьПараметр("Владелец",СтрокаНоменклатура.НоменклатураСсылка);
				Запрос.УстановитьПараметр("Наименование",СтрокаНоменклатура.userUnitName);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда 
					ЕдиницаИзмеренияСсылка = Выборка.Ссылка;
				КонецЕсли;
				
				//Автосалон, КомбинатПитания: владельцем единицы измерения может быть не только Номенклатура, но и ТипНоменклатуры
				Если (Конф = "Автосалон"  Или Конф = "КомбинатПитания" Или Конф = "УправлениеРестораном") И Не ЗначениеЗаполнено(ЕдиницаИзмеренияСсылка) Тогда
					Запрос.УстановитьПараметр("Владелец",СтрокаНоменклатура.НоменклатураСсылка.ТипНоменклатуры);
					Запрос.УстановитьПараметр("Наименование",СтрокаНоменклатура.userUnitName);
					
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда 
						ЕдиницаИзмеренияСсылка = Выборка.Ссылка;
					КонецЕсли;
				КонецЕсли;
				
			//2022.06.03 ( Для пустого владельца поищем единицу измерения из классификатора для заполнения базовой единицы измерения
			Иначе
				Если РеквизитСуществует("Справочники","КлассификаторЕдиницИзмерения") Тогда
					ЕдиницаИзмеренияСсылка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(СтрокаНоменклатура.userUnitName,Истина);
				КонецЕсли;
			//2022.06.03
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
			
	Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияСсылка) Тогда
		//2019.01.07 (
		КодЕИДляПоиска = ?(ЗначениеЗаполненоXDTO(СтрокаНоменклатура.unitCode),СтрокаНоменклатура.unitCode,СтрокаНоменклатура.recognizedUnitCode);
		// ) 2019.01.07
		
		// Поиск в базовых единицах измерения
		Если Конф = "УТ11" Или Конф = "КА2" Или Конф = "ERP" Тогда
			
			Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Полн = "УТ11.1" Тогда
				//Для УТ11.1 поиск описан далее
			Иначе
				Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияСсылка) Тогда
					
					//EN-223: пока приоритетным будет поиск по наименованию, установленному/проверенному пользователем, а не распознанный код
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка,
					               |	1 КАК Порядок
					               |ИЗ
					               |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
					               |ГДЕ
					               |	УпаковкиЕдиницыИзмерения.Код = &Код
					               |	И УпаковкиЕдиницыИзмерения.Владелец = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.БазовыеЕдиницыИзмерения)
					               |
					               |ОБЪЕДИНИТЬ ВСЕ
					               |
					               |ВЫБРАТЬ
					               |	УпаковкиЕдиницыИзмерения.Ссылка,
					               |	0
					               |ИЗ
					               |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
					               |ГДЕ
					               |	УпаковкиЕдиницыИзмерения.Наименование = &Наименование
					               |	И УпаковкиЕдиницыИзмерения.Владелец = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.БазовыеЕдиницыИзмерения)
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Порядок";
					
					Запрос.УстановитьПараметр("Код",КодЕИДляПоиска);
					Запрос.УстановитьПараметр("Наименование",СтрокаНоменклатура.userUnitName);
					
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда 
						ЕдиницаИзмеренияСсылка = Выборка.Ссылка;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Поиск единицы измерения/упаковки по коду
		Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияСсылка) Тогда
			Если Конф = "БП30" Тогда
				ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(КодЕИДляПоиска,"КлассификаторЕдиницИзмерения","Код");
				
			ИначеЕсли Конф = "УНФ" Тогда
				ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(КодЕИДляПоиска,"КлассификаторЕдиницИзмерения","Код");
				
			ИначеЕсли Конф = "ITОтдел" Тогда
				ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(КодЕИДляПоиска,"КлассификаторЕдиницИзмерения","Код");
				
			ИначеЕсли Конф = "РОЗН3" Тогда
				ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(КодЕИДляПоиска,"КлассификаторЕдиницИзмерения","Код");
				
			ИначеЕсли Конф = "РОЗН2" Тогда
				ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(КодЕИДляПоиска,"БазовыеЕдиницыИзмерения","Код");
				
			ИначеЕсли Конф = "ЭДО" Тогда
				ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(КодЕИДляПоиска,"ЕдиницыИзмерения","Код");
				
			ИначеЕсли Конф = "УТ11" Или Конф = "КА2" Или Конф = "ERP" Тогда
				
				Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Полн = "УТ11.1" Тогда
					ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(КодЕИДляПоиска,"ЕдиницыИзмерения","Код");
				Иначе					
					Если ЗначениеЗаполнено(СтрокаНоменклатура.НоменклатураСсылка) Тогда // владелец упаковки найден
											
						Запрос = Новый Запрос;
						Запрос.Текст = "ВЫБРАТЬ
						               |	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
						               |ИЗ
						               |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
						               |ГДЕ
						               |	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
						               |	И УпаковкиЕдиницыИзмерения.Код = &Код";
						Запрос.УстановитьПараметр("Владелец",СтрокаНоменклатура.НоменклатураСсылка);
						Запрос.УстановитьПараметр("Код",КодЕИДляПоиска);
						
						Выборка = Запрос.Выполнить().Выбрать();
						Если Выборка.Следующий() Тогда 
							ЕдиницаИзмеренияСсылка = Выборка.Ссылка;
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли Конф = "БП20" И НЕ Лок = "BLR" Тогда
				ЕдиницаИзмеренияСсылка = ПолучитьСсылку_ОбъектПоРеквизиту(КодЕИДляПоиска,"КлассификаторЕдиницИзмерения","Код");
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//E1C-162: Поиск по возможным соответствиям ЕИ из списка синонимов портала
	Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияСсылка) И Не ПовторныйВызовПоискаПоСинонимам Тогда
		//Ищем единицу по классификатору в словаре синонимов по userUnitName и unitName
		ДанныеСловаря = СтруктураНастроек.СловарьСинонимовЕИ.Получить(СтрокаНоменклатура.userUnitName);
		Если ДанныеСловаря = Неопределено Тогда
			ДанныеСловаря = СтруктураНастроек.СловарьСинонимовЕИ.Получить(СтрокаНоменклатура.unitName);
		КонецЕсли;
		
		Если ДанныеСловаря <> Неопределено Тогда
			
			//Нужно определиться, будем подменять в данных портала распознанные данные найденными в "классификаторе" портала,
			//или использовать такие данные только для поиска ссылки, а в таблице данных портала оставляем исходные?
			ЗаменяемДанныеПортала = Истина;
			
			Если ЗаменяемДанныеПортала Тогда
				СтруктураПоиска = СтрокаНоменклатура;
			Иначе
				//Чтобы не изменять данные портала, заполняем новую структуру для поиска значениями, найденными в синонимах, и повторяем поиск
				СтруктураПоиска = Инициализировать_Таблица_documentItems(Истина);
				ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрокаНоменклатура);
			КонецЕсли;
			
			СтруктураПоиска.userUnitName = ДанныеСловаря.Наименование;
			СтруктураПоиска.unitName = ДанныеСловаря.Наименование;
			СтруктураПоиска.unitCode = ДанныеСловаря.Код;
			СтруктураПоиска.recognizedUnitCode = ДанныеСловаря.Код;
			ЕдиницаИзмеренияСсылка = ПолучитьСсылку_УпаковкаЕдиницаИзмерения(СтруктураПоиска,СтруктураНастроек,Истина);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕдиницаИзмеренияСсылка;
	
КонецФункции

Функция ПолучитьСсылку_СтавкаНДС(Значение,СтавкиНДС)
	
	Результат = СтавкиНДС.БезНДС;
	
	Если Значение = "PERCENT_18" Тогда
		Результат = СтавкиНДС.НДС18;
	ИначеЕсли Значение = "PERCENT_22" Тогда
		Результат = СтавкиНДС.НДС22;
	ИначеЕсли Значение = "PERCENT_20" Тогда
		// НАЧАЛО ВРЕМЕННОГО КОСТЫЛЯ (
		Если Не СтавкиНДС.Свойство("НДС20")
			Или СтавкиНДС.НДС20 = Неопределено Тогда
			Результат = СтавкиНДС.НДС18;
		Иначе
		// ) КОНЕЦ ВРЕМЕННОГО КОСТЫЛЯ
			Результат = СтавкиНДС.НДС20;
		КонецЕсли;			
	ИначеЕсли Значение = "PERCENT_10" Тогда
		Результат = СтавкиНДС.НДС10;
	ИначеЕсли Значение = "PERCENT_12" Тогда
		Результат = СтавкиНДС.НДС12;
	ИначеЕсли Значение = "PERCENT_16" Тогда
		Результат = СтавкиНДС.НДС16;
	ИначеЕсли Значение = "PERCENT_5" Тогда
		Результат = СтавкиНДС.НДС5;
	ИначеЕсли Значение = "PERCENT_7" Тогда
		Результат = СтавкиНДС.НДС7;
	ИначеЕсли Значение = "0"
		Или Значение = "PERCENT_0" Тогда
		Результат = СтавкиНДС.НДС0;
		
	//E1C-509: появились счета-фактуры на аванс
	ИначеЕсли Значение = "PERCENT_18_118" Тогда
		Результат = СтавкиНДС.НДС18_118;
	ИначеЕсли Значение = "PERCENT_20_120" Тогда
		Результат = СтавкиНДС.НДС20_120;
	ИначеЕсли Значение = "PERCENT_22_122" Тогда
		Результат = СтавкиНДС.НДС22_122;
	ИначеЕсли Значение = "PERCENT_10_110" Тогда
		Результат = СтавкиНДС.НДС10_110;
	ИначеЕсли Значение = "PERCENT_7_107" Тогда
		Результат = СтавкиНДС.НДС7_107;
	ИначеЕсли Значение = "PERCENT_5_105" Тогда
		Результат = СтавкиНДС.НДС5_105;
	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьСсылку_СерияНоменклатуры(СтрокаНоменклатура,СтруктураНастроек,ПараметрыПоиска) Экспорт
	
	Результат = Справочники.СерииНоменклатуры.ПустаяСсылка();
	
	//Модуль кастомизации: можно переопределить установленное стандартным поиском значение
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыМК.Вставить("ПараметрыПоиска",ПараметрыПоиска);
	ПараметрыМК.Вставить("СтрокаНоменклатуры",СтрокаНоменклатура);
	ПараметрыМК.Вставить("СерияНоменклатурыСсылка",Результат);
	ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
			
	МодульКастомизации_ОбработатьСобытие("ПоискСсылок_ОпределениеСерииНоменклатуры",ПараметрыМК);
	
	Если ПараметрыМК.СтандартнаяОбработка <> Истина Тогда
		Результат = ПараметрыМК.СерияНоменклатурыСсылка;
		
	Иначе
	
		Если ЗначениеЗаполнено(СтрокаНоменклатура.НоменклатураСсылка)
			И ЗначениеЗаполнено(СтрокаНоменклатура.НомерГТДСсылка)
			И ЗначениеЗаполнено(СтрокаНоменклатура.СтранаПроисхожденияСсылка) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	СерииНоменклатуры.Ссылка
			               |ИЗ
			               |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
			               |ГДЕ
						   |	НЕ СерииНоменклатуры.ПометкаУдаления
						   |	И СерииНоменклатуры.Владелец = &Номенклатура
						   |	И СерииНоменклатуры.НомерГТД = &НомерГТД
			               |	И СерииНоменклатуры.СтранаПроисхождения = &СтранаПроисхождения";
			Запрос.УстановитьПараметр("Номенклатура",ПараметрыПоиска.Номенклатура);
			Запрос.УстановитьПараметр("НомерГТД",ПараметрыПоиска.НомерГТД);
			Запрос.УстановитьПараметр("СтранаПроисхождения",ПараметрыПоиска.СтранаПроисхождения);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Результат = Выборка.Ссылка;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСсылку_ИсточникПроисхождения(ПараметрыПоиска) Экспорт
	
	//E1C-477: Поиск Номер ГТД/сертификата, код ТНВЭД, Номер строки ГТД/Заявления
	Результат = Справочники.НомераГТД.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсточникиПроисхождения.Ссылка
	               |ИЗ
	               |	Справочник.НомераГТД КАК ИсточникиПроисхождения
	               |ГДЕ
				   |	НЕ ИсточникиПроисхождения.ПометкаУдаления
				   |	И ИсточникиПроисхождения.Код = &Код
				   |	И ИсточникиПроисхождения.КодТНВЭД = &КодТНВЭД
	               |	И ИсточникиПроисхождения.НомерСтрокиГТД = &НомерСтрокиГТД";
	Запрос.УстановитьПараметр("Код",Строка(ПараметрыПоиска.Код));
	Запрос.УстановитьПараметр("КодТНВЭД",Строка(ПараметрыПоиска.КодТНВЭД));
	Запрос.УстановитьПараметр("НомерСтрокиГТД",Строка(ПараметрыПоиска.НомерСтрокиГТД));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСсылку_ОбъектПоСвойствуИдентификаторуПортала(СтруктураНастроек,Значение)
	
	//2019.05.21 ( БГУ: Измерение Объект регистра ЗначенияСвойствОбъектов не позволяет хранить ссылки на документы,
	//храним связь в своей таблице в ХранилищеОбщихНастроек
	Если СтруктураНастроек.СведенияОКонфигурации.ХранениеСвязиДокументов_СвояТаблица = Истина Тогда
		СвязьДокументов = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СвязьДокументов");
	
		Если ТипЗнч(СвязьДокументов) = Тип("ТаблицаЗначений") Тогда
			СтрокиТаблицы = СвязьДокументов.НайтиСтроки(Новый Структура("documentId",Значение));
			Если СтрокиТаблицы.Количество() > 0 Тогда
				Результат = СтрокиТаблицы[0].Ссылка;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
	
		Свойство = СтруктураНастроек.Свойство_Entera_documentId;
		
		ИмяРегистраСведений = СтруктураНастроек.ИмяРегистраСведений;
		
		Если ИмяРегистраСведений <> Неопределено Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ДополнительныеСведения.Объект КАК Ссылка
			               |ИЗ
			               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
			               |ГДЕ
			               |	ДополнительныеСведения.Свойство = &Свойство
						   //2023.05.17 ( Управление Холдингом изменили тип ресурса Значения на неограниченную строку, ограничим
						   |	И Выразить(ДополнительныеСведения.Значение КАК Строка(100)) = &Значение";
						   // ) 2023.05.17
			
			Если ИмяРегистраСведений <> "ДополнительныеСведения" Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ДополнительныеСведения",ИмяРегистраСведений);
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Свойство",Свойство);
			Запрос.УстановитьПараметр("Значение",Значение);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Результат = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		//Связь может также храниться в дополнительной таблице объединенных документов		
		ТаблицаОбъединенныхДокументов = ПолучитьДанныеИзОбщегоХранилища("ОбъединенныеДокументы");
		Если ТипЗнч(ТаблицаОбъединенныхДокументов) = Тип("ТаблицаЗначений") Тогда
			СтрокиДокумента = ТаблицаОбъединенныхДокументов.НайтиСтроки(Новый Структура("documentId",Значение));
			Если СтрокиДокумента.Количество() > 0 Тогда
				Результат = СтрокиДокумента[0].Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат) И ОбъектНеНайден(Результат) Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОпределитьФлаг_УчитыватьНДС(СтруктураНастроек,Организация,Дата)
		
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат; 
	
	УчитыватьНДС = Истина;	
	
	//2019.06.16 ( флаг Учитывать НДС вынесен в настройки
	Если СтруктураНастроек.ЗаполнениеШапки_УчитыватьНДС = Ложь Тогда
		УчитыватьНДС = Ложь;
	КонецЕсли;
	
	Возврат УчитыватьНДС;
	// ) 2019.06.16
	
	Если Конф = "БП30" Тогда
		
		МодульУчетнаяПолитика = _ЗФ_ПолучитьОбщийМодульКонфигурации("УчетнаяПолитика");
		Если МодульУчетнаяПолитика <> Неопределено Тогда
			Попытка
				ПлательщикНДС = МодульУчетнаяПолитика.ПлательщикНДС(Организация, Дата);
				Если ПлательщикНДС <> Истина Тогда
					УчитыватьНДС = Ложь;
				КонецЕсли;
			Исключение;
				
			КонецПопытки;
		КонецЕсли;
		
	ИначеЕсли Конф = "УТ11" Тогда
		
		МодульУчетнаяПолитика = _ЗФ_ПолучитьОбщийМодульКонфигурации("УчетнаяПолитика");
		Если МодульУчетнаяПолитика <> Неопределено Тогда
			Попытка
				ПлательщикНДС = МодульУчетнаяПолитика.ПлательщикНДС(Организация, Дата);
				Если ПлательщикНДС <> Истина Тогда
					УчитыватьНДС = Ложь;
				КонецЕсли;
			Исключение;
				
			КонецПопытки;
		КонецЕсли;
	
	ИначеЕсли Конф = "УНФ" Тогда
		
		МодульУправлениеНебольшойФирмойСервер = _ЗФ_ПолучитьОбщийМодульКонфигурации("УправлениеНебольшойФирмойСервер");
		Если МодульУправлениеНебольшойФирмойСервер <> Неопределено Тогда
			Попытка
				НалогообложениеНДС = МодульУправлениеНебольшойФирмойСервер.НалогообложениеНДС(Организация,,Дата);
				Если НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
					УчитыватьНДС = Ложь;
				КонецЕсли;
			Исключение;
				
			КонецПопытки;
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат УчитыватьНДС;
	
КонецФункции

Функция ПолучитьСписокГруппДляПоискаНоменклатуры(СтрокаТаблицы,СтруктураНастроек)
	
	//E1C-271: поиск номенклатуры должен выполняться с учетом настроенных групп не только в форме сопоставления, но и до ее открытия.
	//код функции чуть более чем полностью состоит из клиентского кода формы сопоставления для выполнения этого поиска на сервере
	
	СписокГрупп = Новый Массив;

	// Получаем таблицу "маркеров" - подстрок поиска номенклатуры в иерархии группы						
	ДанныеСвязей = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СловаМаркеры");
	Если ТипЗнч(ДанныеСвязей) = Тип("ТаблицаЗначений") Тогда
		Для Каждого СтрокаМаркер Из ДанныеСвязей Цикл
			Если СтрокаМаркер.Маркер <> "" И ЗначениеЗаполнено(СтрокаМаркер.Номенклатура) И СтрокаМаркер.Номенклатура.ЭтоГруппа Тогда
				
				СтрокаДляПоиска = Нрег(СтрокаТаблицы.name);				
				
				Если Найти(СтрокаДляПоиска,Нрег(СтрокаМаркер.Маркер)) > 0 Тогда
					СписокГрупп.Добавить(СтрокаМаркер.Номенклатура);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
						
	Если СтруктураНастроек.Свойство("Номенклатура_ГруппаДляПоискаПохожейНоменклатуры")
		И ЗначениеЗаполнено(СтруктураНастроек.Номенклатура_ГруппаДляПоискаПохожейНоменклатуры) Тогда
		
		Если ТипЗнч(СтруктураНастроек.Номенклатура_ГруппаДляПоискаПохожейНоменклатуры) = Тип("СписокЗначений") Тогда
			Для Каждого ЭлементСписка Из СтруктураНастроек.Номенклатура_ГруппаДляПоискаПохожейНоменклатуры Цикл
				СписокГрупп.Добавить(ЭлементСписка.Значение);
			КонецЦикла;
		Иначе
			СписокГрупп.Добавить(СтруктураНастроек.Номенклатура_ГруппаДляПоискаПохожейНоменклатуры);
		КонецЕсли;
	КонецЕсли;
		
	Возврат СписокГрупп;
	
КонецФункции


// ================= Доп. классификаторы ===================

Функция Классификатор_ПолучитьСтрануМира(СтруктураЗаполнения) Экспорт
	
	Результат = Неопределено;
	
	Если СтруктураЗаполнения.Код = "980"
		Или СтруктураЗаполнения.Код = "EU"
		Или СтруктураЗаполнения.Наименование = "EU"
		Или Нрег(СтруктураЗаполнения.Наименование) = "европейский союз" Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("Код","980");
		Результат.Вставить("Наименование","Европейский союз");
		Результат.Вставить("НаименованиеПолное","Европейский союз");
		Результат.Вставить("КодАльфа2","EU");
		Результат.Вставить("КодАльфа3","");
		
	ИначеЕсли СтруктураЗаполнения.Код = "981"
		Или Нрег(СтруктураЗаполнения.Наименование) = "евразийский экономический союз" Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("Код","981");
		Результат.Вставить("Наименование","Евразийский экономический союз");
		Результат.Вставить("НаименованиеПолное","Евразийский экономический союз");
		Результат.Вставить("КодАльфа2","");
		Результат.Вставить("КодАльфа3","");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Классификатор_ИнициализироватьСоответствияСинонимовЕдиницИзмерения() Экспорт
	
	//Читаем макет синонимов единиц измерения в Соответствие
	
	Синонимы = Новый Соответствие;
	
	Макет = ПолучитьМакет("СинонимыЕдиницИзмерения");
	
	Для Сч = 2 По Макет.ВысотаТаблицы Цикл
		name = ПолучитьТекстЯчейкиОбласти(Макет,Сч,1);
		okei_code = ПолучитьТекстЯчейкиОбласти(Макет,Сч,2);
		synonym = ПолучитьТекстЯчейкиОбласти(Макет,Сч,3);
		
		//Разбираем синонимы, ключом будет синоним, значением - структура ЕИ Наименование и Код
		ТекЗначение = Новый Структура("Наименование,Код",name,okei_code);
		
		МассивСинонимов = Энтера_РазложитьСтрокуВМассивПодстрок(synonym,";",Истина,Истина);
		
		Для Каждого Синоним Из МассивСинонимов Цикл
			Синонимы.Вставить(Синоним,ТекЗначение);
		КонецЦикла;
				
	КонецЦикла;
	
	Возврат Синонимы;
	
КонецФункции

Функция СловаМаркерыТипНоменклатуры_ЗначенияПоУмолчанию_ПолучитьДанныеМакета(УникальныйИдентификатор = Неопределено) Экспорт
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Маркер");
	ТаблицаЗначений.Колонки.Добавить("ТипНоменклатуры");
		
	Макет = ПолучитьМакет("СловаМаркерыТипНоменклатуры");
	Область = Макет.ПолучитьОбласть("Услуги");
			
	Для Сч = 1 По Область.ВысотаТаблицы Цикл
		Маркер = ПолучитьТекстЯчейкиОбласти(Область,Сч,1);
		
		НоваяСтрока = ТаблицаЗначений.Добавить();
		НоваяСтрока.Маркер = Маркер;
		НоваяСтрока.ТипНоменклатуры = "Услуга";
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаЗначений,УникальныйИдентификатор);
	
КонецФункции


Функция КодыДокументов_ИнициализироватьСоответствияКодовДокументов() Экспорт
	
	СоответствияКодов = Новый Соответствие;
	
	Макет = ПолучитьМакет("КодыТиповДокументов");
	Область = Макет.ПолучитьОбласть("КодыТиповДокументов");
	
	Для Сч = 1 По Область.ВысотаТаблицы Цикл
		КодТипаДокумента = ПолучитьТекстЯчейкиОбласти(Область,Сч,1);
		ИмяТипаДокумента = ПолучитьТекстЯчейкиОбласти(Область,Сч,2);
		
		СоответствияКодов.Вставить(ИмяТипаДокумента,КодТипаДокумента);
	КонецЦикла;
	
	Возврат СоответствияКодов;
	
КонецФункции

Функция ИсточникиДокументов_ИнициализироватьСоответствияИсточниковДокументов() Экспорт
	
	СоответствияИсточников = Новый Соответствие;
	
	СоответствияИсточников.Вставить("WEB_APP","Портал");
	СоответствияИсточников.Вставить("MODULE_1C","Модуль 1С");
	СоответствияИсточников.Вставить("MODULE_1C_FRESH","1С Фреш");
	СоответствияИсточников.Вставить("WEB_RECEIPT_SCANNER","Сканер чеков");
	СоответствияИсточников.Вставить("EXTERNAL_SYSTEM","API");
	СоответствияИсточников.Вставить("EMAIL","Email");
	СоответствияИсточников.Вставить("DIADOC","Диадок вх");
	СоответствияИсточников.Вставить("ENTERA_EDI","Диадок исх");
	СоответствияИсточников.Вставить("SBIS","СБИС вх");
	СоответствияИсточников.Вставить("SBIS_MANUAL","СБИС вх руч");
	СоответствияИсточников.Вставить("ENTERA_EDI_SBIS","СБИС исх");
	СоответствияИсточников.Вставить("ESF_KZ_MANUAL","ИС ЭСФ вх руч");
	СоответствияИсточников.Вставить("WEB_MOBILE","Мобильная версия");
	СоответствияИсточников.Вставить("UNKNOWN","Неизвестный");
	
	//E1C-519:
	СоответствияИсточников.Вставить("WHATSAPP","WhatsApp");
	
	//E1C-540:
	СоответствияИсточников.Вставить("TELEGRAM","Telegram");
	
	Возврат СоответствияИсточников;
	
КонецФункции


// ================= Интеграция с ЭДО ===================

Функция Диадок_ИнициализироватьСоответствияСтатусов() Экспорт
	//Описание: Все статусы по типам документов, которые мы обрабатываем, кроме внутреннего документооборота.
	//ключ-перевода как type.status, где type - тип документа, то что лежит в поле externalSystemInfos.*.data.attachmentType (Invoice, XmlTorg12,  ...),
	//status - то что лежит в поле externalSystemInfos.*.data.status. Это избыточно, т.к. одинаковый status в разных типах документов
	//всё равно имеет один и тот же перевод, но type в случае чего сможет помочь в разрешении конфликтов,
	//когда один и тот же статус для разных типов будет иметь разный перевод.
	
	СоответствияСтатусов = Новый Соответствие;
	
	Макет = ПолучитьМакет("СтатусыДиадок");
	Область = Макет.ПолучитьОбласть("Статусы");
	
	Для Сч = 1 По Область.ВысотаТаблицы Цикл
		attachmentType = ПолучитьТекстЯчейкиОбласти(Область,Сч,1);
		status = ПолучитьТекстЯчейкиОбласти(Область,Сч,2);
		Описание = ПолучитьТекстЯчейкиОбласти(Область,Сч,3);
		
		Если attachmentType = "" Тогда
			Продолжить;
		КонецЕсли;
		
		СоответствиеТип = СоответствияСтатусов.Получить(attachmentType);
		Если СоответствиеТип = Неопределено Тогда
			СоответствиеТип = Новый Соответствие;
		КонецЕсли;
		
		СоответствиеТип.Вставить(status,Описание);
		СоответствияСтатусов.Вставить(attachmentType,СоответствиеТип);
	КонецЦикла;
	
	Возврат СоответствияСтатусов;

КонецФункции

Функция Диадок_ПолучитьСтатусДокумента(СоответствияСтатусов,attachmentType,status)
	
	СоответствиеТип = СоответствияСтатусов.Получить(attachmentType);
	Если СоответствиеТип <> Неопределено Тогда
		Описание = СоответствиеТип.Получить(status);
	КонецЕсли;
	
	Возврат ?(Описание = Неопределено,"Неопределен",Описание);
	
КонецФункции


Функция СБИС_ИнициализироватьСоответствияСтатусов() Экспорт
	
	СоответствияСтатусов = Новый Соответствие;
	
	Макет = ПолучитьМакет("СтатусыСБИС");
	Область = Макет.ПолучитьОбласть("Статусы");
	
	Для Сч = 1 По Область.ВысотаТаблицы Цикл
		status = ПолучитьТекстЯчейкиОбласти(Область,Сч,1);
		Описание = ПолучитьТекстЯчейкиОбласти(Область,Сч,2);
		
		СоответствияСтатусов.Вставить(status,Описание);
	КонецЦикла;
	
	Возврат СоответствияСтатусов;
	
КонецФункции

Функция СБИС_ПолучитьСтатусДокумента(СоответствияСтатусов,status)
	Описание = СоответствияСтатусов.Получить(status);	
	Возврат ?(Описание = Неопределено,"Неопределен",Описание);
КонецФункции


// ================= Заполнение табличных частей ===================

Функция ЗаполнитьНаправленияСоздаваемыхДокументов(АдресХранилищаДанныхПортала,СтруктураНастроек) Экспорт
	
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
		
	Для Каждого СтрокаДокумента Из СписокДокументов Цикл
		
		//Обрабатываются только строки документов, не задания распознавания
		Если СтрокаДокумента.recognitionTaskId <> "" Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеДокумента = ДанныеПортала.documents.Найти(СтрокаДокумента.ДокументИД,"id");
		
		СтрокаДокумента.НаправлениеСоздаваемогоДокумента = ОпределитьНаправлениеСоздаваемогоДокумента(ДанныеДокумента,СтруктураНастроек);
		
	КонецЦикла;
	
КонецФункции

Функция ОпределитьНаправлениеСоздаваемогоДокумента(ДанныеДокумента,СтруктураНастроек) Экспорт
	
	Если СтруктураНастроек.СозданиеДокумента_Направление = "Входящий" Тогда
		Результат = "Входящий";
		
	ИначеЕсли СтруктураНастроек.СозданиеДокумента_Направление = "Исходящий" Тогда
		Результат = "Исходящий";
		
	ИначеЕсли СтруктураНастроек.СозданиеДокумента_Направление = "Автоопределение" Тогда
		
		//определяем по вхождению Плательщика или Поставщика в справочник Организации по ИНН
		Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.Организации_ИмяРеквизитаИНН) Тогда
				
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	""Входящий"" КАК Направление
			               |ИЗ
			               |	Справочник.Организации КАК Организации
			               |ГДЕ
			               |	НЕ Организации.ПометкаУдаления
			               |	И Организации.ИНН = &ИННПлательщика
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	""Исходящий""
			               |ИЗ
			               |	Справочник.Организации КАК Организации
			               |ГДЕ
			               |	НЕ Организации.ПометкаУдаления
			               |	И Организации.ИНН = &ИННПоставщика";
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"Организации.ИНН","Организации." + СтруктураНастроек.СведенияОКонфигурации.Организации_ИмяРеквизитаИНН);
			
			Если СтруктураНастроек.РегионПространства = "KAZ" Тогда
				Запрос.УстановитьПараметр("ИННПлательщика",ДанныеДокумента.customerTaxId);
				Запрос.УстановитьПараметр("ИННПоставщика",ДанныеДокумента.supplierTaxId);
			Иначе
				Запрос.УстановитьПараметр("ИННПлательщика",ДанныеДокумента.customerInn);
				Запрос.УстановитьПараметр("ИННПоставщика",ДанныеДокумента.supplierInn);
			КонецЕсли;
			
			Выгрузка = Запрос.Выполнить().Выгрузить();
			
			Если Выгрузка.Количество() = 1 Тогда
				Результат = Выгрузка[0].Направление;
				
			Иначе
				//E1C-49: Описание: для автоопределения направления на чеках оно не срабатывает т.к. не распознан покупатель, его в чеке нет,
				//нужно все-равно ставить направление входящий, исходящим при автоопределении делаем если только в качестве поставщика твоя организация
				Если ДанныеДокумента.type = "RECEIPT" Тогда
					Результат = "Входящий";
					
				Иначе			
					//Организация не найдена или обе компании присутствуют как организация в базе, отдаем направление на выбор пользователю
					Результат = Неопределено;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьЗагружаемыеДокументыНаДубли(АдресХранилищаДанныхПортала,СтруктураНастроек,ДопПараметры) Экспорт
	
	//Функция переехала в модуль объекта из модулей форм ОФ и УФ
	РезультатПроверки = Новый Структура("Успешно,ТекстОшибки",Истина);
	
	СтрокиДокументов = СписокДокументов.НайтиСтроки(Новый Структура("Пометка",Истина));
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	Если ДанныеПортала = Неопределено Тогда
		РезультатПроверки.Успешно = Ложь;
		РезультатПроверки.ТекстОшибки = "С портала не были получены данные о документах, операция прервана";
		
		Возврат РезультатПроверки;
	КонецЕсли;
	
	СтруктураКолонок = Новый Структура("Пометка,ДокументИД,ДокументТип,ПредставлениеДокумента,НомерДокумента,ДатаДокумента,СуммаДокумента,КонтрагентСсылка,ДубликатСсылка");
	ТаблицаНайденныхДубликатов = ИнициализироватьТаблицуПоСтруктуреКолонок(СтруктураКолонок);
	
	//E1C-227: свой обработчик поиска ссылки на дубликат загружаемого документа
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("СтрокиДокументов",СтрокиДокументов);
	ПараметрыМК.Вставить("ДанныеПортала",ДанныеПортала);
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыМК.Вставить("ДопПараметры",ДопПараметры);
	ПараметрыМК.Вставить("ТаблицаНайденныхДубликатов",ТаблицаНайденныхДубликатов);
	ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
			
	МодульКастомизации_ОбработатьСобытие("Дубликаты_ПередЗаполнениемТаблицыДубликатов",ПараметрыМК);
	
	Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
	// ) E1C-227
	
		Для Каждого СтрокаДокумента Из СтрокиДокументов Цикл
			
			Если ДопПараметры.АвтоопределениеТипа = Истина Тогда
				Если СтрокаДокумента.ДокументТип = "OFFER" Тогда
					ИмяТипаДокумента = СтруктураНастроек.ТипДокумента_Счет;
					
				ИначеЕсли СтрокаДокумента.ДокументТип = "CERTIFICATE" Тогда
					ИмяТипаДокумента = СтруктураНастроек.ТипДокумента_Акт;
					
				Иначе
					ИмяТипаДокумента = СтруктураНастроек.ТипДокумента_Поступление;
					
				КонецЕсли;
				
			Иначе
				//Теперь у нас тип документа может быть выбран пользователем
				ИмяТипаДокумента = ДопПараметры.ТипСоздаваемогоДокумента;
			КонецЕсли;
			
			ДанныеДокументаПортала = ДанныеПортала.documents.Найти(СтрокаДокумента.ДокументИД,"id");
					
			//Самопроверка
			Если ДанныеДокументаПортала = Неопределено Тогда
				ДополнитьТекстОшибки(РезультатПроверки.ТекстОшибки,"- в данных портала не найдены данные шапки документа (" + СтрокаДокумента.ДокументИД + ")");
				Прервать;
			КонецЕсли;
			
			//E1C-513: Существующий документ может присутствовать в табличной части будучи созданным в текущем сеансе или связанным вручную
			Если ЗначениеЗаполнено(ДанныеДокументаПортала.ДокументСсылка) Тогда
				СуществующийДокумент = ДанныеДокументаПортала.ДокументСсылка;
			ИначеЕсли ЗначениеЗаполнено(СтрокаДокумента.Документ1с) Тогда
				СуществующийДокумент = СтрокаДокумента.Документ1с;
			Иначе
				СуществующийДокумент = Неопределено;
			КонецЕсли;
			
			//E1C-227: свой обработчик поиска ссылки на дубликат загружаемого документа
			ПараметрыМК = Новый Структура;
			ПараметрыМК.Вставить("ДокументИД",СтрокаДокумента.ДокументИД);
			ПараметрыМК.Вставить("ИмяТипаДокумента",ИмяТипаДокумента);
			ПараметрыМК.Вставить("ДанныеПортала",ДанныеПортала);
			ПараметрыМК.Вставить("ДанныеДокументаПортала",ДанныеДокументаПортала);
			ПараметрыМК.Вставить("СуществующийДокумент",СуществующийДокумент);
			ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
			ПараметрыМК.Вставить("ДубликатСсылка",Неопределено);
			ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
					
			МодульКастомизации_ОбработатьСобытие("Дубликаты_УстановкаСсылки",ПараметрыМК);
					
			Если ЗначениеЗаполнено(ПараметрыМК.ДубликатСсылка) Тогда
				ДобавитьСтрокуВТаблицуДубликатов(ТаблицаНайденныхДубликатов,ДанныеДокументаПортала,ПараметрыМК.ДубликатСсылка,ДанныеДокументаПортала);
			КонецЕсли;
			
			Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
			// ) E1C-227
			
				Если СтрокаДокумента.НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
					//входящие документы предполагают наличие реквизитов Номер/Дата входящего документа, выполняем контроль по ним и контрагенту
					
					//Ссылка на поставщика еще может быть не заполнена
					Если Не ЗначениеЗаполнено(ДанныеДокументаПортала.ПоставщикСсылка) Тогда
						ПоляПоискаПоставщик = Новый Структура("ИНН,КПП,ИдентификационныйКодЛичности,Наименование,НаименованиеПолное",ДанныеДокументаПортала.supplierInn,ДанныеДокументаПортала.supplierKpp,ДанныеДокументаПортала.supplierTaxId,ДанныеДокументаПортала.supplierShortName,ДанныеДокументаПортала.supplierName);
						ДанныеДокументаПортала.ПоставщикСсылка = ПолучитьСсылку_КонтрагентОрганизацияПоИННКПП("Контрагенты",ПоляПоискаПоставщик,СтруктураНастроек);
					КонецЕсли;
					
					//Ссылка на плательщика еще может быть не заполнена
					Если Не ЗначениеЗаполнено(ДанныеДокументаПортала.ПлательщикСсылка) Тогда
						Если ЗначениеЗаполнено(СтруктураНастроек.ЗаполнениеШапки_ОрганизацияПоУмолчанию) Тогда
							ДанныеДокументаПортала.ПлательщикСсылка = СтруктураНастроек.ЗаполнениеШапки_ОрганизацияПоУмолчанию;
						Иначе
							ПоляПоискаПлательщик = Новый Структура("ИНН,КПП,ИдентификационныйКодЛичности,Наименование,НаименованиеПолное",ДанныеДокументаПортала.customerInn,ДанныеДокументаПортала.customerKpp,ДанныеДокументаПортала.customerTaxId,ДанныеДокументаПортала.customerShortName,ДанныеДокументаПортала.customerName);
							ДанныеДокументаПортала.ПлательщикСсылка = ПолучитьСсылку_КонтрагентОрганизацияПоИННКПП(СтруктураНастроек.СведенияОКонфигурации.Организации_ИмяСправочника,ПоляПоискаПлательщик,СтруктураНастроек);
						КонецЕсли;
					КонецЕсли;
					
					//Обрабатываем логику связанных комплектов документов
					Если СтруктураНастроек.Свойство("СозданиеДокумента_ИспользоватьПоискКомплектов")
						И СтруктураНастроек.СозданиеДокумента_ИспользоватьПоискКомплектов = Истина Тогда
						
						//Счета-фактуры ищем среди счетов-фактур, их основания - по выбранному типу
						Если СтрокаДокумента.ДокументТип = "VAT_INVOICE" Тогда
							Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.СчетФактураПолученный) Тогда
													
								ПараметрыПоиска = Новый Структура;
								ПараметрыПоиска.Вставить("Номер",ДанныеДокументаПортала.number);
								ПараметрыПоиска.Вставить("Дата",ДанныеДокументаПортала.date);
								
								//E1C-507: Номер, Дата, Сумма документа
								Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Номер, Дата, Сумма документа" Тогда 
									ПараметрыПоиска.Вставить("Сумма",ДанныеДокументаПортала.amount);
								Иначе
									ПараметрыПоиска.Вставить("Контрагент",ДанныеДокументаПортала.ПоставщикСсылка);
								КонецЕсли;
								
								Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Контрагент, Номер, Дата, Сумма документа" Тогда 
									ПараметрыПоиска.Вставить("Сумма",ДанныеДокументаПортала.amount);
								КонецЕсли;
								
								Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Плательщик, Контрагент, Номер, Дата документа" Тогда 
									ПараметрыПоиска.Вставить("Организация",ДанныеДокументаПортала.ПлательщикСсылка);
								КонецЕсли;
								
								ДубликатСсылка = ПолучитьСсылку_ДокументПоПараметрамВходящегоДокумента(СтруктураНастроек.СведенияОКонфигурации.СчетФактураПолученный,ПараметрыПоиска,СуществующийДокумент);
								
								Если ЗначениеЗаполнено(ДубликатСсылка) Тогда
									ДобавитьСтрокуВТаблицуДубликатов(ТаблицаНайденныхДубликатов,ДанныеДокументаПортала,ДубликатСсылка,ДанныеДокументаПортала);
								КонецЕсли;
								
								//Если у текущего документа есть parent, то используем для поиска его номер и дату
								Если ЗначениеЗаполнено(ДанныеДокументаПортала.parent) Тогда
									СвязанныйДокумент = ДанныеПортала.documents.Найти(ДанныеДокументаПортала.parent,"id");
								
									Если СвязанныйДокумент <> Неопределено Тогда
																	
										ПараметрыПоиска = Новый Структура;
										ПараметрыПоиска.Вставить("Номер",СвязанныйДокумент.number);
										ПараметрыПоиска.Вставить("Дата",СвязанныйДокумент.date);
										
										//E1C-507: Номер, Дата, Сумма документа
										Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Номер, Дата, Сумма документа" Тогда 
											ПараметрыПоиска.Вставить("Сумма",ДанныеДокументаПортала.amount);
										Иначе
											ПараметрыПоиска.Вставить("Контрагент",ДанныеДокументаПортала.ПоставщикСсылка);
										КонецЕсли;
										
										Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Контрагент, Номер, Дата, Сумма документа" Тогда 
											ПараметрыПоиска.Вставить("Сумма",ДанныеДокументаПортала.amount);
										КонецЕсли;
										
										Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Плательщик, Контрагент, Номер, Дата документа" Тогда 
											ПараметрыПоиска.Вставить("Организация",ДанныеДокументаПортала.ПлательщикСсылка);
										КонецЕсли;
								
										//Повторяем поиск, но уже с номером/датой связанного документа, Контрагент определен ранее
										ДубликатСсылка = ПолучитьСсылку_ДокументПоПараметрамВходящегоДокумента(ИмяТипаДокумента,ПараметрыПоиска,СвязанныйДокумент.ДокументСсылка);
										
										Если ЗначениеЗаполнено(ДубликатСсылка) Тогда
											ДобавитьСтрокуВТаблицуДубликатов(ТаблицаНайденныхДубликатов,СвязанныйДокумент,ДубликатСсылка,ДанныеДокументаПортала);
										КонецЕсли;
										
									КонецЕсли;
									
								//E1C-503: также поиск по "родительскому" документу должен быть выполнен для E_VAT_INVOICE
								//если заполнены номер и дата esfKzDeliveryDocNum и esfKzDeliveryDocDate 
								ИначеЕсли ЗначениеЗаполнено(ДанныеДокументаПортала.esfKzDeliveryDocNum) И ЗначениеЗаполнено(ДанныеДокументаПортала.esfKzDeliveryDocDate) Тогда
									
									ПараметрыПоиска = Новый Структура;
									ПараметрыПоиска.Вставить("Номер",ДанныеДокументаПортала.esfKzDeliveryDocNum);
									ПараметрыПоиска.Вставить("Дата",ДанныеДокументаПортала.esfKzDeliveryDocDate);
									
									//E1C-507: Номер, Дата, Сумма документа
									Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Номер, Дата, Сумма документа" Тогда 
										ПараметрыПоиска.Вставить("Сумма",ДанныеДокументаПортала.amount);
									Иначе
										ПараметрыПоиска.Вставить("Контрагент",ДанныеДокументаПортала.ПоставщикСсылка);
									КонецЕсли;
									
									Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Контрагент, Номер, Дата, Сумма документа" Тогда 
										ПараметрыПоиска.Вставить("Сумма",ДанныеДокументаПортала.amount);
									КонецЕсли;
									
									Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Плательщик, Контрагент, Номер, Дата документа" Тогда 
										ПараметрыПоиска.Вставить("Организация",ДанныеДокументаПортала.ПлательщикСсылка);
									КонецЕсли;
							
									//Повторяем поиск, но уже с номером/датой связанного документа, Контрагент определен ранее
									ДубликатСсылка = ПолучитьСсылку_ДокументПоПараметрамВходящегоДокумента(ИмяТипаДокумента,ПараметрыПоиска,Неопределено);
									
									Если ЗначениеЗаполнено(ДубликатСсылка) Тогда
										ДобавитьСтрокуВТаблицуДубликатов(ТаблицаНайденныхДубликатов,ДанныеДокументаПортала,ДубликатСсылка,ДанныеДокументаПортала);
									КонецЕсли;
									
								КонецЕсли;
								
							КонецЕсли;
						Иначе
							
							//E1C-503: также поиск документа поступления должен быть выполнен для E_VAT_INVOICE
							//если заполнены номер и дата esfKzDeliveryDocNum и esfKzDeliveryDocDate 
							Если ЗначениеЗаполнено(ДанныеДокументаПортала.esfKzDeliveryDocNum) И ЗначениеЗаполнено(ДанныеДокументаПортала.esfKzDeliveryDocDate) Тогда
								ПараметрыПоиска = Новый Структура;
								ПараметрыПоиска.Вставить("Номер",ДанныеДокументаПортала.esfKzDeliveryDocNum);
								ПараметрыПоиска.Вставить("Дата",ДанныеДокументаПортала.esfKzDeliveryDocDate);
							Иначе
								ПараметрыПоиска = Новый Структура;
								ПараметрыПоиска.Вставить("Номер",ДанныеДокументаПортала.number);
								ПараметрыПоиска.Вставить("Дата",ДанныеДокументаПортала.date);
							КонецЕсли;
							
							//E1C-507: Номер, Дата, Сумма документа
							Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Номер, Дата, Сумма документа" Тогда 
								ПараметрыПоиска.Вставить("Сумма",ДанныеДокументаПортала.amount);
							Иначе
								ПараметрыПоиска.Вставить("Контрагент",ДанныеДокументаПортала.ПоставщикСсылка);
							КонецЕсли;
							
							Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Контрагент, Номер, Дата, Сумма документа" Тогда 
								ПараметрыПоиска.Вставить("Сумма",ДанныеДокументаПортала.amount);
							КонецЕсли;
							
							Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Плательщик, Контрагент, Номер, Дата документа" Тогда 
								ПараметрыПоиска.Вставить("Организация",ДанныеДокументаПортала.ПлательщикСсылка);
							КонецЕсли;
							
							ДубликатСсылка = ПолучитьСсылку_ДокументПоПараметрамВходящегоДокумента(ИмяТипаДокумента,ПараметрыПоиска,СуществующийДокумент);
						
							Если ЗначениеЗаполнено(ДубликатСсылка) Тогда
								ДобавитьСтрокуВТаблицуДубликатов(ТаблицаНайденныхДубликатов,ДанныеДокументаПортала,ДубликатСсылка,ДанныеДокументаПортала);
							КонецЕсли;
							
							//Если у текущего документа есть children, то используем для поиска его номер и дату
							Если ЗначениеЗаполнено(ДанныеДокументаПортала.children) Тогда
								СвязанныйДокумент = ДанныеПортала.documents.Найти(ДанныеДокументаПортала.children,"id");
								
								Если СвязанныйДокумент <> Неопределено Тогда
									
									//Дочерний документ по логике портала - только счет-фактура
									Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.СчетФактураПолученный) Тогда
										
										ПараметрыПоиска = Новый Структура;
										ПараметрыПоиска.Вставить("Номер",СвязанныйДокумент.number);
										ПараметрыПоиска.Вставить("Дата",СвязанныйДокумент.date);
										
										//E1C-507: Номер, Дата, Сумма документа
										Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Номер, Дата, Сумма документа" Тогда 
											ПараметрыПоиска.Вставить("Сумма",ДанныеДокументаПортала.amount);
										Иначе
											ПараметрыПоиска.Вставить("Контрагент",ДанныеДокументаПортала.ПоставщикСсылка);
										КонецЕсли;
										
										Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Контрагент, Номер, Дата, Сумма документа" Тогда 
											ПараметрыПоиска.Вставить("Сумма",ДанныеДокументаПортала.amount);
										КонецЕсли;
										
										Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Плательщик, Контрагент, Номер, Дата документа" Тогда 
											ПараметрыПоиска.Вставить("Организация",ДанныеДокументаПортала.ПлательщикСсылка);
										КонецЕсли;
										
										ДубликатСсылка = ПолучитьСсылку_ДокументПоПараметрамВходящегоДокумента(СтруктураНастроек.СведенияОКонфигурации.СчетФактураПолученный,ПараметрыПоиска,СвязанныйДокумент.ДокументСсылка);
																
										Если ЗначениеЗаполнено(ДубликатСсылка) Тогда
											ДобавитьСтрокуВТаблицуДубликатов(ТаблицаНайденныхДубликатов,СвязанныйДокумент,ДубликатСсылка,ДанныеДокументаПортала);
										КонецЕсли;
										
									КонецЕсли;
									
								КонецЕсли;
								
							КонецЕсли;
								
						КонецЕсли;
						
					Иначе
						//2020.06.30 ( счета-фактуры тоже проверяем на дубликаты, не только основания
						Если СтрокаДокумента.ДокументТип = "VAT_INVOICE" Тогда
							Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.СчетФактураПолученный) Тогда
								ИмяТипаДокумента = СтруктураНастроек.СведенияОКонфигурации.СчетФактураПолученный;
							КонецЕсли;
						КонецЕсли;
						// ) 2020.06.30
						
						ПараметрыПоиска = Новый Структура;
						ПараметрыПоиска.Вставить("Номер",ДанныеДокументаПортала.number);
						ПараметрыПоиска.Вставить("Дата",ДанныеДокументаПортала.date);
						
						//E1C-507: Номер, Дата, Сумма документа
						Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Номер, Дата, Сумма документа" Тогда 
							ПараметрыПоиска.Вставить("Сумма",ДанныеДокументаПортала.amount);
						Иначе
							ПараметрыПоиска.Вставить("Контрагент",ДанныеДокументаПортала.ПоставщикСсылка);
						КонецЕсли;
						
						Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Контрагент, Номер, Дата, Сумма документа" Тогда 
							ПараметрыПоиска.Вставить("Сумма",ДанныеДокументаПортала.amount);
						КонецЕсли;
						
						Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Плательщик, Контрагент, Номер, Дата документа" Тогда 
							ПараметрыПоиска.Вставить("Организация",ДанныеДокументаПортала.ПлательщикСсылка);
						КонецЕсли;
						
						//Исходная логика поиска дубликатов
						ДубликатСсылка = ПолучитьСсылку_ДокументПоПараметрамВходящегоДокумента(ИмяТипаДокумента,ПараметрыПоиска,СуществующийДокумент);
						
						Если ЗначениеЗаполнено(ДубликатСсылка) Тогда
							ДобавитьСтрокуВТаблицуДубликатов(ТаблицаНайденныхДубликатов,ДанныеДокументаПортала,ДубликатСсылка,ДанныеДокументаПортала);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли; //МК: Стандартная обработка Дубликаты_УстановкаСсылки
		КонецЦикла;
		
	КонецЕсли; //МК: Стандартная обработка Дубликаты_ПередЗаполнениемТаблицыДубликатов
	
	Если ТаблицаНайденныхДубликатов.Количество() > 0 Тогда
		РезультатПроверки.Успешно = Ложь;
		РезультатПроверки.Вставить("АдресВХ",ПоместитьВоВременноеХранилище(ТаблицаНайденныхДубликатов));
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

Функция ПолучитьСсылку_ДокументПоНомеруДатеВходящегоДокумента(ТипДокумента,Контрагент,Номер,Дата,СуществующийДокумент) Экспорт
	
	//Функция устарела и больше не используется, оставлена для обратной совместимости при вызове из модуля кастомизации.
	//Используется вызов функции ПолучитьСсылку_ДокументПоПараметрамВходящегоДокумента
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("Контрагент",Контрагент);
	ПараметрыПоиска.Вставить("Номер",Номер);
	ПараметрыПоиска.Вставить("Дата",Дата);
	
	Результат = ПолучитьСсылку_ДокументПоПараметрамВходящегоДокумента(ТипДокумента,ПараметрыПоиска,СуществующийДокумент);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСсылку_ДокументПоПараметрамВходящегоДокумента(ТипДокумента,ПараметрыПоиска,СуществующийДокумент) Экспорт
	
	Перем Организация,Контрагент,Номер,Дата,Сумма;
	
	ПараметрыПоиска.Свойство("Организация",Организация);
	ПараметрыПоиска.Свойство("Контрагент",Контрагент);
	ПараметрыПоиска.Свойство("Номер",Номер);
	ПараметрыПоиска.Свойство("Дата",Дата);
	ПараметрыПоиска.Свойство("Сумма",Сумма);	
	
	Если ЗначениеЗаполнено(Номер)
		И ЗначениеЗаполнено(Дата) Тогда
		
		//В КА2, УТ11, ERP нумерация СФП выполняется в номере самого документа, а не НомерВходящегоДокумента/ДатаВходящегоДокумента,
		//+++ чтобы каждый раз не дергать метаданные, можно перенести это условие в форму настроек
		Если ТипДокумента = "СчетФактураПолученный" Тогда
			Если ЗначениеЗаполнено(Контрагент) Тогда
				Если Метаданные.Документы[ТипДокумента].Реквизиты.Найти("Контрагент") <> Неопределено Тогда
					ИмяРеквизитаКонтрагент = "Контрагент";
				КонецЕсли;
			КонецЕсли;
			
			Если Метаданные.Документы[ТипДокумента].Реквизиты.Найти("НомерВходящегоДокумента") <> Неопределено Тогда
				ИмяРеквизитаНомерВходящегоДокумента = "НомерВходящегоДокумента"
			Иначе
				ИмяРеквизитаНомерВходящегоДокумента = "Номер";
			КонецЕсли;
			
			Если Метаданные.Документы[ТипДокумента].Реквизиты.Найти("ДатаВходящегоДокумента") <> Неопределено Тогда
				ИмяРеквизитаДатаВходящегоДокумента = "ДатаВходящегоДокумента"
			Иначе
				ИмяРеквизитаДатаВходящегоДокумента = "Дата";
			КонецЕсли;
			
		Иначе
			Если ПараметрыПоиска.Свойство("Контрагент") Тогда
				Если Метаданные.Документы[ТипДокумента].Реквизиты.Найти("Контрагент") <> Неопределено Тогда
					ИмяРеквизитаКонтрагент = "Контрагент";
				КонецЕсли;
			КонецЕсли;
			
			Если Метаданные.Документы[ТипДокумента].Реквизиты.Найти("НомерВходящегоДокумента") <> Неопределено Тогда
				ИмяРеквизитаНомерВходящегоДокумента = "НомерВходящегоДокумента";
			ИначеЕсли Метаданные.Документы[ТипДокумента].Реквизиты.Найти("НомерПоДаннымПоставщика") <> Неопределено Тогда
				ИмяРеквизитаНомерВходящегоДокумента = "НомерПоДаннымПоставщика";
			ИначеЕсли Метаданные.Документы[ТипДокумента].Реквизиты.Найти("ВхДокНомер") <> Неопределено Тогда
				ИмяРеквизитаНомерВходящегоДокумента = "ВхДокНомер";
			КонецЕсли;
			
			Если Метаданные.Документы[ТипДокумента].Реквизиты.Найти("ДатаВходящегоДокумента") <> Неопределено Тогда
				ИмяРеквизитаДатаВходящегоДокумента = "ДатаВходящегоДокумента";
			ИначеЕсли Метаданные.Документы[ТипДокумента].Реквизиты.Найти("ДатаПоДаннымПоставщика") <> Неопределено Тогда
				ИмяРеквизитаДатаВходящегоДокумента = "ДатаПоДаннымПоставщика";
			ИначеЕсли Метаданные.Документы[ТипДокумента].Реквизиты.Найти("ВхДокДата") <> Неопределено Тогда
				ИмяРеквизитаДатаВходящегоДокумента = "ВхДокДата";
			КонецЕсли;
			
			Если ПараметрыПоиска.Свойство("Сумма") Тогда
				Если Метаданные.Документы[ТипДокумента].Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
					ИмяРеквизитаСуммаДокумента = "СуммаДокумента";
				ИначеЕсли Метаданные.Документы[ТипДокумента].Реквизиты.Найти("Сумма") <> Неопределено Тогда
					ИмяРеквизитаСуммаДокумента = "Сумма";
				КонецЕсли;
			КонецЕсли;
			
			Если ПараметрыПоиска.Свойство("Организация") Тогда
				Если Метаданные.Документы[ТипДокумента].Реквизиты.Найти("Организация") <> Неопределено Тогда
					ИмяРеквизитаОрганизация = "Организация";
				ИначеЕсли Метаданные.Документы[ТипДокумента].Реквизиты.Найти("Фирма") <> Неопределено Тогда
					ИмяРеквизитаОрганизация = "Фирма";
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяРеквизитаНомерВходящегоДокумента)
			И ЗначениеЗаполнено(ИмяРеквизитаДатаВходящегоДокумента) Тогда
		
			//В тексте запроса ПТиУ при предыдущем поиске мог быть переопределен на другой тип
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЗаполняемыйДокумент.Ссылка КАК Ссылка
			               |ИЗ
			               |	Документ.ПоступлениеТоваровУслуг КАК ЗаполняемыйДокумент
			               |ГДЕ
			               |	НЕ ЗаполняемыйДокумент.ПометкаУдаления
			               |	И ЗаполняемыйДокумент.НомерВходящегоДокумента В (&НомерВходящегоДокумента)
			               |	И НАЧАЛОПЕРИОДА(ЗаполняемыйДокумент.ДатаВходящегоДокумента, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаВходящегоДокумента, ДЕНЬ)
						   |	И &Контрагент
						   |	И &Организация
						   |	И &СуммаДокумента
			               |	И НЕ ЗаполняемыйДокумент.Ссылка = &СуществующийДокумент";
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПоступлениеТоваровУслуг", ТипДокумента);
			Запрос.Текст = СтрЗаменить(Запрос.Текст,".НомерВходящегоДокумента", "." + ИмяРеквизитаНомерВходящегоДокумента);
			Запрос.Текст = СтрЗаменить(Запрос.Текст,".ДатаВходящегоДокумента", "." + ИмяРеквизитаДатаВходящегоДокумента);
			
			Если ЗначениеЗаполнено(ИмяРеквизитаКонтрагент) Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Контрагент", "ЗаполняемыйДокумент." + ИмяРеквизитаКонтрагент + " = &Контрагент");
				Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Иначе
				Запрос.УстановитьПараметр("Контрагент",Истина);
			КонецЕсли;
			
			//Эти переменные заполнены если переданы сумма/организация документа и соответствующий реквизит в документе присутствует
			Если ЗначениеЗаполнено(ИмяРеквизитаСуммаДокумента) Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"&СуммаДокумента", "ЗаполняемыйДокумент." + ИмяРеквизитаСуммаДокумента + " = &СуммаДокумента");
				Запрос.УстановитьПараметр("СуммаДокумента",Сумма);
			Иначе
				Запрос.УстановитьПараметр("СуммаДокумента",Истина);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ИмяРеквизитаОрганизация) Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Организация", "ЗаполняемыйДокумент." + ИмяРеквизитаОрганизация + " = &Организация");
				Запрос.УстановитьПараметр("Организация",Организация);
			Иначе
				Запрос.УстановитьПараметр("Организация",Истина);
			КонецЕсли;
			
			Запрос.УстановитьПараметр("НомерВходящегоДокумента",ПолучитьМассивВариантовНаписанияНомера(Номер));
			Запрос.УстановитьПараметр("ДатаВходящегоДокумента",Дата);
			Запрос.УстановитьПараметр("СуществующийДокумент",СуществующийДокумент);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Результат = Выборка.Ссылка;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуВТаблицуДубликатов(ТаблицаДубликатов,ДобавляемыйДокумент,ДокументСсылка,ДанныеДокументаПортала) Экспорт
	
	//Связанный документ уже может быть добавлен в таблицу дубликатов, если был отмечен флагом
	Если ТаблицаДубликатов.Найти(ДобавляемыйДокумент.id,"ДокументИД") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = ТаблицаДубликатов.Добавить();
	НоваяСтрока.Пометка = Истина;
	НоваяСтрока.ДокументИД = ДобавляемыйДокумент.id;
	НоваяСтрока.ДокументТип = ДобавляемыйДокумент.type;
	НоваяСтрока.ПредставлениеДокумента = ДобавляемыйДокумент.ПредставлениеДокумента;
	НоваяСтрока.НомерДокумента = ДобавляемыйДокумент.number;
	НоваяСтрока.ДатаДокумента = ДобавляемыйДокумент.date;
	НоваяСтрока.СуммаДокумента = ДобавляемыйДокумент.amount;
	НоваяСтрока.КонтрагентСсылка = ДокументСсылка.Контрагент;
	НоваяСтрока.ДубликатСсылка = ДокументСсылка;
	
	//Снимем флаг у документа-дубликата в списке документов
	НайденнаяСтрока = СписокДокументов.Найти(ДобавляемыйДокумент.id,"ДокументИД");
	Если НайденнаяСтрока <> Неопределено Тогда
		НайденнаяСтрока.Пометка = Ложь;
	КонецЕсли;
	
КонецПроцедуры


Функция ПолучитьМассивВариантовНаписанияНомера(Знач Номер) Экспорт
	
	//Номер с буквами, имеющими одинаковое написание в латинице и кириллице, может быть распознан в раскладке,
	//отличающейся от той, в которой он был введен в 1с, сформируем варинты возможных написаний номера
	Соответствия = ПолучитьСоответствияКириллицыЛатиницы();
	
	//Сам исходный распознанный номер нам тоже нужен
	Результат = Новый Массив;
	Результат.Добавить(Номер);
	
	//E1C-408: При очень длинных строках номера можно словить ошибку "Переполнение стека встроенного языка на сервере",
	//ограничимся длиной строки номера 20 знаков, если больше - ищем только саму строку
	ОграничениеДлиныНомера = 20;
	Если СтрДлина(Номер) <= ОграничениеДлиныНомера Тогда
		//Рекурсивно заполняем различные комбинации номеров с указанными символами
		ДополнитьМассивВариантов(Номер,Результат,Соответствия);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСоответствияКириллицыЛатиницы() Экспорт
	
	//Строка с буквами, имеющими одинаковое написание в латинице и кириллице, может быть распознана в раскладке,
	//отличающейся от той, в которой он был введен в 1с, сформируем варинты возможных написаний номера/артикула:
	//E,T,O,P,A,H,K,X,C,B,M
	//e,y,o,p,a,x,c
	
	Соответствия = Новый Соответствие;
	Соответствия.Вставить("E","Е");
	Соответствия.Вставить("T","Т");
	Соответствия.Вставить("O","О");
	Соответствия.Вставить("P","Р");
	Соответствия.Вставить("A","А");
	Соответствия.Вставить("H","Н");
	Соответствия.Вставить("K","К");
	Соответствия.Вставить("X","Х");
	Соответствия.Вставить("C","С");
	Соответствия.Вставить("B","В");
	Соответствия.Вставить("M","М");
	Соответствия.Вставить("e","е");
	Соответствия.Вставить("y","у");
	Соответствия.Вставить("o","о");
	Соответствия.Вставить("p","р");
	Соответствия.Вставить("a","а");
	Соответствия.Вставить("x","х");
	Соответствия.Вставить("c","с");
	
	//Также предусмотрим обратную ситуацию
	Для Каждого ЭлементСоответствия Из Соответствия Цикл
		Соответствия.Вставить(ЭлементСоответствия.Значение,ЭлементСоответствия.Ключ);
	КонецЦикла;
	
	Возврат Соответствия;
	
КонецФункции

Процедура ДополнитьМассивВариантов(Знач Номер,Массив,Соответствия)
	
	Для Позиция = 1 По СтрДлина(Номер) Цикл		
			
		ТекСимвол = Сред(Номер,Позиция,1);
		Аналог = Соответствия.Получить(ТекСимвол);
		
		Если Аналог <> Неопределено Тогда
			
			НовыйНомер = Лев(Номер,Позиция - 1) + Аналог + Сред(Номер,Позиция + 1);
			
			Если Массив.Найти(НовыйНомер) = Неопределено Тогда
				Массив.Добавить(НовыйНомер);
				ДополнитьМассивВариантов(НовыйНомер,Массив,Соответствия);
			КонецЕсли;			
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


Функция ЗаполнитьТипыСоздаваемыхДокументовВДанныхПортала(АдресХранилищаДанныхПортала,ДопПараметры,СтруктураНастроек) Экспорт
	
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	СтрокиДокументов = СписокДокументов.НайтиСтроки(Новый Структура("Пометка",Истина));
	
	Для Каждого СтрокаДокумента Из СтрокиДокументов Цикл
		
		ДанныеДокумента = ДанныеПортала.documents.Найти(СтрокаДокумента.ДокументИД,"id");
	
		Если ДопПараметры.АвтоопределениеТипа = Истина Тогда
			
			Если СтрокаДокумента.НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
			
				Если ДанныеДокумента.type = "OFFER" Тогда
					ТипСоздаваемогоДокумента = СтруктураНастроек.ТипДокумента_Счет;
					
				ИначеЕсли ДанныеДокумента.type = "CERTIFICATE" Тогда
					ТипСоздаваемогоДокумента = СтруктураНастроек.ТипДокумента_Акт;
					
				ИначеЕсли ДанныеДокумента.type = "RECEIPT" Тогда
					ТипСоздаваемогоДокумента = СтруктураНастроек.ТипДокумента_Чек;
					
				Иначе // все остальные документы заполняем как поступление
					ТипСоздаваемогоДокумента = СтруктураНастроек.ТипДокумента_Поступление;
					
				КонецЕсли;
				
			Иначе
				//2019.02.20 ( По описанию задачи кейс заполнения реализации только один:
				//когда покупатель в документе - это Контрагент, поставщик - Организация
				ТипСоздаваемогоДокумента = СтруктураНастроек.СведенияОКонфигурации.ДокументРеализации;
				
			КонецЕсли;
			
		Иначе
			
			//Пользователь сам выбрал тип создаваемого документа
			ТипСоздаваемогоДокумента = ДопПараметры.ТипСоздаваемогоДокумента;
		КонецЕсли;
		
		ДанныеДокумента.ТипСоздаваемогоДокумента = ТипСоздаваемогоДокумента;
		
		//E1C-407: Может быть передан принудительно задаваемый вид операции для документа
		ДопПараметры.Свойство("ВидОперацииПринудительно",ДанныеДокумента.ВидОперацииПринудительно);
		ДопПараметры.Свойство("СправочникТоварныхПозиций",ДанныеДокумента.СправочникТоварныхПозиций);
		
		//+++ Для типов документов, не предполагающих создание номенклатуры заполнить флаг ТребуетсяСозданиеНоменклатуры = Ложь
		
		//2021.08.04 ( Для ряда документов не требуется указание договора
		Если ТипСоздаваемогоДокумента = "ПеремещениеТоваров"
			Или ТипСоздаваемогоДокумента = "ТребованиеНакладная" Тогда
			ДанныеДокумента.ДоговорНеТребуется = Истина;
		КонецЕсли;		
		// ) 2021.08.04
				
	КонецЦикла;
	
	//Помещаем данные документа обратно во временное хранилище
	ПоместитьВоВременноеХранилище(ДанныеПортала,АдресХранилищаДанныхПортала);
	
КонецФункции

Функция ЗаполнитьТаблицуЗагружаемыхОбъектов(СтруктураНастроек,АдресХранилищаДанныхПортала,ДопПараметры) Экспорт
		
	РезультатЗаполнения = Новый Структура("Успешно,ВсеЭлементыНайдены,ТекстОшибки",Истина,"");
		
	СтрокиДокументов = СписокДокументов.НайтиСтроки(Новый Структура("Пометка",Истина));
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	Если ДанныеПортала = Неопределено Тогда
		РезультатЗаполнения.Успешно = Ложь;
		РезультатЗаполнения.ТекстОшибки = "С портала не были получены данные о документах, операция прервана";
		
		Возврат РезультатЗаполнения;
	КонецЕсли;
	
	//2019.09.03 ( Определить выбранное ранее вручную значение единицы измерения коэффицент пересчета
	ИспользуютсяКоэффициентыПересчета = Ложь;
	Если СтруктураНастроек.ЗаполнениеТЧ_ИспользоватьКоэффициентПересчета Тогда
		//таблица хранится по исходной схеме в настройках текущего пользователя
		СвязьЕдиницы = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СвязьЕдиницыИзмерения");
		Если ТипЗнч(СвязьЕдиницы) = Тип("ТаблицаЗначений")
			И СвязьЕдиницы.Количество() > 0 Тогда
			ИспользуютсяКоэффициентыПересчета = Истина;
		КонецЕсли;
	КонецЕсли;
	// ) 2019.09.03
		
	ЗагружаемыеОбъекты.Очистить();
	ВсеЭлементыНайдены = Истина;
	ПервыйЭлемент = Истина;
	ОбщийТекстОшибки = "";
	
	ПараметрыПоиска = Новый Структура;
		
	// Собрать данные по найденным/создаваемым объектам
	Для Каждого СтрокаДокумента Из СтрокиДокументов Цикл
		
		НаправлениеСоздаваемогоДокумента = СтрокаДокумента.НаправлениеСоздаваемогоДокумента;
		ПараметрыПоиска.Вставить("НаправлениеСоздаваемогоДокумента",НаправлениеСоздаваемогоДокумента);
		ПараметрыПоиска.Вставить("СправочникТоварныхПозиций",ДопПараметры.СправочникТоварныхПозиций);
		
		//2019.02.20 ( предварительно определяем ссылки Контрагентов/Организаций по направлению создаваемого документа
		ПараметрыПоиска.Вставить("documentId",СтрокаДокумента.ДокументИД);
		ВыполнитьПоискСсылокПоДаннымПортала(СтруктураНастроек,ДанныеПортала,ПараметрыПоиска);
		// ) 2019.02.20
				
		ТекстОшибки = "";
		
		ДанныеДокументаПортала = ДанныеПортала.documents.Найти(СтрокаДокумента.ДокументИД,"id");
		ДанныеНоменклатурыПортала = ДанныеПортала.documentItems.НайтиСтроки(Новый Структура("documentId",СтрокаДокумента.ДокументИД));
		
		//E1C-292: обозначим первый документ в списке как основной из объединяемых для получения из него данных шапки
		Если ПервыйЭлемент Тогда
			ДанныеДокументаПортала.СодержитДанныеШапкиОбъединенногоДокумента = Истина;
			ПервыйЭлемент = Ложь;
		Иначе
			ДанныеДокументаПортала.СодержитДанныеШапкиОбъединенногоДокумента = Ложь;
		КонецЕсли;
		
		//Самопроверка
		Если ДанныеДокументаПортала = Неопределено Тогда
			ДополнитьТекстОшибки(ТекстОшибки,"- в данных портала не найдены данные шапки документа");
		КонецЕсли;
		Если ДанныеНоменклатурыПортала.Количество() = 0 Тогда
			ДополнитьТекстОшибки(ТекстОшибки,"- в данных портала не найдена номенклатура документа");
		КонецЕсли;
		
		ПараметрыДополнения = Новый Структура;
		ПараметрыДополнения.Вставить("СтруктураНастроек",СтруктураНастроек);
		ПараметрыДополнения.Вставить("НаправлениеСоздаваемогоДокумента",НаправлениеСоздаваемогоДокумента);
		ПараметрыДополнения.Вставить("СтрокаДокумента",СтрокаДокумента);
		ПараметрыДополнения.Вставить("ДанныеДокументаПортала",ДанныеДокументаПортала);
		ПараметрыДополнения.Вставить("ДанныеНоменклатурыПортала",ДанныеНоменклатурыПортала);
				
		//E1C-91: реквизиты документа в окно сопоставления
		ДополнитьТаблицуЗагружаемыхОбъектов("Документ","Документ",СтрокаДокумента.ДокументИД,ДанныеДокументаПортала.ПредставлениеДокумента,Неопределено,Неопределено,СтрокаДокумента.ДокументИД,ПараметрыДополнения);
		
		//Поля шапки документа
		Если НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
			ДополнитьТаблицуЗагружаемыхОбъектов("Организации","Плательщик",ДанныеДокументаПортала.customerId,ДанныеДокументаПортала.ПредставлениеПлательщика,ДанныеДокументаПортала.ПлательщикСсылка,СтрокаДокумента.ПредставлениеДокумента,СтрокаДокумента.ДокументИД,ПараметрыДополнения);
			ДополнитьТаблицуЗагружаемыхОбъектов("Контрагенты","Поставщик",ДанныеДокументаПортала.supplierId,ДанныеДокументаПортала.ПредставлениеПоставщика,ДанныеДокументаПортала.ПоставщикСсылка,СтрокаДокумента.ПредставлениеДокумента,СтрокаДокумента.ДокументИД,ПараметрыДополнения);
						
			//2019.05.24 ( обрабатываем данные о банковском счете для контрагентов-поставщиков
			Если СтруктураНастроек.ЗаполнениеШапки_СоздаватьБанковскийСчетКонтрагента = Истина Тогда
				Если ЗначениеЗаполнено(ДанныеДокументаПортала.supplierAccountBic) И ЗначениеЗаполнено(ДанныеДокументаПортала.supplierAccountNumber) Тогда
					ПредставлениеБанковскогоСчета = ДанныеДокументаПортала.supplierAccountNumber + ?(ЗначениеЗаполнено(ДанныеДокументаПортала.supplierAccountBankName)," (" + ДанныеДокументаПортала.supplierAccountBankName + ")","");
					ДополнитьТаблицуЗагружаемыхОбъектов("БанковскиеСчета","Банковский счет",ДанныеДокументаПортала.supplierAccountNumber,ПредставлениеБанковскогоСчета,ДанныеДокументаПортала.БанковскийСчетКонтрагентаСсылка,СтрокаДокумента.ПредставлениеДокумента,СтрокаДокумента.ДокументИД,ПараметрыДополнения);
				КонецЕсли;
			КонецЕсли;
			// ) 2019.05.24
		Иначе
			ДополнитьТаблицуЗагружаемыхОбъектов("Организации","Поставщик",ДанныеДокументаПортала.supplierId,ДанныеДокументаПортала.ПредставлениеПоставщика,ДанныеДокументаПортала.ПоставщикСсылка,СтрокаДокумента.ПредставлениеДокумента,СтрокаДокумента.ДокументИД,ПараметрыДополнения);
			ДополнитьТаблицуЗагружаемыхОбъектов("Контрагенты","Плательщик",ДанныеДокументаПортала.customerId,ДанныеДокументаПортала.ПредставлениеПлательщика,ДанныеДокументаПортала.ПлательщикСсылка,СтрокаДокумента.ПредставлениеДокумента,СтрокаДокумента.ДокументИД,ПараметрыДополнения);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДанныеДокументаПортала.ПоставщикСсылка)
			Или Не ЗначениеЗаполнено(ДанныеДокументаПортала.ПлательщикСсылка) Тогда
			ВсеЭлементыНайдены = Ложь;
		КонецЕсли;
		
		//2018.12.17 ( Нужно вызвать окно создания объектов, если нужно создавать договор и он не заполнен
		Если СтруктураНастроек.ЗаполнениеШапки_СоздаватьДоговор И ЗначениеЗаполнено(СтруктураНастроек.ЗаполнениеШапки_НаименованиеНовогоДоговора)
			И ЗначениеЗаполнено(ДанныеДокументаПортала.ПоставщикСсылка) И Не ЗначениеЗаполнено(ДанныеДокументаПортала.ДоговорСсылка) Тогда
			ВсеЭлементыНайдены = Ложь;
		КонецЕсли;
		// ) 2018.12.17
		
		//Данные договора
		Если СтруктураНастроек.ЗаполнениеШапки_РучноеРедактированиеДоговора = Истина Тогда
			ДополнитьТаблицуЗагружаемыхОбъектов("Договоры","Договор",ДанныеДокументаПортала.id,ДанныеДокументаПортала.ПредставлениеДоговора,ДанныеДокументаПортала.ДоговорСсылка,СтрокаДокумента.ПредставлениеДокумента,СтрокаДокумента.ДокументИД,ПараметрыДополнения);
		КонецЕсли;
				
		//2019.09.03 ( Определить выбранное ранее вручную значение единицы измерения коэффицент пересчета
		Если ИспользуютсяКоэффициентыПересчета Тогда
			ПараметрыДополнения.Вставить("СвязьЕдиницы",СвязьЕдиницы);
		КонецЕсли;
		// ) 2019.09.03
		
		//2020.09.01 ( добавляем документы без таблицы номенклатуры
		ИспользуетсяНоменклатура = ЗаполняемыйДокумент_ИспользуетсяНоменклатура(ДанныеДокументаПортала.ТипСоздаваемогоДокумента,СтруктураНастроек);
		
		Если ИспользуетсяНоменклатура Тогда
		// ) 2020.09.01
		
		    //2020.10.07 (
			ТребуетсяСозданиеНоменклатуры = ЗаполняемыйДокумент_ТребуетсяСозданиеНоменклатуры(ДанныеДокументаПортала.ТипСоздаваемогоДокумента,СтруктураНастроек);
			ПараметрыДополнения.Вставить("ТребуетсяСозданиеНоменклатуры",ТребуетсяСозданиеНоменклатуры);
			// ) 2020.10.07		
		
			//Поля табличной части
			Для Каждого СтрокаНоменклатуры Из ДанныеНоменклатурыПортала Цикл
				
				ПараметрыДополнения.Вставить("СтрокаНоменклатуры",СтрокаНоменклатуры);
				
				//E1C-407: Основные средства
				Если ДанныеДокументаПортала.СправочникТоварныхПозиций = "ОсновныеСредства" Тогда
					ДополнитьТаблицуЗагружаемыхОбъектов("ОсновныеСредства","Основное средство",СтрокаНоменклатуры.id,СтрокаНоменклатуры.name,СтрокаНоменклатуры.ОсновноеСредствоСсылка,СтрокаДокумента.ПредставлениеДокумента,СтрокаДокумента.ДокументИД,ПараметрыДополнения);
					
					Если Не ЗначениеЗаполнено(СтрокаНоменклатуры.ОсновноеСредствоСсылка)
						Или Не ЗначениеЗаполнено(СтрокаНоменклатуры.ОсновноеСредствоСсылка) Тогда
						ВсеЭлементыНайдены = Ложь;
					КонецЕсли;
					
				Иначе				
					ДополнитьТаблицуЗагружаемыхОбъектов("Номенклатура","Номенклатура",СтрокаНоменклатуры.id,СтрокаНоменклатуры.name,СтрокаНоменклатуры.НоменклатураСсылка,СтрокаДокумента.ПредставлениеДокумента,СтрокаДокумента.ДокументИД,ПараметрыДополнения); //ИНН дописываем для сохранения связи наименования номенклатуры с поставщиком
					
					Если Не ЗначениеЗаполнено(СтрокаНоменклатуры.НоменклатураСсылка)
						Или Не ЗначениеЗаполнено(СтрокаНоменклатуры.ЕдиницаИзмеренияСсылка) Тогда
						ВсеЭлементыНайдены = Ложь;
					КонецЕсли;
								
					//E1C-477: По включенной настройке используем либо данные "Источника происхождения", либо стандартные данные ГТД
					Если СтруктураНастроек.ЗаполнениеТЧ_ЗаполнятьДанныеИсточникПроисхождения = Истина Тогда
												
						//2.1)  Если по номенклатуре  truOriginCode равен значению "6" (оказание работ/услуг), то Источник происхождения не требуется создавать
						Если СтрокаНоменклатуры.esfKzTruOriginCode = "6" Тогда
							//Пропускаем
						Иначе
							//Из постановки: "%ProductDeclaration%/%productNumberInDeclaration%/%UnitCode%/%truOriginCode%"
							ПредставлениеИсточника = Строка(СтрокаНоменклатуры.esfKzProductDeclaration)
								+ "/" + СтрокаНоменклатуры.esfKzProductNumberInDeclaration
								+ "/" + СтрокаНоменклатуры.esfKzUnitCode + "/" + СтрокаНоменклатуры.esfKzTruOriginCode;
							
							ДополнитьТаблицуЗагружаемыхОбъектов("ИсточникиПроисхождения","Источник происхождения",
								СтрокаНоменклатуры.id,ПредставлениеИсточника,СтрокаНоменклатуры.ИсточникПроисхожденияСсылка,СтрокаДокумента.ПредставлениеДокумента,СтрокаДокумента.ДокументИД,ПараметрыДополнения);
								
							Если Не ЗначениеЗаполнено(СтрокаНоменклатуры.ИсточникПроисхожденияСсылка)
								Или Не ЗначениеЗаполнено(СтрокаНоменклатуры.СтранаПроисхожденияСсылка) Тогда
								ВсеЭлементыНайдены = Ложь;
							КонецЕсли;
							
						КонецЕсли;
						
					Иначе
					
						Если СтруктураНастроек.ЗаполнениеТЧ_ЗаполнятьДанныеГТД Тогда
							Если ЗначениеЗаполнено(СтрокаНоменклатуры.recognizedCustomsDeclaration) Тогда
								
								ПредставлениеСтраны = Строка(СтрокаНоменклатуры.recognizedCountryShortName) + ?(ЗначениеЗаполнено(СтрокаНоменклатуры.recognizedCountryCode)," (" + СтрокаНоменклатуры.recognizedCountryCode + ")","");
								
								ДополнитьТаблицуЗагружаемыхОбъектов("НомераГТД","Номер ГТД",СтрокаНоменклатуры.id,СтрокаНоменклатуры.recognizedCustomsDeclaration,СтрокаНоменклатуры.НомерГТДСсылка,СтрокаДокумента.ПредставлениеДокумента,СтрокаДокумента.ДокументИД,ПараметрыДополнения);
								
								Если ЗначениеЗаполнено(ПредставлениеСтраны) Тогда
									ДополнитьТаблицуЗагружаемыхОбъектов("СтраныМира","Страна происхождения",СтрокаНоменклатуры.id,ПредставлениеСтраны,СтрокаНоменклатуры.СтранаПроисхожденияСсылка,СтрокаДокумента.ПредставлениеДокумента,СтрокаДокумента.ДокументИД,ПараметрыДополнения);
								КонецЕсли;
									
								Если Не ЗначениеЗаполнено(СтрокаНоменклатуры.НомерГТДСсылка)
									Или Не ЗначениеЗаполнено(СтрокаНоменклатуры.СтранаПроисхожденияСсылка) Тогда
									ВсеЭлементыНайдены = Ложь;
								КонецЕсли;
								
								Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат = "УТ10"
									И Не ЗначениеЗаполнено(СтрокаНоменклатуры.СерияНоменклатурыСсылка) Тогда
									ВсеЭлементыНайдены = Ложь;
								КонецЕсли;
								
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
			
		Если ТекстОшибки <> "" Тогда
			ОбщийТекстОшибки = "Документ " + СтрокаДокумента.ПредставлениеДокумента + " <id=" + СтрокаДокумента.ДокументИД + ">, ошибки при обработке:" + Символы.ПС + ТекстОшибки;
		КонецЕсли;		
	КонецЦикла;
	
	//2021.02.22 ( Новое событие в МК: "Сопоставление_ПослеЗаполненияТаблицыЗагружаемыхОбъектов"
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("ДанныеПортала",ДанныеПортала);
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
	
	МодульКастомизации_ОбработатьСобытие("Сопоставление_ПослеЗаполненияТаблицыЗагружаемыхОбъектов",ПараметрыМК);	
	// ) 2021.02.22
	
	//Помещаем данные документа обратно во временное хранилище
	ПоместитьВоВременноеХранилище(ДанныеПортала,АдресХранилищаДанныхПортала);
	
	РезультатЗаполнения.ВсеЭлементыНайдены = ВсеЭлементыНайдены;
	РезультатЗаполнения.ТекстОшибки = ОбщийТекстОшибки;
	
	Возврат РезультатЗаполнения;
КонецФункции

Процедура ДополнитьТаблицуЗагружаемыхОбъектов(ТипОбъекта,ПредставлениеТипаОбъекта,ИдентификаторОбъекта,ПредставлениеОбъекта,Объект1с,
											  ПредставлениеДокумента,ДокументИД,ПараметрыДополнения)
											  
	СтруктураНастроек = ПараметрыДополнения.СтруктураНастроек;										  
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
											  
	ДанныеДокументаПортала = ПараметрыДополнения.ДанныеДокументаПортала;
	ДанныеНоменклатурыПортала = ПараметрыДополнения.ДанныеНоменклатурыПортала;
	СтрокаНоменклатуры = ?(ПараметрыДополнения.Свойство("СтрокаНоменклатуры"),ПараметрыДополнения.СтрокаНоменклатуры,Неопределено);
											  
	НоваяСтрока = ЗагружаемыеОбъекты.Добавить();
	НоваяСтрока.ДокументИД = ДокументИД;
	НоваяСтрока.ДокументТип = ДанныеДокументаПортала.type;
	НоваяСтрока.Документ_Номер = ДанныеДокументаПортала.number;
	НоваяСтрока.Документ_Дата = ДанныеДокументаПортала.date;
	НоваяСтрока.Документ_Направление = ДанныеДокументаПортала.Направление;
	НоваяСтрока.ТипОбъекта = ТипОбъекта;
	НоваяСтрока.ПредставлениеТипаОбъекта = ПредставлениеТипаОбъекта;
	НоваяСтрока.ТипСоздаваемогоДокумента = ДанныеДокументаПортала.ТипСоздаваемогоДокумента;
	НоваяСтрока.ИдентификаторОбъекта = ИдентификаторОбъекта;
	НоваяСтрока.ПредставлениеОбъекта = ПредставлениеОбъекта;
	НоваяСтрока.ПредставлениеДокумента = ПредставлениеДокумента;
	НоваяСтрока.КонтрагентИД = ДанныеДокументаПортала.supplierInn;
	НоваяСтрока.Объект1с = Объект1с;
	НоваяСтрока.СоответствиеУстановлено = ЗначениеЗаполнено(Объект1с);
	НоваяСтрока.АдресХранилищаСканаДокумента = ДанныеДокументаПортала.АдресХранилищаСканаДокумента;
	НоваяСтрока.СканДокумента_ТекущаяСтраница = 1;
	НоваяСтрока.СканДокумента_КоличествоСтраниц = ДанныеДокументаПортала.pagesCount;
	
	//Для комплектов документов будет нужно показывать оба скана из комплекта
	НоваяСтрока.parentId = ДанныеДокументаПортала.parent;
	НоваяСтрока.childrenId = ДанныеДокументаПортала.children;
	
	НоваяСтрока.ОписаниеТипа = СтруктураНастроек.СведенияОКонфигурации.СоответствиеТипов.Получить(ТипОбъекта);
	
	//Определяем специальные реквизиты в зависимости от типа заполняемого объекта
	Если ТипОбъекта = "Документ" Тогда
		НоваяСтрока.СоответствиеУстановлено = Истина;
		НоваяСтрока.Документ_Дата = ДанныеДокументаПортала.date;
		НоваяСтрока.Документ_Номер = ДанныеДокументаПортала.number;
		НоваяСтрока.Документ_Сумма = ДанныеДокументаПортала.amount;
		НоваяСтрока.Документ_СуммаНДС = ДанныеДокументаПортала.vat;
		НоваяСтрока.Документ_Склад = СтруктураНастроек.ЗаполнениеШапки_СкладПоУмолчанию;
		НоваяСтрока.Документ_Подразделение = СтруктураНастроек.ЗаполнениеШапки_ПодразделениеПоУмолчанию;
		НоваяСтрока.Документ_ПодразделениеОрганизации = СтруктураНастроек.ЗаполнениеШапки_ПодразделениеОрганизацииПоУмолчанию;
		НоваяСтрока.Документ_ПодотчетноеЛицо = СтруктураНастроек.ЗаполнениеШапки_ПодотчетноеЛицоПоУмолчанию;
		НоваяСтрока.Документ_ДоговорНеТребуется = ДанныеДокументаПортала.ДоговорНеТребуется = Истина;
		НоваяСтрока.Документ_ОригиналПолучен = СтруктураНастроек.СозданиеДокумента_УстанавливатьФлагОригиналПолучен;
		
		//E1C-375: Услуги аренды. По постановке для реквизита Документ_ВедетсяУчетПредметовАренды
		//должно быть установлено значение <Плата за право пользования предметами аренды(1)>
		НоваяСтрока.Документ_ВедетсяУчетПредметовАренды = 1;
		
		//E1C-407: Вид операции мог быть выбран ранее, фиксируем от изменения
		Если ЗначениеЗаполнено(ДанныеДокументаПортала.ВидОперацииПринудительно) Тогда
			НоваяСтрока.Документ_ВидОперацииЗаданПринудительно = Истина;
			НоваяСтрока.Документ_ВидОперации = ДанныеДокументаПортала.ВидОперацииПринудительно;
		КонецЕсли;
		
		//E1C-191: Дата создаваемого документа теперь редактируется в форме сопоставления
		Если СтруктураНастроек.ЗаполнениеШапки_ИспользоватьДатуВходящегоДокумента И ЗначениеЗаполнено(ДанныеДокументаПортала.date) Тогда
			НоваяСтрока.Документ_ДатаСоздаваемогоДокумента = ДанныеДокументаПортала.date;
		Иначе
			НоваяСтрока.Документ_ДатаСоздаваемогоДокумента = ТекущаяДата();
		КонецЕсли;
		
		//E1C-487: Казахстан: дата оборота для типа документа ЭСФ
		//1) При создании Поступления ТМЗ из распознанного типа документа ЭСФ входящая дата  и дата документа в 1С заполняются значением "turnoverDate".
		Если ДанныеДокументаПортала.ТипСоздаваемогоДокумента = "ПоступлениеТоваровУслуг"
			И ДанныеДокументаПортала.type = "E_VAT_INVOICE" Тогда
			НоваяСтрока.Документ_Дата = ДанныеДокументаПортала.esfKzTurnoverDate;
			НоваяСтрока.Документ_ДатаСоздаваемогоДокумента = ДанныеДокументаПортала.esfKzTurnoverDate;
		КонецЕсли;
		
		//Изначально функция формировала назначение платежа по собранным данным по документу при его заполнении,
		//чтобы не переписывать ее, сформируем структуру, аналогичную исходной и передадим в ту же функцию
		СтруктураЗаполненияДокумента = Новый Структура("document,documentItems",ДанныеДокументаПортала,ДанныеНоменклатурыПортала);

		
		// модуль кастомизации
		ПараметрыМК = Новый Структура;
		ПараметрыМК.Вставить("ДокументИД",ДокументИД);
		ПараметрыМК.Вставить("СтрокаТаблицы",НоваяСтрока);
		ПараметрыМК.Вставить("СтруктураЗаполненияДокумента",СтруктураЗаполненияДокумента);
		ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
		ПараметрыМК.Вставить("НазначениеПлатежа","");		
		ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
					
		МодульКастомизации_ОбработатьСобытие("Сопоставление_ПередФормированиемНазначенияПлатежа",ПараметрыМК);
		
		Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
			НоваяСтрока.Документ_НазначениеПлатежа = ЗаполнениеДокумента_ПлатежноеПоручение_СформироватьНазначениеПлатежа(СтруктураНастроек,СтруктураЗаполненияДокумента);
		Иначе
			НоваяСтрока.Документ_НазначениеПлатежа = ПараметрыМК.НазначениеПлатежа;
		КонецЕсли;
		
		//E1C-308: заполним значение Содержание услуги для документа ПоступлениеДопРасходов значением из первой строки номенклатуры
		Если ДанныеНоменклатурыПортала.Количество() > 0 Тогда
			НоваяСтрока.Документ_СодержаниеУслугиДляДопРасходов = ДанныеНоменклатурыПортала[0].name;
		КонецЕсли;
	
	ИначеЕсли ТипОбъекта = "Организации" Тогда
		
		Если ПараметрыДополнения.НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
			//E1C-421: для отображения задействуем существующий реквизит ИНН
			Если СтруктураНастроек.РегионПространства = "KAZ" Тогда
				НоваяСтрока.Организации_ИНН = ДанныеДокументаПортала.customerTaxId;
			Иначе
				НоваяСтрока.Организации_ИНН = ДанныеДокументаПортала.customerInn;
				НоваяСтрока.Организации_КПП = ДанныеДокументаПортала.customerKpp;
			КонецЕсли;
			
			НоваяСтрока.Организации_Наименование = ДанныеДокументаПортала.customerShortName;
			НоваяСтрока.Организации_НаименованиеПолное = ДанныеДокументаПортала.customerName;
		Иначе
			//E1C-421: для отображения задействуем существующий реквизит ИНН
			Если СтруктураНастроек.РегионПространства = "KAZ" Тогда
				НоваяСтрока.Организации_ИНН = ДанныеДокументаПортала.supplierTaxId;
			Иначе
				НоваяСтрока.Организации_ИНН = ДанныеДокументаПортала.supplierInn;
				НоваяСтрока.Организации_КПП = ДанныеДокументаПортала.supplierKpp;
			КонецЕсли;
			НоваяСтрока.Организации_Наименование = ДанныеДокументаПортала.supplierShortName;
			НоваяСтрока.Организации_НаименованиеПолное = ДанныеДокументаПортала.supplierName;			
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = "Контрагенты" Тогда
		
		Если ПараметрыДополнения.НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
			//E1C-421: для отображения задействуем существующий реквизит ИНН
			Если СтруктураНастроек.РегионПространства = "KAZ" Тогда
				НоваяСтрока.Контрагенты_ИНН = ДанныеДокументаПортала.supplierTaxId;
			Иначе
				НоваяСтрока.Контрагенты_ИНН = ДанныеДокументаПортала.supplierInn;
				НоваяСтрока.Контрагенты_КПП = ДанныеДокументаПортала.supplierKpp;
			КонецЕсли;
			НоваяСтрока.Контрагенты_Наименование = ДанныеДокументаПортала.supplierShortName;
			НоваяСтрока.Контрагенты_НаименованиеПолное = ДанныеДокументаПортала.supplierName;
		Иначе
			//E1C-421: для отображения задействуем существующий реквизит ИНН
			Если СтруктураНастроек.РегионПространства = "KAZ" Тогда
				НоваяСтрока.Контрагенты_ИНН = ДанныеДокументаПортала.customerTaxId;
			Иначе
				НоваяСтрока.Контрагенты_ИНН = ДанныеДокументаПортала.customerInn;
				НоваяСтрока.Контрагенты_КПП = ДанныеДокументаПортала.customerKpp;
			КонецЕсли;
			НоваяСтрока.Контрагенты_Наименование = ДанныеДокументаПортала.customerShortName;
			НоваяСтрока.Контрагенты_НаименованиеПолное = ДанныеДокументаПортала.customerName;
		КонецЕсли;
		
		НоваяСтрока.Контрагенты_Партнер = ДанныеДокументаПортала.ПартнерСсылка;
		
	//Договоры
	ИначеЕсли ТипОбъекта = "Договоры" Тогда
		НоваяСтрока.Договоры_ОснованиеПередачиЗаполнено = ДанныеДокументаПортала.ОснованиеПередачиЗаполнено;
		НоваяСтрока.Договоры_Наименование = ДанныеДокументаПортала.transferBaseName;
		НоваяСтрока.Договоры_Номер = ДанныеДокументаПортала.transferBaseNumber;
		НоваяСтрока.Договоры_Дата = ДанныеДокументаПортала.transferBaseDate;
		НоваяСтрока.Договоры_ДопИнформация = ДанныеДокументаПортала.transferBaseAdditionalInfo;
		
		Если НоваяСтрока.ТипСоздаваемогоДокумента = "ПоступлениеУслугПоАренде" Тогда
			Если Не ЗначениеЗаполнено(Объект1с) Тогда
				НоваяСтрока.Объект1с = Справочники.ДоговорыАренды.ПустаяСсылка();
				НоваяСтрока.ОписаниеТипа = "СправочникСсылка.ДоговорыАренды";
			КонецЕсли;
		КонецЕсли;
	
	ИначеЕсли ТипОбъекта = "БанковскиеСчета" Тогда
		
		НоваяСтрока.БанковскиеСчета_БИК = ДанныеДокументаПортала.supplierAccountBic;
		НоваяСтрока.БанковскиеСчета_НаименованиеБанка = ДанныеДокументаПортала.supplierAccountBankName;
		НоваяСтрока.БанковскиеСчета_НомерСчета = ДанныеДокументаПортала.supplierAccountNumber;		
		
	ИначеЕсли ТипОбъекта = "ОсновныеСредства" Тогда
		
		//Служебные поля
		НоваяСтрока.Номенклатура_serialNumber = СтрокаНоменклатуры.serialNumber;
		НоваяСтрока.Номенклатура_goodCodeIsNull = СтрокаНоменклатуры.goodCodeIsNull;
		НоваяСтрока.Номенклатура_ТребуетсяСозданиеНоменклатуры = ПараметрыДополнения.ТребуетсяСозданиеНоменклатуры;
		
		НоваяСтрока.Номенклатура_ЕдиницаИзмеренияПредставление = СтрокаНоменклатуры.userUnitName;
		НоваяСтрока.Номенклатура_КоэффициентПересчета = 1;
		НоваяСтрока.Номенклатура_Количество = СтрокаНоменклатуры.quantity;
		НоваяСтрока.Номенклатура_ПодразделениеЗатрат = СтруктураНастроек.ЗаполнениеШапки_ПодразделениеОрганизацииПоУмолчанию;
		
		//ОС всегда "товар", а не услуга
		НоваяСтрока.ДополнительноеОписаниеОбъекта = "Товар";
		
		Если НоваяСтрока.СоответствиеУстановлено Тогда
			
			НоваяСтрока.ОсновныеСредства_ТипОС = НоваяСтрока.Объект1с.ТипОС;
			НоваяСтрока.ОсновныеСредства_АмортизационнаяГруппа = НоваяСтрока.Объект1с.АмортизационнаяГруппа;
			НоваяСтрока.ОсновныеСредства_ГруппаОС = НоваяСтрока.Объект1с.ГруппаОС;
			НоваяСтрока.ОсновныеСредства_ДатаВыпуска = НоваяСтрока.Объект1с.ДатаВыпуска;
			НоваяСтрока.ОсновныеСредства_ЕдиницаУчета = НоваяСтрока.Объект1с.ЕдиницаУчета;
			НоваяСтрока.ОсновныеСредства_ЗаводскойНомер = НоваяСтрока.Объект1с.ЗаводскойНомер;
			НоваяСтрока.ОсновныеСредства_НомерПаспорта = НоваяСтрока.Объект1с.НомерПаспорта;
			НоваяСтрока.ОсновныеСредства_Изготовитель = НоваяСтрока.Объект1с.Изготовитель;
			НоваяСтрока.ОсновныеСредства_КодПоОКОФ = НоваяСтрока.Объект1с.КодПоОКОФ;
			НоваяСтрока.ОсновныеСредства_НаименованиеПолное = НоваяСтрока.Объект1с.НаименованиеПолное;
			
			НоваяСтрока.ОсновныеСредства_ИнвентарныйНомер = 
				?(НоваяСтрока.ОсновныеСредства_ЕдиницаУчета = Перечисления.ЕдиницыУчетаОС.ГрупповойОбъект,
				"", НоваяСтрока.Объект1с.Код);
			
		Иначе
			//"артикулом" будет код?
			НоваяСтрока.ОсновныеСредства_ЗаводскойНомер = СтрокаНоменклатуры.recognizedGoodCode;
			НоваяСтрока.ОсновныеСредства_НаименованиеПолное = ПредставлениеОбъекта;
			
			Если РеквизитСуществует("Перечисления","ТипыОС","ОбъектОС") Тогда
				НоваяСтрока.ОсновныеСредства_ТипОС = Перечисления.ТипыОС.ОбъектОС;
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ЕдиницыУчетаОС","ИнвентарныйОбъект") Тогда
				НоваяСтрока.ОсновныеСредства_ЕдиницаУчета = Перечисления.ЕдиницыУчетаОС.ИнвентарныйОбъект;
			КонецЕсли;
		
		КонецЕсли;
			
	ИначеЕсли ТипОбъекта = "Номенклатура" Тогда
		
		Если НоваяСтрока.СоответствиеУстановлено Тогда
			
			//2019.04.03 (
			Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаВидНоменклатуры) Тогда
				НоваяСтрока.Номенклатура_ВидНоменклатуры = Объект1с[СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаВидНоменклатуры];
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаРодитель) Тогда
				НоваяСтрока.Номенклатура_Родитель = Объект1с[СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаРодитель];
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаКатегория) Тогда
				НоваяСтрока.Номенклатура_Категория = Объект1с[СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаКатегория];
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаНаправлениеДеятельности) Тогда
				НоваяСтрока.Номенклатура_НаправлениеДеятельности = Объект1с[СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаНаправлениеДеятельности];
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаСтатьяЗатрат) Тогда
				НоваяСтрока.Номенклатура_СтатьяЗатрат = Объект1с[СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаСтатьяЗатрат];
			КонецЕсли;
			// ) 2019.04.03
			
			Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаАртикул) Тогда
				НоваяСтрока.Номенклатура_Артикул1с = Объект1с[СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаАртикул];
			КонецЕсли;
			
			//2019.05.21 ( БГУ
			Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат = "БГУ" Тогда
				МодульПолучениеНСИ = _ЗФ_ПолучитьОбщийМодульКонфигурации("ПолучениеНСИ");
				Если МодульПолучениеНСИ <> Неопределено Тогда
					НоваяСтрока.Номенклатура_СчетУчета = МодульПолучениеНСИ.ПолучитьСчетНоменклатурыПоУмолчанию(НоваяСтрока.Объект1с);
				КонецЕсли;
			КонецЕсли;
			// ) 2019.05.21
			
			Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат = "УНФ" Тогда
				НоваяСтрока.Номенклатура_СчетУчетаЗапасов = Объект1с.СчетУчетаЗапасов;
				НоваяСтрока.Номенклатура_СчетУчетаЗатрат = Объект1с.СчетУчетаЗатрат;
			КонецЕсли;
			
			//+++ Единицу измерения возьмем из номенклатуры?
		Иначе
			
			НоваяСтрока.ДополнительноеОписаниеОбъекта = СтруктураНастроек.Номенклатура_ТипНоменклатурыТоварУслуга;
			
			//EN-339: Тип номенклатуры Услуга по умолчанию для Актов
			Если ДанныеДокументаПортала.type = "CERTIFICATE" Тогда
				НоваяСтрока.ДополнительноеОписаниеОбъекта = "Услуга";
			КонецЕсли;
			// ) EN-339
						
			//E1C-390: определение типа товар/услуга по маркера
			СловаМаркеры = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СловаМаркерыТипНоменклатуры");
			Если ТипЗнч(СловаМаркеры) = Тип("ТаблицаЗначений")
				И СловаМаркеры.Количество() > 0 Тогда
				
				СтрокаДляПоиска = Нрег(ПредставлениеОбъекта);
				Для Каждого СтрокаМаркер Из СловаМаркеры Цикл
					Если ЗначениеЗаполнено(СтрокаМаркер.Маркер) И ЗначениеЗаполнено(СтрокаМаркер.ТипНоменклатуры) Тогда
													
						//пробел в маркере разбивает маркер на подстроки поиска, поиск по этим подстрокам
						//должен выполняться по вхождению всех подстрок в наименование номенклатуры поставщика
						МассивПодстрок = Энтера_РазложитьСтрокуВМассивПодстрок(Нрег(СтрокаМаркер.Маркер)," ",Истина,Истина);
						ВсеПодстрокиНайдены = Истина;
						Для Каждого Подстрока Из МассивПодстрок Цикл
							Если Найти(СтрокаДляПоиска,Подстрока) = 0 Тогда
								ВсеПодстрокиНайдены = Ложь;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						Если ВсеПодстрокиНайдены Тогда
							НоваяСтрока.ДополнительноеОписаниеОбъекта = СтрокаМаркер.ТипНоменклатуры;
							Прервать;
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			Если НоваяСтрока.ДополнительноеОписаниеОбъекта = "Услуга" Тогда
				НоваяСтрока.Номенклатура_ВидНоменклатуры = СтруктураНастроек.Номенклатура_ВидНоменклатурыПоУмолчаниюУслуга;
				НоваяСтрока.Номенклатура_Родитель = СтруктураНастроек.Номенклатура_ГруппаСоздаваемойНоменклатурыУслуги;
								
			Иначе
				НоваяСтрока.Номенклатура_ВидНоменклатуры = СтруктураНастроек.Номенклатура_ВидНоменклатурыПоУмолчаниюТовар;
				НоваяСтрока.Номенклатура_Родитель = СтруктураНастроек.Номенклатура_ГруппаСоздаваемойНоменклатуры;
				
			КонецЕсли;
			
			Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат = "УНФ" Тогда
				НоваяСтрока.Номенклатура_СчетУчетаЗапасов = СтруктураНастроек.ЗаполнениеТЧ_СчетУчетаПоУмолчаниюТовар;
				НоваяСтрока.Номенклатура_СчетУчетаЗатрат = СтруктураНастроек.ЗаполнениеТЧ_СчетУчетаПоУмолчаниюУслуга;
			КонецЕсли;
						
		КонецЕсли;		
		
		//Служебные поля
		НоваяСтрока.Номенклатура_serialNumber = СтрокаНоменклатуры.serialNumber;
		НоваяСтрока.Номенклатура_goodCodeIsNull = СтрокаНоменклатуры.goodCodeIsNull;
		НоваяСтрока.Номенклатура_ТребуетсяСозданиеНоменклатуры = ПараметрыДополнения.ТребуетсяСозданиеНоменклатуры;
		
		//Данные для отображения/изменения пользователем
		НоваяСтрока.Номенклатура_Код = СтрокаНоменклатуры.recognizedGoodCode;
		
		НоваяСтрока.ДополнительноеОписание_СписокВыбора = СтруктураНастроек.Номенклатура_ТипНоменклатурыТоварУслуга_СписокВыбора;		
		НоваяСтрока.Номенклатура_ЕдиницаИзмерения = СтрокаНоменклатуры.ЕдиницаИзмеренияСсылка;
		НоваяСтрока.Номенклатура_ЕдиницаИзмеренияПредставление = СтрокаНоменклатуры.userUnitName;
		НоваяСтрока.Номенклатура_КоэффициентПересчета = 1;
		НоваяСтрока.Номенклатура_Количество = СтрокаНоменклатуры.quantity;
		НоваяСтрока.Номенклатура_Характеристика = СтрокаНоменклатуры.ХарактеристикаСсылка;
		НоваяСтрока.Номенклатура_НоменклатураПоставщика = СтрокаНоменклатуры.НоменклатураПоставщикаСсылка;
		НоваяСтрока.Номенклатура_ПодразделениеЗатрат = СтруктураНастроек.ЗаполнениеШапки_ПодразделениеОрганизацииПоУмолчанию;
		
		Если Не ЗначениеЗаполнено(НоваяСтрока.Номенклатура_СтатьяЗатрат) Тогда
			НоваяСтрока.Номенклатура_СтатьяЗатрат = СтрокаНоменклатуры.СтатьяЗатратСсылка;
		КонецЕсли;
		
		//БГУ
		Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат = "БГУ2" Тогда
			Если РеквизитСуществует("Справочники","КлассификационныеПризнакиСчетов") Тогда
				НоваяСтрока.Номенклатура_КПС = Справочники.КлассификационныеПризнакиСчетов.ПустаяСсылка();
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","КВД") Тогда
				НоваяСтрока.Номенклатура_КФО = Перечисления.КВД.ПустаяСсылка();
			КонецЕсли;
			
			Если РеквизитСуществует("Справочники","КОСГУ") Тогда
				НоваяСтрока.Номенклатура_КЭК = Справочники.КОСГУ.ПустаяСсылка();
			КонецЕсли;			
		КонецЕсли;
		
		//E1C-485: БП 3.0 для Казахстана. Предзаполнение реквизита "Вид поступления" в зависимости от ставки НДС по позиции
		//1) Если по позиции "Без НДС", то поле "Вид поступления" предзаполнять значением "Товары, приобретенные без НДС";
		//2) Если по позиции есть НДС , то поле "Вид поступления" предзаполнять значением "Товары, приобретенные с НДС";
		Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат = "БП30" И СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
			Если СтрокаНоменклатуры.СтавкаНДССсылка = СтруктураНастроек.СведенияОКонфигурации.СтавкиНДС.БезНДС Тогда
				НоваяСтрока.Номенклатура_НДСВидПоступления = Справочники.ВидыПоступления.ПриобретениеТМЗБезНДС;
			Иначе
				НоваяСтрока.Номенклатура_НДСВидПоступления = Справочники.ВидыПоступления.ПриобретениеТМЗ;
			КонецЕсли;
		КонецЕсли;
		
		//расшифровка услуги из документа оказанных услуг
		НоваяСтрока.Номенклатура_НаименованиеПолное = ПредставлениеОбъекта;
		
		// 2019.09.03 ( 3659: Возможно есть сохраненное значение единицы измерения и коэффициента пересчета
		Если ПараметрыДополнения.Свойство("СвязьЕдиницы") Тогда
			СвязьЕдиницы = ПараметрыДополнения.СвязьЕдиницы;
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Наименование",НоваяСтрока.Номенклатура_ЕдиницаИзмеренияПредставление);
			СтруктураПоиска.Вставить("КонтрагентИД",НоваяСтрока.КонтрагентИД);
			
			//Если есть ссылка на номенклатуру - ищем по ней, если нет - по наименованию
			Если ЗначениеЗаполнено(НоваяСтрока.Объект1с) Тогда
				СтруктураПоиска.Вставить("НоменклатураСсылка",НоваяСтрока.Объект1с);
			Иначе
				СтруктураПоиска.Вставить("НаименованиеНоменклатуры",НоваяСтрока.Номенклатура_НаименованиеПолное);
			КонецЕсли;
			
			НайденныеСтроки = СвязьЕдиницы.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() = 0
				И СтруктураПоиска.Свойство("НоменклатураСсылка") Тогда
					//Исключим поиск по ссылке на номенклатуру, оставим поиск по наименованию номенклатуры
					СтруктураПоиска.Удалить("НоменклатураСсылка");
					СтруктураПоиска.Вставить("НаименованиеНоменклатуры",НоваяСтрока.Номенклатура_НаименованиеПолное);
					
					НайденныеСтроки = СвязьЕдиницы.НайтиСтроки(СтруктураПоиска);
			КонецЕсли;
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				//2020.10.30 ( УТ10, УПП, КА: Могут быть найдены и установлены ошибочно сохраненные связи с единицей по классификатору,
				//не устанавливаем их вместо значения, только коэффициент
				Если Конф = "УТ10" Или Конф = "КА1" Или Конф = "УПП" Или Конф = "Автосалон" Или Конф = "КомбинатПитания" Или Конф = "УправлениеРестораном" Тогда
					Если ТипЗнч(НайденныеСтроки[0].Ссылка) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
						НоваяСтрока.Номенклатура_ЕдиницаИзмерения = НайденныеСтроки[0].Ссылка;
					КонецЕсли;
				Иначе
				//Иначе исходный вариант
				// ) 2020.10.30
					НоваяСтрока.Номенклатура_ЕдиницаИзмерения = НайденныеСтроки[0].Ссылка;
				КонецЕсли;
				
				НоваяСтрока.Номенклатура_КоэффициентПересчета = НайденныеСтроки[0].КоэффициентПересчета;
				
				Если Конф = "УТ11" Или Конф = "КА2" Или Конф = "ERP" Тогда
					Если Не ЗначениеЗаполнено(НоваяСтрока.Номенклатура_ЕдиницаИзмерения) Тогда
						//Не заполненная единица измерения может предполагать, что выбрана единица хранения номенклатуры,
						//по логике конфигурации ее не заполняем в табличной части. Для спокойствия пользователя отобразим ее в сопоставлении
						НоваяСтрока.Номенклатура_ЕдиницаИзмерения = НоваяСтрока.Объект1с.ЕдиницаИзмерения;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;
		// ) 2019.09.03
		
	ИначеЕсли ТипОбъекта = "НомераГТД" Тогда
		
		НоваяСтрока.НомераГТД_Код = ПредставлениеОбъекта;
		
	ИначеЕсли ТипОбъекта = "СтраныМира" Тогда
		
		НоваяСтрока.СтраныМира_Код = СтрокаНоменклатуры.recognizedCountryCode;
		НоваяСтрока.СтраныМира_НаименованиеПолное = СтрокаНоменклатуры.recognizedCountryShortName;
		
	ИначеЕсли ТипОбъекта = "ИсточникиПроисхождения" Тогда
		
		НоваяСтрока.ИсточникиПроисхождения_Код = СтрокаНоменклатуры.esfKzproductDeclaration;
		НоваяСтрока.ИсточникиПроисхождения_ПризнакПроисхождения = СтрокаНоменклатуры.esfKzTruOriginCode;
		НоваяСтрока.ИсточникиПроисхождения_НомерСтрокиГТД = СтрокаНоменклатуры.esfKzproductNumberInDeclaration;
		НоваяСтрока.ИсточникиПроисхождения_КодТНВЭД = СтрокаНоменклатуры.esfKzUnitCode;
		
	КонецЕсли;
	
	НоваяСтрока.Пометка = Не НоваяСтрока.СоответствиеУстановлено;
	
	//2020.10.13 (
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("ТипОбъекта",ТипОбъекта);
	ПараметрыМК.Вставить("ДокументИД",ДокументИД);
	ПараметрыМК.Вставить("СтрокаТаблицы",НоваяСтрока);
	ПараметрыМК.Вставить("ДанныеДокументаПортала",ДанныеДокументаПортала);
	ПараметрыМК.Вставить("ДанныеНоменклатурыПортала",ДанныеНоменклатурыПортала);
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
				
	МодульКастомизации_ОбработатьСобытие("Сопоставление_ПослеДобавленияСтрокиТаблицыСопоставления",ПараметрыМК);
	// ) 2020.10.13
		
КонецПроцедуры


Процедура ЗаполнитьИдентификаторыОбъединенияДокументов(АдресХранилищаДанныхПортала,ДопПараметры) Экспорт
	
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	//Пока объединяются только документы с типом Чек / Авансовый отчет, при необходимости можно сделать соответствие с идентификаторами по разным объединяемым типам 
	ИдентификаторОбъединения_Чек = Строка(Новый УникальныйИдентификатор);
	
	// 2019.10.31 ( Исходная логика предполагает, что объединяются только документы с типом RECEIPT. Теперь принято решение
	//объединять документы с любыми типами. Старый механизм на всякий случай оставляю, чтобы не переделывать
	ОбъединятьЛюбыеТипы = Истина;
	// ) 2019.10.31
	
	Для Каждого СтрокаДокумента Из СписокДокументов Цикл
		
		//Обрабатываются только строки документов, не задания распознавания
		Если СтрокаДокумента.recognitionTaskId <> "" Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДокумента.Пометка Тогда
			
			Если ДопПараметры.ОбъединятьДокументы Тогда
			
				Если СтрокаДокумента.ДокументТип = "RECEIPT"
					Или ОбъединятьЛюбыеТипы Тогда
					//у всех чеков в этой порции документов будет один идентификатор
					ТекИдентификатор = ИдентификаторОбъединения_Чек;
					
				Иначе
					//для прочих документов идентификатором объединения будет их идентификатор
					ТекИдентификатор = СтрокаДокумента.ДокументИД;
					
				КонецЕсли;
				
			Иначе
				//для прочих документов идентификатором объединения будет их идентификатор
				ТекИдентификатор = СтрокаДокумента.ДокументИД;
				
			КонецЕсли;
			
		Иначе
			//Снимаем идентификатор объединения у строки
			ТекИдентификатор = "";
			
		КонецЕсли;
		
		СтрокаДокумента.ИдентификаторОбъединения = ТекИдентификатор;
		
		ДанныеДокумента = ДанныеПортала.documents.Найти(СтрокаДокумента.ДокументИД,"id");
		ДанныеНоменклатуры = ДанныеПортала.documentItems.НайтиСтроки(Новый Структура("documentId",СтрокаДокумента.ДокументИД));
		
		ДанныеДокумента.ИдентификаторОбъединения = ТекИдентификатор;
		
		Для Каждого СтрокаНоменклатуры Из ДанныеНоменклатуры Цикл
			СтрокаНоменклатуры.ИдентификаторОбъединения = ТекИдентификатор;
		КонецЦикла;
			
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ДанныеПортала,АдресХранилищаДанныхПортала);
		
КонецПроцедуры

Функция ПолучитьСтруктуруОбъединенныхДанныхЗаполненияДокумента(АдресХранилищаДанныхПортала,ИдентификаторОбъединения,СтруктураНастроек,ДопПараметры) Экспорт
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ИдентификаторОбъединения",ИдентификаторОбъединения);
	
	МассивИдентификаторовДокументов = Новый Массив;
	
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	ДанныеДокументов = ДанныеПортала.documents.НайтиСтроки(Новый Структура("ИдентификаторОбъединения",ИдентификаторОбъединения));
	
	//Направление определяем по первому документу из найденной группы
	СтрокаСпискаДокументов = СписокДокументов.Найти(ИдентификаторОбъединения,"ИдентификаторОбъединения");
	Если СтрокаСпискаДокументов = Неопределено Тогда //Самопроверка
		СообщитьСообщение("Внутренняя ошибка модуля: не удалось получить по идентификатору объединения документов строку документа");
		Возврат Неопределено;
	КонецЕсли;
	
	НаправлениеСоздаваемогоДокумента = СтрокаСпискаДокументов.НаправлениеСоздаваемогоДокумента;
	СтруктураДанных.Вставить("НаправлениеСоздаваемогоДокумента",НаправлениеСоздаваемогоДокумента);
	
	ДанныеШапки = Инициализировать_Таблица_documents(Истина);
	
	//E1C-292: "первый" документ в списке формы сопоставления был отмечен как основной из объединяемых для получения из него данных шапки
	СтруктураПоискаДанныхШапки = Новый Структура("ИдентификаторОбъединения,СодержитДанныеШапкиОбъединенногоДокумента",ИдентификаторОбъединения,Истина);
	СтрокиШапкиОбъединенногоДокумента = ДанныеПортала.documents.НайтиСтроки(СтруктураПоискаДанныхШапки);
	Если СтрокиШапкиОбъединенногоДокумента.Количество() > 0 Тогда
		ДанныеДокумента = СтрокиШапкиОбъединенногоДокумента[0];
		
	Иначе
	// ) E1C-292
	
		//Для заполнения шапки объединяемых документов берем первый из найденной коллекции
		ДанныеДокумента = ДанныеДокументов[0];
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДанныеШапки,ДанныеДокумента);
	ДанныеШапки.Вставить("НаправлениеСоздаваемогоДокумента",НаправлениеСоздаваемогоДокумента);
	СтруктураДанных.Вставить("document",ДанныеШапки);
	
	//Обходим коллекцию документов, заполняем строки товаров
	documentItems = Новый Массив;
	
	Для Каждого ДанныеДокумента Из ДанныеДокументов Цикл
		
		Если НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
			ОрганизацияСсылка = ДанныеДокумента.ПлательщикСсылка;
			КонтрагентСсылка = ДанныеДокумента.ПоставщикСсылка;
		Иначе
			ОрганизацияСсылка = ДанныеДокумента.ПоставщикСсылка;
			КонтрагентСсылка = ДанныеДокумента.ПлательщикСсылка;
		КонецЕсли;
		
		ДанныеНоменклатуры = ДанныеПортала.documentItems.НайтиСтроки(Новый Структура("documentId",ДанныеДокумента.id));
		
		Для каждого СтрокаНоменклатуры Из ДанныеНоменклатуры Цикл
			ДанныеСтрокиНоменклатуры = Инициализировать_Таблица_documentItems(Истина);
			ЗаполнитьЗначенияСвойств(ДанныеСтрокиНоменклатуры,СтрокаНоменклатуры);
			
			//Добавим необходимые поля шапки документа для заполнения авансового отчета
			ДанныеСтрокиНоменклатуры.Вставить("Организация",ОрганизацияСсылка);
			ДанныеСтрокиНоменклатуры.Вставить("Контрагент",КонтрагентСсылка);
			ДанныеСтрокиНоменклатуры.Вставить("ДоговорКонтрагента",ДанныеДокумента.ДоговорСсылка);
			ДанныеСтрокиНоменклатуры.Вставить("number",ДанныеДокумента.number);
			ДанныеСтрокиНоменклатуры.Вставить("date",ДанныеДокумента.date);
			ДанныеСтрокиНоменклатуры.Вставить("type",ДанныеДокумента.type);
			
			documentItems.Добавить(ДанныеСтрокиНоменклатуры);
		КонецЦикла;
		
		//Определим для этой структуры, где будет храниться связь
		МассивИдентификаторовДокументов.Добавить(ДанныеДокумента.id);
		
	КонецЦикла;
	
	СтруктураДанных.Вставить("documentItems",documentItems);
	СтруктураДанных.Вставить("МассивИдентификаторовДокументов",МассивИдентификаторовДокументов);
	
	//По флагу в настройках загружаем файл скана и прикрепляем его как ПрисоединенныйФайл
	МассивФайлов = Новый Массив;
	
	Если СтруктураНастроек.СозданиеДокумента_ПрисоединятьФайлСканаДокумента = Истина Тогда
		
		//Файлов сканов у конечного документа может быть несколько, если мы объединяем несколько документов в один
		НайденныеСтроки = СписокДокументов.НайтиСтроки(Новый Структура("ИдентификаторОбъединения",ИдентификаторОбъединения));
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			Если ЭтоАдресВременногоХранилища(НайденнаяСтрока.АдресХранилищаСканаДокумента) Тогда
				СтруктураФайла = Новый Структура;
				СтруктураФайла.Вставить("АдресВХ",НайденнаяСтрока.АдресХранилищаСканаДокумента);
				СтруктураФайла.Вставить("ИмяФайла",НайденнаяСтрока.ИмяФайлаСканаДокумента);
				СтруктураФайла.Вставить("ДокументТип",НайденнаяСтрока.ДокументТип);
				
				МассивФайлов.Добавить(СтруктураФайла);
			КонецЕсли;
			
		КонецЦикла;
		
		//Для комплектов документов прикрепляем оба скана к основному документу
		Если СтруктураНастроек.СозданиеДокумента_ИспользоватьПоискКомплектов = Истина Тогда
			
			Если ЗначениеЗаполнено(СтрокаСпискаДокументов.parentId) Тогда
				
				НайденныеСтроки = СписокДокументов.НайтиСтроки(Новый Структура("ДокументИД",СтрокаСпискаДокументов.parentId));
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					
					Если ЭтоАдресВременногоХранилища(НайденнаяСтрока.АдресХранилищаСканаДокумента) Тогда
						СтруктураФайла = Новый Структура;
						СтруктураФайла.Вставить("АдресВХ",НайденнаяСтрока.АдресХранилищаСканаДокумента);
						СтруктураФайла.Вставить("ИмяФайла",НайденнаяСтрока.ИмяФайлаСканаДокумента);
						СтруктураФайла.Вставить("ДокументТип",НайденнаяСтрока.ДокументТип);
						
						//Проверим, нет ли уже в массиве этого файла
						Если МассивФайлов.Найти(СтруктураФайла) = Неопределено Тогда
							МассивФайлов.Добавить(СтруктураФайла);
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ЗначениеЗаполнено(СтрокаСпискаДокументов.childrenId) Тогда
				
				НайденныеСтроки = СписокДокументов.НайтиСтроки(Новый Структура("ДокументИД",СтрокаСпискаДокументов.childrenId));
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					
					Если ЭтоАдресВременногоХранилища(НайденнаяСтрока.АдресХранилищаСканаДокумента) Тогда
						СтруктураФайла = Новый Структура;
						СтруктураФайла.Вставить("АдресВХ",НайденнаяСтрока.АдресХранилищаСканаДокумента);
						СтруктураФайла.Вставить("ИмяФайла",НайденнаяСтрока.ИмяФайлаСканаДокумента);
						СтруктураФайла.Вставить("ДокументТип",НайденнаяСтрока.ДокументТип);
						
						//Проверим, нет ли уже в массиве этого файла
						Если МассивФайлов.Найти(СтруктураФайла) = Неопределено Тогда
							МассивФайлов.Добавить(СтруктураФайла);
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	СтруктураДанных.Вставить("МассивФайлов",МассивФайлов);
	
	Возврат СтруктураДанных;
	
КонецФункции

Процедура ЗаполнитьАдресХранилищаСканаДокументаВДанныхПортала(АдресХранилищаДанныхПортала) Экспорт
	
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
		
	Для Каждого СтрокаДокумента Из СписокДокументов Цикл
		
		ДанныеДокумента = ДанныеПортала.documents.Найти(СтрокаДокумента.ДокументИД,"id");
		
		Если ДанныеДокумента <> Неопределено Тогда
			ДанныеДокумента.АдресХранилищаСканаДокумента = СтрокаДокумента.АдресХранилищаСканаДокумента;
			ДанныеДокумента.ИмяФайлаСканаДокумента = СтрокаДокумента.ИмяФайлаСканаДокумента;
		КонецЕсли;
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ДанныеПортала,АдресХранилищаДанныхПортала);
	
КонецПроцедуры


Функция СнятьФлагСозданияУСвязанныхДокументов() Экспорт
	
	Результат = Новый Структура("Успешно",Ложь);
	
	НайденныеСтроки = СписокДокументов.НайтиСтроки(Новый Структура("Пометка",Истина));
	
	Для Каждого Строка Из НайденныеСтроки Цикл
		СвязанныйДокумент = СписокДокументов.Найти(Строка.parentId,"ДокументИД");
		
		Если СвязанныйДокумент <> Неопределено Тогда
			Если СвязанныйДокумент.Пометка = Истина Тогда
				СвязанныйДокумент.Пометка = Ложь;
				Результат.Успешно = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция КонтрольЗаполнения_ФормаСопоставления_Склады() Экспорт
		
	ДокументыБезСклада = "";
	СтруктураПоиска = Новый Структура("ТипОбъекта","Документ");
	СтрокиДокументов = ЗагружаемыеОбъекты.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого СтрокаТаблицы Из СтрокиДокументов Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Документ_Склад) Тогда
			//Проверяем, есть ли вообще в таком типе заполняемого документа реквизит Склад
			Если РеквизитСуществует("Документы",СтрокаТаблицы.ТипСоздаваемогоДокумента,"Склад")
				Или РеквизитСуществует("Документы",СтрокаТаблицы.ТипСоздаваемогоДокумента,"СкладОрдер") Тогда
				
				//Проверяем, в этом документе выбраны только услуги?				
				СтруктураПоиска = Новый Структура("ТипОбъекта,ДокументИД","Номенклатура",СтрокаТаблицы.ДокументИД);
				СтрокиНоменклатуры = ЗагружаемыеОбъекты.НайтиСтроки(СтруктураПоиска);
				
				ЕстьТовары = Ложь;
				Для Каждого СтрокаНоменклатуры Из СтрокиНоменклатуры Цикл
											
					Если ЗначениеЗаполнено(СтрокаНоменклатуры.Объект1с) Тогда
						
						//Проверяем признак у заполненной номенклатуры Услуга
						Если СтрокаНоменклатуры.Объект1с.Метаданные().Реквизиты.Найти("Услуга") <> Неопределено Тогда //БП
							Если СтрокаНоменклатуры.Объект1с.Услуга = Ложь Тогда
								ЕстьТовары = Истина;
								Прервать;
							КонецЕсли;
							
						ИначеЕсли СтрокаНоменклатуры.Объект1с.Метаданные().Реквизиты.Найти("ТипНоменклатуры") <> Неопределено
							И РеквизитСуществует("Перечисления","ТипыНоменклатуры","Услуга") Тогда
							Если СтрокаНоменклатуры.Объект1с.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
								ЕстьТовары = Истина;
								Прервать;
							КонецЕсли;
							
						КонецЕсли;
						
					Иначе
						Если СтрокаНоменклатуры.ДополнительноеОписаниеОбъекта = "Товар" Тогда
							ЕстьТовары = Истина;
							Прервать;
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
				
				Если ЕстьТовары Тогда
					ДокументыБезСклада = ДокументыБезСклада + Символы.ПС + СтрокаТаблицы.ПредставлениеОбъекта;
					//Запомним идентификатор первого документа без склада, чтобы вывести сообщение к этой строке
					СтрокаБезСклада = ?(СтрокаБезСклада = Неопределено,ЗагружаемыеОбъекты.Индекс(СтрокаТаблицы),СтрокаБезСклада);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("ДокументыБезСклада,СтрокаБезСклада",ДокументыБезСклада,СтрокаБезСклада);
	
КонецФункции


Функция ИзменитьСтороныДокумента_ПодготовитьДанныеДляПортала(АдресХранилищаДанныхПортала,МассивИдентификаторов) Экспорт
	
	//E1C-273: В реестре документов, в контекстном меню добавить пункт "поменять контрагентов местами"
	//	+ отправить данные о смене сторон на портал
	
	Результат = Новый Структура("Успешно,ТекстОшибки,КоллекцияЗапросов",Истина);
	
	КоллекцияЗапросов = Новый Соответствие;
	
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	Для Каждого ДокументИД Из МассивИдентификаторов Цикл
		ДанныеДокумента = ДанныеПортала.documents.Найти(ДокументИД,"id");
		
		//скопируем данные покупателя
		customer = Новый Структура("customerId,customerInn,customerKpp,customerName,customerShortName");
		ЗаполнитьЗначенияСвойств(customer,ДанныеДокумента);
		
		//Заменим данные покупателя данными поставщика
		ДанныеДокумента.customerId = ДанныеДокумента.supplierId;
		ДанныеДокумента.customerInn = ДанныеДокумента.supplierInn;
		ДанныеДокумента.customerKpp = ДанныеДокумента.supplierKpp;
		ДанныеДокумента.customerName = ДанныеДокумента.supplierName;
		ДанныеДокумента.customerShortName = ДанныеДокумента.supplierShortName;
		
		//Заменим данные поставщика данными покупателя
		ДанныеДокумента.supplierId = customer.customerId;
		ДанныеДокумента.supplierInn = customer.customerInn;
		ДанныеДокумента.supplierKpp = customer.customerKpp;
		ДанныеДокумента.supplierName = customer.customerName;
		ДанныеДокумента.supplierShortName = customer.customerShortName;
		
		
		//Меняем данные в списке документов
		СтрокаДокумента = СписокДокументов.Найти(ДокументИД,"ДокументИД");
		ПредставлениеПлательщика = СтрокаДокумента.ПредставлениеПлательщика;
		СтрокаДокумента.ПредставлениеПлательщика = СтрокаДокумента.ПредставлениеПоставщика;
		СтрокаДокумента.ПредставлениеПоставщика = ПредставлениеПлательщика;
		
		
		//Формируем тело запроса для отправки данных документа порталу
		ТелоЗапроса = ОбновлениеДанныхДокументов_СформироватьТелоЗапроса_suplier_customer(ДанныеДокумента);
		КоллекцияЗапросов.Вставить(ДокументИД,ТелоЗапроса);
		
	КонецЦикла;
	
	Результат.КоллекцияЗапросов = КоллекцияЗапросов;
	
	Возврат Результат;
	
КонецФункции

Функция УстановитьСтатусДокумента_ПодготовитьДанныеДляПортала(АдресХранилищаДанныхПортала,МассивИдентификаторов,Статус) Экспорт
	
	//E1C-309: В реестре документов, в контекстном меню добавить пункт "изменить статус документа"
	//	+ отправить данные о смене сторон на портал
	
	Результат = Новый Структура("Успешно,ТекстОшибки,КоллекцияЗапросов",Истина);
	
	КоллекцияЗапросов = Новый Соответствие;
	
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	Для Каждого ДокументИД Из МассивИдентификаторов Цикл
		ДанныеДокумента = ДанныеПортала.documents.Найти(ДокументИД,"id");
		
		ДанныеДокумента.state = Статус.Статус;
		ДанныеДокумента.ПредставлениеСтатуса = Статус.ПредставлениеСтатуса;
		
		Если Статус.Статус = "UPLOADED" Тогда
			ДанныеДокумента.uploaded = Истина;
		КонецЕсли;
		
		//Меняем данные в списке документов
		СтрокаДокумента = СписокДокументов.Найти(ДокументИД,"ДокументИД");
		СтрокаДокумента.ДокументСтатус = Статус.Статус;
		СтрокаДокумента.ПредставлениеСтатуса = Статус.ПредставлениеСтатуса;
		
		СтрокаДокумента.Счетчик_Загружен = 0;
		СтрокаДокумента.Счетчик_Проверен = 1;
		СтрокаДокумента.Счетчик_Распознан = 0;		
		
		//Формируем тело запроса для отправки данных документа порталу
		ТелоЗапроса = ОбновлениеДанныхДокументов_СформироватьТелоЗапроса_state(ДанныеДокумента);
		КоллекцияЗапросов.Вставить(ДокументИД,ТелоЗапроса);
		
	КонецЦикла;
	
	Результат.КоллекцияЗапросов = КоллекцияЗапросов;
	
	Возврат Результат;
	
КонецФункции


// ================= Шаблоны заполнения ===================

Функция ЗаполнениеДокумента_ПолучитьПараметрыДляПодстановки(ДанныеДокумента,ДанныеНоменклатуры = Неопределено)
	
	СоответствиеПараметров = Новый Соответствие;
		
	Если ЗначениеЗаполнено(ДанныеДокумента.vat) Тогда
		ТекстНДС = "В т.ч. НДС " + ?(ЗначениеЗаполнено(ДанныеДокумента.СтавкаНДССсылка),"(" + ДанныеДокумента.СтавкаНДССсылка + ") "," ")
			+ Формат(ДанныеДокумента.vat, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=");
	Иначе
		ТекстНДС = "Без налога (НДС)";
	КонецЕсли;
	
	//Значения шапки документа
	СоответствиеПараметров.Вставить("%ТекущаяДата%",Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));
	СоответствиеПараметров.Вставить("%НомерДокумента%",ДанныеДокумента.number);
	СоответствиеПараметров.Вставить("%ДатаДокумента%",Формат(ДанныеДокумента.date,"ДФ=dd.MM.yyyy"));
	СоответствиеПараметров.Вставить("%ИдентификаторДокумента%",ДанныеДокумента.id);
		
	СоответствиеПараметров.Вставить("%Сумма%",Формат(ДанныеДокумента.amount, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="));
	СоответствиеПараметров.Вставить("%ТекстНДС%",ТекстНДС);	
	
	
	//Значения, зависящие от табличной части документа
	ТоварыТЗ = Новый ТаблицаЗначений;
	ТоварыТЗ.Колонки.Добавить("Наименование");
	ТоварыТЗ.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	ТоварыТЗ.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));
	
	Если ДанныеНоменклатуры <> Неопределено Тогда
		Для каждого СтрокаНоменклатуры Из ДанныеНоменклатуры Цикл
			СтрокаТовары = ТоварыТЗ.Добавить();
			СтрокаТовары.Наименование = СтрокаНоменклатуры.name;
			СтрокаТовары.Количество = СтрокаНоменклатуры.quantity;			
			СтрокаТовары.Сумма = СтрокаНоменклатуры.amount;
		КонецЦикла;
	КонецЕсли;
	
	ПерваяПозиция = ?(ТоварыТЗ.Количество() > 0, ТоварыТЗ[0].Наименование, "");
	
	ТоварыПоУбываниюСтрокой = "";
	СамаяДорогаяПозиция = "";
	
	//Самая дорогая позиция, товары по убыванию суммы
	Если ТоварыТЗ.Количество() > 0 Тогда
		ТоварыТЗКопия = ТоварыТЗ.Скопировать();
		ТоварыТЗКопия.Свернуть("Наименование","Сумма");	
		ТоварыТЗКопия.Сортировать("Сумма УБЫВ");
		
		СамаяДорогаяПозиция = ТоварыТЗКопия[0].Наименование;
		
		ПервыйЭлемент = Истина;
	
		Для Каждого СтрокаТаблицы Из ТоварыТЗКопия Цикл
			Если ПервыйЭлемент Тогда
				ПервыйЭлемент = Ложь;  
				ТоварыПоУбываниюСтрокой = ТоварыПоУбываниюСтрокой + СтрокаТаблицы.Наименование;
			Иначе
				ТоварыПоУбываниюСтрокой = ТоварыПоУбываниюСтрокой + "," + СтрокаТаблицы.Наименование;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//Все товары строкой
	ТоварыТЗКопия = ТоварыТЗ.Скопировать();
	ТоварыТЗКопия.Свернуть("Наименование");	
	
	ТоварыСтрокой = "";
	
	ПервыйЭлемент = Истина;
	
	Для Каждого СтрокаТаблицы Из ТоварыТЗКопия Цикл
		Если ПервыйЭлемент Тогда
			ПервыйЭлемент = Ложь;
			ТоварыСтрокой = ТоварыСтрокой + СтрокаТаблицы.Наименование;
		Иначе
			ТоварыСтрокой = ТоварыСтрокой + "," + СтрокаТаблицы.Наименование;
		КонецЕсли;
	КонецЦикла;
	
	СоответствиеПараметров.Вставить("%СамаяДорогаяПозиция%",СамаяДорогаяПозиция);
	СоответствиеПараметров.Вставить("%ПерваяПозиция%",ПерваяПозиция);
	СоответствиеПараметров.Вставить("%Товары%",ТоварыСтрокой);
	СоответствиеПараметров.Вставить("%ПоУбываниюТовары%",ТоварыПоУбываниюСтрокой);
	
	СоответствиеПараметров.Вставить("%ТипДокумента%",ДанныеДокумента.type);
	СоответствиеПараметров.Вставить("%ИмяТипаДокумента%",ДанныеДокумента.ПредставлениеТипа);
	
	Возврат СоответствиеПараметров;
	
КонецФункции       


Функция ЗаполнениеДокумента_СформироватьКомментарийСПараметрами(АдресХранилищаДанныхПортала,СтруктураЗаполненияДокумента,СтруктураНастроек) Экспорт
	
	//Исходный комментарий, заданный пользователем
	Комментарий = СтруктураНастроек.ЗаполнениеШапки_КомментарийСозданногоДокумента;
	
	ДанныеДокумента = СтруктураЗаполненияДокумента.document;
	ДанныеНоменклатуры = СтруктураЗаполненияДокумента.documentItems;
	
	ДокументИД = ДанныеДокумента.id;
	
	// %fileName%
	Если Найти(Комментарий,"%fileName%") > 0 Тогда
		
		//Получаем имя файла из таблицы documentPages
		ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
		СтрокаДокумента = ДанныеПортала.documentPages.Найти(ДокументИД,"documentId");
		
		Если СтрокаДокумента <> Неопределено Тогда
			//Заменяем "служебный" параметр %fileName% на имя файла скана
			Комментарий = СтрЗаменить(Комментарий,"%fileName%",СтрокаДокумента.fileName);
		КонецЕсли;
	КонецЕсли;
	
	// %source%
	Если Найти(Комментарий,"%source%") > 0 Тогда
		Комментарий = СтрЗаменить(Комментарий,"%source%",СтруктураЗаполненияДокумента.document.ИсточникДокумента);
	КонецЕсли;
	
	// %currentDate%
	Если Найти(Комментарий,"%currentDate%") > 0 Тогда
		Комментарий = СтрЗаменить(Комментарий,"%currentDate%",Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
	// %documentNumber%
	Если Найти(Комментарий,"%documentNumber%") > 0 Тогда
		Комментарий = СтрЗаменить(Комментарий,"%documentNumber%",ДанныеДокумента.number);
	КонецЕсли;
	
	// %documentDate%
	Если Найти(Комментарий,"%documentDate%") > 0 Тогда
		Комментарий = СтрЗаменить(Комментарий,"%documentDate%",Формат(ДанныеДокумента.date,"ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
	// %comment%
	Если Найти(Комментарий,"%comment%") > 0 Тогда
		Комментарий = СтрЗаменить(Комментарий,"%comment%",ДанныеДокумента.comment);
	КонецЕсли;
	
	//%documentCreator%
	Если Найти(Комментарий,"%documentCreator%") > 0 Тогда
		Комментарий = СтрЗаменить(Комментарий,"%documentCreator%",ДанныеДокумента.documentCreator);
	КонецЕсли;
	
	// %items%
	Если Найти(Комментарий,"%items%") > 0 Тогда
		Значение = "";
		Для Каждого СтрокаТоваров Из СтруктураЗаполненияДокумента.documentItems Цикл
			Значение = Значение + ?(ЗначениеЗаполнено(Значение),"; ","") + СтрокаТоваров.name;
		КонецЦикла;
		Комментарий = СтрЗаменить(Комментарий,"%items%",Значение);
	КонецЕсли;
	
	// %item0%
	Если Найти(Комментарий,"%item0%") > 0 Тогда
		Значение = "";
		Если СтруктураЗаполненияДокумента.documentItems.Количество() > 0 Тогда
			Значение = СтруктураЗаполненияДокумента.documentItems[0].name;
		КонецЕсли;
		Комментарий = СтрЗаменить(Комментарий,"%item0%",Значение);
	КонецЕсли;
	
	// %documentType%
	Если Найти(Комментарий,"%documentType%") > 0 Тогда
		Комментарий = СтрЗаменить(Комментарий,"%documentType%",ДанныеДокумента.type);
	КонецЕсли;
	
	// %documentTypeRussian%
	Если Найти(Комментарий,"%documentTypeRussian%") > 0 Тогда
		Комментарий = СтрЗаменить(Комментарий,"%documentTypeRussian%",ДанныеДокумента.ПредставлениеТипа);
	КонецЕсли;
	
	// %documentTypeCode%
	Если Найти(Комментарий,"%documentTypeCode%") > 0 Тогда
		Комментарий = СтрЗаменить(Комментарий,"%documentTypeCode%",ДанныеДокумента.КодТипаДокумента);
	КонецЕсли;
	
	//Номер договора
	Если Найти(Комментарий,"%НомерДоговора%") > 0 Тогда
		Значение = "";
		Если ЗначениеЗаполнено(ДанныеДокумента.ДоговорСсылка) Тогда
			Если ДанныеДокумента.ДоговорСсылка.Метаданные().Реквизиты.Найти("Номер") <> Неопределено Тогда
				Значение = ДанныеДокумента.ДоговорСсылка.Номер;
			КонецЕсли;
		КонецЕсли;
		Комментарий = СтрЗаменить(Комментарий,"%НомерДоговора%",Значение);
	КонецЕсли;
	
	Возврат Комментарий;
	
КонецФункции

Функция ЗаполнениеДокумента_ПлатежноеПоручение_СформироватьНазначениеПлатежа(СтруктураНастроек,СтруктураЗаполненияДокумента) Экспорт
	
	Если ЗначениеЗаполнено(СтруктураНастроек.ЗаполнениеШапки_ШаблонНазначенияПлатежа) Тогда
		
		СоответствиеПараметров = ЗаполнениеДокумента_ПолучитьПараметрыДляПодстановки(СтруктураЗаполненияДокумента.document,СтруктураЗаполненияДокумента.documentItems);
		
		НазначениеПлатежа = СтруктураНастроек.ЗаполнениеШапки_ШаблонНазначенияПлатежа; 
		
		МассивОбязательныхПарметров = Новый Массив;
		МассивОбязательныхПарметров.Добавить("%НомерДокумента%");
		МассивОбязательныхПарметров.Добавить("%ДатаДокумента%");
		МассивОбязательныхПарметров.Добавить("%Сумма%");
		МассивОбязательныхПарметров.Добавить("%ТекстНДС%");
		
		Для каждого ОбязательныйПараметр Из МассивОбязательныхПарметров Цикл 
			
			Если Найти(НазначениеПлатежа, ОбязательныйПараметр) > 0 Тогда 
				Значение = СоответствиеПараметров.Получить(ОбязательныйПараметр);
				НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа,ОбязательныйПараметр,Значение);
	        КонецЕсли;
		КонецЦикла;	
		  
		КоличествоСимволовВШаблоне = СтрДлина(НазначениеПлатежа);
				
		Для каждого ЭлементСоответствия Из СоответствиеПараметров Цикл 
			
			//Проверяем кол-во символов кажого элемента соответствия. Режем значение превышающие длину свободных символов
			Если Найти(НазначениеПлатежа, ЭлементСоответствия.Ключ) > 0 Тогда  	
				
				//Вычисляем сколько свободных символов есть в строке
				ДоступноСимволов = 210 - КоличествоСимволовВШаблоне + СтрДлина(ЭлементСоответствия.Ключ);
				
				//Следует почистить недопустимые в назначении платежа символы: длинные тире и кавычки-ёлочки
				Значение = ЭлементСоответствия.Значение;
				Значение = СтрЗаменить(Значение,"«","");
				Значение = СтрЗаменить(Значение,"»","");
				Значение = СтрЗаменить(Значение,"—","");
				Значение = СокрЛП(Значение);
				
				//Вычисляем сколько символов в значении
				КоличествоСимволовВЗначении = СтрДлина(Значение);
								
				НовоеЗначение = Лев(Значение, ДоступноСимволов);
				НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа,ЭлементСоответствия.Ключ,НовоеЗначение);
				
				КоличествоСимволовВШаблоне = СтрДлина(НазначениеПлатежа);
				
			КонецЕсли;
		КонецЦикла;
		
	Иначе
	
		ДанныеДокумента = СтруктураЗаполненияДокумента.document;
		
		ТекстНазначение = "Оплата по счету " + ДанныеДокумента.number + ?(ЗначениеЗаполнено(ДанныеДокумента.date)," от " + Формат(ДанныеДокумента.date,"ДФ=dd.MM.yyyy"),"");
		
		Попытка СуммаДокумента = Число(ДанныеДокумента.amount); Исключение; СуммаДокумента = ДанныеДокумента.amount; КонецПопытки;
		
		ТекстСумма = "Сумма " + Формат(СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=");
		ТекСтавка = 0;
		
		Если СтруктураЗаполненияДокумента.documentItems.Количество() > 0 Тогда
			vatRate = СтруктураЗаполненияДокумента.documentItems[0].vatRate;
					
			Если vatRate = "PERCENT_22" Тогда
				ТекСтавка = 22;
			ИначеЕсли vatRate = "PERCENT_20" Тогда
				ТекСтавка = 20;
			ИначеЕсли vatRate = "PERCENT_18" Тогда
				ТекСтавка = 18;
			ИначеЕсли vatRate = "PERCENT_10" Тогда
				ТекСтавка = 10;
			ИначеЕсли vatRate = "PERCENT_12" Тогда
				ТекСтавка = 12;
			ИначеЕсли vatRate = "PERCENT_16" Тогда
				ТекСтавка = 16;
			ИначеЕсли vatRate = "PERCENT_5" Тогда
				ТекСтавка = 5;
			ИначеЕсли vatRate = "PERCENT_7" Тогда
				ТекСтавка = 7;
				
			//E1C-509: появились счета-фактуры на аванс
			ИначеЕсли vatRate = "PERCENT_18_118" Тогда
				ТекСтавка = 18;
			ИначеЕсли vatRate = "PERCENT_20_120" Тогда
				ТекСтавка = 20;
			ИначеЕсли vatRate = "PERCENT_22_122" Тогда
				ТекСтавка = 22;
			ИначеЕсли vatRate = "PERCENT_10_110" Тогда
				ТекСтавка = 10;
			ИначеЕсли vatRate = "PERCENT_7_107" Тогда
				ТекСтавка = 7;
			ИначеЕсли vatRate = "PERCENT_5_105" Тогда
				ТекСтавка = 5;
			КонецЕсли;
			
		КонецЕсли;
		
		Попытка СуммаНДС = Число(ДанныеДокумента.vat); Исключение СуммаНДС = 0; КонецПопытки;
		
		Если ТекСтавка = 0 Тогда
			ТекстНДС = "Без налога (НДС)";
		ИначеЕсли СуммаНДС > 0 Тогда
			ТекстНДС = "В т.ч. НДС "
			+ ?(ЗначениеЗаполнено(ТекСтавка), "(" + ТекСтавка + "%) ", "")
			+ Формат(СуммаНДС, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=");
		Иначе
			ТекстНДС = "";
		КонецЕсли;
		
		ТекстСуммаНазначения = ТекстСумма + ?(ТекстСумма = "", "", Символы.ПС) + ТекстНДС;
			
		НазначениеПлатежа = ТекстНазначение + ?(ПустаяСтрока(ТекстСуммаНазначения), "", Символы.ПС + ТекстСуммаНазначения);
		
	КонецЕсли;
	
	Возврат НазначениеПлатежа;
	
КонецФункции

Функция ЗаполнениеДокумента_Договор_СформироватьПредставление(ДанныеДокументаПортала,СтруктураНастроек) Экспорт
	
	//Исходный шаблон, заданный пользователем
	ПредставлениеДоговора = СтруктураНастроек.ЗаполнениеШапки_НаименованиеНовогоДоговора;
	
	//E1C-516: снова нет, строка Распознанные данные формируется как %Name% №%Number% от %Date%.
	//Частицы "№" и "от" используются, если поля Number и Date - не пустые.
	ПредставлениеДоговора = "";
	
	Если ЗначениеЗаполненоXDTO(ДанныеДокументаПортала.transferBaseName) Тогда
		ПредставлениеДоговора = ДанныеДокументаПортала.transferBaseName;
	КонецЕсли;
	
	Если ЗначениеЗаполненоXDTO(ДанныеДокументаПортала.transferBaseNumber) Тогда
		ПредставлениеДоговора = ПредставлениеДоговора + " №" + ДанныеДокументаПортала.transferBaseNumber;
	КонецЕсли;
	
	Если ЗначениеЗаполненоXDTO(ДанныеДокументаПортала.transferBaseDate) Тогда
		ПредставлениеДоговора = ПредставлениеДоговора + " от " + Формат(ДанныеДокументаПортала.transferBaseDate,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Возврат ПредставлениеДоговора;
	
КонецФункции


Функция СформироватьИмяФайлаСканаПоШаблону(АдресХранилищаДанныхПортала,ДанныеПортала,ДокументИД,ИсходноеИмя,СтруктураНастроек) Экспорт
	
	//ИНН контрагента,
	//Тип документа,
	//Номер документа,
	//Дата документа,
	//Сумма по документу,
	//Наименование контрагента.
	//Если шаблон не задан - используется имя файла, полученное от портала.
	
	Если ЗначениеЗаполнено(СтруктураНастроек.СозданиеДокумента_ШаблонИмениФайлаСкана) Тогда
		
		ИмяФайла = СтруктураНастроек.СозданиеДокумента_ШаблонИмениФайлаСкана;
		
		//Определяем расширение исходного файла
		ЧастиИмениФайла = Энтера_РазложитьСтрокуВМассивПодстрок(ИсходноеИмя,".");
		Если ЧастиИмениФайла.Количество() > 1 Тогда
			РасширениеБезТочки = ЧастиИмениФайла[ЧастиИмениФайла.Количество() - 1];
		КонецЕсли;
		
		Если ДанныеПортала = Неопределено Тогда
			ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
		КонецЕсли;
		
		ДанныеДокумента = ДанныеПортала.documents.НайтиСтроки(Новый Структура("id",ДокументИД))[0];
		
		// %documentType%
		Если Найти(ИмяФайла,"%documentType%") > 0 Тогда
			ИмяФайла = СтрЗаменить(ИмяФайла,"%documentType%",ДанныеДокумента.type);
		КонецЕсли;
		
		// %documentTypeRussian%
		Если Найти(ИмяФайла,"%documentTypeRussian%") > 0 Тогда
			ИмяФайла = СтрЗаменить(ИмяФайла,"%documentTypeRussian%",ДанныеДокумента.ПредставлениеТипа);
		КонецЕсли;
		
		// %documentTypeCode%
		Если Найти(ИмяФайла,"%documentTypeCode%") > 0 Тогда
			ИмяФайла = СтрЗаменить(ИмяФайла,"%documentTypeCode%",ДанныеДокумента.КодТипаДокумента);
		КонецЕсли;
		
		// %documentNumber%
		Если Найти(ИмяФайла,"%documentNumber%") > 0 Тогда
			ИмяФайла = СтрЗаменить(ИмяФайла,"%documentNumber%",ДанныеДокумента.number);
		КонецЕсли;
		
		// %documentDate%
		Если Найти(ИмяФайла,"%documentDate%") > 0 Тогда
			ИмяФайла = СтрЗаменить(ИмяФайла,"%documentDate%",Формат(ДанныеДокумента.date,"ДФ=dd.MM.yyyy"));
		КонецЕсли;
		
		// %documentDateReflect%
		Если Найти(ИмяФайла,"%documentDateReflect%") > 0 Тогда
			ИмяФайла = СтрЗаменить(ИмяФайла,"%documentDateReflect%",Формат(ДанныеДокумента.date,"ДФ=yyyy.MM.dd"));
		КонецЕсли;
		
		// %documentAmount%
		Если Найти(ИмяФайла,"%documentAmount%") > 0 Тогда
			ИмяФайла = СтрЗаменить(ИмяФайла,"%documentAmount%",Формат(ДанныеДокумента.amount,"ЧДЦ=2; ЧРД=-; ЧРГ=; ЧГ=0"));
		КонецЕсли;
		
		// %customerInn%
		Если Найти(ИмяФайла,"%customerInn%") > 0 Тогда
			ИмяФайла = СтрЗаменить(ИмяФайла,"%customerInn%",ДанныеДокумента.customerInn);
		КонецЕсли;
		
		// %customerKpp%
		Если Найти(ИмяФайла,"%customerKpp%") > 0 Тогда
			ИмяФайла = СтрЗаменить(ИмяФайла,"%customerKpp%",ДанныеДокумента.customerKpp);
		КонецЕсли;
		
		// %customerName%
		Если Найти(ИмяФайла,"%customerName%") > 0 Тогда
			ИмяФайла = СтрЗаменить(ИмяФайла,"%customerName%",ДанныеДокумента.customerShortName);
		КонецЕсли;
		
		// %supplierInn%
		Если Найти(ИмяФайла,"%supplierInn%") > 0 Тогда
			ИмяФайла = СтрЗаменить(ИмяФайла,"%supplierInn%",ДанныеДокумента.supplierInn);
		КонецЕсли;
		
		// %supplierKpp%
		Если Найти(ИмяФайла,"%supplierKpp%") > 0 Тогда
			ИмяФайла = СтрЗаменить(ИмяФайла,"%supplierKpp%",ДанныеДокумента.supplierKpp);
		КонецЕсли;
		
		// %supplierName%
		Если Найти(ИмяФайла,"%supplierName%") > 0 Тогда
			ИмяФайла = СтрЗаменить(ИмяФайла,"%supplierName%",ДанныеДокумента.supplierShortName);
		КонецЕсли;
		
		// %currentDate%
		Если Найти(ИмяФайла,"%currentDate%") > 0 Тогда
			ИмяФайла = СтрЗаменить(ИмяФайла,"%currentDate%",Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РасширениеБезТочки) Тогда
			ИмяФайла = ИмяФайла + "." + РасширениеБезТочки;
		КонецЕсли;
		
		//Нужно почистить "запрещенные" символы, которые могут присутствовать в получившейся строке и вызывать ошибку
		//при открытии файла в пользовательском режиме: из того, что удалось поймать: кавычки, двоеточия
		ИмяФайла = СтрЗаменить(ИмяФайла,"""","_");
		ИмяФайла = СтрЗаменить(ИмяФайла,":","_");
		
	Иначе
		ИмяФайла = ИсходноеИмя;
		
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции


Функция СформироватьПредставлениеДокументаПортала(ДанныеДокументаПортала) Экспорт
	
	ПредставлениеДокумента = Строка(ДанныеДокументаПортала.ПредставлениеТипа)
		+ " №" + ДанныеДокументаПортала.number
		+ " от " + Формат(ДанныеДокументаПортала.date,"ДФ=dd.MM.yyyy");
		
	Возврат ПредставлениеДокумента;
	
КонецФункции


// ================= Модуль кастомизации ===================

Функция МодульКастомизации_ОбработатьСобытие(ИмяСобытия,ПараметрыОбработки) Экспорт
	
	РезультатОбработки = Новый Структура("Успешно,ТекстОшибки",Ложь);
	
	СтруктураНастроек = ПараметрыОбработки.СтруктураНастроек;
	
	//Комментарий для аудитора: Для Фреш не выполняется подключение дополнительной внешней обработки "Модуль кастомизации",
	//реквизит ЭтоФреш определяется в процедуре ПриСозданииНаСервере основной формы обработки УФ_ОсновнаяФорма,
	//после этого он передается в данную структуру настроек в форме настроек УФ_Настройки
	Если СтруктураНастроек.ЭтоФреш Тогда
		РезультатОбработки.Успешно = Истина;
		Возврат РезультатОбработки;
	КонецЕсли;
	
	//Список событий поиска ссылок на объекты
	//ПоискСсылок_ОпределениеНаправления
	//ПоискСсылок_ОпределениеПлательщикаПоставщика
	//ПоискСсылок_ОпределениеДоговора
	//ПоискСсылок_ОпределениеНоменклатуры
	//ПоискСсылок_ОпределениеЕдиницыИзмерения
	//ПоискСсылок_ОпределениеСтавкиНДС
	//ПоискСсылок_ОпределениеНомераГТД
	//ПоискСсылок_ОпределениеСтраныПроисхождения
	//ПоискСсылок_ПослеОбработкиВсехОбъектов
	
	//Дубликаты_ПередПрисоединениемФайлов
	//Дубликаты_УстановкаСсылки	
	
	//Список событий создания/заполнения документа:
	//Документ_ПередЗаполнениемШапки
	//Документ_ПослеЗаполненияШапки
	//Документ_ПередЗаполнениемСтрокиТЧ
	//Документ_ПослеЗаполненияСтрокиТЧ
	//Документ_ПередЗаписьюДокумента
	//Документ_ПередПрисоединениемФайлов
	//СчетФактура_ПередЗаполнениемШапки
	//СчетФактура_ПередЗаписьюДокумента
	//СчетФактура_ПередПрисоединениемФайлов
	//Документ_ПередЗаписьюПоступлениеДопРасходов
	//Документ_ПослеЗаписиПоступлениеДопРасходов
	
	//Список событий создания элементов справочников:
	//Сопоставление_ПередФормированиемНазначенияПлатежа
	//Сопоставление_ПослеДобавленияСтрокиТаблицыСопоставления
	//Сопоставление_ПередСозданиемОбъектов
	//Сопоставление_ПослеПереносаСтрокиДанныхДокумента
	//Сопоставление_Контрагент_ПередЗаписью
	//Сопоставление_Договор_ПередЗаписью
	//Сопоставление_Номенклатура_ПередЗаписью
	//Сопоставление_НоменклатураПоставщика_ПередЗаписью
	//Сопоставление_НомерГТД_ПередЗаписью
	//Сопоставление_СтранаМира_ПередЗаписью
	
	Если ЗначениеЗаполнено(СтруктураНастроек.АдресХранилищаДвоичныхДанныхМодуляКастомизации) Тогда
		
		ПолучениеМК = ЭтотОбъект._УФ_МодульКастомизации_Получить(СтруктураНастроек);
		Если ПолучениеМК.Успешно Тогда
			
			МодульКастомизации = ПолучениеМК.Обработка;
			
			ИдентификаторДокумента = ?(ПараметрыОбработки.Свойство("ДокументИД"),ПараметрыОбработки.ДокументИД,"Неопределено");
			
			ОписаниеОбработчика = ИмяСобытия + ": передача события для обработки в МК (documentId=" + ИдентификаторДокумента + ")";
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Модуль",ОписаниеОбработчика,"ВыполнениеМК");
			
			//Для обратной совместимости со старыми модулями кастомизации, передаем АдресХранилищаПротоколаРаботы в параметрах
			АдресХранилищаПротоколаРаботы = ПоместитьВоВременноеХранилище(Инициализировать_ПротоколРаботы(),Новый УникальныйИдентификатор);
			ПараметрыОбработки.Вставить("АдресХранилищаПротоколаРаботы",АдресХранилищаПротоколаРаботы);
			
			//и структуре настроек
			СтруктураНастроек.Вставить("АдресХранилищаПротоколаРаботы",АдресХранилищаПротоколаРаботы);
			ПараметрыОбработки.Вставить("СтруктураНастроек",СтруктураНастроек);
			
			//новый вариант предполагает передачу данных для протокола в параметре ПротоколМК
			ПараметрыОбработки.Вставить("ПротоколМК","");
			
			//Для вызова функций и процедур основного модуля
			ПараметрыОбработки.Вставить("ОсновнойМодуль",ЭтотОбъект);
			
			Попытка
				МодульКастомизации.ОбработатьСобытиеОсновногоМодуля(ИмяСобытия,ПараметрыОбработки);
				РезультатОбработки.Успешно = Истина;
				
				//Поскольку протокол работы теперь у нас хранится в табличной части основного модуля,
				//запишем в протокол то, что нам отдал модуль кастомизации
				Если ПараметрыОбработки.Свойство("ПротоколМК") и ЗначениеЗаполнено(ПараметрыОбработки.ПротоколМК) Тогда
					ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Модуль","МК: " + ПараметрыОбработки.ПротоколМК,"ВыполнениеМК");
				КонецЕсли;
				
			Исключение
				ТекстОшибки = КраткоеОписаниеОшибки(ОписаниеОшибки());
				РезультатОбработки.ТекстОшибки = ТекстОшибки;
				
				Если ПараметрыОбработки.Свойство("ТекстОшибки") Тогда
					ПараметрыОбработки.ТекстОшибки = ТекстОшибки;
				КонецЕсли;
				
				ОписаниеОбработчика = ИмяСобытия + ": при обработке события в МК (documentId=" + ИдентификаторДокумента + "): возникла ошибка" + Символы.ПС + ТекстОшибки;
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Модуль",ОписаниеОбработчика,"Ошибка");
			КонецПопытки;
			
			//для обратной совместимости обработаем также переданную таблицу по адресу АдресХранилищаПротоколаРаботы
			Если ПараметрыОбработки.Свойство("АдресХранилищаПротоколаРаботы")
				И ЭтоАдресВременногоХранилища(ПараметрыОбработки.АдресХранилищаПротоколаРаботы) Тогда
				СтарыйПротокол = ПолучитьИзВременногоХранилища(ПараметрыОбработки.АдресХранилищаПротоколаРаботы);
				Если ТипЗнч(СтарыйПротокол) = Тип("ТаблицаЗначений") И СтарыйПротокол.Количество() > 0 Тогда
					Для Каждого СтрокаПротокола Из СтарыйПротокол Цикл
						ЗаполнитьЗначенияСвойств(ПротоколРаботы.Добавить(),СтрокаПротокола);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;			
			
			//удалим из структуры параметров основной модуль
			ПараметрыОбработки.Удалить("ОсновнойМодуль");
		Иначе
			РезультатОбработки.ТекстОшибки = ПолучениеМК.ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатОбработки;
	
КонецФункции


// ================= Вспомогательные функции ===================

Функция ПолучитьКоллекциюXDTO(ОбъектXDTO) Экспорт
	Если ТипЗнч(ОбъектXDTO) = Тип("ОбъектXDTO") Тогда
		Коллекция = Новый Массив;
		Если ОбъектXDTO.Свойства().Количество() > 0 Тогда
			Коллекция.Добавить(ОбъектXDTO);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ОбъектXDTO) = Тип("СписокXDTO") Тогда
		Коллекция = ОбъектXDTO;
	Иначе
		
	КонецЕсли;
	
	Возврат Коллекция;
КонецФункции

Функция ЗначениеЗаполненоXDTO(Значение) Экспорт
	Если ТипЗнч(Значение) = Тип("ОбъектXDTO") Тогда
		Результат = Значение.Свойства().Количество() > 0;
	Иначе
		Результат = ЗначениеЗаполнено(Значение);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция СвойствоXDTOСуществует(ОбъектXDTO,ИмяСвойства) Экспорт
	Возврат ОбъектXDTO.Свойства().Получить(ИмяСвойства) <> Неопределено;
КонецФункции

Функция ПолучитьЗначениеПоляXDTO(ОбъектXDTO,ИмяСвойства,ЭтоЧисло = Ложь)
	
	Если СвойствоXDTOСуществует(ОбъектXDTO,ИмяСвойства)
		И ЗначениеЗаполненоXDTO(ОбъектXDTO[ИмяСвойства]) Тогда
		Значение = ОбъектXDTO[ИмяСвойства];
	КонецЕсли;
	
	//Добавим приведение к типу число
	Если ЭтоЧисло Тогда
		Если Значение = Неопределено Тогда
			Значение = 0;
		Иначе
			Попытка
				Значение = Число(Значение);
			Исключение
				Значение = 0;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ПолучитьДатуИзДатыПортала(ДатаПортала,ЭтоМоментВремени = Ложь) Экспорт
	
	Результат = Дата(1,1,1);
	
	Если ЗначениеЗаполненоXDTO(ДатаПортала) Тогда
		
		Если СтрДлина(ДатаПортала) = 10 И Сред(ДатаПортала,3,1) = "." И Сред(ДатаПортала,6,1) = "." Тогда
			//Даты документов ЭДО передаются в формате строки "ДД.ММ.ГГГГ"
			Результат = Дата(Сред(ДатаПортала,7,4) + Сред(ДатаПортала,4,2) + Сред(ДатаПортала,1,2));
			
		ИначеЕсли СтрДлина(ДатаПортала) = 13 Тогда
			//Unix timeStamp в миллисекундах
			Результат = Дата('19700101')+ ДатаПортала/1000;
			
		Иначе
			СокрДата = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(ДатаПортала,"-",""),".",""),":",""),"T",""),"Z","");
			Если СтрДлина(СокрДата) > 14 Тогда
				СокрДата = Лев(СокрДата,14);
			КонецЕсли;
			Попытка
				Результат = Дата(СокрДата);
			Исключение
				СообщитьСообщение("Ошибка преобразования даты: " + ДатаПортала);
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоМоментВремени И ТипЗнч(Результат) = Тип("Дата") Тогда
		//Добавляем к полученному моменту времени поправку часового пояса пользователя
		Результат = Результат + СмещениеСтандартногоВремени(ЧасовойПояс());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭкранироватьСпецсимволыJSON(Знач Строка) Экспорт
	Строка = СтрЗаменить(Строка,"\","\\");
	Строка = СтрЗаменить(Строка,"""","\""");
	Строка = СтрЗаменить(Строка,Символы.Таб," ");
	Строка = СтрЗаменить(Строка,Символы.ПС,"\n");
	Возврат Строка;
КонецФункции

Функция СтрокаJSON(Знач Строка)
	Возврат """" + Строка + """";
КонецФункции

Функция СформироватьJSONСтрокуСтруктуры(ЗаписьТекста, Структура, Ключ,	ИмяПоля = Неопределено, ФорматированноеЗначение = Неопределено, ВыводитьПустые = Ложь, ЭтоЧисло = Ложь, ПервыйЭлемент = Ложь)
	//Старые платформы не умеют в JSON
	Если ПервыйЭлемент Или ВыводитьПустые Или ЗначениеЗаполнено(ФорматированноеЗначение) Или (Структура.Свойство(Ключ) И ЗначениеЗаполнено(Структура[Ключ])) Тогда
		Значение = ?(ФорматированноеЗначение = Неопределено,Структура[Ключ],ФорматированноеЗначение);
		
		ЗаписьТекста.ДобавитьСтроку(?(ПервыйЭлемент,"","," + Символы.ПС) +
		СтрокаJSON(?(ЗначениеЗаполнено(ИмяПоля), ИмяПоля, Ключ)) + ": "
			+ СтрокаJSON(ЭкранироватьСпецсимволыJSON(Значение)));
	КонецЕсли;
КонецФункции

Функция Энтера_РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Результат = Новый Массив;
	
	// Для обеспечения обратной совместимости.
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Строка));
		Иначе
			Результат.Добавить(Строка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция Энтера_НаименованиеОрганизации(Знач Наименование) Экспорт
	
	Наименование = СокрЛП(Наименование);
	
	ВыделятьНаименованиеКавычками = Истина;
	
	Если Энтера_УбратьИзНаименованияОПФ(Наименование, НСтр("ru='ООО'")) Тогда
		ОрганизационноПравоваяФорма				= НСтр("ru='Общество с ограниченной ответственностью'");
		ОрганизационноПравоваяФормаСокращенно	= НСтр("ru='ООО'");
	ИначеЕсли Энтера_УбратьИзНаименованияОПФ(Наименование, НСтр("ru='ОАО'")) Тогда
		ОрганизационноПравоваяФорма				= НСтр("ru='Открытое акционерное общество'");
		ОрганизационноПравоваяФормаСокращенно	= НСтр("ru='ОАО'");
	ИначеЕсли Энтера_УбратьИзНаименованияОПФ(Наименование, НСтр("ru='ЗАО'")) Тогда
		ОрганизационноПравоваяФорма				= НСтр("ru='Закрытое акционерное общество'");
		ОрганизационноПравоваяФормаСокращенно	= НСтр("ru='ЗАО'");
	ИначеЕсли Энтера_УбратьИзНаименованияОПФ(Наименование, НСтр("ru='АО'")) Тогда
		ОрганизационноПравоваяФорма				= НСтр("ru='Акционерное общество'");
		ОрганизационноПравоваяФормаСокращенно	= НСтр("ru='АО'");
	ИначеЕсли Энтера_УбратьИзНаименованияОПФ(Наименование, НСтр("ru='ИП'")) Тогда
		ОрганизационноПравоваяФорма				= НСтр("ru='Индивидуальный предприниматель'");
		ОрганизационноПравоваяФормаСокращенно	= НСтр("ru='ИП'");
		ВыделятьНаименованиеКавычками = Ложь;
	ИначеЕсли Энтера_УбратьИзНаименованияОПФ(Наименование, НСтр("ru='Общество с ограниченной ответственностью'")) Тогда
		ОрганизационноПравоваяФорма				= НСтр("ru='Общество с ограниченной ответственностью'");
		ОрганизационноПравоваяФормаСокращенно	= НСтр("ru='ООО'");
	ИначеЕсли Энтера_УбратьИзНаименованияОПФ(Наименование, НСтр("ru='Открытое акционерное общество'")) Тогда
		ОрганизационноПравоваяФорма				= НСтр("ru='Открытое акционерное общество'");
		ОрганизационноПравоваяФормаСокращенно	= НСтр("ru='ОАО'");
	ИначеЕсли Энтера_УбратьИзНаименованияОПФ(Наименование, НСтр("ru='Закрытое акционерное общество'")) Тогда
		ОрганизационноПравоваяФорма				= НСтр("ru='Закрытое акционерное общество'");
		ОрганизационноПравоваяФормаСокращенно	= НСтр("ru='ЗАО'");
	ИначеЕсли Энтера_УбратьИзНаименованияОПФ(Наименование, НСтр("ru='Акционерное общество'")) Тогда
		ОрганизационноПравоваяФорма				= НСтр("ru='Акционерное общество'");
		ОрганизационноПравоваяФормаСокращенно	= НСтр("ru='АО'");
	ИначеЕсли Энтера_УбратьИзНаименованияОПФ(Наименование, НСтр("ru='Индивидуальный предприниматель'")) Тогда
		ОрганизационноПравоваяФорма				= НСтр("ru='Индивидуальный предприниматель'");
		ОрганизационноПравоваяФормаСокращенно	= НСтр("ru='ИП'");
		ВыделятьНаименованиеКавычками = Ложь;
	Иначе
		ОрганизационноПравоваяФорма				= "";
		ОрганизационноПравоваяФормаСокращенно	= "";
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ОрганизационноПравоваяФорма) Тогда
		КоличествоКавычек	= СтрЧислоВхождений(Наименование, """");
		Если КоличествоКавычек > 1 Тогда
			// Наименование организации внутри внешних кавычек
			ПозицияПервойКавычки = Найти(Наименование, """");
			ПозицияПоследнейКавычки = 0;
			
			ВремНаименование = Наименование;
			
			ПозицияКавычки = ПозицияПервойКавычки;
			Пока ПозицияКавычки > 0 Цикл
				ПозицияПоследнейКавычки = ПозицияПоследнейКавычки + ПозицияКавычки;
				ВремНаименование = Сред(ВремНаименование, ПозицияКавычки + 1);
				ПозицияКавычки = Найти(ВремНаименование, """");
			КонецЦикла;
			
			Наименование = Сред(Наименование, ПозицияПервойКавычки + 1, ПозицияПоследнейКавычки - ПозицияПервойКавычки - 1);
			Если НЕ КоличествоКавычек%2 = 0 Тогда
				Наименование = Наименование + """";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОрганизационноПравоваяФорма) Тогда
		ПолноеНаименование = Наименование;
	Иначе
		ШаблонСтроки = ?(ВыделятьНаименованиеКавычками,"%1 ""%2""","%1 %2");
		ПолноеНаименование = Энтера_ПодставитьПараметрыВСтроку(ШаблонСтроки,
			ОрганизационноПравоваяФорма, Наименование);
	КонецЕсли;
	
	СокращенноеНаименование = Наименование + ?(ПустаяСтрока(ОрганизационноПравоваяФормаСокращенно), "", " ")
		+ ОрганизационноПравоваяФормаСокращенно;
	
	СтруктураНаименования = Новый Структура("Наименование, СокращенноеНаименование, ПолноеНаименование",
		Наименование, СокращенноеНаименование, ПолноеНаименование);
	
	Возврат СтруктураНаименования;
	
КонецФункции

Функция Энтера_УбратьИзНаименованияОПФ(Наименование, ИмяОрганизационнойФормы)

	Результат = Ложь;
	
	Наименование = СокрЛП(Наименование);
	
	ДлинаНаименования			= СтрДлина(Наименование);
	ДлинаОрганизационнойФормы	= СтрДлина(ИмяОрганизационнойФормы);
	
	Если Нрег(Лев(Наименование, ДлинаОрганизационнойФормы)) = Нрег(ИмяОрганизационнойФормы) Тогда
		Наименование	= СокрЛ(Сред(Наименование, ДлинаОрганизационнойФормы + 1));
		Результат		= Истина;
	КонецЕсли;	
	
	Если Нрег(Прав(Наименование, ДлинаОрганизационнойФормы)) = Нрег(ИмяОрганизационнойФормы) Тогда
		Наименование	= СокрП(Лев(Наименование, ДлинаНаименования - ДлинаОрганизационнойФормы - 1));
		Результат		= Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Энтера_ПодставитьПараметрыВСтроку(Знач ШаблонСтроки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	ЕстьПараметрыСПроцентом = Найти(Параметр1, "%")
		Или Найти(Параметр2, "%")
		Или Найти(Параметр3, "%")
		Или Найти(Параметр4, "%")
		Или Найти(Параметр5, "%")
		Или Найти(Параметр6, "%")
		Или Найти(Параметр7, "%")
		Или Найти(Параметр8, "%")
		Или Найти(Параметр9, "%");
		
	Если ЕстьПараметрыСПроцентом Тогда
		Возврат Энтера_ПодставитьПараметрыСПроцентом(ШаблонСтроки, Параметр1,
			Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	КонецЕсли;
	
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%2", Параметр2);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%3", Параметр3);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%4", Параметр4);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%5", Параметр5);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%6", Параметр6);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%7", Параметр7);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%8", Параметр8);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%9", Параметр9);
	Возврат ШаблонСтроки;
	
КонецФункции

Функция Энтера_ПодставитьПараметрыСПроцентом(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
	
	Результат = "";
	Позиция = Найти(СтрокаПодстановки, "%");
	Пока Позиция > 0 Цикл 
		Результат = Результат + Лев(СтрокаПодстановки, Позиция - 1);
		СимволПослеПроцента = Сред(СтрокаПодстановки, Позиция + 1, 1);
		ПодставляемыйПараметр = Неопределено;
		Если СимволПослеПроцента = "1" Тогда
			ПодставляемыйПараметр = Параметр1;
		ИначеЕсли СимволПослеПроцента = "2" Тогда
			ПодставляемыйПараметр = Параметр2;
		ИначеЕсли СимволПослеПроцента = "3" Тогда
			ПодставляемыйПараметр = Параметр3;
		ИначеЕсли СимволПослеПроцента = "4" Тогда
			ПодставляемыйПараметр = Параметр4;
		ИначеЕсли СимволПослеПроцента = "5" Тогда
			ПодставляемыйПараметр = Параметр5;
		ИначеЕсли СимволПослеПроцента = "6" Тогда
			ПодставляемыйПараметр = Параметр6;
		ИначеЕсли СимволПослеПроцента = "7" Тогда
			ПодставляемыйПараметр = Параметр7
		ИначеЕсли СимволПослеПроцента = "8" Тогда
			ПодставляемыйПараметр = Параметр8;
		ИначеЕсли СимволПослеПроцента = "9" Тогда
			ПодставляемыйПараметр = Параметр9;
		КонецЕсли;
		Если ПодставляемыйПараметр = Неопределено Тогда
			Результат = Результат + "%";
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 1);
		Иначе
			Результат = Результат + ПодставляемыйПараметр;
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 2);
		КонецЕсли;
		Позиция = Найти(СтрокаПодстановки, "%");
	КонецЦикла;
	Результат = Результат + СтрокаПодстановки;
	
	Возврат Результат;
КонецФункции


Функция ПолучитьЗначениеСоответствия(КоллекцияСоответствий,Ключ)
	Значение = КоллекцияСоответствий.Получить(Ключ);	
	Возврат Значение;
КонецФункции

Функция РеквизитСуществует(РазделМетаданных, ОбъектМетаданных, ИмяРеквизита = Неопределено, ИмяТабЧасти = Неопределено) Экспорт
	
	Существует = Ложь;
		
	Если Метаданные[РазделМетаданных].Найти(ОбъектМетаданных) <> Неопределено Тогда
		Если ИмяРеквизита = Неопределено И ИмяТабЧасти = Неопределено Тогда
			Существует = Истина;
		Иначе	
			Если ИмяТабЧасти = Неопределено Тогда
				Если РазделМетаданных = "Перечисления" Тогда
					Если Метаданные[РазделМетаданных][ОбъектМетаданных].ЗначенияПеречисления.Найти(ИмяРеквизита) <> Неопределено Тогда
						Существует = Истина;
					КонецЕсли;
				Иначе
					Если Метаданные[РазделМетаданных][ОбъектМетаданных].Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
						Существует = Истина;
					КонецЕсли;
				КонецЕсли;
			Иначе
				ТабличнаяЧасть = Метаданные[РазделМетаданных][ОбъектМетаданных].ТабличныеЧасти.Найти(ИмяТабЧасти);
				Если ТабличнаяЧасть <> Неопределено И ТабличнаяЧасть.Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
					Существует = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Существует;
КонецФункции

Функция КраткоеОписаниеОшибки(ТекстОшибки) Экспорт
	
	КонецСлужебнойИнформации = Найти(ТекстОшибки,"}: ");
	Если КонецСлужебнойИнформации > 0 Тогда
		ТекстОшибки = Сред(ТекстОшибки,КонецСлужебнойИнформации + 3);
	КонецЕсли;				
	
	Возврат ТекстОшибки;
	
КонецФункции


// ================= Формирование и отправка данных о созданных документах ===================

Функция УведомлениеПорталуОСозданииДокументов_СформироватьТелоЗапроса(ЗаданияУведомления) Экспорт
		
	ИдентификаторБазы = ПолучитьНавигационнуюСсылкуИнформационнойБазы(); //будет служить идентификатором базы
	ОписаниеБазы = Метаданные.Синоним;
	
	//формируем тело запроса уведомления об успешном создании документов в текущей базе
	ТелоЗапроса = "{" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """infos"": [";
	
	ПервыйЭлемент = Истина;
	Для Каждого Задание Из ЗаданияУведомления Цикл
		
		Если ПервыйЭлемент Тогда
			ПервыйЭлемент = Ложь;
		Иначе
			ТелоЗапроса = ТелоЗапроса + "," + Символы.ПС;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Задание.Значение) Тогда
			ГУИДЭлемента = Задание.Значение.УникальныйИдентификатор();
			ТипЭлемента = Задание.Значение.Метаданные().Имя;
			ОписаниеЭлемента = ЭкранироватьСпецсимволыJSON(Строка(Задание.Значение));
		Иначе
			ГУИДЭлемента = "00000000-0000-0000-0000-000000000000";
			ТипЭлемента = "";
			ОписаниеЭлемента = "Ручное изменение статуса на <Выгружен>";
		КонецЕсли;
		
		ТелоЗапроса = ТелоЗапроса + "{" + Символы.ПС;
		ТелоЗапроса = ТелоЗапроса + """documentId"": """ + Задание.Представление + """," + Символы.ПС;
		ТелоЗапроса = ТелоЗапроса + """externalId"": """ + ГУИДЭлемента + """," + Символы.ПС;
		
		//data
		ТелоЗапроса = ТелоЗапроса + """data"": {" + Символы.ПС;
		ТелоЗапроса = ТелоЗапроса + """type"": """ + ТипЭлемента + """," + Символы.ПС;
		ТелоЗапроса = ТелоЗапроса + """description"": """ + ОписаниеЭлемента + " <" + Строка(ТекущаяДата()) + ">""," + Символы.ПС;
		ТелоЗапроса = ТелоЗапроса + """dbGuid"": """ + ЭкранироватьСпецсимволыJSON(ИдентификаторБазы) + """," + Символы.ПС;
		ТелоЗапроса = ТелоЗапроса + """dbDescription"": """ + ЭкранироватьСпецсимволыJSON(ОписаниеБазы) + """" + Символы.ПС;
		ТелоЗапроса = ТелоЗапроса + "}" + Символы.ПС; //data
		ТелоЗапроса = ТелоЗапроса + "}" + Символы.ПС; //document
	КонецЦикла;
	
	ТелоЗапроса = ТелоЗапроса + "]" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + "}";
	
	Возврат ТелоЗапроса;
	
КонецФункции


Функция ОбновлениеДанныхДокументов_СформироватьТелоЗапроса_items(ДокументИД) Экспорт
	
	//Для аудитора: это не закомментированный код, а пример метода и тела запроса, фиксируется для истории разработки.
	//PUT https://app.entera.pro/api/v1/documents/{{documentId}}/accept
	//{
	// "items": [
	// { "id": "{{itemId}}", "serialNumber": 1, "name": "Новое название" }
	// ]
	//}
	
	ТелоЗапроса = "{";
	ТелоЗапроса = ТелоЗапроса + """items"": [" + Символы.ПС;
	ПервыйЭлемент = Истина;
	
	СтруктураПоиска = Новый Структура("ДокументИД,ТипОбъекта,Номенклатура_ПредставлениеИзменено",ДокументИД,"Номенклатура",Истина);
	НайденныеСтроки = ЗагружаемыеОбъекты.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		
		Если ПервыйЭлемент Тогда
			ПервыйЭлемент = Ложь;
		Иначе
			ТелоЗапроса = ТелоЗапроса + "," + Символы.ПС;
		КонецЕсли;
		
		ТелоЗапроса = ТелоЗапроса + "{" + Символы.ПС;
		ТелоЗапроса = ТелоЗапроса + """id"" : """ + СтрокаТаблицы.ИдентификаторОбъекта + """," + Символы.ПС;
		ТелоЗапроса = ТелоЗапроса + """serialNumber"" : """ + СтрокаТаблицы.Номенклатура_serialNumber + """," + Символы.ПС;
		
		goodCode = ?(СтрокаТаблицы.Номенклатура_goodCodeIsNull,"",ЭкранироватьСпецсимволыJSON(СтрокаТаблицы.Номенклатура_Код));
		ТелоЗапроса = ТелоЗапроса + """goodCode"" : """ + goodCode + """," + Символы.ПС;
		
		ТелоЗапроса = ТелоЗапроса + """name"" : """ + ЭкранироватьСпецсимволыJSON(СтрокаТаблицы.ПредставлениеОбъекта) + """" + Символы.ПС;
		ТелоЗапроса = ТелоЗапроса + "}";
		
	КонецЦикла;
	
	ТелоЗапроса = ТелоЗапроса + "]" + Символы.ПС + "}";
	
	Возврат ТелоЗапроса;
	
КонецФункции

Функция ОбновлениеДанныхДокументов_СформироватьТелоЗапроса_suplier_customer(ДанныеДокумента) Экспорт
	
	//Для аудитора: это не закомментированный код, а пример метода и тела запроса, фиксируется для истории разработки.
	//PUT https://app.entera.pro/api/v1/documents/{{documentId}}/accept
	
	ТелоЗапроса = "{" + Символы.ПС;
	
	ТелоЗапроса = ТелоЗапроса + """customer"": {" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """id"" : """ + ДанныеДокумента.customerId + """," + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """inn"" : """ + ЭкранироватьСпецсимволыJSON(ДанныеДокумента.customerInn) + """," + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """kpp"" : """ + ЭкранироватьСпецсимволыJSON(ДанныеДокумента.customerKpp) + """," + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """name"" : """ + ЭкранироватьСпецсимволыJSON(ДанныеДокумента.customerName) + """," + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """shortName"" : """ + ЭкранироватьСпецсимволыJSON(ДанныеДокумента.customerShortName) + """" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + "}," + Символы.ПС;
	
	ТелоЗапроса = ТелоЗапроса + """supplier"": {" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """id"" : """ + ДанныеДокумента.supplierId + """," + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """inn"" : """ + ЭкранироватьСпецсимволыJSON(ДанныеДокумента.supplierInn) + """," + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """kpp"" : """ + ЭкранироватьСпецсимволыJSON(ДанныеДокумента.supplierKpp) + """," + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """name"" : """ + ЭкранироватьСпецсимволыJSON(ДанныеДокумента.supplierName) + """," + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """shortName"" : """ + ЭкранироватьСпецсимволыJSON(ДанныеДокумента.supplierShortName) + """" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + "}" + Символы.ПС;
	
	ТелоЗапроса = ТелоЗапроса + "}";
	
	Возврат ТелоЗапроса;
	
КонецФункции

Функция ОбновлениеДанныхДокументов_СформироватьТелоЗапроса_state(ДанныеДокумента) Экспорт
	
	//Для аудитора: это не закомментированный код, а пример метода и тела запроса, фиксируется для истории разработки.
	//PUT https://app.entera.pro/api/v1/documents/{{documentId}}/accept
	
	ТелоЗапроса = "{" + Символы.ПС;
	
	ТелоЗапроса = ТелоЗапроса + """uploaded"" : ""false""," + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """state"" : """ + ДанныеДокумента.state + """" + Символы.ПС;	
	
	ТелоЗапроса = ТелоЗапроса + "}";
	
	Возврат ТелоЗапроса;
	
КонецФункции


// ================= Формирование и отправка данных о номенклатуре ===================

Функция ПолучитьСсылку_УзелОбменаНоменклатурой(СоздатьЕслиНеНайден = Ложь) Экспорт
	
	Результат = Новый Структура("Успешно,ТекстОшибки",Ложь);
	
	ТекстОшибки = "";
	
	//Выбрать план обмена в данной конфигурации
	Если Метаданные.ПланыОбмена.Найти("СинхронизацияДанныхЧерезУниверсальныйФормат") <> Неопределено Тогда
		ПланОбмена = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат;
	Иначе
		ТекстОшибки = ТекстОшибки + "В метаданных конфигурации не найден подходящий план обмена." + Символы.ПС;
	КонецЕсли;
	
	// и найти/создать там узел с кодом и именем Entera
	Если ПланОбмена <> Неопределено Тогда
		УзелОбмена = ПланОбмена.НайтиПоКоду("Entera");
		
		Если Не ЗначениеЗаполнено(УзелОбмена) И СоздатьЕслиНеНайден Тогда
			
			УзелОбменаОбъект = ПланОбмена.СоздатьУзел();
			
			СтруктураЗаполнения = Новый Структура("Код,Наименование,ОтправлятьНоменклатуру,РегистрироватьИзменения","Entera","Entera",Истина,Истина);
			ЗаполнитьЗначенияСвойств(УзелОбменаОбъект,СтруктураЗаполнения);
			
			Попытка
				УзелОбменаОбъект.Записать();
				УзелОбмена = УзелОбменаОбъект.Ссылка;
				Результат.Успешно = Истина;
			Исключение
				ТекстОшибки = ТекстОшибки + КраткоеОписаниеОшибки(ОписаниеОшибки()) + Символы.ПС;
			КонецПопытки;
		КонецЕсли;	
	КонецЕсли;
	
	Результат.ТекстОшибки = ТекстОшибки;
	Результат.Вставить("Ссылка",УзелОбмена);	
	
	Возврат Результат;	
	
КонецФункции

Функция ВыполнитьРегламентноеЗадание_ВыгрузкаНоменклатуры()
	
	РезультатВыполнения = Новый Структура("Успешно,ТекстОшибки",Истина);
	
	//Пробуем восстановить сохраненные для регламентного задания настройки
	СохраненныеНастройки = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","ОбщиеНастройки",,"Entera");
	
	Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда
		
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("Токен");
		
		//Необходимо сперва авторизоваться и получить токен
		РезультатЗапроса = ВыполнитьЗапрос("Авторизация","POST",,,ПараметрыЗапроса);
		
		Если РезультатЗапроса.Успешно Тогда
			
			//Вставляем в параметры следующих запросов полученный токен
			РезультатЧтения = ПрочитатьОтветПортала("Авторизация",ПараметрыЗапроса,РезультатЗапроса.ПараметрыОтвета);
			
			Если РезультатЧтения.Успешно Тогда
				
				ПараметрыЗапроса.Токен = РезультатЧтения.Токен;
							
				//Получить таблицу номенклатуры
				Таблица = ПолучитьТаблицуНоменклатуры(СохраненныеНастройки.ОбменДанными_УзелОбменаНоменклатурой);
				
				Если Таблица.Количество() > 0 Тогда
											
					//Выгрузить номенклатуру на портал
					МассивНоменклатуры = Таблица.ВыгрузитьКолонку("Номенклатура");
					ВыгрузитьНоменклатуруНаПортал(МассивНоменклатуры,ПараметрыЗапроса,СохраненныеНастройки);
				КонецЕсли;
			Иначе				
				РезультатВыполнения.ТекстОшибки = РезультатЧтения.ТекстОшибки;
			КонецЕсли;
			
		Иначе
			РезультатВыполнения.ТекстОшибки = РезультатЗапроса.ТекстОшибки;
		КонецЕсли;
		
	Иначе
		РезультатВыполнения.ТекстОшибки = "Сохраненные ранее настройки не найдены, или имеют некорректный формат. Создайте и сохраните настройку для регламентного задания заново.";
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьТаблицуНоменклатуры(УзелОбмена = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(УзелОбмена) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	НоменклатураИзменения.Ссылка КАК Номенклатура
		               |ИЗ
		               |	Справочник.Номенклатура.Изменения КАК НоменклатураИзменения
		               |ГДЕ
		               |	НоменклатураИзменения.Узел = &Узел
		               |	И НЕ НоменклатураИзменения.Ссылка.ЭтоГруппа";
		Запрос.УстановитьПараметр("Узел",УзелОбмена);
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Номенклатура.Ссылка КАК Номенклатура
		               |ИЗ
		               |	Справочник.Номенклатура КАК Номенклатура
		               |ГДЕ
		               |	НЕ Номенклатура.ЭтоГруппа";
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ВыгрузитьНоменклатуруНаПортал(МассивНоменклатуры,ПараметрыЗапроса,НастройкиВыгрузки) Экспорт
	
	РезультатВыгрузки = Новый Структура("Успешно,ТекстОшибки",Истина);
		
	//Сперва нужно проверить наличие сохраненного идентификатора каталога, при необходимости - создать его и сохранить
	КаталогиПространств = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","КаталогиПространств",,"Entera");
	
	Если ТипЗнч(КаталогиПространств) = Тип("Соответствие") Тогда
		catalogId = КаталогиПространств.Получить(НастройкиВыгрузки.Пространство);
	Иначе
		КаталогиПространств = Новый Соответствие;
	КонецЕсли;
	
		
	//Создаем каталог для текущего пространства
	РезультатСозданияКаталога = СоздатьОбновитьКаталогВТекущемПространстве(ПараметрыЗапроса,НастройкиВыгрузки.Пространство,catalogId);
	
	Если РезультатСозданияКаталога.Успешно Тогда
		
		//Сохраняем соответствие каталога номенклатуры и пространства
		catalogId = РезультатСозданияКаталога.catalogId;
		
		КаталогиПространств.Вставить(НастройкиВыгрузки.Пространство,catalogId);
		ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","КаталогиПространств",КаталогиПространств,,"Entera");
		
	Иначе
		
		Возврат РезультатСозданияКаталога;
	КонецЕсли;
	
	//api/v1/catalogs/{catalogId}/nomenclatures
	МетодAPI = "/api/v1/catalogs/" + catalogId + "/nomenclatures";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка,
	               |	Номенклатура.Код КАК Код,
	               |	Номенклатура.Артикул КАК Артикул,
	               |	Номенклатура.Наименование КАК Наименование,
	               |	Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	               |	Номенклатура.ПометкаУдаления КАК ПометкаУдаления
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Ссылка В(&МассивНоменклатуры)";
	Запрос.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выгружено = 0;
	Обновлено = 0;
	ТекстОшибки = "";
	
	Пока Выборка.Следующий() Цикл
		
		Назначение = "СозданиеНоменклатуры";
			
		ГУИДНоменклатуры = Выборка.Ссылка.УникальныйИдентификатор();
		
		ТелоЗапроса = "{" + Символы.ПС;
		ТелоЗапроса = ТелоЗапроса + """name"": """ + Выборка.Наименование + """," + Символы.ПС;
		ТелоЗапроса = ТелоЗапроса + """code"": """ + Выборка.Код + """," + Символы.ПС;
		ТелоЗапроса = ТелоЗапроса + """externalId"": """ + ГУИДНоменклатуры + """" + Символы.ПС;
		ТелоЗапроса = ТелоЗапроса + "}";
		
		Если Выборка.ПометкаУдаления Тогда
			//помеченные на удаление позиции удаляем из справочника, чтобы не участвовали в сопоставлении
			РезультатЗапроса = ВыполнитьЗапрос(Назначение,"DELETE",МетодAPI + "/" + ГУИДНоменклатуры + "/externalId?format=xml",,ПараметрыЗапроса);
		Иначе
		
			//Сначала пытаемся обновить существующую номенклатуру PUT                                +++ как обновить по externalId? На 2018.12.25 - никак
			РезультатЗапроса = ВыполнитьЗапрос(Назначение,"PUT",МетодAPI + "/" + ГУИДНоменклатуры + "/externalId?format=xml",ТелоЗапроса,ПараметрыЗапроса);
					
			Если РезультатЗапроса.Успешно Тогда
				Обновлено = Обновлено + 1;
			
			ИначеЕсли РезультатЗапроса.ПараметрыОтвета.КодСостояния = 404 Тогда
				//пытаемся создать новую номенклатуру POST
				РезультатЗапроса = ВыполнитьЗапрос(Назначение,"POST",МетодAPI + "?format=xml",ТелоЗапроса,ПараметрыЗапроса);
				
				Если РезультатЗапроса.Успешно Тогда
					Выгружено = Выгружено + 1;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		Если РезультатЗапроса.Успешно Тогда
			
			Если ЗначениеЗаполнено(НастройкиВыгрузки.ОбменДанными_УзелОбменаНоменклатурой) Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(НастройкиВыгрузки.ОбменДанными_УзелОбменаНоменклатурой,Выборка.Ссылка);
			КонецЕсли;
			
		Иначе
			ТекстОшибки = ТекстОшибки + "<" + Выборка.Ссылка + "> ошибка при выгрузке: " + РезультатЗапроса.ТекстОшибки + Символы.ПС;
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатВыгрузки.Вставить("Выгружено",Выгружено);
	РезультатВыгрузки.Вставить("Обновлено",Обновлено);
	
	РезультатВыгрузки.ТекстОшибки = ТекстОшибки;
	
	Возврат РезультатВыгрузки;
	
КонецФункции

Функция СоздатьОбновитьКаталогВТекущемПространстве(ПараметрыЗапроса,Пространство,catalogId)
	
	// 2018.12.28 ( Нужно сформировать список компаний, которым "принадлежит" этот каталог
	//если компания не будет привязана к справочнику, то не будет работать сопоставление номенклатуры для неё
	КомпанииПортала = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","КомпанииПортала",,"Entera");
	
	Если ТипЗнч(КомпанииПортала) <> Тип("Соответствие") Тогда
		КомпанииПортала = Новый Соответствие;
	КонецЕсли;
	
	ТребуетсяОбновлениеКаталога = Ложь;
	МассивИдентификаторов = Новый Массив;
	
	ВыборкаОрганизаций = Справочники.Организации.Выбрать();
	Пока ВыборкаОрганизаций.Следующий() Цикл
		Если ВыборкаОрганизаций.ПометкаУдаления Тогда
			Продолжить;
		ИначеЕсли ВыборкаОрганизаций.ИНН = "" Тогда
			Продолжить;
		КонецЕсли;
		
		ИдентификаторКомпании = КомпанииПортала.Получить(ВыборкаОрганизаций.Ссылка);
		
		Если ИдентификаторКомпании = Неопределено Тогда
			//Нужно получить его с портала: https://app.entera.pro/api/v1/companies?search=:inn
			//Саша [27.12.18 11:52] Компании пока можно только так вытащить. Пока нет одновременного поиска по inn + kpp. Так что после получения по ИНН, надо сматчить по kpp самому.
			РезультатЗапроса = ВыполнитьЗапрос("КомпанииПортала","GET","/api/v1/companies?format=xml&search=" + ВыборкаОрганизаций.ИНН,,ПараметрыЗапроса);
			
			Если РезультатЗапроса.Успешно Тогда
				
				РезультатЧтения = ПрочитатьОтветПортала("КомпанииПортала",ПараметрыЗапроса,РезультатЗапроса.ПараметрыОтвета);
				
				//перебираем, ищем совпадение по КПП
				Если РезультатЧтения.Успешно Тогда
					Если ЗначениеЗаполненоXDTO(РезультатЧтения.Дерево.companies) Тогда
						КоллекцияКомпаний = ПолучитьКоллекциюXDTO(РезультатЧтения.Дерево.companies.company);
						
						//Если нашлась одна компания - вероятно, это она и есть?
						Если КоллекцияКомпаний.Количество() = 1 Тогда
							ИдентификаторКомпании = КоллекцияКомпаний[0].id;
						Иначе
							
							//Перебираем, ищем по КПП
							Для Каждого Компания Из КоллекцияКомпаний Цикл
								Если Компания.КПП = ВыборкаОрганизаций.КПП Тогда
									ИдентификаторКомпании = Компания.id;
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
						КонецЕсли;
						ТребуетсяОбновлениеКаталога = Истина;
					Иначе
						// компания на портале не найдена
						
					КонецЕсли;
				Иначе
					
				КонецЕсли;
			Иначе
				
			КонецЕсли;
		КонецЕсли;
		
		//добавляем значение в тело запроса
		Если ЗначениеЗаполнено(ИдентификаторКомпании) Тогда
			МассивИдентификаторов.Добавить(ИдентификаторКомпании);
			КомпанииПортала.Вставить(ВыборкаОрганизаций.Ссылка,ИдентификаторКомпании);
		КонецЕсли;
	КонецЦикла;
	
	ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","КомпанииПортала",КомпанииПортала,"Entera");
	
	companies = "";
	ПервыйЭлемент = Истина;
	Для Каждого ИдентификаторКомпании Из МассивИдентификаторов Цикл
		
		Если ПервыйЭлемент Тогда
			ПервыйЭлемент = Ложь;
		Иначе
			companies = companies + "," + Символы.ПС;
		КонецЕсли;
		
		companies = companies + "{""id"": """ + ИдентификаторКомпании + """}";
		
	КонецЦикла;
	// ) 2018.12.28
	
	Назначение = "СозданиеКаталога";
		
	ТелоЗапроса = "{" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """name"": ""Справочник 1С""," + Символы.ПС;
	// 2018.12.28 (
	Если companies <> "" Тогда
		ТелоЗапроса = ТелоЗапроса + """companies"": [" + Символы.ПС;
		ТелоЗапроса = ТелоЗапроса + companies + Символы.ПС;
		ТелоЗапроса = ТелоЗапроса + "]," + Символы.ПС;
	КонецЕсли;
	// ) 2018.12.28
	ТелоЗапроса = ТелоЗапроса + """space"": {" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """id"": """ + Пространство + """" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + "}" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + "}";
	
	Если ЗначениеЗаполнено(catalogId) Тогда
		РезультатЗапроса = ВыполнитьЗапрос(Назначение,"PUT","/api/v1/catalogs/" + catalogId + "?format=xml",ТелоЗапроса,ПараметрыЗапроса);
	Иначе
		РезультатЗапроса = ВыполнитьЗапрос(Назначение,"POST","/api/v1/catalogs?format=xml",ТелоЗапроса,ПараметрыЗапроса);
	КонецЕсли;
	
	Если РезультатЗапроса.Успешно Тогда
		
		//Вытаскиваем идентификатор каталога
		РезультатЗапроса = ПрочитатьОтветПортала(Назначение,ПараметрыЗапроса,РезультатЗапроса.ПараметрыОтвета);
		
		Если РезультатЗапроса.Успешно Тогда
			catalogId = РезультатЗапроса.Дерево.catalog.id;
			РезультатЗапроса.Вставить("catalogId",catalogId);
		КонецЕсли;
		
	КонецЕсли;	
	
	Если РезультатЗапроса.Успешно = Ложь Тогда
		РезультатЗапроса.ТекстОшибки = "Создание каталога номенклатуры на портале: " + РезультатЗапроса.ТекстОшибки;
	КонецЕсли;
	
	Возврат РезультатЗапроса;
	
КонецФункции


// ================= Чтение сохраненных настроек и заполнение дерева настроек ===================

Процедура ЗаполнитьДеревоНастроек(ДеревоНастроек,Пространство,ЗагружаемаяСтруктураНастроек = Неопределено,recognitionSettings = Неопределено) Экспорт
	
	ПолнаяСтруктураНастроек = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","ОбщиеНастройки");
	
	ИзбранныеНастройки = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","ИзбранныеНастройки");
	Если ИзбранныеНастройки = Неопределено Тогда
		ИзбранныеНастройки = Новый Структура;
	КонецЕсли;
	
	Если ЗагружаемаяСтруктураНастроек = Неопределено Тогда
	
		Если ПолнаяСтруктураНастроек = Неопределено Тогда // Настроек не найдено
		
		ИначеЕсли ТипЗнч(ПолнаяСтруктураНастроек) = Тип("Структура") Тогда // сохранен первый вариант настроек, единый для всех пространств. Переходный кейс
			СтруктураНастроек = ПолнаяСтруктураНастроек;
			
		ИначеЕсли ТипЗнч(ПолнаяСтруктураНастроек) = Тип("Соответствие") Тогда // сохранен новый вариант настроек, отдельный для каждого пространства
			
			Если ЗначениеЗаполнено(Пространство) Тогда
				СтруктураНастроек = ПолнаяСтруктураНастроек.Получить(Пространство);
			Иначе
				СтруктураНастроек = ПолнаяСтруктураНастроек.Получить("ПустоеПространство");
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтруктураНастроек = Неопределено Тогда
			СтруктураНастроек = Новый Структура;
		КонецЕсли;
		
	Иначе
		СтруктураНастроек = ЗагружаемаяСтруктураНастроек;
		
	КонецЕсли;
	
	//2019.09.09 ( Настройки для пространства, полученные от портала имеют больший приоритет, предустановим их
	Если ТипЗнч(recognitionSettings) = Тип("ФиксированноеСоответствие")
		Или ТипЗнч(recognitionSettings) = Тип("Соответствие") Тогда
			
		НастройкиПортала = recognitionSettings.Получить(Пространство);
		
		Если НастройкиПортала <> Неопределено Тогда
			СтруктураНастроек.Вставить("ЗаполнениеТЧ_ЗаполнятьДанныеГТД",НастройкиПортала.customsDeclarationParse = "true");
			
			//E1C-484: устанавливаем в качестве значения настройки значение, полученное от портала 
			СтруктураНастроек.Вставить("ЗаполнениеШапки_ИспользоватьДанныеОснованияДляДоговора",НастройкиПортала.hasTransferBase = "true");
		КонецЕсли;
		
	КонецЕсли;
	// ) 2019.09.09
	
	//В процессе развития модуля некоторые настройки при восстановлении нужно привести к новому значению ключа настройки
	ПреобразоватьТипыЗначенийСохраненныхРанееНастроек(СтруктураНастроек);
	
	Иерархия = Новый Соответствие;
	Иерархия.Вставить("",ДеревоНастроек);
	
	Макет = ПолучитьМакет("ШаблонНастроек");
	Область = Макет.ПолучитьОбласть("НастройкиОбщие");
	
	ДоступныеТипыДокументов = ПолучитьСписокЗаполняемыхДокументов();
	Конф = ПолучитьОписаниеКонфигурации();
	
	Для Сч = 1 По Область.ВысотаТаблицы Цикл
		НастройкаИД					=	ПолучитьТекстЯчейкиОбласти(Область,Сч,1);
		НастройкаНаименование		=	ПолучитьТекстЯчейкиОбласти(Область,Сч,2);
		ЭтоГруппа					=	ПолучитьТекстЯчейкиОбласти(Область,Сч,3);
		ТекГруппа					=	ПолучитьТекстЯчейкиОбласти(Область,Сч,4);
		ТекТип						=	ПолучитьТекстЯчейкиОбласти(Область,Сч,5);
		ЗначениеПоУмолчанию			=	ПолучитьТекстЯчейкиОбласти(Область,Сч,7);
		Описание					=	ПолучитьТекстЯчейкиОбласти(Область,Сч,8);
		ОтображатьНастройку			=	ПолучитьТекстЯчейкиОбласти(Область,Сч,9);
		СтартовыйПомощник			=	ПолучитьТекстЯчейкиОбласти(Область,Сч,10);
		
		Если ОтображатьНастройку = "0" Тогда
			Продолжить;
		КонецЕсли;
				
		Если ЭтоГруппа = "Истина" Тогда
			
			НоваяСтрока = Иерархия[ТекГруппа].Строки.Добавить();
			НоваяСтрока.ЭтоГруппа = ЭтоГруппа;
			НоваяСтрока.НастройкаИД	= НастройкаИД;
			НоваяСтрока.НастройкаНаименование = НастройкаНаименование;
			НоваяСтрока.Описание = Описание;

			Иерархия.Вставить(НастройкаИД,НоваяСтрока);
		Иначе
			
			НоваяСтрока = Иерархия[ТекГруппа].Строки.Добавить();
			НоваяСтрока.ЭтоГруппа = ЭтоГруппа;
			НоваяСтрока.НастройкаИД				=	НастройкаИД;
			НоваяСтрока.НастройкаНаименование	=	НастройкаНаименование;
			НоваяСтрока.Описание				=	Описание;
			
			Если Лев(ТекТип,14) = "_ВыборИзСписка" Тогда
				НоваяСтрока.ОписаниеТипа	=	Новый ОписаниеТипов("Строка");
				НоваяСтрока.СписокВыбора = ЗначениеВСтрокуВнутр(ПолучитьСписокЗначенийИзМакета(Макет,ТекТип));
				
			ИначеЕсли ТекТип = "Метаданные.Справочники" Тогда
				НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СписокЗначений");
				
				СписокМетаданных = Новый СписокЗначений;
				СписокМетаданных.Добавить("","<Пустое значение>");
				
				Для Каждого ЭлМетаданных Из Метаданные.Справочники Цикл
					СписокМетаданных.Добавить(ЭлМетаданных.Имя,ЭлМетаданных.Синоним);
				КонецЦикла;	
				
				НоваяСтрока.СписокВыбора = ЗначениеВСтрокуВнутр(СписокМетаданных);
				
			ИначеЕсли ТекТип = "СчетУчета" Тогда				
				НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов(ПланыСчетов.ТипВсеСсылки().Типы());
				
			ИначеЕсли ТекТип = "ТипДокумента" Тогда				
				НоваяСтрока.ОписаниеТипа	=	Новый ОписаниеТипов("Строка");
				НоваяСтрока.СписокВыбора = ЗначениеВСтрокуВнутр(ДоступныеТипыДокументов);
				
			ИначеЕсли ТекТип = "ОрганизацияСсылка" Тогда
				Если РеквизитСуществует("Справочники","Организации") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.Организации");
				ИначеЕсли РеквизитСуществует("Справочники","Фирмы") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.Фирмы");
				ИначеЕсли РеквизитСуществует("Справочники","Салоны") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.Салоны");
				КонецЕсли;
				
			//2022.03.04 ( Теперь есть отдельная настройка по умолчанию ПодразделениеОрганизации	
			ИначеЕсли ТекТип = "ПодразделениеОрганизацииСсылка" Тогда
				
				//2020.09.15 ( В БП30 добавили справочник СтруктураПредприятия, но функционал у него не связан с ПодразделенияОрганизаций
				//определяем используемый тип в зависимости от конфигурации, если не определили - используем исходный вариант
				ОписаниеТипаПодразделение = Неопределено;
				
				//2021.04.01 ( Новая вводная: даем выбор подразделений из найденных типов (Для Управления Холдингом)
				Если Найти(Метаданные.Имя,"УправлениеХолдингом") > 0 Тогда
					
					МассивТипов = Новый Массив;
					
					Если РеквизитСуществует("Справочники","ПодразделенияОрганизаций") Тогда
						МассивТипов.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
					КонецЕсли;
					
					Если РеквизитСуществует("Справочники","СтруктураПредприятия") Тогда
						МассивТипов.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
					КонецЕсли;
					
					ОписаниеТипаПодразделение = Новый ОписаниеТипов(МассивТипов);					
				// ) 2021.04.01
				
				ИначеЕсли Конф.Крат = "БП30" Или Найти(Метаданные.Имя,"Бухгалтерия") > 0 Тогда
					Если РеквизитСуществует("Справочники","ПодразделенияОрганизаций") Тогда
						ОписаниеТипаПодразделение = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций");
					КонецЕсли;
					
				ИначеЕсли Конф.Крат = "ERP" И РеквизитСуществует("Справочники","ПодразделенияОрганизаций") Тогда
					ОписаниеТипаПодразделение = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций");
					
				КонецЕсли;
				
				Если ОписаниеТипаПодразделение = Неопределено Тогда
				// ) 2020.09.15
				
					//2023.05.23 ( Условие перемещено на самый верх, так как в УНФ 3.0.3 добавили справочник СтруктураПредприятия
					Если РеквизитСуществует("Справочники","СтруктурныеЕдиницы") Тогда //УНФ
						ОписаниеТипаПодразделение = Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы");	
					// ) 2023.05.23
					
					ИначеЕсли РеквизитСуществует("Справочники","СтруктураПредприятия") Тогда //УТ11
						ОписаниеТипаПодразделение = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
						
					ИначеЕсли РеквизитСуществует("Справочники","ПодразделенияОрганизаций") Тогда
						ОписаниеТипаПодразделение = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций");
						
					ИначеЕсли РеквизитСуществует("Справочники","ПодразделенияКомпании") Тогда
						ОписаниеТипаПодразделение = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании");
						
					КонецЕсли;
					
				КонецЕсли;
				
				НоваяСтрока.ОписаниеТипа = ОписаниеТипаПодразделение;
				
			ИначеЕсли ТекТип = "ПодразделениеСсылка" Тогда
				
				//2020.09.15 ( В БП30 добавили справочник СтруктураПредприятия, но функционал у него не связан с ПодразделенияОрганизаций
				//определяем используемый тип в зависимости от конфигурации, если не определили - используем исходный вариант
				ОписаниеТипаПодразделение = Неопределено;
				
				//2021.04.01 ( Новая вводная: даем выбор подразделений из найденных типов (Для Управления Холдингом)
				Если Найти(Метаданные.Имя,"УправлениеХолдингом") > 0 Тогда
					
					МассивТипов = Новый Массив;
					
					Если РеквизитСуществует("Справочники","Подразделения") Тогда
						МассивТипов.Добавить(Тип("СправочникСсылка.Подразделения"));
					КонецЕсли;
					
					Если РеквизитСуществует("Справочники","СтруктураПредприятия") Тогда
						МассивТипов.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
					КонецЕсли;
					
					ОписаниеТипаПодразделение = Новый ОписаниеТипов(МассивТипов);					
				// ) 2021.04.01
				
				ИначеЕсли Конф.Крат = "БП30" Или Найти(Метаданные.Имя,"Бухгалтерия") > 0 Тогда
					Если РеквизитСуществует("Справочники","Подразделения") Тогда
						ОписаниеТипаПодразделение = Новый ОписаниеТипов("СправочникСсылка.Подразделения");
					КонецЕсли;
				КонецЕсли;
				
				Если ОписаниеТипаПодразделение = Неопределено Тогда
				// ) 2020.09.15
				
					//2023.05.23 ( Условие перемещено на самый верх, так как в УНФ 3.0.3 добавили справочник СтруктураПредприятия
					Если РеквизитСуществует("Справочники","СтруктурныеЕдиницы") Тогда //УНФ
						ОписаниеТипаПодразделение = Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы");	
					// ) 2023.05.23
				
					ИначеЕсли РеквизитСуществует("Справочники","СтруктураПредприятия") Тогда //УТ11
						ОписаниеТипаПодразделение = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
						
					ИначеЕсли РеквизитСуществует("Справочники","ПодразделенияКомпании") Тогда
						ОписаниеТипаПодразделение = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании");
						
					ИначеЕсли РеквизитСуществует("Справочники","Подразделения") Тогда
						ОписаниеТипаПодразделение = Новый ОписаниеТипов("СправочникСсылка.Подразделения");
						
					КонецЕсли;
					
				КонецЕсли;
				
				НоваяСтрока.ОписаниеТипа = ОписаниеТипаПодразделение;
				
			ИначеЕсли ТекТип = "БанковскийСчетОрганизацииСсылка" Тогда
				Если РеквизитСуществует("Справочники","БанковскиеСчетаОрганизаций") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчетаОрганизаций");
				ИначеЕсли РеквизитСуществует("Справочники","БанковскиеСчета") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
				КонецЕсли;
			
			ИначеЕсли ТекТип = "КассаККМСсылка" Тогда
				Если РеквизитСуществует("Справочники","КассыККМ") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.КассыККМ");
				КонецЕсли;
				
			ИначеЕсли ТекТип = "СкладСсылка" Тогда
				Если РеквизитСуществует("Справочники","Склады") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.Склады");
				ИначеЕсли РеквизитСуществует("Справочники","СкладыКомпании") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании");
				ИначеЕсли РеквизитСуществует("Справочники","СтруктурныеЕдиницы") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы");
				ИначеЕсли РеквизитСуществует("Справочники","ЦМО") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ЦМО");
				ИначеЕсли РеквизитСуществует("Справочники","МестаХранения") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.МестаХранения");
				КонецЕсли;
				
			ИначеЕсли ТекТип = "НоменклатураСсылка" Тогда
				НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
				
			ИначеЕсли ТекТип = "СписокГрупп_НоменклатураСсылка" Тогда
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
				МассивТипов.Добавить(Тип("СписокЗначений"));
				НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
			
			ИначеЕсли ТекТип = "ВидНоменклатурыСсылка" Тогда
				Если РеквизитСуществует("Справочники","ВидыНоменклатуры") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры");
					
				//Автосалон, КомбинатПитания, УправлениеРестораном: в конфигурации Вид - перечисление, Тип - справочник,
				//пользователь задает Тип номенклатуры (справочник), а вид номенклатуры (перечисление) берем из него
				ИначеЕсли РеквизитСуществует("Перечисления","ВидыНоменклатуры") И РеквизитСуществует("Справочники","ТипыНоменклатуры") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ТипыНоменклатуры");
					
				//Моя бухгалтерия Беларусь
				ИначеЕсли РеквизитСуществует("Перечисления","ВидыТМЦ") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТМЦ");
					
				//БГУ	
				ИначеЕсли РеквизитСуществует("Перечисления","ТипыНоменклатуры") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры");
					
				//ДАЛИОНУправлениеМагазином	
				ИначеЕсли РеквизитСуществует("Справочники","КатегорииТоваров") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.КатегорииТоваров");
				
				КонецЕсли;
				
			//E1C-193: виды/типы цен
			ИначеЕсли ТекТип = "ВидТипЦеныСсылка" Тогда
				Если РеквизитСуществует("Справочники","ТипыЦенНоменклатуры") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ТипыЦенНоменклатуры");
				ИначеЕсли РеквизитСуществует("Справочники","ВидыЦенНоменклатуры") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыЦенНоменклатуры");
				ИначеЕсли РеквизитСуществует("Справочники","ВидыЦен") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыЦен");
				ИначеЕсли Конф.Крат = "Автосалон" Или Конф.Крат = "КомбинатПитания" Или Конф.Крат = "УправлениеРестораном" Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ТипыЦен");
				ИначеЕсли Конф.Имя = "МояБухгалтерия" Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ТипыЦен");
				КонецЕсли;
				
			ИначеЕсли ТекТип = "НоменклатурнаяГруппаСсылка" Тогда
				Если РеквизитСуществует("Справочники","НоменклатурныеГруппы") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы");
				КонецЕсли;
				
			//E1C-235: Подотчетное лицо для Авансового отчета
			ИначеЕсли ТекТип = "ПодотчетноеЛицоСсылка" Тогда
				//В УНФ это справочник Сотрудники
				Если Конф.Крат = "УНФ" Тогда
					Если РеквизитСуществует("Справочники","Сотрудники") Тогда
						НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
					КонецЕсли;
				Иначе
					//В БП - Физлицо
					Если РеквизитСуществует("Справочники","ФизическиеЛица") Тогда
						НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли ТекТип = "СтатьяДвиженияДенежныхСредствСсылка" Тогда
				Если РеквизитСуществует("Справочники","СтатьиДвиженияДенежныхСредств") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.СтатьиДвиженияДенежныхСредств");
				КонецЕсли;
				
			ИначеЕсли ТекТип = "СтатьяЗатратСсылка" Тогда
				Если РеквизитСуществует("Справочники","СтатьиЗатрат") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат");
				КонецЕсли;
				
			ИначеЕсли ТекТип = "СпособУчетаНДС" Тогда
				Если РеквизитСуществует("Перечисления","СпособыУчетаНДС") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.СпособыУчетаНДС");
				КонецЕсли;
				
			ИначеЕсли ТекТип = "СпособЗачетаАвансов" Тогда
				Если РеквизитСуществует("Перечисления","СпособыЗачетаАвансов") Тогда
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.СпособыЗачетаАвансов");
				КонецЕсли;
				
			ИначеЕсли ТекТип = "УзелОбмена" Тогда
				НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов(ПланыОбмена.ТипВсеСсылки().Типы());
				
			ИначеЕсли ТекТип = "ВнешняяОбработка" Тогда
				
				НоваяСтрока.Значение = Неопределено;
				
				Если Конф.Крат = "Автосалон" Или Конф.Крат = "КомбинатПитания" Или Конф.Крат = "УправлениеРестораном" Тогда
					Если РеквизитСуществует("Справочники","ВнешниеПечатныеФормы") Тогда
						НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ВнешниеПечатныеФормы");
					КонецЕсли;
				Иначе
				
					// 2020.05.28 ( Персонально для клиента, у которого в УТ10.3 добавлены оба справочника >_<
					Если РеквизитСуществует("Справочники","ВнешниеОбработки")
						И РеквизитСуществует("Справочники","ДополнительныеОтчетыИОбработки") Тогда
						НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ВнешниеОбработки");
					// ) 2020.05.28
					
					ИначеЕсли РеквизитСуществует("Справочники","ДополнительныеОтчетыИОбработки") Тогда
						НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ДополнительныеОтчетыИОбработки");
					ИначеЕсли РеквизитСуществует("Справочники","ВнешниеОбработки") Тогда
						НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ВнешниеОбработки");
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Попытка
					НоваяСтрока.ОписаниеТипа = Новый ОписаниеТипов(ТекТип);
				Исключение
					//Не обрабатываем исключение
				КонецПопытки;
				
			КонецЕсли;
			
			//Костыль для сохранения значения в табличной части для ОФ
			НоваяСтрока.ОписаниеТипаСтрокой = ЗначениеВСтрокуВнутр(НоваяСтрока.ОписаниеТипа);
			
			СохраненноеЗначение = Неопределено;
			ЕстьСохраненноеСвойство = СтруктураНастроек.Свойство(НоваяСтрока.НастройкаИД,СохраненноеЗначение);
						
			//Проверяем и заполняем значение настройки
			Если ЕстьСохраненноеСвойство И СохраненноеЗначение <> Неопределено Тогда
				
				ЭтоСправочник = Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(СохраненноеЗначение)) = Истина;
				Если Не ЭтоСправочник Или (ЭтоСправочник И Не ОбъектНеНайден(СохраненноеЗначение)) Тогда
					НоваяСтрока.Значение = СохраненноеЗначение;
				КонецЕсли;
				
			ИначеЕсли ЕстьСохраненноеСвойство И ТекТип = "Число" Тогда
				НоваяСтрока.Значение = СохраненноеЗначение;
				
			Иначе
				НоваяСтрока.Значение = ЗначениеПоУмолчанию;
				
			КонецЕсли;
			
			//Если мы знаем тип настройки, приведем устанавливаемое значение к этому типу
			Если ЗначениеЗаполнено(НоваяСтрока.ОписаниеТипа) Тогда
				НоваяСтрока.Значение = НоваяСтрока.ОписаниеТипа.ПривестиЗначение(НоваяСтрока.Значение);
			КонецЕсли;
			
			НоваяСтрока.СтартовыйПомощник = СтартовыйПомощник = "1";
			
		КонецЕсли;
		
		//Всегда отображаем группы настроек, настройки стартового помощника и выбранные пользователем избранные настройки,
		//для обычного интерфейса при переданном параметре ТолькоИзбранное формируем дерево только из Избранных настроек
		Если НоваяСтрока.ЭтоГруппа
			Или НоваяСтрока.СтартовыйПомощник
			Или ИзбранныеНастройки.Свойство(НоваяСтрока.НастройкаИД) Тогда
			
			НоваяСтрока.Избранное = 1;
			НоваяСтрока.ОтображатьВсегда = Истина;
			
		Иначе
			НоваяСтрока.Избранное = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТекстЯчейкиОбласти(Область,Строка,Колонка) Экспорт
	Возврат Строка(Область.ПолучитьОбласть("R"+Формат(Строка,"ЧГ=0")+"C"+Формат(Колонка,"ЧГ=0")).ТекущаяОбласть.Текст);
КонецФункции

Функция ПолучитьСписокЗначенийИзМакета(Макет,ИмяСписка)
	
	СписокЗначений = Новый СписокЗначений;
	
	Область = Макет.ПолучитьОбласть(ИмяСписка);
	
	Для Сч = 1 По Область.ВысотаТаблицы Цикл
		
		ОтображатьНастройку = ПолучитьТекстЯчейкиОбласти(Область,Сч,9);
	
		Если ОтображатьНастройку = "0" Тогда
			Продолжить;
		КонецЕсли;
		
		СписокЗначений.Добавить(ПолучитьТекстЯчейкиОбласти(Область,Сч,1),ПолучитьТекстЯчейкиОбласти(Область,Сч,2));
	КонецЦикла;		
	
	Возврат СписокЗначений;
	
КонецФункции


Процедура ПреобразоватьТипыЗначенийСохраненныхРанееНастроек(СтруктураНастроек)
	
	Если ТипЗнч(СтруктураНастроек) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
		
	//E1C-395: Изменился тип существующей настройки СозданиеДокумента_КонтрольДубликатовДокументов, раньше был Булево,
	//теперь - строка из списка вариантов присоединения. Преобразуем в СтруктуреНастроек сохраненное значение в новое
	Если СтруктураНастроек.Свойство("СозданиеДокумента_КонтрольДубликатовДокументов")
		И ТипЗнч(СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов) = Тип("Булево") Тогда
		Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = Истина Тогда
			СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Контрагент, Номер, Дата документа";
		Иначе
			СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов = "Нет";
		КонецЕсли;
		
	//E1C-497: Теперь настройка "Сворачивать данные табличной части в одну строку"
	//подразумевает вместо исходного Булево три различных варианта, Преобразуем хранимое значение
	ИначеЕсли СтруктураНастроек.Свойство("ЗаполнениеТЧ_СворачиватьТЧВОднуСтроку")
		И ТипЗнч(СтруктураНастроек.ЗаполнениеТЧ_СворачиватьТЧВОднуСтроку) = Тип("Булево") Тогда
		Если СтруктураНастроек.ЗаполнениеТЧ_СворачиватьТЧВОднуСтроку = Истина Тогда
			СтруктураНастроек.ЗаполнениеТЧ_СворачиватьТЧВОднуСтроку = "Да, оставляя количество = 1";
		Иначе
			СтруктураНастроек.ЗаполнениеТЧ_СворачиватьТЧВОднуСтроку = "Нет";
		КонецЕсли;
			
	КонецЕсли;
		
КонецПроцедуры


// ================= Типы документов и особенности их заполнения ===================

Функция ПолучитьСписокЗаполняемыхДокументов(Конфигурация = Неопределено) Экспорт
	
	//Избегаем повторного анализа метаданных
	Если Конфигурация = Неопределено Тогда
		Конфигурация = ПолучитьОписаниеКонфигурации();
	КонецЕсли;
	
	ИмяКонфигурации = Метаданные.Имя;
	
	ТипыДокументов = Новый СписокЗначений;
	
	ТипыДокументов.Добавить("ПоступлениеТоваровУслуг");
	ТипыДокументов.Добавить("ПриобретениеТоваровУслуг");
	ТипыДокументов.Добавить("ПриобретениеУслугПрочихАктивов");
	ТипыДокументов.Добавить("ПриходнаяНакладная");
	ТипыДокументов.Добавить("ПоступлениеТоваров");
	
	ТипыДокументов.Добавить("РеализацияТоваровУслуг");
	ТипыДокументов.Добавить("РасходнаяНакладная");
	ТипыДокументов.Добавить("ДокументРеализации");
	
	//Розница2
	ТипыДокументов.Добавить("РеализацияТоваров");
	
	//БП30, БП20, УТ10.3
	ТипыДокументов.Добавить("ВозвратТоваровОтПокупателя");
	ТипыДокументов.Добавить("ВозвратТоваровПоставщику");
	
	ТипыДокументов.Добавить("ОтчетОРозничныхПродажах");
	
	//+++ в более новых БП30 документ переименовали в ПоступлениеВАренду
	ТипыДокументов.Добавить("ПоступлениеВЛизинг");
	ТипыДокументов.Добавить("ПоступлениеВАренду");
	
	//"Моя бухгалтерия" (Беларусь)
	ТипыДокументов.Добавить("ПоступлениеТМЦ");
	ТипыДокументов.Добавить("ПоступлениеРозницаОбщепит");
	ТипыДокументов.Добавить("РасходнаяНакладнаяТМЦ");
	
	Если Ложь Тогда
		ТипыДокументов.Добавить("ПолучениеУслуг");
	КонецЕсли;
	
	//в большинстве типовых конфигураций СФ не имеет табличной части Товары, они перечисляются в документе-основании.
	//в КлиентЭДО Счет-фактура имеет свою ТЧ Товары, позволим заполнить ее для этой конфигурации
	Если Найти(ИмяКонфигурации,"КлиентЭДО") > 0 Тогда
		ТипыДокументов.Добавить("СчетФактураПолученный");
	КонецЕсли;
	
	ТипыДокументов.Добавить("ПоступлениеДопРасходов");
	
	ТипыДокументов.Добавить("АктВыполненныхРабот");
	ТипыДокументов.Добавить("ЗаказПоставщику");
	ТипыДокументов.Добавить("СчетНаОплатуПоставщика");
	ТипыДокументов.Добавить("СчетНаОплатуПокупателю");
	
	//2023.02.02 ( БСО
	ТипыДокументов.Добавить("ИмпРеализацияСтроительныхРаботУслуг");
	ТипыДокументов.Добавить("ИмпПриемкаСтроительныхРаботУслуг");
	// ) 2023.02.02
	
	// 2020.09.01 (
	Если Конфигурация.Крат = "БП30"
		Или Найти(ИмяКонфигурации,"Бухгалтерия") > 0
		Или Найти(ИмяКонфигурации,"УправлениеХолдингом") > 0 Тогда
		
		//чтобы не поломать остальные конфигурации ППИ добавляем понемногу
		ТипыДокументов.Добавить("ПлатежноеПоручение");
		
		//2021.08.04 ( Для БП НЕ добавляем ПеремещениеТоваров
		Если Ложь Тогда
			ТипыДокументов.Добавить("ПеремещениеТоваров");
		КонецЕсли;
		// ) 2021.08.04
		
		Если Конфигурация.Лок = "KAZ" Тогда
			//E1C-477: Казахстан: 1С. БП 3.0 для КЗ. Работа с ЭСФ и Источником происхождения
			ТипыДокументов.Добавить("_СчетФактураПолученный");
			
			ТипыДокументов.Добавить("ПриходныйКассовыйОрдер");
			ТипыДокументов.Добавить("Доверенность");
			
			//2024.01.24 (
			ТипыДокументов.Добавить("ПеремещениеТоваров");
			// ) 2024.01.24
			
			//E1C-459
			ТипыДокументов.Добавить("СписаниеТоваров");
			
			//E1C-469
			ТипыДокументов.Добавить("ПлатежноеПоручениеИсходящее");
			
			//Задача 316476
			ТипыДокументов.Добавить("_АктОбОказанииПроизводственныхУслуг");
		КонецЕсли;		
		
	КонецЕсли;
	// ) 2020.09.01
	
	//2025.03.03 (
	Если Ложь И Конфигурация.Крат = "УТ10" И Конфигурация.Лок = "KAZ" Тогда
		ТипыДокументов.Добавить("Доверенность");
		ТипыДокументов.Добавить("СписаниеТоваров");
	КонецЕсли;
	// ) 2025.03.03
	
	//2021.10.14 ( Для кастомной БП20 добавляем СчетПолученный
	Если Конфигурация.Крат = "БП20" Тогда
		ТипыДокументов.Добавить("СчетПолученный");
	КонецЕсли;
	// ) 2021.10.14
	
	//2021.10.12 ( Для БП30 добавляем ОтчетПроизводстваЗаСмену
	Если Конфигурация.Крат = "БП30" Тогда
		ТипыДокументов.Добавить("ОтчетПроизводстваЗаСмену");
		
		//2021.12.09 ( Для БП добавляем ТребованиеНакладную
		ТипыДокументов.Добавить("ТребованиеНакладная");
		// ) 2021.12.09
		
		//2022.03.04 ( Для БП НЕ добавляем ПередачаТоваров
		Если Ложь Тогда
			ТипыДокументов.Добавить("ПередачаТоваров");
		КонецЕсли;
		// ) 2022.03.04
		
		//2023.04.24 ( Для БП добавляем ПоступлениеИзПереработки
		ТипыДокументов.Добавить("ПоступлениеИзПереработки");
		// ) 2023.04.24
		
		//2024.08.30 ( Для БП добавляем РеализацияУслугПоПереработке
		ТипыДокументов.Добавить("_РеализацияУслугПоПереработке");
		// ) 2024.08.30
		
		//2024.12.08
		Если Не ЗначениеЗаполнено(Конфигурация.Лок) Или Конфигурация.Лок = "RUS" Тогда
			ТипыДокументов.Добавить("ВыплатыСамозанятым");
		КонецЕсли;
		// ) 2024.12.08
		
	КонецЕсли;
	// ) 2021.10.12
	
	
	//E1C-327: Отчеты комиссионеров
	Если Конфигурация.Крат = "БП30" Или Конфигурация.Крат = "БП20" Тогда
		ТипыДокументов.Добавить("ОтчетКомиссионераОПродажах");
	КонецЕсли;
	Если Конфигурация.Крат = "КА2"
		Или Конфигурация.Крат = "УТ11" Тогда
		ТипыДокументов.Добавить("ОтчетКомиссионера");
	КонецЕсли;
	Если Конфигурация.Крат = "УТ10" Или Конфигурация.Крат = "УПП" Тогда
		ТипыДокументов.Добавить("ОтчетКомиссионераОПродажах");
	КонецЕсли;
	
	//2026.01.13 (
	ТипыДокументов.Добавить("_ПоступлениеТоваровОтХранителя");
	// ) 2026.01.13
	
	//Пока включаем для УПП-конфигураций
	Если Конфигурация.Крат = "УПП" Тогда
		ТипыДокументов.Добавить("ПлатежноеПоручениеИсходящее");
		
		//2025.04.05 (
		ТипыДокументов.Добавить("ЗаявкаНаРасходованиеСредств");
		// ) 2025.04.05
		
		//2024.01.29 (
		ТипыДокументов.Добавить("ТребованиеНакладная");
		// ) 2024.01.29
		
		//2024.11.21 (
		ТипыДокументов.Добавить("_РасходныйОрдерНаТовары");
		// ) 2024.11.21
	КонецЕсли;
	
	//2024.12.17 (
	Если Конфигурация.Крат = "Далион" Тогда
		ТипыДокументов.Добавить("ПлатежноеПоручениеИсходящее");
	КонецЕсли;
	// ) 2024.12.17
		
	Если Найти(ИмяКонфигурации,"КомплекснаяАвтоматизация") > 0 Тогда
		ТипыДокументов.Добавить("ЗаявкаНаРасходованиеДенежныхСредств");
		
		ТипыДокументов.Добавить("СписаниеБезналичныхДенежныхСредств");
	КонецЕсли;
	
	ТипыДокументов.Добавить("ЗаказКлиента");
	
	// 2019.05.21 ( пока понемногу добавляем новые документы (по запросу).
	//ЗаказПокупателя есть не только в УНФ, а его заполнения хотят уже сейчас - добавим только для нее
	Если Конфигурация.Крат = "УНФ"
		Или Найти(ИмяКонфигурации,"УправлениеНебольшойФирмой") > 0 Тогда
		ТипыДокументов.Добавить("ЗаказПокупателя");
		ТипыДокументов.Добавить("СчетНаОплату");
		
		// 2022.02.01 (
		ТипыДокументов.Добавить("ПлатежноеПоручение");
		// ) 2022.02.01
		
		// 2023.04.25 (
		ТипыДокументов.Добавить("ДополнительныеРасходы");
		// ) 2023.04.25
		
		// 2023.08.31 (
		ТипыДокументов.Добавить("_ОтчетПереработчика");
		// ) 2023.08.31
		
		// 2024.04.23 (
		ТипыДокументов.Добавить("_ОтчетКомиссионера");
		// ) 2024.04.23
		
		// 2024.07.19 (
		ТипыДокументов.Добавить("СборкаЗапасов");
		// ) 2024.07.19
		
	КонецЕсли;
	// ) 2019.05.21
	
	//Задача 288582: Розница для Казахстана
	Если Конфигурация.Крат = "РОЗН2" Тогда
		ТипыДокументов.Добавить("ЗаказПокупателя");
	КонецЕсли;
	
	Если Конфигурация.Крат = "УТ11" Тогда
		ТипыДокументов.Добавить("КоммерческоеПредложениеКлиенту");
		ТипыДокументов.Добавить("ПриемкаТоваровНаХранение");
		ТипыДокументов.Добавить("ОтгрузкаТоваровСХранения");
		
		//2024.09.12 (
		ТипыДокументов.Добавить("_ДоверенностьВыданная");
		// ) 2024.09.12 
	КонецЕсли;
			
	Если Конфигурация.Крат = "УТ11"
		Или Конфигурация.Крат = "КА2" Тогда
		ТипыДокументов.Добавить("СписаниеБезналичныхДенежныхСредств");
		ТипыДокументов.Добавить("ЗаказНаПеремещение");
	КонецЕсли;
		
	ТипыДокументов.Добавить("АвансовыйОтчет");
	
	//2021.11.14 (
	Если Конфигурация.Крат = "ERP" Тогда
		ТипыДокументов.Добавить("ЗаказНаВнутреннееПотребление");
		ТипыДокументов.Добавить("ЗаказНаПеремещение");
		ТипыДокументов.Добавить("ЗаявкаНаРасходованиеДенежныхСредств");
		
		ТипыДокументов.Добавить("ПоступлениеУслугПоАренде");
	КонецЕсли;
	// ) 2021.11.14
	
	//2023.09.25 (
	Если Конфигурация.Крат = "КА2" Тогда
		ТипыДокументов.Добавить("ПоступлениеУслугПоАренде");
	КонецЕсли;
	// ) 2023.09.25
	
	//2021.06.05 ( Альфа-авто: Автосалон
	Если Конфигурация.Крат = "Автосалон" Или Конфигурация.Крат = "КомбинатПитания" Или Конфигурация.Крат = "УправлениеРестораном" Тогда
		ТипыДокументов.Добавить("ПоступлениеТоваров");
		ТипыДокументов.Добавить("РеализацияТоваров");
	КонецЕсли;
	// ) 2021.04.27
	
	ТипыДокументов.Добавить("РасходыПредпринимателя");
		
	ТипыДокументов.Добавить("ПриходныйОрдерНаТовары");
	
	ТипыДокументов.Добавить("бит_ЗаявкаНаРасходованиеСредств");
	ТипыДокументов.Добавить("бит_кзн_ЗаявкаНаРасходованиеСредств");
	ТипыДокументов.Добавить("бит_стр_ЗаказПоставщику");
	ТипыДокументов.Добавить("бит_стр_ЗаявкаНаМПЗ");
	ТипыДокументов.Добавить("бит_стр_ПриходныйОрдер");
	
	//2019.05.21 ( БГУ
	Если Конфигурация.Крат = "БГУ" Или Конфигурация.Крат = "БГУ2"
		Или Найти(ИмяКонфигурации,"БухгалтерияГосударственногоУчреждения") > 0 Тогда
		
		ТипыДокументов.Добавить("МЗ_Покупка");
		// 2019.08.06 ( БГУ2
		ТипыДокументов.Добавить("ПоступлениеМЗ");
		ТипыДокументов.Добавить("ПоступлениеУслугРабот");
		ТипыДокументов.Добавить("УслугиСтороннихОрганизаций");
		ТипыДокументов.Добавить("СчетНаОплату");
		// ) 2019.08.06
		
		//2023.07.06 (
		ТипыДокументов.Добавить("РегистрацияОбязательствИСведенийПоДоговорам");
		// ) 2023.07.06
		
		//2024.10.01 (
		ТипыДокументов.Добавить("_ПоступлениеОС");
		// ) 2024.10.01
	КонецЕсли;
	
	//2020.02.21 ( ФитнесКлуб
	Если ИмяКонфигурации = "ФитнесКлуб" Тогда
		ТипыДокументов.Добавить("Поступление");
	КонецЕсли;
	// ) 2020.02.21
	
	//2024.07.17 ( УправлениеЮвелирнымПроизводством
	Если ИмяКонфигурации = "УправлениеЮвелирнымПроизводством" Тогда
		ТипыДокументов.Добавить("ПоступлениеМатериалов");
	КонецЕсли;
	// ) 2024.07.17
	
	//2020.02.21 ( ITОтдел
	Если Конфигурация.Крат = "ITОтдел"
		//2021.12.22 ( еще какое-то нетленное творение "про стоматологию"
		Или Найти(ИмяКонфигурации,"Стоматология") > 0 Тогда
		// ) 2021.12.22
		ТипыДокументов.Добавить("Поступление");
	КонецЕсли;
	// ) 2020.02.21
	
	//Управление торговлей для Казахстана
	Если ИмяКонфигурации = "УправлениеТорговлейДляКазахстана" Тогда
		ТипыДокументов.Добавить("ПеремещениеТоваров");
	КонецЕсли;
	
	//2022.06.28 (
	ТипыДокументов.Добавить("Тренд_ЗаказПоставщику");
	// ) 2022.06.28
	
	//УАТ
	ТипыДокументов.Добавить("уатПоступлениеТоваровУслуг");
	ТипыДокументов.Добавить("уатРеализацияУслуг");
	ТипыДокументов.Добавить("_уатСчетНаОплатуПокупателю");
	
	//ЭлитСтроительство
	ТипыДокументов.Добавить("эсПланРабот");
	
	ДоступныеТипы = Новый СписокЗначений;
	
	Для Каждого Строка Из ТипыДокументов Цикл	
		НайденныйТип = Метаданные.Документы.Найти(Строка.Значение);
		Если НайденныйТип <> Неопределено И ДоступныеТипы.НайтиПоЗначению(Строка.Значение) = Неопределено Тогда
			НовыйЭлемент = ДоступныеТипы.Добавить();
			НовыйЭлемент.Значение = Строка.Значение;
			НовыйЭлемент.Представление = ?(ЗначениеЗаполнено(НайденныйТип.ПредставлениеОбъекта),НайденныйТип.ПредставлениеОбъекта,НайденныйТип.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДоступныеТипы;
	
КонецФункции

Функция ПолучитьСписокВидовОперацийЗаполняемыхДокументов(ТипыЗаполняемыхДокументов,Конфигурация) Экспорт
	
	ВидыОпераций = Новый Соответствие;
	
	Для Каждого ТипДокумента Из ТипыЗаполняемыхДокументов Цикл
		
		//выбор вида операции для создаваемого документа
		ДоступныеВиды = Новый Массив;
		СписокВидовОпераций = Новый СписокЗначений;
		
		// "_" - Пока отключено
		
		Если ТипДокумента.Значение = "ПоступлениеТоваровУслуг" Тогда
			Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","Товары") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Товары);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","Услуги") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Услуги);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","ПокупкаКомиссия") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия);
			КонецЕсли;
			
			//2024.08.22 ( БП30 KAZ
			Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","ПокупкаКомисия") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомисия);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","Импорт") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Импорт);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","ПоступлениеОтНерезидента") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПоступлениеОтНерезидента);
			КонецЕсли;
			// ) 2024.08.22
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","ВПереработку") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","УслугиЛизинга") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПоступлениеТоваровУслуг.УслугиЛизинга);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","УслугиАренды") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПоступлениеТоваровУслуг.УслугиАренды);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","_ВидыОперацийПоступлениеТоваровУслуг","УслугиФакторинга") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПоступлениеТоваровУслуг.УслугиФакторинга);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","_ВидыОперацийПоступлениеТоваровУслуг","ОбъектыСтроительства") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","Оборудование") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","ОтветственноеХранение") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОтветственноеХранение);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","ОтСтруктурногоПодразделения") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОтСтруктурногоПодразделения);
			КонецЕсли;
			
			//2025.08.13 (Старая УТ11.1: выбор вида операции
			Если РеквизитСуществует("Перечисления","ХозяйственныеОперации","_ЗакупкаЧерезПодотчетноеЛицо") Тогда
				ДоступныеВиды.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо);
			КонецЕсли;
			
		//2024.03.11 ( Авансовый отчет
		ИначеЕсли ТипДокумента.Значение = "АвансовыйОтчет" Тогда			
			Если РеквизитСуществует("Перечисления","_ВидыОперацийАвансовыйОтчет","ПокупкаОплатаПрочее") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийАвансовыйОтчет.ПокупкаОплатаПрочее);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийАвансовыйОтчет","Командировка") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийАвансовыйОтчет.Командировка);
			КонецЕсли;
		// ) 2024.03.11
		
		ИначеЕсли ТипДокумента.Значение = "ПриобретениеТоваровУслуг" Тогда			
			Если РеквизитСуществует("Перечисления","ХозяйственныеОперации","ЗакупкаЧерезПодотчетноеЛицо") Тогда
				ДоступныеВиды.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ХозяйственныеОперации","ЗакупкаУПоставщика") Тогда
				ДоступныеВиды.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
			КонецЕсли;
			
		//2025.08.22 ( 
		ИначеЕсли ТипДокумента.Значение = "РеализацияТоваровУслуг" Тогда			
			Если РеквизитСуществует("Перечисления","ВидыОперацийРеализацияТоваров","Товары") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийРеализацияТоваров.Товары);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийРеализацияТоваров","Услуги") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийРеализацияТоваров.Услуги);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийРеализацияТоваров","ПередачаТоваров") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийРеализацияТоваров.ПередачаТоваров);
			КонецЕсли;
		// ) 2025.08.22
		
		//2025.05.12 (
		ИначеЕсли ТипДокумента.Значение = "ОтчетКомиссионераОПродажах" Тогда			
			Если РеквизитСуществует("Перечисления","ВидыОперацийОтчетКомиссионера","ОтчетОПродажах") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийОтчетКомиссионера.ОтчетОПродажах);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийОтчетКомиссионера","ОтчетОРозничныхПродажах") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийОтчетКомиссионера.ОтчетОРозничныхПродажах);
			КонецЕсли;			
		// ) 2025.05.12
			
		ИначеЕсли ТипДокумента.Значение = "ПередачаТоваров" Тогда			
			Если РеквизитСуществует("Перечисления","ВидыОперацийПередачаТоваров","ВПереработку") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПередачаТоваров.ВПереработку);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийПередачаТоваров","ИзПереработки") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПередачаТоваров.ИзПереработки);
			КонецЕсли;
			
		//E1C-531: "Возврат: переданные на реализацию"
		ИначеЕсли ТипДокумента.Значение = "ВозвратТоваровОтПокупателя" Тогда			
			Если РеквизитСуществует("Перечисления","ВидыОперацийВозвратТоваровОтПокупателя","Товары") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.Товары);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийВозвратТоваровОтПокупателя","ПродажаКомиссия") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.ПродажаКомиссия);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийВозвратТоваровОтПокупателя","ПереданныеТовары") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.ПереданныеТовары);
			КонецЕсли;
			
		ИначеЕсли ТипДокумента.Значение = "ИмпРеализацияСтроительныхРаботУслуг" Тогда			
			Если РеквизитСуществует("Перечисления","ИмпВидыОперацийРеализацияСтроительныхРаботУслуг","ПередачаЗаконченныхСМР") Тогда
				ДоступныеВиды.Добавить(Перечисления.ИмпВидыОперацийРеализацияСтроительныхРаботУслуг.ПередачаЗаконченныхСМР);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ИмпВидыОперацийРеализацияСтроительныхРаботУслуг","ПоэтапнаяПередачаСМР") Тогда
				ДоступныеВиды.Добавить(Перечисления.ИмпВидыОперацийРеализацияСтроительныхРаботУслуг.ПоэтапнаяПередачаСМР);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ИмпВидыОперацийРеализацияСтроительныхРаботУслуг","УслугиГенподрядчика") Тогда
				ДоступныеВиды.Добавить(Перечисления.ИмпВидыОперацийРеализацияСтроительныхРаботУслуг.УслугиГенподрядчика);
			КонецЕсли;
			
		//"Моя бухгалтерия" (Беларусь)
		ИначеЕсли ТипДокумента.Значение = "ПоступлениеТМЦ" Тогда			
			Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТМЦ","Покупка") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПоступлениеТМЦ.Покупка);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТМЦ","Впереработку") Тогда
				ДоступныеВиды.Добавить(Перечисления.ВидыОперацийПоступлениеТМЦ.Впереработку);
			КонецЕсли;
			
		//2026.01.13 (
		ИначеЕсли ТипДокумента.Значение = "ПоступлениеТоваровОтХранителя" Тогда			
			Если РеквизитСуществует("Перечисления","ХозяйственныеОперации","ВозвратОтКомиссионера") Тогда
				ДоступныеВиды.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера);
			КонецЕсли;			
		// ) 2026.01.13
		
		КонецЕсли;
		
		Для Каждого ВидОперации Из ДоступныеВиды Цикл
			СписокВидовОпераций.Добавить(ВидОперации);
		КонецЦикла;
		
		ВидыОпераций.Вставить(ТипДокумента.Значение,СписокВидовОпераций);
		
	КонецЦикла;
	
	Возврат ВидыОпераций;
	
КонецФункции

Функция ЗаполняемыйДокумент_ИспользуетсяНоменклатура(ТипДокумента,СтруктураНастроек) Экспорт
	
	ИспользуетсяНоменклатура = Истина;
	
	//Пока захардкожено для Платежного поручения, в дальнейшем можно расширить функционал
	//типом используемого справочника (Номенклатура, Основные средства)
	Если ТипДокумента = "ПлатежноеПоручение"
		Или ТипДокумента = "ПлатежноеПоручениеИсходящее"
		Или ТипДокумента = "ЗаявкаНаРасходованиеСредств"
		Или ТипДокумента = "ЗаявкаНаРасходованиеДенежныхСредств"
		Или ТипДокумента = "СписаниеБезналичныхДенежныхСредств"
		Или ТипДокумента = "ПоступлениеДопРасходов" //E1C-308
		Или ТипДокумента = "СчетФактураПолученный" Тогда //E1C-509
		ИспользуетсяНоменклатура = Ложь;
	КонецЕсли;
	
	Возврат ИспользуетсяНоменклатура;
	
КонецФункции

Функция ЗаполняемыйДокумент_ТребуетсяСозданиеНоменклатуры(ТипДокумента,СтруктураНастроек) Экспорт
	
	ТребуетсяСозданиеНоменклатуры = Истина;
	
	//Пока захардкожено для ПриобретениеУслугПрочихАктивов
	Если ТипДокумента = "ПриобретениеУслугПрочихАктивов" Тогда
		ТребуетсяСозданиеНоменклатуры = Ложь;
		
	ИначеЕсли ТипДокумента = "ПоступлениеУслугПоАренде" Тогда
		ТребуетсяСозданиеНоменклатуры = Ложь;
		
	//E1C-308: При заполнении основного документа ПоступлениеДопРасходов не создаем номенклатуру,
	//заполнение основного документа выполняется по выбранным пользователем документам поступления в форме сопоставления
	ИначеЕсли ТипДокумента = "ПоступлениеДопРасходов" Тогда
		ТребуетсяСозданиеНоменклатуры = Ложь;
		
	//добавлена Бухгалтерия для Казахстана
	ИначеЕсли ТипДокумента = "ПриходныйКассовыйОрдер" Тогда
		ТребуетсяСозданиеНоменклатуры = Ложь;
		
	КонецЕсли;
	
	Возврат ТребуетсяСозданиеНоменклатуры;
	
КонецФункции


// ================= Служебные функции и процедуры ===================

Функция ПолучитьДанныеИзОбщегоХранилища(КлючНастроек) Экспорт
	
	Попытка
		//Доступ к настройкам "виртуального пользователя" Entera предполагает наличие у пользователя права АдминистрированиеДанных (устанавливается в правах роли в корне конфигурации)
		СохраненныеДанные = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов",КлючНастроек,,"Entera");
	Исключение
		//при отсутствии этого права созданные пользователем таблицы хранятся для него индивидуально и недоступны другим пользователям
		СохраненныеДанные = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов",КлючНастроек);
	КонецПопытки;
	
	Возврат СохраненныеДанные;
	
КонецФункции

Функция ЗаписатьДанныеВОбщееХранилище(КлючНастроек,Данные) Экспорт
	
	Попытка
		//Доступ к настройкам "виртуального пользователя" Entera предполагает наличие у пользователя права АдминистрированиеДанных (устанавливается в правах роли в корне конфигурации)
		ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов",КлючНастроек,Данные,,"Entera");
	Исключение
		//при отсутствии этого права созданные пользователем таблицы хранятся для него индивидуально и недоступны другим пользователям
		ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов",КлючНастроек,Данные);
	КонецПопытки;
	
КонецФункции

Функция ДекодироватьСтрокуURL(URL, WindowsFileURI = Истина) Экспорт
	
	//При работе со старыми версиями платформы методы КодироватьСтроку и РаскодироватьСтроку могут быть недоступны,
	//используем программный алгоритм раскодирования имени файла из ContentDisposition: https://infostart.ru/public/101004/
    ДлинаСтроки = СтрДлина(URL);
    Инд = 1;
    Результат = "";
    ПолныйКод = 0;
    ОсталосьСимволов = 0;

    Пока Инд <= ДлинаСтроки Цикл

        Код = КодСимвола(URL, Инд);

        Если Код = 37 Тогда
            // Символ(37) = "%"
            Код = Из16ВЧисло(Сред(URL, Инд+1, 2));
            Инд = Инд + 2;
        ИначеЕсли ОсталосьСимволов = 0 Тогда
            Если (Код = 43) и (не WindowsFileURI) Тогда
                // Символ(43) = "+"
                Код = 32; // Символ(32) = " " (пробел)
            КонецЕсли;
            Результат = Результат + Символ(Код);
            Инд = Инд + 1;
            Продолжить;
        КонецЕсли;

        Если Код <= 127 Тогда
            // Код = 0b0ххххххх
            Результат = Результат + Символ(Код);
        ИначеЕсли Код <= 191 Тогда
            // Код = 0b10хххххх
            ПолныйКод = (ПолныйКод*64) + (Код%64); // shl(ПолныйКод, 6) + (Код & 0x3F)
            ОсталосьСимволов = ОсталосьСимволов - 1;
            Если ОсталосьСимволов = 0 Тогда
                Результат = Результат + Символ(ПолныйКод);
            КонецЕсли;
        ИначеЕсли Код <= 223 Тогда
            // Код = 0b110ххххх
            ПолныйКод = Код % 32; // Код & 0x1F
            ОсталосьСимволов = 1;
        ИначеЕсли Код <= 239 Тогда
            // Код = 0b1110хххх
            ПолныйКод = Код % 16; // Код & 0x0F
            ОсталосьСимволов = 2;
        ИначеЕсли Код <= 247 Тогда
            // Код = 0b11110ххх
            ПолныйКод = Код % 8; // Код & 0x07
            ОсталосьСимволов = 3;
        ИначеЕсли Код <= 251 Тогда
            // Код = 0b111110хх
            ПолныйКод = Код % 4; // Код & 0x03
            ОсталосьСимволов = 4;
        ИначеЕсли Код <= 253 Тогда
            // Код = 0b1111110х
            ПолныйКод = Код % 2; // Код & 0x01
            ОсталосьСимволов = 5;
        КонецЕсли;

        Инд = Инд + 1;
    КонецЦикла;

    Возврат Результат;
	
КонецФункции

Функция Из16ВЧисло(Знач Значение)

    Результат = 0;
    Множитель = 1;
    Пока Значение <> "" Цикл
        Результат = Результат + Множитель * (Найти("0123456789ABCDEF", Прав(Значение,1))-1);
        Множитель = Множитель * 16;
        Значение = Лев(Значение,СтрДлина(Значение)-1);
    КонецЦикла;
    Возврат Результат;

КонецФункции


Процедура ДополнитьТекстОшибки(ОбщийТекстОшибки,ТекстОшибки) Экспорт
	ОбщийТекстОшибки = Строка(ОбщийТекстОшибки) + ТекстОшибки + Символы.ПС;
КонецПроцедуры

Процедура ЗаписатьСобытие(Событие,ТекстОшибки,Объект = Неопределено,Уровень = Неопределено,ВыводитьСообщение = Ложь)
	
	Если Уровень = Неопределено Тогда
		Уровень = УровеньЖурналаРегистрации.Информация;
	КонецЕсли;
		
	ЗаписьЖурналаРегистрации(Событие,Уровень,Объект,,ТекстОшибки);
	
	Если ВыводитьСообщение Тогда
		СообщитьСообщение(?(ЗначениеЗаполнено(Объект),"<" + Объект + "> ","") + ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьСобытиеВПротокол(СтруктураНастроек,Уровень,Событие,Описание,Состояние) Экспорт
	
	Если СтруктураНастроек.СистемныеНастройки_ВестиПротоколРаботы = "Нет" Тогда
		Возврат;
		
		//Уровень значимости события
		//2 - Ошибки
		//1 - Ошибки+Запросы
		//0 - Полный		
		
	ИначеЕсли СтруктураНастроек.СистемныеНастройки_ВестиПротоколРаботы = "Ошибки" Тогда
		ФиксируемыйУровень = 2;
	ИначеЕсли СтруктураНастроек.СистемныеНастройки_ВестиПротоколРаботы = "Ошибки+Запросы" Тогда
		ФиксируемыйУровень = 1;
	ИначеЕсли СтруктураНастроек.СистемныеНастройки_ВестиПротоколРаботы = "Полный" Тогда
		ФиксируемыйУровень = 0;
	Иначе
		//такого не бывает, но если вдруг бывает - выходим
		Возврат;
	КонецЕсли;
	
	Если ФиксируемыйУровень <= Уровень Тогда
			
		НоваяСтрока = ПротоколРаботы.Добавить();
		НоваяСтрока.Дата = ТекущаяДата();
		НоваяСтрока.Событие = Событие;
		НоваяСтрока.Описание = Описание;
		НоваяСтрока.Состояние = Состояние;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СообщитьСообщение(Текст,Поле = Неопределено,ИдентификаторНазначения = Неопределено) Экспорт
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = Текст;
	СообщениеПользователю.Поле = Поле;
	
	Если ТипЗнч(ИдентификаторНазначения) = Тип("УникальныйИдентификатор") Тогда
		СообщениеПользователю.ИдентификаторНазначения = ИдентификаторНазначения;
	КонецЕсли;
	
	СообщениеПользователю.Сообщить();
	
КонецПроцедуры

Функция СформироватьПредставлениеРазмераФайла(РазмерДанных) Экспорт
	
	Результат = "";
	
	Если РазмерДанных > 1048576 Тогда
		Результат = "" + Окр(РазмерДанных/1048576,1) + "МБ";
	ИначеЕсли РазмерДанных > 1024 Тогда
		Результат = "" + Окр(РазмерДанных/1024,1) + "КБ";
	ИначеЕсли РазмерДанных = 0 Тогда
		Результат = "0Б";
	Иначе
		Результат = Строка(РазмерДанных) + "Б";
	КонецЕсли;			
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОписаниеКонфигурации() Экспорт
	
	Конфигурация = Новый Структура("Крат,Полн,Лок");
	
	Имя = Метаданные.Имя;
	Версия = Метаданные.Версия;
		
	МассивРелизов = Энтера_РазложитьСтрокуВМассивПодстрок(Версия,".");
	
	Если Найти(Имя,"УправлениеТорговлей") > 0
		
		//2022.03.26 ( Есть варианты Алко-торговли на базе 10 и 11 УТ
		Или Найти(Имя,"KT2000_Alcohol_Trade") > 0 Тогда
		// ) 2022.03.26
		
		//2021.09.13 ( УправлениеТорговлей_CRMПроф 1.1 - считаем за УТ10.3
		Если Имя = "УправлениеТорговлей_CRMПроф" Тогда
			Если МассивРелизов[0] = "1" Тогда
				Конфигурация = Новый Структура("Крат,Полн,Лок","УТ10","УТ10.3");
			КонецЕсли;
		// ) 2021.09.13
		
		//2022.03.21 ( УправлениеТорговлей_CRM_2 считаем за УТ 11
		ИначеЕсли Найти(Имя,"УправлениеТорговлей_CRM_2") > 0 Тогда
			Конфигурация = Новый Структура("Крат,Полн,Лок","УТ11","УТ11.4");
		// ) 2022.03.21
		
		//Казахские УТ
		ИначеЕсли Найти(Имя,"УправлениеТорговлейДляКазахстана") > 0 Тогда
			
			Если МассивРелизов[0] = "2" Тогда
				Конфигурация = Новый Структура("Крат,Полн,Лок","УТ10","УТ10.3","KAZ");
			// 2023.05.05 ( Попробуем считать ее аналогом российской УТ11		
			ИначеЕсли МассивРелизов[0] = "3" Тогда
				Конфигурация = Новый Структура("Крат,Полн,Лок","УТ11","УТ11.5","KAZ");
			КонецЕсли;
			// ) 2023.05.05
			
		ИначеЕсли МассивРелизов[0] = "10" Тогда
			
			Если МассивРелизов[1] = "1" Тогда
				Конфигурация = Новый Структура("Крат,Полн,Лок","УТ10","УТ10.1");
			ИначеЕсли МассивРелизов[1] = "2" Тогда
				Конфигурация = Новый Структура("Крат,Полн,Лок","УТ10","УТ10.2");
			ИначеЕсли МассивРелизов[1] = "3" Тогда
				Конфигурация = Новый Структура("Крат,Полн,Лок","УТ10","УТ10.3");
			КонецЕсли;
			
		ИначеЕсли МассивРелизов[0] = "11" Тогда
			
			Если МассивРелизов[1] = "0" Тогда
				Конфигурация = Новый Структура("Крат,Полн,Лок","УТ11","УТ11.0");
			ИначеЕсли МассивРелизов[1] = "1" Тогда
				Конфигурация = Новый Структура("Крат,Полн,Лок","УТ11","УТ11.1");
			ИначеЕсли МассивРелизов[1] = "2" Тогда
				Конфигурация = Новый Структура("Крат,Полн,Лок","УТ11","УТ11.2");
			ИначеЕсли МассивРелизов[1] = "3" Тогда
				Конфигурация = Новый Структура("Крат,Полн,Лок","УТ11","УТ11.3");
			ИначеЕсли МассивРелизов[1] = "4" Тогда
				Конфигурация = Новый Структура("Крат,Полн,Лок","УТ11","УТ11.4");
			ИначеЕсли МассивРелизов[1] = "5" Тогда
				Конфигурация = Новый Структура("Крат,Полн,Лок","УТ11","УТ11.5");
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Найти(Имя,"УправлениеТорговымПредприятиемДляКазахстана") > 0 Тогда
			
			Если МассивРелизов[0] = "2" Тогда
				Конфигурация = Новый Структура("Крат,Полн,Лок","УТ10","УТ10.3","KAZ");
			КонецЕсли;
		
	//2021.10.18 ( по утверждению разработчиков отраслевого решения их конфигурация с таким именем выполнена на основании УТ11,
	//будем надеяться, что при жестком сравнении строки наименования с заданной, пересечений с другими решениями не будет.
	ИначеЕсли Имя = "МониторингТранспорта" Или Имя = "МониторингТранспорта_CRM" Тогда
		
		//По релизам их разбивка пока непонятна, исходим из актуальной на текущий момент УТ11
		Конфигурация = Новый Структура("Крат,Полн,Лок","УТ11","УТ11.5");
		// ) 2021.10.18
		
	//2022.06.28 ( БИТСтоматология
	ИначеЕсли Имя = "БИТСтоматология" Тогда
		
		Конфигурация = Новый Структура("Крат,Полн,Лок","БИТСтоматология","БИТСтоматология");
	// ) 2022.06.28
	
	//2022.06.28 ( БИТ: Управление медицинским центром
	ИначеЕсли Найти(Имя,"БИТУправлениеМедицинскимЦентром") > 0 Тогда
		
		Конфигурация = Новый Структура("Крат,Полн,Лок","БИТУМЦ","БИТУМЦ");
	// ) 2022.06.28
		
	ИначеЕсли Найти(Имя,"УправлениеНебольшойФирмой") > 0
		Или Найти(Имя,"УправлениеНашейФирмой") > 0
		Или Найти(Имя,"УНФУправлениеПредприятиемОбщепита") > 0 Тогда
		
		Конфигурация = Новый Структура("Крат,Полн,Лок","УНФ","УНФ");
		
		//2022.09.18 ( Вышла УНФ 3.0, по идее логика заполнения счета-фактуры переехала из последних 1.6.
		//Пока определим как последние 1.6, при необходимости определим "персональный" идентификатор конфы
		Если МассивРелизов[0] = "3" Тогда
			Конфигурация = Новый Структура("Крат,Полн,Лок","УНФ","УНФ1618");
		Иначе
		// ) 2022.09.18
		
			//2019.12.16 ( Теперь нужно дробить УНФ по версиям, в частности, в 1.6.18 по-новому заполняется счет-фактура на основании Приходной накладной
			Если МассивРелизов[1] = "6" Тогда
				Если МассивРелизов[2] < "18" Тогда
					Конфигурация = Новый Структура("Крат,Полн,Лок","УНФ","УНФ1616");
				Иначе
					Конфигурация = Новый Структура("Крат,Полн,Лок","УНФ","УНФ1618");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// ) 2019.12.16
		
		Если Имя = "УправлениеНебольшойФирмойДляКазахстана" Тогда
			Конфигурация.Лок = "KAZ";
		КонецЕсли;
		
	//2023.05.04 (	
	ИначеЕсли Найти(Имя,"УправлениеПредприятиемЖКХ") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","УПП","УПП");
	// ) 2023.05.04
		
	ИначеЕсли Найти(Имя,"УправлениеПредприятием") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","ERP","ERP");
		
	ИначеЕсли Найти(Имя,"ERPУправлениеСтроительнойОрганизацией") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","ERP","ERP");
		
	ИначеЕсли Найти(Имя,"EPM2_УправлениеПроектнойОрганизацией") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","ERP","ERP");
		
	ИначеЕсли Найти(Имя,"АгропромышленныйКомплекс") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","ERP","ERP");
		
	ИначеЕсли Найти(Имя,"ГорнодобывающаяПромышленность2") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","ERP","ERP");
		
	ИначеЕсли Найти(Имя,"КомплекснаяАвтоматизация") > 0 Тогда
				
		Если МассивРелизов[0] = "1" Тогда
			Конфигурация = Новый Структура("Крат,Полн,Лок","КА1","КА1");
		ИначеЕсли МассивРелизов[0] = "2" Тогда
			Конфигурация = Новый Структура("Крат,Полн,Лок","КА2","КА2");
		КонецЕсли;
		
		Если Имя = "КомплекснаяАвтоматизацияДляКазахстана" Тогда
			Конфигурация.Лок = "KAZ";
		КонецЕсли;
		
	//2023.01.18 (	
	ИначеЕсли Найти(Имя,"KT2000_Alcohol_Complex") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","КА1","КА1");
	// ) 2023.01.18
		
	ИначеЕсли Найти(Имя,"УправлениеПроизводственнымПредприятием") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","УПП","УПП");
		
	ИначеЕсли Найти(Имя,"УправлениеСтроительнойОрганизацией") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","УПП","УПП");
		
	ИначеЕсли Найти(Имя,"KT2000_Alcohol_Mnfc") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","УПП","УПП");
		
	ИначеЕсли Найти(Имя,"УправлениеПтицефабрикой") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","УПП","УПП");
		
	//2025.12.22 (	
	ИначеЕсли Имя = "Лесозавод" Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","УПП","УПП");
	// ) 2025.12.22
		
	//2021.10.25 (	
	ИначеЕсли Имя = "MBC_ДеталиМашин2" Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","УТ10","УТ10.3");
	// ) 2021.10.25
			
	ИначеЕсли Найти(Имя,"KT2000_Alcohol_Trade") > 0 Тогда
			Конфигурация = Новый Структура("Крат,Полн,Лок","УТ10","УТ10.3");
	
	ИначеЕсли Найти(Имя,"БухгалтерияГосударственногоУчреждения") > 0 Тогда
		
		Если МассивРелизов[0] = "1" Тогда
			Конфигурация = Новый Структура("Крат,Полн,Лок","БГУ","БГУ");
		ИначеЕсли МассивРелизов[0] = "2" Тогда
			Конфигурация = Новый Структура("Крат,Полн,Лок","БГУ2","БГУ2");
		КонецЕсли;
		
	//2020.02.21 (	
	ИначеЕсли Найти(Имя,"ФитнесКлуб") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","ФитнесКлуб","ФитнесКлуб");
	// ) 2020.02.21
	
	//2021.03.31 (	
	ИначеЕсли Найти(Имя,"ITОтдел") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","ITОтдел","ITОтдел");
	// ) 2021.03.31
	
	//2021.06.05 (	
	ИначеЕсли Найти(Имя,"Автосалон") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","Автосалон","Автосалон");
	// ) 2021.06.05
	
	//2022.02.03 ( в виде эксперимента
	ИначеЕсли Найти(Имя,"КомбинатПитания") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","КомбинатПитания","КомбинатПитания");
	// ) 2022.02.03
	
	//2022.11.17 (
	ИначеЕсли Найти(Имя,"УправлениеРестораном") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","УправлениеРестораном","УправлениеРестораном");
	// ) 2022.11.17
	
	//2021.06.15 ( Пока обобщим, возможно, между разными решениями будет больше различий в используемых модулем метаданных,
	//тогда будем ветвить условия для определения особенностей каждого решения.
	ИначеЕсли Найти(Имя,"__ШтрихМ") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","ШтрихМ","ШтрихМ");
	// ) 2021.06.15
	
	//2024.09.15 ( Был предоставлен временный доступ к лицензии клиента для конфигурации ДАЛИОНТренд
	ИначеЕсли Найти(Имя,"ДАЛИОНТренд") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","Далион","Далион");
	// ) 2024.09.15
	
	//2024.10.07 ( Был предоставлен временный доступ к лицензии клиента для конфигурации ДАЛИОНУправлениеМагазином
	ИначеЕсли Найти(Имя,"ДАЛИОНУправлениеМагазином") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","Далион","Далион");
	// ) 2024.10.07
	
	ИначеЕсли Найти(Имя,"Розница") > 0 Тогда
		Если МассивРелизов[0] = "3" Тогда
			Конфигурация = Новый Структура("Крат,Полн,Лок","РОЗН3","РОЗН3");
		Иначе 
			Конфигурация = Новый Структура("Крат,Полн,Лок","РОЗН2","РОЗН2");
		КонецЕсли;
		
		Если Найти(Имя,"РозницаДляКазахстана") > 0 Тогда
			Конфигурация.Лок = "KAZ";
		КонецЕсли;
		
	ИначеЕсли Найти(Имя,"КлиентЭДО") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","ЭДО","ЭДО");

	ИначеЕсли Найти(Имя,"БухгалтерияПредприятия") > 0 Тогда
		
		Если МассивРелизов[0] = "3" Тогда
			Конфигурация = Новый Структура("Крат,Полн,Лок","БП30","БП30");
		ИначеЕсли МассивРелизов[0] = "2" Тогда
			
			Попытка
				Минор = Число(МассивРелизов[2]);
				
				Если Минор < 40 Тогда
					Конфигурация = Новый Структура("Крат,Полн,Лок","БП20","БП2039");
				Иначе
					Конфигурация = Новый Структура("Крат,Полн,Лок","БП20","БП20");
				КонецЕсли;
			
			Исключение
				Конфигурация = Новый Структура("Крат,Полн,Лок","БП20","БП20");
				
			КонецПопытки;
			
		КонецЕсли;
		
	// 2022.11.15 (	
	ИначеЕсли Найти(Имя,"БухгалтерияДляКыргызстана") > 0 Тогда
		Если МассивРелизов[0] = "3" Тогда
			Конфигурация = Новый Структура("Крат,Полн,Лок","БП30","БП30","KGZ");
		ИначеЕсли МассивРелизов[0] = "2" Тогда
			Конфигурация = Новый Структура("Крат,Полн,Лок","БП20","БП20","KGZ");
		КонецЕсли;
	// ) 2022.11.15
	
	// 2023.03.15 (	
	ИначеЕсли Найти(Имя,"БухгалтерияДляКазахстана") > 0 Тогда
		Если МассивРелизов[0] = "3" Тогда
			Конфигурация = Новый Структура("Крат,Полн,Лок","БП30","БП30","KAZ");
		ИначеЕсли МассивРелизов[0] = "2" Тогда
			Конфигурация = Новый Структура("Крат,Полн,Лок","БП20","БП20","KAZ");
		КонецЕсли;
	// ) 2023.03.15
	
	// 2024.06.05 (	
	ИначеЕсли Найти(Имя,"БухгалтерияДляБеларуси") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","БП30","БП30","BLR");
	// ) 2024.06.05
	
	// 2023.06.21 (
	ИначеЕсли Найти(Имя,"МояБухгалтерия") > 0 Тогда
		Конфигурация = Новый Структура("Крат,Полн,Лок","БП20","БП20","BLR");
	// ) 2023.06.21
	
	Иначе
		//Угадываем: большое количество отраслевых решений сделаны на базе БП3.0, но имеют собственное имя метаданных конфигурации,
		//в качестве ориентира возьмем какой-нибудь общий модуль БП, например УправлениеКонтактнойИнформациейБП
		
		Если Метаданные.ОбщиеМодули.Найти("УправлениеКонтактнойИнформациейБП") <> Неопределено Тогда
			Конфигурация = Новый Структура("Крат,Полн,Лок","БП30","БП30");
			
		//Отраслевые решения на базе УНФ
		ИначеЕсли (_ЗФ_ПолучитьОбщийМодульКонфигурации("ЗаполнениеОбъектовУНФ") <> Неопределено
			Или _ЗФ_ПолучитьОбщийМодульКонфигурации("ПроведениеДокументовУНФ") <> Неопределено) Тогда
		
			Конфигурация = Новый Структура("Крат,Полн,Лок","УНФ","УНФ");
		
			// Вышла УНФ 3.0, по идее логика заполнения счета-фактуры переехала из последних 1.6.
			//Пока определим как последние 1.6, при необходимости определим "персональный" идентификатор конфы
			Если МассивРелизов[0] = "3" Тогда
				Конфигурация = Новый Структура("Крат,Полн,Лок","УНФ","УНФ1618");
			Иначе
		
				// Теперь нужно дробить УНФ по версиям, в частности, в 1.6.18 по-новому заполняется счет-фактура на основании Приходной накладной
				Если МассивРелизов[1] = "6" Тогда
					Если МассивРелизов[2] < "18" Тогда
						Конфигурация = Новый Структура("Крат,Полн,Лок","УНФ","УНФ1616");
					Иначе
						Конфигурация = Новый Структура("Крат,Полн,Лок","УНФ","УНФ1618");
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли Метаданные.ОбщиеМодули.Найти("ОбменДаннымиСобытияБП") <> Неопределено Тогда
			Конфигурация = Новый Структура("Крат,Полн,Лок","БП20","БП20");
			
		ИначеЕсли Метаданные.ОбщиеМодули.Найти("ОбщегоНазначенияБГУ") <> Неопределено Тогда
			Если МассивРелизов[0] = "1" Тогда
				Конфигурация = Новый Структура("Крат,Полн,Лок","БГУ","БГУ");
			ИначеЕсли МассивРелизов[0] = "2" Тогда
				Конфигурация = Новый Структура("Крат,Полн,Лок","БГУ2","БГУ2");
			КонецЕсли;
			
		//Предположим, что "БК" = Бухгалтерия Казахстана
		ИначеЕсли Метаданные.Обработки.Найти("ОбновлениеИнформационнойБазыБК") <> Неопределено Тогда
			Если МассивРелизов[0] = "3" Тогда
				Конфигурация = Новый Структура("Крат,Полн,Лок","БП30","БП30","KAZ");
			КонецЕсли;
		КонецЕсли;
			
	КонецЕсли;
	
	//Чтобы не опрашивать метаданные поместим эту информацию в описание
	Конфигурация.Вставить("Имя",Имя);
	Конфигурация.Вставить("Версия",Версия);
	
	Возврат Конфигурация;
	
КонецФункции

Функция ПолучитьТекстовоеОписаниеКонфигурации(СтруктураНастроек = Неопределено) Экспорт
	
	F = Не СведенияОВнешнейОбработке().Свойство("НеФреш");
	ВерсияТекст = "Версия обработки 1." + ВерсияМодуля.Версия + ?(F,"F","") + " " + Формат(ВерсияМодуля.Дата,"ДФ=[yyyy.MM.dd]");
	
	СисИнфо = Новый СистемнаяИнформация;
	Платформа = СисИнфо.ВерсияПриложения;
	
	СтрокаСоединенияСБД = СтрокаСоединенияИнформационнойБазы();
	// в зависимости от того файловый это вариант БД или нет,  по-разному отображается путь в БД 
	ФайловаяСерверная = ?(Найти(Врег(СтрокаСоединенияСБД), "FILE=") > 0,"файловая","серверная");
	
	ОписаниеКонфигурации = "Платформа: " + Платформа + Символы.ПС
		+ "Конфигурация: " + Метаданные.Имя + " (" + Метаданные.Версия + ") (" + ФайловаяСерверная + ")";
		
	//2021.04.09 ( Как модуль определил эту конфигурацию
	СтруктураОписания = ПолучитьОписаниеКонфигурации();
	ОписаниеКонфигурации = ОписаниеКонфигурации + ", определена модулем как <" + СтруктураОписания.Полн + ">"
		+ ?(ЗначениеЗаполнено(СтруктураОписания.Лок)," [" + СтруктураОписания.Лок + "]","");
	// ) 2021.04.09
	
	ОписаниеКонфигурации = ОписаниеКонфигурации + Символы.ПС + ВерсияТекст;
		
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		Если СтруктураНастроек.Свойство("СистемныеНастройки_ДополнительныйМодульКастомизации")
			И ЗначениеЗаполнено(СтруктураНастроек.СистемныеНастройки_ДополнительныйМодульКастомизации) Тогда
			ИспользованиеМК = "В текущих настройках используется модуль кастомизации";
		Иначе
			ИспользованиеМК = "В текущих настройках НЕ используется модуль кастомизации";
		КонецЕсли;
	Иначе
		ИспользованиеМК = "Использование модуля кастомизации не определено";
	КонецЕсли;
	
	ОписаниеКонфигурации = ОписаниеКонфигурации + Символы.ПС + ИспользованиеМК;
				
	Возврат ОписаниеКонфигурации;
	
КонецФункции

Функция ЗаполнитьСтруктуруПодключения(ТестовыйРежим = 0) Экспорт
	
	СтруктураПодключения = Новый Структура;
	
	СтруктураПодключения.Вставить("Адрес","app.entera.pro");
	СтруктураПодключения.Вставить("АдресСервераАвторизации","id.entera.pro");
	СтруктураПодключения.Вставить("Протокол","https://");
	СтруктураПодключения.Вставить("Порт",Неопределено);
	СтруктураПодключения.Вставить("Токен_Cookie","ENTERA_JWT=");
	СтруктураПодключения.Вставить("SSL",Новый ЗащищенноеСоединениеOpenSSL);
	
	//Отладка
	Если ТестовыйРежим = 1 Тогда
		СтруктураПодключения.Вставить("ТестовыйРежим",Истина);
		СтруктураПодключения.Вставить("Адрес","app-staging1.entera.pro");
		СтруктураПодключения.Вставить("АдресСервераАвторизации","id-staging1.entera.pro");
		СтруктураПодключения.Вставить("Токен_Cookie","ENTERA_JWT_TEST=");
	ИначеЕсли ТестовыйРежим = 2 Тогда
		СтруктураПодключения.Вставить("ТестовыйРежим",Истина);
		СтруктураПодключения.Вставить("Адрес","app-test2.entera.pro");
		СтруктураПодключения.Вставить("АдресСервераАвторизации","id-test2.entera.pro");
		СтруктураПодключения.Вставить("Токен_Cookie","ENTERA_JWT_TEST=");
	ИначеЕсли ТестовыйРежим = 7 Тогда
		СтруктураПодключения.Вставить("ТестовыйРежим",Истина);
		СтруктураПодключения.Вставить("Адрес","app-test7.entera.pro");
		СтруктураПодключения.Вставить("АдресСервераАвторизации","id-test7.entera.pro");
		СтруктураПодключения.Вставить("Токен_Cookie","ENTERA_JWT_TEST=");
	КонецЕсли;
		
	Возврат СтруктураПодключения;
	
КонецФункции

ВерсияМодуля = Новый Структура("Версия,Дата",99,Дата(2026,01,26));