&НаКлиенте
Перем ОповещениеВыполнено; // признак выполненного оповещения перед закрытием формы
&НаКлиенте
Перем АвтоматическийВход; // признак автоматической авторизации

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ВыполнитьАвтоматическийВход",ВыполнитьАвтоматическийВход);
	Параметры.Свойство("СтруктураНастроек",СтруктураНастроек);
	Параметры.Свойство("ЭтоФреш",ЭтоФреш);
	
	//E1C-100: при подключении в режиме расширения не нужно показывать ссылку на регистрацию
	Если Метаданные.Подсистемы.Найти("Entera_ЗагрузкаДокументов") <> Неопределено Тогда
		Элементы.Декорация1.Заголовок = "Введите учетные данные entera.pro";
		Элементы.ДекорацияСсылкаРегистрация.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//E1C-14: Автоматическая авторизация
	Если ВыполнитьАвтоматическийВход
		И ЗначениеЗаполнено(Логин)
		И ЗначениеЗаполнено(Пароль) Тогда
		
		АвтоматическийВход = Истина;
		
		//Сперва дадим форму авторизации открыться, потом выполним автоматический вход
		ЭтаФорма.Доступность = Ложь;
		Попытка КартинкаАвторизация = БиблиотекаКартинок.Пользователь; Исключение; КонецПопытки;
		ПоказатьОповещениеПользователя("Авторизация",,"Выполняется автоматический вход...",КартинкаАвторизация);
		
		ПодключитьОбработчикОжидания("ВыполнитьАвтоматическийВход",0.1,Истина);
	КонецЕсли;
	//
	
	Токен = ВладелецФормы.Токен;
	ОповещениеВыполнено = Ложь;
КонецПроцедуры
&НаКлиенте
Процедура ВыполнитьАвтоматическийВход() Экспорт
	
	ВыполнитьВход(Неопределено);
		
	Если АвторизацияВыполнена Тогда
		ВыполнитьПередЗакрытьФорму();		
	Иначе
		ЭтаФорма.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если Не ОповещениеВыполнено Тогда
		ВыполнитьПередЗакрытьФорму();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПередЗакрытьФорму()
	
	ОповещениеВыполнено = Истина;
	Результат = Новый Структура("Токен,Логин,Пароль,АвторизацияВыполнена",Токен,Логин,Пароль,АвторизацияВыполнена);
	
	Если АвтоматическийВход = Истина Тогда
		Результат.Вставить("АвтоматическийВход",Истина);
	КонецЕсли;
	
	Если АвторизацияВыполнена Тогда
		СохранитьНастройкиПодключенияНаСервере();
		
		Если ЭтаФорма.Открыта() Тогда
			ЭтаФорма.Закрыть(Результат);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
&НаСервере
Процедура СохранитьНастройкиПодключенияНаСервере()
	
	Если АвторизацияВыполнена Тогда
		
		//При реализации регламентного задания по загрузке документов можно будет авторизоваться под указанными учетными данными
		НастройкиПодключения = Новый Структура("Логин,Пароль",Логин,Пароль);
		
		Попытка
			ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","ЛогинПароль",НастройкиПодключения,,"Entera");
		Исключение
			
		КонецПопытки;
	КонецЕсли;
			
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	ОповещениеВыполнено = Истина;
	Логин = Неопределено;
	Пароль = Неопределено;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВход(Команда)
	
	РаботаДоступна = KAZ_РаботаДоступна(СтруктураНастроек);
	Если ЭтоФреш И Не РаботаДоступна Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Для работы с сервисом необходимо подключить соответствующий тариф'"));
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Логин) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
		Сообщение.Текст = "Логин не может быть пустым";
		Сообщение.Поле = "Логин";		
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Пароль) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
		Сообщение.Текст = "Пароль не может быть пустым";
		Сообщение.Поле = "Пароль";		
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	//POST /api/v1/login
	РазделительСтрок = Символы.ПС;
	
	СтрокаЗапроса = "{" + РазделительСтрок;
	СтрокаЗапроса = СтрокаЗапроса + """login"": """ + Логин + """, " + РазделительСтрок;
	СтрокаЗапроса = СтрокаЗапроса + """password"": """ + ЭкранироватьСпецсимволыJSON(Пароль) + """" + РазделительСтрок;
	СтрокаЗапроса = СтрокаЗапроса + "}";
	
	//E1C-241: расширенная информация об используемой версии в заголовке Entera-User-Agent
	ЭтоФреш = ВладелецФормы.ЭтоФреш;
	
	ДопЗаголовки = Новый Соответствие;
	ЗначениеЗаголовка = ?(ЭтоФреш,"MODULE_1C_FRESH","MODULE_1C");
	ЗначениеЗаголовка = ЗначениеЗаголовка + "_01." + ВладелецФормы.ВерсияМодуля.Версия + "_UF";
	
	Если ВладелецФормы.ЭтоРасширениеКонфигурации И ЭтоФреш Тогда
		Постфикс = "E";
	ИначеЕсли ЭтоФреш Тогда
		Постфикс = "F";
	Иначе
		Постфикс = "S";
	КонецЕсли;
	ЗначениеЗаголовка = ЗначениеЗаголовка + "_" + Постфикс;
	
	ДопЗаголовки.Вставить("Entera-User-Agent",ЗначениеЗаголовка);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ДопЗаголовки",ДопЗаголовки);
	
	//Выполняем запрос, заполняем Токен, с которым в дальнейшем выполняем запросы
	Результат = ВладелецФормы.ВыполнитьЗапрос("Авторизация","POST","/api/v1/login?format=xml",СтрокаЗапроса,ПараметрыЗапроса);
	
	Если Результат.Успешно Тогда
		//Из заголовков получаем наш токен из cookie ENTERA_JWT
		Результат.Свойство("Токен",Токен);
		АвторизацияВыполнена = ЗначениеЗаполнено(Токен);
		
		ВыполнитьПередЗакрытьФорму();
	Иначе
		АвторизацияВыполнена = Ложь;
		АвтоматическийВход = Ложь;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
		Сообщение.Текст = Результат.ТекстОшибки;
		Сообщение.Поле = "Пароль";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Логин)
		И ЗначениеЗаполнено(Пароль) Тогда
		ВыполнитьВход(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Ссылка_Регистрация(Команда)
	ПерейтиПоНавигационнойСсылке("https://app.entera.pro/registration");
КонецПроцедуры
&НаКлиенте
Процедура Ссылка_ЗабылиПароль(Команда)
	ПерейтиПоНавигационнойСсылке("https://app.entera.pro/forgetPassword");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияДекорацияСсылкаРегистрацияНажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("https://app.entera.pro/registration");
КонецПроцедуры

&НаКлиенте
Функция ЭкранироватьСпецсимволыJSON(Знач Строка)
	Строка = СтрЗаменить(Строка,"\","\\");
	Строка = СтрЗаменить(Строка,"""","\""");
	Строка = СтрЗаменить(Строка,Символы.Таб," ");
	Строка = СтрЗаменить(Строка,Символы.ПС,"\n");
	Возврат Строка;
КонецФункции

&НаСервереБезКонтекста
Функция KAZ_РаботаДоступна(СтруктураНастроек)
	
	//В соответствии с запросом специалистов Фреш Казахстана реализована проверка наличия записи "Контроль_Entera"
	//в регистре сведений ДоступныеЛицензии с датой окончания больше, чем текущая дата сеанса.
	//Для унификации сопровождения основного модуля для остальных сервисов и конфигураций
	//эта функция возвращает Истина в случае отсутствия данного регистра в метаданных используемой конфигурации.
	РаботаДоступна = Истина;
	
	//E1C-473: новый костыль: проверка должна выполняться только если в строке адреса базы присутствует 1cfresh.kz или 1cbо.kz
	СтрокаСоединенияИБ = Нрег(СтрокаСоединенияИнформационнойБазы());
	Если Найти(СтрокаСоединенияИБ,"1cfresh.kz") > 0
		Или Найти(СтрокаСоединенияИБ,"1cbо.kz") > 0 Тогда
	
		//Считаем, что проверка должна выполняться только для конфигураций Казахстана
		Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ"
			И Метаданные.РегистрыСведений.Найти("ДоступныеЛицензии") <> Неопределено Тогда
					
			УслугиПоТарифу = Новый Массив();
			УслугиПоТарифу.Добавить("Контроль_Entera");
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ДоступныеЛицензии.Услуга КАК Услуга
				|ИЗ
				|	РегистрСведений.ДоступныеЛицензии КАК ДоступныеЛицензии
				|ГДЕ
				|	ДоступныеЛицензии.Услуга.Идентификатор В(&Идентификаторы)
				|	И ДоступныеЛицензии.ДатаОкончанияДействия > &ДатаОкончания";
			
			Запрос.УстановитьПараметр("Идентификаторы",УслугиПоТарифу);
			Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ТекущаяДатаСеанса()));
			
			РезультатЗапроса = Запрос.Выполнить();
			РаботаДоступна = Не РезультатЗапроса.Пустой();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РаботаДоступна;
	
КонецФункции
