
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//EN-385: Используем эту же форму для отображения информации о балансе страниц и покупке
	Если Параметры.Свойство("ЗаявкаНаПокупку") Тогда
		ЗаявкаНаПокупку = Истина;
		
		Заголовок = "Заявка покупки страниц";
		Элементы.ДекорацияТекст.Заголовок = "Для приобретения страниц введите Ваш номер телефона
			|и нажмите кнопку <Отправить заявку>. Наш специалист свяжется с Вами по указанному номеру.";
		
		Элементы.Подтвердить.Заголовок = "Отправить заявку";
		Элементы.КодПодтверждения.Видимость = Ложь;
		
		Если Параметры.Свойство("НомерТелефона") Тогда
			Телефон = ОставитьТолькоЦифры(СтрЗаменить(Параметры.НомерТелефона,"+7",""));
		КонецЕсли;
	Иначе
		Элементы.Подтвердить.Заголовок = "Запросить код";
		Элементы.КодПодтверждения.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТелефонИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Элементы.Подтвердить.Доступность = ОставитьТолькоЦифры(Текст) <> "";	
КонецПроцедуры
&НаКлиенте
Процедура КодПодтвержденияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Элементы.Подтвердить.Доступность = ОставитьТолькоЦифры(Текст) <> "";
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	
	//EN-385: Используем эту же форму для отображения информации о балансе страниц и покупке
	Если ЗаявкаНаПокупку Тогда
		
		Если ПустаяСтрока(Телефон) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
			Сообщение.Текст = "Телефон не может быть пустым";
			Сообщение.Поле = "Телефон";
			Сообщение.Сообщить();
			
		Иначе
			//POST https://id.entera.pro/api/v1/phone/send?phone=XXX
			ПараметрыЗапроса = Новый Структура;
			
			ТелоЗапроса = "{" + Символы.ПС;
			ТелоЗапроса = ТелоЗапроса + """phoneNumber"" : """ + ОставитьТолькоЦифры(Телефон) + """" + Символы.ПС;	
			ТелоЗапроса = ТелоЗапроса + "}";
			
			//Форма может быть открыта как из основной формы УФ_ОсновнаяФорма, так и из формы УФ_ФормаОбновлений
			Если Найти(ВладелецФормы.ИмяФормы,"УФ_ОсновнаяФорма") > 0 Тогда
				ОсновнаяФорма = ВладелецФормы;
			Иначе
				ОсновнаяФорма = ВладелецФормы.ВладелецФормы;
			КонецЕсли;
			
			Результат = ОсновнаяФорма.ВыполнитьЗапрос("ЗаявкаНаПокупку","POST","/api/v1/buy?format=xml",ТелоЗапроса,ПараметрыЗапроса);
			
			Если Результат.Успешно Тогда
				Попытка КартинкаУспешно = БиблиотекаКартинок.Успешно32; Исключение; КонецПопытки;
				ПоказатьОповещениеПользователя("Спасибо за заявку",,"С Вами скоро свяжется наш специалист",КартинкаУспешно);
				
				ЭтаФорма.ОповеститьОВыборе(Истина);
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
				Сообщение.Текст = Результат.ТекстОшибки;
				Сообщение.Поле = "Телефон";
				Сообщение.Сообщить();
				
			КонецЕсли;	
			
		КонецЕсли;
			
	Иначе
	
		Если Элементы.Подтвердить.Заголовок = "Запросить код" Тогда
			
			// это запрос кода подтверждения
			
			Если ПустаяСтрока(Телефон) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
				Сообщение.Текст = "Телефон не может быть пустым";
				Сообщение.Поле = "Телефон";
				Сообщение.Сообщить();
				
			Иначе
				//POST https://id.entera.pro/api/v1/phone/send?phone=XXX
				ПараметрыЗапроса = Новый Структура;
				
				Результат = ВладелецФормы.ВыполнитьЗапрос("ПодтверждениеТелефона","POST","/api/v1/phone/send?phone=" + ОставитьТолькоЦифры(Телефон) + "&format=xml","{}",ПараметрыЗапроса);
				
				Если Результат.Успешно Тогда
					Попытка КартинкаУспешно = БиблиотекаКартинок.Успешно32; Исключение; КонецПопытки;
					ПоказатьОповещениеПользователя("Код подтверждения",,"На ваш телефон отправлен код потверждения",КартинкаУспешно);
					
					Элементы.Подтвердить.Заголовок = "Подтвердить";
					
					Элементы.Телефон.Доступность = Ложь;
					Элементы.КодПодтверждения.Доступность = Истина;
				Иначе
					Сообщение = Новый СообщениеПользователю;
					Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
					Сообщение.Текст = Результат.ТекстОшибки;
					Сообщение.Поле = "Телефон";
					Сообщение.Сообщить();
					
				КонецЕсли;	
				
			КонецЕсли;
			
		Иначе
		
			Если ПустаяСтрока(КодПодтверждения) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
				Сообщение.Текст = "Код подтверждения не может быть пустым";
				Сообщение.Поле = "КодПодтверждения";
				Сообщение.Сообщить();
				
			Иначе
			
				//POST https://id.entera.pro/api/v1/phone/confirm?code=XXX
				ПараметрыЗапроса = Новый Структура;
				
				Результат = ВладелецФормы.ВыполнитьЗапрос("ПодтверждениеТелефонаКод","POST","/api/v1/phone/confirm?code=" + ОставитьТолькоЦифры(КодПодтверждения) + "&format=xml","{}",ПараметрыЗапроса);
				
				Если Результат.Успешно Тогда
					Попытка КартинкаУспешно = БиблиотекаКартинок.Успешно32; Исключение; КонецПопытки;
					ПоказатьОповещениеПользователя("Успешно",,"Номер телефона подтвержден",КартинкаУспешно);
					Оповестить("ЗакрытиеФормы_ПодтверждениеТелефона", Результат);
					ЭтаФорма.Закрыть();
				Иначе
					Сообщение = Новый СообщениеПользователю;
					Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
					Сообщение.Текст = Результат.ТекстОшибки;
					Сообщение.Поле = "Телефон";
					Сообщение.Сообщить();
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; //Заявка на покупку
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОставитьТолькоЦифры(Знач Номер)
	
	Результат = "";
	
	Для ц = 1 по СтрДлина(Номер) Цикл
		Символ = Сред(Номер,ц,1);
		Если Найти("0123456789",Символ) > 0 Тогда
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
