
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	//Заполним настройки
	СтруктураНастроек = Параметры.СтруктураНастроек;
	Пространство = Параметры.Пространство;
	ЗаполнитьЗначенияСвойств(ЭтаФорма,СтруктураНастроек);
	
	ЗаполнитьСпискиВыбораЭлементов();
	
	//Для задания типов элементов сформируем дерево настроек, там уже настроены типы настроек
	Дерево = РеквизитФормыВЗначение("ДеревоНастроек");	
	РеквизитОбъект.ЗаполнитьДеревоНастроек(Дерево,Пространство);
	ЗначениеВРеквизитФормы(Дерево,"ДеревоНастроек");
	
	//Заполним подсказки для элементов из описания настроек
	СтрокиДерева = Дерево.Строки.НайтиСтроки(Новый Структура("СтартовыйПомощник",Истина),Истина);
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если ЭтаФорма.Элементы.Найти(СтрокаДерева.НастройкаИД) <> Неопределено Тогда
			ЭтаФорма.Элементы[СтрокаДерева.НастройкаИД].Подсказка = СтрокаДерева.Описание;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьОграничениеТиповЭлементовФормы(Дерево);
	
	//Установим картинку логотипа
	Энтера_Лого = ПоместитьВоВременноеХранилище(РеквизитОбъект.ПолучитьМакет("Entera_logo"),УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораЭлементов()
	
	СписокТоварУслуга = ЗначениеИзСтрокиВнутр(СтруктураНастроек.Номенклатура_ТипНоменклатурыТоварУслуга_СписокВыбора);
	ЗаполнитьСписокВыбораЭлементов(Элементы.Номенклатура_ТипНоменклатурыТоварУслуга,СписокТоварУслуга);
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСписокВыбораЭлементов(Элемент,СписокЗначений)
	Для Каждого ЭлементСписка Из СписокЗначений Цикл
		НовыйЭлемент = Элемент.СписокВыбора.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйЭлемент,ЭлементСписка);
	КонецЦикла;
КонецПроцедуры
&НаСервере
Процедура УстановитьОграничениеТиповЭлементовФормы(Дерево)
	
	//Обойдем реквизиты формы, если есть в дереве настроек - установим элементу соответствующий тип
	Для Каждого ЭлементФормы Из Элементы Цикл
		
		Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") Тогда
				
			СтрокаДерева = Дерево.Строки.Найти(ЭлементФормы.ПутьКДанным,"НастройкаИД",Истина);
			Если СтрокаДерева <> Неопределено Тогда
		
				Если ЗначениеЗаполнено(СтрокаДерева.ОписаниеТипа) Тогда
					ЭлементФормы.ОграничениеТипа = СтрокаДерева.ОписаниеТипа;
				Иначе
					ЭлементФормы.ОграничениеТипа = Новый ОписаниеТипов;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура Команда_Далее(Команда)
	
	Если Элементы.Группа_Страницы.ТекущаяСтраница = Элементы.Страница_Номенклатура Тогда
		Элементы.Группа_Страницы.ТекущаяСтраница = Элементы.Страница_Документа;
		Элементы.Команда_Далее.Доступность = Истина;
		Элементы.Команда_Назад.Доступность = Истина;
		Элементы.СохранитьНастройки.Видимость = Ложь;
		
		ВыделитьЭлемент_ТекущийШаг(Элементы.Декорация_Шаги_ЗаполнениеШапки);
		
	ИначеЕсли Элементы.Группа_Страницы.ТекущаяСтраница = Элементы.Страница_Документа Тогда
		Элементы.Группа_Страницы.ТекущаяСтраница = Элементы.Страница_ЗначенияПоУмолчанию;
		Элементы.Команда_Далее.Доступность = Ложь;
		Элементы.Команда_Назад.Доступность = Истина;
		Элементы.СохранитьНастройки.Видимость = Истина;
		
		ВыделитьЭлемент_ТекущийШаг(Элементы.Декорация_Шаги_ТипыДокументов);
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура Команда_Назад(Команда)
	
	Если Элементы.Группа_Страницы.ТекущаяСтраница = Элементы.Страница_ЗначенияПоУмолчанию Тогда
		Элементы.Группа_Страницы.ТекущаяСтраница = Элементы.Страница_Документа;
		Элементы.Команда_Далее.Доступность = Истина;
		Элементы.Команда_Назад.Доступность = Истина;
		Элементы.СохранитьНастройки.Видимость = Ложь;
		
		ВыделитьЭлемент_ТекущийШаг(Элементы.Декорация_Шаги_ЗаполнениеШапки);
		
	ИначеЕсли Элементы.Группа_Страницы.ТекущаяСтраница = Элементы.Страница_Документа Тогда
		Элементы.Группа_Страницы.ТекущаяСтраница = Элементы.Страница_Номенклатура;
		Элементы.Команда_Далее.Доступность = Истина;
		Элементы.Команда_Назад.Доступность = Ложь;
		Элементы.СохранитьНастройки.Видимость = Ложь;
		
		ВыделитьЭлемент_ТекущийШаг(Элементы.Декорация_Шаги_Номенклатура);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация_Шаги_ЗаполнениеШапкиНажатие(Элемент)
	Элементы.Группа_Страницы.ТекущаяСтраница = Элементы.Страница_Документа;
	Элементы.Команда_Далее.Доступность = Истина;
	Элементы.Команда_Назад.Доступность = Ложь;
	ВыделитьЭлемент_ТекущийШаг(Элементы.Декорация_Шаги_ЗаполнениеШапки);
КонецПроцедуры
&НаКлиенте
Процедура Декорация_Шаги_НоменклатураНажатие(Элемент)
	Элементы.Группа_Страницы.ТекущаяСтраница = Элементы.Страница_Номенклатура;
	Элементы.Команда_Далее.Доступность = Истина;
	Элементы.Команда_Назад.Доступность = Истина;
	ВыделитьЭлемент_ТекущийШаг(Элементы.Декорация_Шаги_Номенклатура);
КонецПроцедуры
&НаКлиенте
Процедура Декорация_Шаги_ТипыДокументовНажатие(Элемент)
	Элементы.Группа_Страницы.ТекущаяСтраница = Элементы.Страница_ЗначенияПоУмолчанию;
	Элементы.Команда_Далее.Доступность = Ложь;
	Элементы.Команда_Назад.Доступность = Истина;	
	ВыделитьЭлемент_ТекущийШаг(Элементы.Декорация_Шаги_ТипыДокументов);
КонецПроцедуры


&НаКлиенте
Процедура ВыделитьЭлемент_ТекущийШаг(ВыделяемыйЭлемент)
	
	ОбычныйШрифт = Новый Шрифт(Элементы.Декорация_Документ_Шапка.Шрифт,,12,Ложь);
	ПолужирныйШрифт = Новый Шрифт(Элементы.Декорация_Документ_Шапка.Шрифт,,12,Истина);
	
	Элементы.Декорация_Шаги_ЗаполнениеШапки.Шрифт = ОбычныйШрифт;
	Элементы.Декорация_Шаги_Номенклатура.Шрифт = ОбычныйШрифт;
	Элементы.Декорация_Шаги_ТипыДокументов.Шрифт = ОбычныйШрифт;
	
	ВыделяемыйЭлемент.Шрифт = ПолужирныйШрифт;	
	
КонецПроцедуры


&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	АдресВХ = ПоместитьДеревоНастроекВоВременноеХранилище();
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Пространство",Пространство);
	ПараметрыОткрытия.Вставить("recognitionSettings",ВладелецФормы.СправочникиПортала.recognitionSettings);
	ПараметрыОткрытия.Вставить("ВладелецФормыУникальныйИдентификатор",ВладелецФормы.УникальныйИдентификатор);
	ПараметрыОткрытия.Вставить("ЭтоФреш",ВладелецФормы.ЭтоФреш);
	
	ФормаНастроек = ПолучитьФорму(ВладелецФормы.ПрефиксИмениФорм + "УФ_Настройки", ПараметрыОткрытия, ЭтаФорма.ВладелецФормы);
	НоваяСтруктураНастроек = ФормаНастроек.ПолучитьСтруктуруНастроекНаСервере(АдресВХ);
	
	// 2019.09.09 ( Передадим порталу информацию о выбранных настройках распознавания
	ФормаНастроек.ОбменНастройками_ОбновитьНастройкиРаспознавания(Пространство,НоваяСтруктураНастроек);
	ВладелецФормы.СправочникиПортала.recognitionSettings = ФормаНастроек.recognitionSettings;
	// ) 2019.09.09
	
	//Установим открытие стартового помощника в Ложь, для этого пространства его можно больше не открывать
	НоваяСтруктураНастроек.СистемныеНастройки_ОткрыватьСтартовыйПомощник = Ложь;
		
	ФормаНастроек.СохранитьНастройкиНаСервере(Ложь,НоваяСтруктураНастроек);
	ФормаНастроек = Неопределено;
	
	//Владельцу формы заменяем структуру настроек
	ВладелецФормы.СтруктураНастроек = НоваяСтруктураНастроек;
	
	ЭтаФорма.Закрыть(Истина);
	
КонецПроцедуры
&НаСервере
Функция ПоместитьДеревоНастроекВоВременноеХранилище()
	
	Дерево = РеквизитФормыВЗначение("ДеревоНастроек");	
	СтрокиДерева = Дерево.Строки.НайтиСтроки(Новый Структура("СтартовыйПомощник",Истина),Истина);
	
	//Переносим в дерево настроек значения реквизитов формы
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		СтрокаДерева.Значение = ЭтаФорма[СтрокаДерева.НастройкаИД];
	КонецЦикла;
	
	//помещаем дерево во временное хранилище, чтобы выполнить сохранение из основной формы настроек
	АдресВХ = ПоместитьВоВременноеХранилище(Дерево,УникальныйИдентификатор);
	
	Возврат АдресВХ;
	
КонецФункции