
&НаКлиенте
Перем
ВремяНачалаПросмотра;				// Начальная дата открытия новости для вычисления времени просмотра при отправке

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИндексНовости = 0;
	УстановитьИндексНовости(0);
КонецПроцедуры


&НаКлиенте
Процедура Команда_Далее(Команда)
	УстановитьИндексНовости(1);
КонецПроцедуры
&НаКлиенте
Процедура Команда_Назад(Команда)
	УстановитьИндексНовости(-1);
КонецПроцедуры
&НаКлиенте
Процедура УстановитьИндексНовости(Изменение)
	
	ИндексНовости = ИндексНовости + Изменение;
	Элементы.Команда_Далее.Доступность = ИндексНовости < ВладелецФормы.ДанныеПользователя_ТаблицаНовостей.Количество() - 1;
	Элементы.Команда_Назад.Доступность = ИндексНовости > 0;
	
	ТекущаяНовость = Строка(ИндексНовости + 1) + " / " + ВладелецФормы.ДанныеПользователя_ТаблицаНовостей.Количество();
	
	ОтобразитьНовость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьНовость()
	
	СтрокаНовости = ВладелецФормы.ДанныеПользователя_ТаблицаНовостей[ИндексНовости];
	
	Текст = "<html>";
	
	Если Истина Тогда
		ЗаголовокНовости = СтрокаНовости.Title;
	Иначе
		Текст = Текст + "<head><title>" + СтрокаНовости.Title + "</title></head>";
	КонецЕсли;
	
	Текст = Текст + "<body>";
	Текст = Текст + СтрокаНовости.content;
	Текст = Текст + "</body></html>";
	
	HTML_Контент = Текст;
	
	ВремяНачалаПросмотра = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_НапомнитьПозже(Команда)
	//Очищаем таблицу новостей "до следующего раза", закрываем форму
	ВладелецФормы.ДанныеПользователя_ТаблицаНовостей.Очистить();
	ЭтаФорма.Закрыть();
КонецПроцедуры
&НаКлиенте
Процедура Команда_Интересует(Команда)
	ОтправитьОтветПользователя(Истина);
КонецПроцедуры
&НаКлиенте
Процедура Команда_НеИнтересует(Команда)
	ОтправитьОтветПользователя(Ложь);
КонецПроцедуры
&НаКлиенте
Процедура ОтправитьОтветПользователя(ОтветПользователя)
	
	//Для ответа на предложение есть метод АПИ POST /api/v1/broadcastMessages/:id/response
	//Принимает на вход структуру:
	//watchedTime int; --Время ответа пользователя на сообщение в миллисекундах.
	//interested boolean -- Заинтересован ли пользователь в предложении?
	//comment string -- Комментарий
	
	ВремяПросмотра = (ТекущаяДата() - ВремяНачалаПросмотра) * 1000;
	СтрокаНовости = ВладелецФормы.ДанныеПользователя_ТаблицаНовостей[ИндексНовости];
	
	ТелоЗапроса = "{" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """watchedTime"" : " + СтрЗаменить(ВремяПросмотра,Символы.НПП,"") + "," + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """interested"" : """ + ?(ОтветПользователя,"true","false") + """," + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """comment"" : """"" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + "}";
	
	МетодAPI = "/api/v1/broadcastMessages/" + СтрокаНовости.id + "/responses?format=xml";
	РезультатЗапроса = ВладелецФормы.ВыполнитьЗапрос("ОтправкаОтветаНаНовостьПортала","POST",МетодAPI,ТелоЗапроса);
	
	Если РезультатЗапроса.Успешно Тогда
		Попытка КартинкаУспешно = БиблиотекаКартинок.Успешно32; Исключение; КонецПопытки;
		ПоказатьОповещениеПользователя("Информация передана",,"Спасибо за ваш ответ",КартинкаУспешно);
		ЭтаФорма.Закрыть();
	Иначе
		ВладелецФормы.СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры
