&НаКлиенте
Перем ИдентификаторТекущейСтроки Экспорт;
&НаКлиенте
Перем Кэш_СканыДокументов;
&НаКлиенте
Перем СтруктураПодключения;
&НаКлиенте
Перем ОтображаемыйАдрес;
&НаКлиенте
Перем ФормаПросмотра;

// ================= _ЗФ_УФ_ ===================

&НаСервереБезКонтекста
Функция _ЗФ_ПолучитьОбщийМодульКонфигурации(ИмяОбщегоМодуля)
	Если Метаданные.ОбщиеМодули.Найти(ИмяОбщегоМодуля) <> Неопределено Тогда
		ТребуемыйОбщийМодуль = Вычислить(ИмяОбщегоМодуля);
	КонецЕсли;
	
	Возврат ТребуемыйОбщийМодуль;
КонецФункции
&НаСервере          
Процедура _3Ф_УстановитьРежимЗаписи_ОбменДаннымиЗагрузка(ЗаписываемыйОбъект)
	//Для 1с:Фреш эту процедуру очищаем
	ЗаписываемыйОбъект.ОбменДанными.Загрузка = Истина;
КонецПроцедуры
&НаКлиенте
Функция _ЗФ_ОбработатьАсинхронныйВызов(ТипВызова,ПараметрыВызова)
	
	//Для реализации возможности открытия этой формы внешней обработке на платформах, не поддерживающих ОписаниеОповещения,
	//(не будет пройден синтаксический контроль), обработчики асинхронных вызовов вынесены в эту процедуру.
	//Для прохождения аудита 1С:Фреш эта процедура заменяется на аналогичную, но без методов Вычислить(). Profit!
	
	Если ТипВызова = "Вопрос" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			ПоказатьВопрос(ОписаниеОповещения,ПараметрыВызова.ТекстВопроса,ПараметрыВызова.Кнопки);
		Иначе
			Вопрос(ПараметрыВызова.ТекстВопроса,ПараметрыВызова.Кнопки);
		КонецЕсли;
		
	ИначеЕсли ТипВызова = "ВыборИзМеню" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			
			ЭлементФормы = Неопределено;
			ПараметрыВызова.ДопПараметры.Свойство("ЭлементФормы",ЭлементФормы);
			
			ПоказатьВыборИзМеню(ОписаниеОповещения,ПараметрыВызова.СписокВыбора,ЭлементФормы);
		Иначе
			ВыбратьИзМеню(ПараметрыВызова.СписокВыбора);
		КонецЕсли;
		
	ИначеЕсли ТипВызова = "ВыборИзСписка" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			
			ЭлементФормы = Неопределено;
			ПараметрыВызова.ДопПараметры.Свойство("ЭлементФормы",ЭлементФормы);
						
			ПоказатьВыборИзСписка(ОписаниеОповещения,ПараметрыВызова.СписокВыбора,ЭлементФормы);
		Иначе
			ВыбратьИзСписка(ПараметрыВызова.СписокВыбора);
		КонецЕсли;
		
	ИначеЕсли ТипВызова = "ВводЧисла" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			ПоказатьВводЧисла(ОписаниеОповещения,ПараметрыВызова.Число,ПараметрыВызова.Подсказка,ПараметрыВызова.Длина,ПараметрыВызова.Точность);
		Иначе
			ВвестиЧисло(ПараметрыВызова.Число,ПараметрыВызова.Подсказка,ПараметрыВызова.Длина,ПараметрыВызова.Точность);
		КонецЕсли;
	
	ИначеЕсли ТипВызова = "ПоместитьФайлы" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещенияНачало = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова_3Параметра"",ЭтаФорма,ПараметрыВызова.ПараметрыВызоваНачало)");
			ОписаниеОповещенияОкончание = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова.ПараметрыВызоваЗавершение)");
			НачатьПомещениеФайлов(ОписаниеОповещенияОкончание,,Истина,УникальныйИдентификатор,ОписаниеОповещенияНачало);
		Иначе
			ПоместитьФайлы(ПараметрыВызова.ПомещаемыеФайлы,Истина,УникальныйИдентификатор);
		КонецЕсли;
				
	ИначеЕсли ТипВызова = "ДиалогВыбораФайла" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			ПараметрыВызова.ДиалогВыбораФайла.Показать(ОписаниеОповещения);
		Иначе
			ПоместитьФайлы(ПараметрыВызова.ПомещаемыеФайлы,Истина,УникальныйИдентификатор);
		КонецЕсли;
		
	ИначеЕсли ТипВызова = "ВыборЗначенияИзФормыСписка" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			ПараметрыВызова.ФормаВыбора.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
			
			ПараметрыВызова.ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
			ПараметрыВызова.ФормаВыбора.ЗакрыватьПриЗакрытииВладельца = Истина;
			ПараметрыВызова.ФормаВыбора.Открыть();
		Иначе
			РезультатВыбора = ПараметрыВызова.ФормаВыбора.ОткрытьМодально();
			ОбработатьРезультатАсинхронногоВызова(РезультатВыбора,ПараметрыВызова);
		КонецЕсли;                                                                                  
		          
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработатьРезультатАсинхронногоВызова(Результат,ПараметрыВызова) Экспорт
		
	//Сюда в условия переносятся все присутствующие в форме обработчики результатов асинхронных вызовов
	Если ПараметрыВызова.Обработчик = "ПродолжитьСозданиеОбъектов_НеЗаполненСклад" Тогда
		ПродолжитьСозданиеОбъектов_НеЗаполненСклад(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ПродолжитьСозданиеОбъектов_КонтрольИНН_Контрагентов" Тогда
		ПродолжитьСозданиеОбъектов_КонтрольИНН_Контрагентов(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ОбработатьВыбор_Дополнительно" Тогда
		ОбработатьВыбор_Дополнительно(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ПродолжитьВыполнениеГрупповойОбработкиВыделенныхСтрок" Тогда
		ПродолжитьВыполнениеГрупповойОбработкиВыделенныхСтрок(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ОбработатьВыборВариантаПоиска_АртикулНаименование" Тогда
		ОбработатьВыборВариантаПоиска_АртикулНаименование(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ОбработатьВыборПроцента_ВыполнитьПоискПохожих" Тогда
		ОбработатьВыборПроцента_ВыполнитьПоискПохожих(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ОбработатьВыборИзФормыСписка_Организации" Тогда
		ОбработатьВыборИзФормыСписка_Организации(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ЗагружаемыеОбъекты_ВыбратьНоменклатуру_ОбработатьРанееЗаполненные" Тогда
		ЗагружаемыеОбъекты_ВыбратьНоменклатуру_ОбработатьРанееЗаполненные(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ОбработатьВыборИзФормыСписка_ОбщаяНоменклатура" Тогда
		ОбработатьВыборИзФормыСписка_ОбщаяНоменклатура(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "Продолжить_УстановитьПолноеНаименованиеПоКраткому" Тогда
		Продолжить_УстановитьПолноеНаименованиеПоКраткому(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "Заглушка_ОписаниеОповещения" Тогда
		//Ничего не выполняем
		
	КонецЕсли;
	
КонецФункции


// ================= События формы ===================

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДоступноОписаниеОповещения",ДоступноОписаниеОповещения);
	Параметры.Свойство("ПрефиксИмениФорм",ПрефиксИмениФорм);
	Параметры.Свойство("ДопПараметры",ДополнительныеПараметрыФормы);
	Параметры.Свойство("СтруктураНастроек",СтруктураНастроек);
	Параметры.Свойство("ИспользуетсяМК",ИспользуетсяМК);
	
	ДополнительныеПараметрыФормы.Свойство("ПредставлениеСоздаваемогоДокумента",ПредставлениеСоздаваемогоДокумента);
	Если ЗначениеЗаполнено(ПредставлениеСоздаваемогоДокумента) Тогда
		Заголовок = Заголовок + " для " + ПредставлениеСоздаваемогоДокумента;
	КонецЕсли;
	
	//E1C-79: добавлен поиск по справочнику Номенклатура поставщиков
	СтруктураНастроек.Свойство("Номенклатура_ИспользоватьНоменклатуруПоставщиков",ПоискПоНоменклатуреПоставщиков);
	
	//E1C-421: для региона пространства KAZ не отображаем КПП, ИНН отображаем как ИИН/БИН
	Если СтруктураНастроек.РегионПространства = "KAZ" Тогда
		Элементы.Контрагенты_КПП.Видимость = Ложь;
		Элементы.Контрагенты_ИНН.Заголовок = "ИИН/БИН";
		Элементы.Организации_КПП.Видимость = Ложь;
		Элементы.Организации_ИНН.Заголовок = "ИИН/БИН";
	КонецЕсли;
	
	//2020.03.30 (	
	Если ИспользуетсяМК Тогда
		ПараметрыМК = Новый Структура;
		ПараметрыМК.Вставить("АдресХранилищаДанныхПортала",АдресХранилищаДанныхПортала);
		ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
		ПараметрыМК.Вставить("Форма",ЭтаФорма);
		
		РеквизитОбъект = РеквизитФормыВЗначение("Объект");
		РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("ПриСозданииНаСервере_УФ_ЗагружаемыеОбъекты",ПараметрыМК);
		ЗначениеВРеквизитФормы(РеквизитОбъект,"Объект");
	КонецЕсли;
	// ) 2020.03.30
	
	//E1C-80: По умолчанию для новых клиентов этот флаг должен быть взведен, проверяем по наличию сохраненных данных формы
	ТекущаяНастройкаДанныхФормы = ХранилищеСистемныхНастроек.Загрузить(ПрефиксИмениФорм + "УФ_ЗагружаемыеОбъекты/ТекущиеДанные");
	Если ТекущаяНастройкаДанныхФормы = Неопределено Тогда
		//для этой формы еще не существует сохраненных настроек, взводим флаг
		ДополнительноеОписаниеЭлемента = Истина;
	КонецЕсли;
	
	//E1C-506: на 8.3.27 проблема с отображением скана, устраняется повторным назначение адреса
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	СисИнфо = Новый СистемнаяИнформация;
	ВерсияМассив = РеквизитОбъект.Энтера_РазложитьСтрокуВМассивПодстрок(СисИнфо.ВерсияПриложения,".");
	ВтораяЦифра = Число(ВерсияМассив[1]); ТретьяЦифра = Число(ВерсияМассив[2]);
			
	ПоказыватьСканДокумента_ОбновлятьАдрес = (ВтораяЦифра = 3 и ТретьяЦифра >= 27) Или ВтораяЦифра > 3;
	
	УстановитьОграниченияЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКнопкуНаФорму(ИмяКоманды,ИмяКнопки,Синоним,ИмяДействия,ГруппаРодитель = Неопределено, Картинка = Неопределено, Пометка = Ложь)
	
	// Добавляем новую команду обработки выбора вида операции.
	Команда = Команды.Добавить(ИмяКоманды);
	Команда.Действие = ИмяДействия;
	
	Если Картинка <> Неопределено Тогда
		Команда.Картинка = Картинка;
	КонецЕсли;
	
	Если ГруппаРодитель = Неопределено Тогда
		НоваяКнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"));
	Иначе    
		НоваяКнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), ГруппаРодитель);
	КонецЕсли;
	
	НоваяКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НоваяКнопка.ИмяКоманды = ИмяКоманды;
	НоваяКнопка.Заголовок = Синоним;
	НоваяКнопка.Пометка = Пометка;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ФормаПросмотра <> Неопределено Тогда
		ФормаПросмотра.Закрыть();
	КонецЕсли;
	
	//E1C-103: при включенной настройке передадим порталу данные об изменениях наименований, внесенных пользователем
	Если ЗавершениеРаботы <> Истина Тогда
		//При завершении работы приложения запрещены серверные вызовы
		Если СтруктураНастроек.Свойство("ОбменДанными_ОтправлятьИзмененияРаспознанныхНаименований")
			И СтруктураНастроек.ОбменДанными_ОтправлятьИзмененияРаспознанныхНаименований = Истина Тогда
			ОбновлениеДанныхДокументов_ОтправкаНаПортал();
		КонецЕсли;
		
		Если ИспользуетсяМК Тогда
			//+++
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ФормаПросмотра_Закрытие" Тогда
		ПоказыватьСканДокумента = Ложь;
		ФормаПросмотра = Неопределено;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КопироватьДанныеФормы(ВладелецФормы.Объект,Объект);
	
	АдресХранилищаДанныхПортала = ВладелецФормы.АдресХранилищаДанныхПортала;
	
	// Заполняем таблицу "маркеров" - подстрок поиска номенклатуры в иерархии группы
	ЗаполнитьКэшФормы_СловаМаркеры();
	
	Попытка
		РазмерСпискаПохожейНоменклатуры = Цел(Число(СтруктураНастроек.Номенклатура_РазмерСпискаПохожих));
	Исключение
		РазмерСпискаПохожейНоменклатуры = 5;
	КонецПопытки;
	
	Если РазмерСпискаПохожейНоменклатуры < 1 Тогда
		РазмерСпискаПохожейНоменклатуры = 1;
	КонецЕсли;
	
	Отбор = 0;
	ПодключитьОбработчикОжидания("УстановитьОтборСтрокТаблицы",1,Истина);
	
	СчетаУчета_ЗаполнитьСчетаУчетаНоменклатуры();
	
	Элементы.ГруппаОписаниеСоздаваемыхЭлементов.Видимость = ДополнительноеОписаниеЭлемента;
	
	//E1C-80: компоновка элементов горизонтальная/вертикальная
	Если Не ЗначениеЗаполнено(СпособКомпоновкиЭлементовФормы) Тогда
		СпособКомпоновкиЭлементовФормы = "Горизонтально";
	КонецЕсли;
	УстановитьСпособКомпоновкиЭлементовФормы();
	
	//Показываем сканы документов
	//+++ во Фреш все равно иногда возникает проблема преавторизации поля предпосмотра скана,
	//даже в тощем клиенте: возможно, следует дополнить условие Или ВладелецФормы.ЭтоФреш
	ПоказыватьСканДокументаСредствамиEntera = Не (ВладелецФормы.ЭтоВебКлиент);
		
	//Подгрузим страницу преавторизации	
	Если ПоказыватьСканДокументаСредствамиEntera Тогда
		СтруктураПодключения = ВладелецФормы.ЗаполнитьСтруктуруПодключения();
		СканДокумента_ИнициализироватьСтраницу_ENTERA();
	КонецЕсли;
	
	СканДокумента_ПоказатьСканДокумента();
	
	
	// EN-229: Показываем колонку с Артикулом только если по нему будет выполняться поиск или они заполняются в новой номенклатуре
	Если СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Артикул"
		Или СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Артикул,Наименование"
		Или СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Наименование,Артикул"
		Или СтруктураНастроек.Номенклатура_ЗаполнятьАртикулы = Истина Тогда
		Элементы.ЗагружаемыеОбъектыНоменклатура_Код.Видимость = Истина;
	Иначе
		Элементы.ЗагружаемыеОбъектыНоменклатура_Код.Видимость = Ложь;
	КонецЕсли;
	
	// Показываем поле КоэффициентПересчета если включен флаг в настройках
	ПоказыватьКоэффициент = СтруктураНастроек.ЗаполнениеТЧ_ИспользоватьКоэффициентПересчета = Истина;
	Элементы.Номенклатура_КоэффициентПересчета.Видимость = ПоказыватьКоэффициент;
	Элементы.Номенклатура_Количество.Видимость = ПоказыватьКоэффициент;
	
	//E1C-75: настройка, скрывающая флаги создания номенклатуры
	Элементы.ЗагружаемыеОбъектыПометка.Видимость = СтруктураНастроек.СозданиеДокумента_ВыбиратьСоздаваемыеЭлементы = Истина;
	
	//E1C-297: настройка, отображающая нумерацию строк номенклатуры документов. В E1C-374 была удалена
	Элементы.ЗагружаемыеОбъектыНоменклатура_serialNumber.Видимость = Истина;
			
	ДобавитьКнопкиКонтекстногоМеню();
	
КонецПроцедуры
&НаСервере
Процедура УстановитьСпособКомпоновкиЭлементовФормы()
	
	Если СпособКомпоновкиЭлементовФормы = "Горизонтально" Тогда
		
		//Старые версии платформы умеют Горизонтальная, новые - ГоризонтальнаяВсегда
		Попытка
			ГруппировкаГоризонтальная = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		Исключение
			ГруппировкаГоризонтальная = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		КонецПопытки;
		
		Элементы.ГруппаСоздаваемыхЭлементов.Группировка = ГруппировкаГоризонтальная;
		Элементы.Переместить(Элементы.ГруппаОписаниеСоздаваемыхЭлементов,Элементы.ГруппаСоздаваемыхЭлементов);
		Элементы.Переместить(Элементы.ГруппаПросмотрСкана_PNG,Элементы.ГруппаСоздаваемыхЭлементов);
		Элементы.Переместить(Элементы.ГруппаПросмотраСкана_HTML,Элементы.ГруппаСоздаваемыхЭлементов);
		
	ИначеЕсли СпособКомпоновкиЭлементовФормы = "Вертикально" Тогда
		Элементы.ГруппаСоздаваемыхЭлементов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.Переместить(Элементы.ГруппаОписаниеСоздаваемыхЭлементов,Элементы.ГруппаСоздаваемыхЭлементовВертикальная);
		Элементы.Переместить(Элементы.ГруппаПросмотрСкана_PNG,Элементы.ГруппаСоздаваемыхЭлементовВертикальная);
		Элементы.Переместить(Элементы.ГруппаПросмотраСкана_HTML,Элементы.ГруппаСоздаваемыхЭлементовВертикальная);
		
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура УстановитьОграниченияЭлементовФормы()
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	
	Элемент = Элементы.Номенклатура_ЕдиницаИзмерения;
	Если Конф = "УНФ"
		//2024.10.22 (
		Или Конф = "РОЗН3" Тогда
		// ) 2024.10.22
		
		//Выбор типа единицы измерения не осуществляется "напрямую", а выбирается методом конфигурации ПолучитьДанныеВыбора
		Элемент.ВыбиратьТип = Ложь;
		
	ИначеЕсли Конф = "Далион" Тогда
		//У Далион в ОбработкаПолученияДанныхВыбора Единиц измерения может возвращаться и КлассификаторЕдиницИзмерения
		Элемент.ВыбиратьТип = Ложь;
		
	ИначеЕсли ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.ЕдиницыИзмерения_ИмяСправочникаЕдиницыИзмерения) Тогда		
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка." + СтруктураНастроек.СведенияОКонфигурации.ЕдиницыИзмерения_ИмяСправочникаЕдиницыИзмерения));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
	
		Элемент.ОграничениеТипа = ОписаниеТипов;
		
	ИначеЕсли Метаданные.Справочники.Найти("КлассификаторЕдиницИзмерения") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	КонецЕсли;
	
	Элемент = Элементы.Номенклатура_ВидНоменклатуры;
	Если Метаданные.Справочники.Найти("ВидыНоменклатуры") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.ВидыНоменклатуры"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
		
	ИначеЕсли Метаданные.Перечисления.Найти("ВидыНоменклатуры") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ВидыНоменклатуры"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
		
	//2022.11.11 ( Хеликс.Стоматология: ВидаНоменклатуры нет, но может быть выбрано перечисление ТипНоменклатуры
	ИначеЕсли Метаданные.Перечисления.Найти("ТипыНоменклатуры") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ТипыНоменклатуры"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
		
		Элемент.Заголовок = "Тип номенклатуры";
	// ) 2022.11.11
	
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	//2020.01.13 ( Добавлен учет по характеристикам
	Элемент = Элементы.Номенклатура_Характеристика;
	Если Метаданные.Справочники.Найти("ХарактеристикиНоменклатуры") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
		
		ОтображатьХарактеристики = СтруктураНастроек.Свойство("ЗаполнениеТЧ_ИспользоватьХарактеристики") И СтруктураНастроек.ЗаполнениеТЧ_ИспользоватьХарактеристики = Истина;
		Элемент.Видимость = ОтображатьХарактеристики;
	КонецЕсли;
	// ) 2020.01.13
	
	Элемент = Элементы.Номенклатура_ГруппаФинансовогоУчета;
	Если Метаданные.Справочники.Найти("ГруппыФинансовогоУчетаНоменклатуры") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.ГруппыФинансовогоУчетаНоменклатуры"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	Элемент = Элементы.Номенклатура_ГруппаАналитическогоУчета;
	Если Метаданные.Справочники.Найти("ГруппыАналитическогоУчетаНоменклатуры") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.ГруппыАналитическогоУчетаНоменклатуры"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	Элемент = Элементы.Номенклатура_Категория;
	Если Метаданные.Справочники.Найти("КатегорииНоменклатуры") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.КатегорииНоменклатуры"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
		
	//НаправленияДеятельности для новой номенклатуры УНФ
	Элемент = Элементы.Номенклатура_НаправлениеДеятельности;
	Если Конф = "УНФ" Тогда
		Если Метаданные.Справочники.Найти("НаправленияДеятельности") <> Неопределено Тогда
			Массив = Новый Массив();
			Массив.Добавить(Тип("СправочникСсылка.НаправленияДеятельности"));
			ОписаниеТипов = Новый ОписаниеТипов(Массив);
			
			Элемент.ОграничениеТипа = ОписаниеТипов;
		Иначе
			Элемент.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	//НаправленияДеятельности для переноса в документ в Комплексной автоматизации 2
	Если Конф = "КА2"	
		//и для Управления торговлей Казахстана
		Или СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Имя = "УправлениеТорговлейДляКазахстана" Тогда
	
		Если Метаданные.Справочники.Найти("НаправленияДеятельности") <> Неопределено Тогда
			Массив = Новый Массив();
			Массив.Добавить(Тип("СправочникСсылка.НаправленияДеятельности"));
			ОписаниеТипов = Новый ОписаниеТипов(Массив);
			
			Элементы.Документ_НаправлениеДеятельности.ОграничениеТипа = ОписаниеТипов;
			Элементы.Договоры_НаправлениеДеятельности.ОграничениеТипа = ОписаниеТипов;
		Иначе
			Элементы.Документ_НаправлениеДеятельности.Видимость = Ложь;
			Элементы.Договоры_НаправлениеДеятельности.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.Документ_НаправлениеДеятельности.Видимость = Ложь;
		Элементы.Договоры_НаправлениеДеятельности.Видимость = Ложь;
	КонецЕсли;
	
	//Объект расчетов
	Элемент = Элементы.Документ_ОбъектРасчетов;
	Если Метаданные.Справочники.Найти("ОбъектыРасчетов") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.ОбъектыРасчетов"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
		
		Элемент.Видимость = Истина;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	
	//Объект
	Элемент = Элементы.Номенклатура_Объект;
	Если Метаданные.Справочники.Найти("Объекты") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.Объекты"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
		
		Элемент.Видимость = Истина;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
		
	ЭлементСчетУчета = Элементы.Номенклатура_СчетУчета;
	ЭлементСчетУчетаНДС = Элементы.Номенклатура_СчетУчетаНДС;
	
	
	Массив = Новый Массив();
	
	//2022.10.18 ( Отраслевое решение БНФО
	Если Метаданные.ПланыСчетов.Найти("БНФОБанковский") <> Неопределено Тогда
		Массив.Добавить(Тип("ПланСчетовСсылка.БНФОБанковский"));
	КонецЕсли;
	// ) 2022.10.18
	
	Если Метаданные.ПланыСчетов.Найти("Хозрасчетный") <> Неопределено Тогда
		Массив.Добавить(Тип("ПланСчетовСсылка.Хозрасчетный"));
		
	//БГУ2	
	ИначеЕсли Метаданные.ПланыСчетов.Найти("ЕПСБУ") <> Неопределено Тогда
		Массив.Добавить(Тип("ПланСчетовСсылка.ЕПСБУ"));
		ЭлементСчетУчетаНДС.Видимость = Ложь;
		
	//Казахстан
	ИначеЕсли Метаданные.ПланыСчетов.Найти("Типовой") <> Неопределено Тогда
		Массив.Добавить(Тип("ПланСчетовСсылка.Типовой"));		
		ЭлементСчетУчетаНДС.Видимость = Ложь;
		
	КонецЕсли;
	
	Если Массив.Количество() > 0 Тогда
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
			
		ЭлементСчетУчета.ОграничениеТипа = ОписаниеТипов;
		ЭлементСчетУчетаНДС.ОграничениеТипа = ОписаниеТипов;
		
	Иначе
		ЭлементСчетУчета.Видимость = Ложь;
		ЭлементСчетУчетаНДС.Видимость = Ложь;
		
	КонецЕсли;
	
	
	//ИФО
	Элемент = Элементы.Документ_ИФО;
	Если Метаданные.Справочники.Найти("ИсточникиФинансовогоОбеспечения") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
		
		Элемент.Видимость = Истина;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	
	//Для УНФ - "своя атмосфера"
	Если Конф = "УНФ" И Метаданные.ПланыСчетов.Найти("Управленческий") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПланСчетовСсылка.Управленческий"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элементы.Номенклатура_СчетУчетаЗапасов.ОграничениеТипа = ОписаниеТипов;		
		Элементы.Номенклатура_СчетУчетаЗатрат.ОграничениеТипа = ОписаниеТипов;		
		
	Иначе
		Элементы.Номенклатура_СчетУчетаЗапасов.Видимость = Ложь;
		Элементы.Номенклатура_СчетУчетаЗатрат.Видимость = Ложь;
	КонецЕсли;
	
	
	//Статьи расходов и аналитика расходов
	Элемент = Элементы.Номенклатура_СтатьяРасходов;
	ЭлементАналитика = Элементы.Номенклатура_АналитикаРасходов;
	Если Метаданные.ПланыВидовХарактеристик.Найти("СтатьиРасходов") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
		
		Массив = Новый Массив();
		Массив.Добавить(Метаданные.ПланыВидовХарактеристик.СтатьиРасходов.Тип);
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		ЭлементАналитика.ОграничениеТипа = ОписаниеТипов;	
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец","Элементы.ЗагружаемыеОбъекты.ТекущиеДанные.Номенклатура_СтатьяРасходов");
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		ЭлементАналитика.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
	Иначе
		Элемент.Видимость = Ложь;
		ЭлементАналитика.Видимость = Ложь;
	КонецЕсли;
	
		
	Элемент = Элементы.Номенклатура_СтатьяЗатрат;
	Если Метаданные.Справочники.Найти("СтатьиЗатрат") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.СтатьиЗатрат"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	//Бухгалтерия для Казахстана 3.0
	Элемент = Элементы.Номенклатура_СтатьяДоходов;
	Если Метаданные.Справочники.Найти("Доходы") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.Доходы"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	
	Элемент = Элементы.Номенклатура_НоменклатурнаяГруппа;
	Если Метаданные.Справочники.Найти("НоменклатурныеГруппы") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.НоменклатурныеГруппы"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	//БСО: Номенклатурную группу отображаем как Объект строительства для шапки документа
	Элемент = Элементы.Документ_НоменклатурнаяГруппа;
	Если Найти(Метаданные.Имя,"БухгалтерияСтроительнойОрганизации") Тогда
		Элемент.Заголовок = "Объект строительства";
		Если Метаданные.Справочники.Найти("НоменклатурныеГруппы") <> Неопределено Тогда
			Массив = Новый Массив();
			Массив.Добавить(Тип("СправочникСсылка.НоменклатурныеГруппы"));
			ОписаниеТипов = Новый ОписаниеТипов(Массив);
			
			Элемент.ОграничениеТипа = ОписаниеТипов;
		Иначе
			Элемент.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	
	Элемент = Элементы.Номенклатура_СпособУчетаНДС;
	Если Метаданные.Перечисления.Найти("СпособыУчетаНДС") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.СпособыУчетаНДС"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
		
	//Подразделения-СтруктураПредприятия
	Если Конф = "ERP" Или Конф = "КА2" Тогда
		
		Если Метаданные.Справочники.Найти("СтруктураПредприятия") <> Неопределено Тогда
			Массив = Новый Массив();
			Массив.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
			ОписаниеТипов = Новый ОписаниеТипов(Массив);
			
			Элементы.Номенклатура_ПодразделениеЗатрат.ОграничениеТипа = ОписаниеТипов;
			Элементы.Договоры_Подразделение.ОграничениеТипа = ОписаниеТипов;
			
		ИначеЕсли Метаданные.Справочники.Найти("ПодразделенияОрганизаций") <> Неопределено Тогда
			Массив = Новый Массив();
			Массив.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
			ОписаниеТипов = Новый ОписаниеТипов(Массив);
			
			Элементы.Номенклатура_ПодразделениеЗатрат.ОграничениеТипа = ОписаниеТипов;
			Элементы.Договоры_Подразделение.ОграничениеТипа = ОписаниеТипов;
		Иначе
			Элементы.Номенклатура_ПодразделениеЗатрат.Видимость = Ложь;
			Элементы.Договоры_Подразделение.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		Если Метаданные.Справочники.Найти("ПодразделенияОрганизаций") <> Неопределено Тогда
			Массив = Новый Массив();
			Массив.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
			ОписаниеТипов = Новый ОписаниеТипов(Массив);
			
			Элементы.Номенклатура_ПодразделениеЗатрат.ОграничениеТипа = ОписаниеТипов;
			Элементы.Договоры_Подразделение.ОграничениеТипа = ОписаниеТипов;
		Иначе
			Элементы.Номенклатура_ПодразделениеЗатрат.Видимость = Ложь;
			Элементы.Договоры_Подразделение.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	//Бух КЗ: Подразделение может быть элементом СтруктурыПредприятия
	Если Метаданные.ФункциональныеОпции.Найти("ПоддержкаРаботыСоСтруктурнымиПодразделениями") <> Неопределено Тогда
		ПоддержкаРаботыСоСтруктурнымиПодразделениями = ПолучитьФункциональнуюОпцию("ПоддержкаРаботыСоСтруктурнымиПодразделениями");
		
		Если ПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда			
			Массив = Новый Массив();
			Массив.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
			ОписаниеТипов = Новый ОписаниеТипов(Массив);
			Элементы.Документ_ПодразделениеОрганизации.ОграничениеТипа = ОписаниеТипов;
						
			НовыйПараметрВыбора = Новый ПараметрВыбора("Отбор.ЯвляетсяСтруктурнымПодразделением",Истина);
			НовыйМассив = Новый Массив();
			НовыйМассив.Добавить(НовыйПараметрВыбора);
			Элементы.Документ_ПодразделениеОрганизации.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
		КонецЕсли;
	КонецЕсли;
	
	
	//Статьи движения ДС
	Если Конф = "КА2" Тогда
		Если Метаданные.Справочники.Найти("СтатьиДвиженияДенежныхСредств") <> Неопределено Тогда
			Массив = Новый Массив();
			Массив.Добавить(Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств"));
			ОписаниеТипов = Новый ОписаниеТипов(Массив);
			
			Элементы.Договоры_СтатьяДДС.ОграничениеТипа = ОписаниеТипов;
		Иначе
			Элементы.Договоры_СтатьяДДС.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.Договоры_СтатьяДДС.Видимость = Ложь;
	КонецЕсли;
		
	//Партнеры
	Элемент = Элементы.Контрагенты_Партнер;
	Если Метаданные.Справочники.Найти("Партнеры") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.Партнеры"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
		
		Элемент.Видимость = Истина;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
		
	//Соглашения
	Элемент = Элементы.Контрагенты_Соглашение;
	Массив = Новый Массив();
	Если Метаданные.Справочники.Найти("СоглашенияСКлиентами") <> Неопределено Тогда
		Массив.Добавить(Тип("СправочникСсылка.СоглашенияСКлиентами"));
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("СоглашенияСПоставщиками") <> Неопределено Тогда
		Массив.Добавить(Тип("СправочникСсылка.СоглашенияСПоставщиками"));
	КонецЕсли;
	
	Если Массив.Количество() > 0 Тогда
		ОписаниеТипов = Новый ОписаниеТипов(Массив);		
		Элемент.ОграничениеТипа = ОписаниеТипов;
		
		Элемент.Видимость = Истина;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	//БГУ2
	Элемент = Элементы.Номенклатура_КФО;
	Если Метаданные.Справочники.Найти("КлассификационныеПризнакиСчетов") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	Элемент = Элементы.Номенклатура_КПС;
	Если Метаданные.Перечисления.Найти("КВД") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.КВД"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	Элемент = Элементы.Номенклатура_КЭК;
	Если Метаданные.Справочники.Найти("КОСГУ") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.КОСГУ"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	
	//Основные средства
	Элемент = Элементы.ОсновныеСредства_ТипОС;
	Если Метаданные.Перечисления.Найти("ТипыОС") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ТипыОС"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	Элемент = Элементы.ОсновныеСредства_Родитель;
	Если Метаданные.Справочники.Найти("ОсновныеСредства") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.ОсновныеСредства"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	Элемент = Элементы.ОсновныеСредства_ГруппаОС;
	Если Метаданные.Перечисления.Найти("ГруппыОС") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ГруппыОС"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	Элемент = Элементы.ОсновныеСредства_ЕдиницаУчета;
	Если Метаданные.Перечисления.Найти("ЕдиницыУчетаОС") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ЕдиницыУчетаОС"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	Элемент = Элементы.ОсновныеСредства_АмортизационнаяГруппа;
	Если Метаданные.Перечисления.Найти("АмортизационныеГруппы") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.АмортизационныеГруппы"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	Элемент = Элементы.ОсновныеСредства_КодПоОКОФ;
	Если Метаданные.Справочники.Найти("ОбщероссийскийКлассификаторОсновныхФондов") <> Неопределено Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.ОбщероссийскийКлассификаторОсновныхФондов"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	
	//E1C-383: только БП30 для Казахстана
	Элемент = Элементы.Номенклатура_НДСВидПоступления;
	Если Конф = "БП30" И СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.ВидыПоступления"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	//E1C-477: Способ происхождения - поле с выбором из 4 значений:
	//ETT, BTO, TC, CT-1 (CT-KZ). Выбирается пользователем вручную
	Элемент = Элементы.ИсточникиПроисхождения_СпособПроисхождения;
	Если Конф = "БП30" И СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.СпособыПроисхожденияТоваров"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	Элемент = Элементы.ИсточникиПроисхождения_ПризнакПроисхождения;
	МодульНомераГТДКлиентСервер = _ЗФ_ПолучитьОбщийМодульКонфигурации("НомераГТДКлиентСервер");
	Если МодульНомераГТДКлиентСервер <> Неопределено
		И Конф = "БП30" И СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
		
		Попытка
			ПредставленияПризнаков = МодульНомераГТДКлиентСервер.ПредставленияПризнаковПроисхождения();
		Исключение
			Элемент.Видимость = Ложь;
		КонецПопытки;
		
		Если ПредставленияПризнаков <> Неопределено Тогда
			Элемент.СписокВыбора.Добавить("1",ПредставленияПризнаков[0]);
			Элемент.СписокВыбора.Добавить("2",ПредставленияПризнаков[1]);
			Элемент.СписокВыбора.Добавить("3",ПредставленияПризнаков[2]);
			Элемент.СписокВыбора.Добавить("4",ПредставленияПризнаков[3]);
			Элемент.СписокВыбора.Добавить("5",ПредставленияПризнаков[4]);
		Иначе
			Элемент.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	Элемент = Элементы.ИсточникиПроисхождения_СтранаПроисхождения;
	Если Конф = "БП30" И СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.КлассификаторСтранМира"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Элемент.ОграничениеТипа = ОписаниеТипов;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
	
	//E1C-257: Агентские услуги
	Если СтруктураНастроек.Свойство("ТипДокумента_ИспользуютсяАгентскиеУслуги")
		И СтруктураНастроек.ТипДокумента_ИспользуютсяАгентскиеУслуги = Истина Тогда
		
		Элементы.Номенклатура_Комитент.Видимость = Истина;
		Элементы.Номенклатура_ДоговорКомитента.Видимость = Истина;
		
		ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		Элементы.Номенклатура_Комитент.ОграничениеТипа = ОписаниеТипов;
		
		ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
		Элементы.Номенклатура_ДоговорКомитента.ОграничениеТипа = ОписаниеТипов;
		
	Иначе
		Элементы.Номенклатура_Комитент.Видимость = Ложь;
		Элементы.Номенклатура_ДоговорКомитента.Видимость = Ложь;
	КонецЕсли;
	
	//E1C-375: Услуги аренды. По умолчанию реквизит Документ_ВедетсяУчетПредметовАренды не отображаем,
	//видимость его включается только при изменении вида операции документа Поступления
	Элементы.Документ_ВедетсяУчетПредметовАренды.Видимость = Ложь;
	
	
	//Установим для единицы измерения отбор по владельцу
	Если СтруктураНастроек.СведенияОКонфигурации.ЕдиницыИзмерения_ВладелецНоменклатура Тогда
		
		//В УНФ ищем единицы измерения в классификаторе, при подборе вызываем
		//функцию конфигурации для выбора единицы измерения, не устанавливаем отбор по владельцу на элемент
		Если Конф = "УНФ" Или Конф = "РОЗН3" Тогда
			//
		Иначе
		//
		
			НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Элементы.ЗагружаемыеОбъекты.ТекущиеДанные.Объект1с");
			НовыйМассив = Новый Массив();
			НовыйМассив.Добавить(НоваяСвязь);
			Элементы.Номенклатура_ЕдиницаИзмерения.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
		КонецЕсли;
	КонецЕсли;
	
	//Склад
	Массив = Новый Массив;
	Массив.Добавить(ТипЗнч(СтруктураНастроек.ЗаполнениеШапки_СкладПоУмолчанию));
	Элементы.Документ_Склад.ОграничениеТипа = Новый ОписаниеТипов(Массив);
	
	//Подразделение
	Если СтруктураНастроек.ЗаполнениеШапки_ПодразделениеПоУмолчанию = "" Тогда
		Элементы.Документ_Подразделение.Видимость = Ложь;
	Иначе
		Массив = Новый Массив;
		Массив.Добавить(ТипЗнч(СтруктураНастроек.ЗаполнениеШапки_ПодразделениеПоУмолчанию));
		Элементы.Документ_Подразделение.ОграничениеТипа = Новый ОписаниеТипов(Массив);
	КонецЕсли;
	
	//Подразделение организации
	Массив = Новый Массив;
	Массив.Добавить(ТипЗнч(СтруктураНастроек.ЗаполнениеШапки_ПодразделениеОрганизацииПоУмолчанию));
	Элементы.Документ_ПодразделениеОрганизации.ОграничениеТипа = Новый ОписаниеТипов(Массив);
	
	//Номенклатуру поставщиков отображаем если включена настройка
	Элемент = Элементы.Номенклатура_НоменклатураПоставщика;
	Элемент.Видимость = ПоискПоНоменклатуреПоставщиков;
	
	Если ПоискПоНоменклатуреПоставщиков Тогда	
		
		Если Метаданные.Справочники.Найти("НоменклатураПоставщиков") <> Неопределено Тогда
			Тип_НоменклатураПоставщиков = Тип("СправочникСсылка.НоменклатураПоставщиков");
		ИначеЕсли Метаданные.Справочники.Найти("НоменклатураКонтрагентов") <> Неопределено Тогда
			Тип_НоменклатураПоставщиков = Тип("СправочникСсылка.НоменклатураКонтрагентов");
		КонецЕсли;
		
		Если Тип_НоменклатураПоставщиков <> Неопределено Тогда
			Массив = Новый Массив();
			Массив.Добавить(Тип_НоменклатураПоставщиков);
			ОписаниеТипов = Новый ОписаниеТипов(Массив);
			
			Элемент.ОграничениеТипа = ОписаниеТипов;
		КонецЕсли;
		
	КонецЕсли;
	
	//Отображаем элемент выбора табличной части документа по настройке
	Элементы.Документ_ИмяТабличнойЧасти.Видимость = СтруктураНастроек.ЗаполнениеТЧ_ВыбиратьТабличнуюЧастьДляЗаполнения = Истина;
	
КонецПроцедуры
&НаКлиенте
Процедура УстановитьОграничениеТипа_ЭлементТекущейСтроки(ТекСтрока)
	
	Если ЗначениеЗаполнено(ТекСтрока.ОписаниеТипа) Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип(ТекСтрока.ОписаниеТипа));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
	Иначе
		ОписаниеТипов = Новый ОписаниеТипов();
	КонецЕсли;
	
	Элементы.ЗагружаемыеОбъектыОбъект1с.ОграничениеТипа = ОписаниеТипов;
	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКнопкиКонтекстногоМеню()
	
	//Кнопки смены типа номенклатуры
	СписокКнопок = ЗначениеИзСтрокиВнутрСервер(СтруктураНастроек.Номенклатура_ТипНоменклатурыТоварУслуга_СписокВыбора);
	
	Для Каждого Кнопка Из СписокКнопок Цикл
		ИмяКоманды = "ТипНоменклатуры_" + Кнопка.Значение;
		ДобавитьКнопкуНаФорму(ИмяКоманды,ИмяКоманды,Кнопка.Представление,"УстановитьТипНоменклатурыВыделеннымСтрокам",Элементы.ЗагружаемыеОбъектыГруппаУстановитьТипНоменклатуры);
	КонецЦикла;
	
	//Добавление связи маркера и номенклатуры
	ИмяКоманды = "ДобавитьМаркерНоменклатуры";
	ДобавитьКнопкуНаФорму(ИмяКоманды,ИмяКоманды,"Добавить в маркеры","ДобавитьМаркерНоменклатуры",Элементы.ЗагружаемыеОбъектыКонтекстноеМенюМаркеры);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Команда_Дополнительно(Команда)
	
	СписокВыбора = Новый СписокЗначений;
	
	Если СпособКомпоновкиЭлементовФормы = "Горизонтально" Тогда
		Попытка Картинка = БиблиотекаКартинок.ВнешнийИсточникДанныхКубТаблицаИзмерения; Исключение; КонецПопытки;
		СписокВыбора.Добавить("СпособКомпоновкиЭлементовФормы_Вертикально","Отображать элементы вертикально",,Картинка);
	Иначе
		Попытка Картинка = БиблиотекаКартинок.ВнешнийИсточникДанныхКубТаблицаИзмерения; Исключение; КонецПопытки;
		СписокВыбора.Добавить("СпособКомпоновкиЭлементовФормы_Горизонтально","Отображать элементы горизонтально",,Картинка);
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ЭлементФормы",Элементы.Дополнительно);
	
	ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,СписокВыбора","ОбработатьВыбор_Дополнительно",ДопПараметры,СписокВыбора);
		
	_ЗФ_ОбработатьАсинхронныйВызов("ВыборИзМеню",ПараметрыВызова);
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьВыбор_Дополнительно(Результат,ДопПараметры)
	
	Если Результат = Неопределено Тогда
		Возврат;	
		
	Иначе
		ВыбранноеЗначение = Результат.Значение;
		
		Если ВыбранноеЗначение = "СпособКомпоновкиЭлементовФормы_Вертикально" Тогда
			СпособКомпоновкиЭлементовФормы = "Вертикально";
			УстановитьСпособКомпоновкиЭлементовФормы();
			
		ИначеЕсли ВыбранноеЗначение = "СпособКомпоновкиЭлементовФормы_Горизонтально" Тогда
			СпособКомпоновкиЭлементовФормы = "Горизонтально";
			УстановитьСпособКомпоновкиЭлементовФормы();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительноеОпианиеЭлементаПриИзменении(Элемент)
	Элементы.ГруппаОписаниеСоздаваемыхЭлементов.Видимость = ДополнительноеОписаниеЭлемента;
КонецПроцедуры
&НаКлиенте
Процедура ПоказыватьСканДокументаПриИзменении(Элемент)
	
	Если ПоказыватьСканДокументаСредствамиEntera Тогда
		СканДокумента_ИнициализироватьСтраницу_ENTERA();
	КонецЕсли;
	
	СканДокумента_ПоказатьСканДокумента();
	
КонецПроцедуры
&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	УстановитьОтборСтрокТаблицы();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрокТаблицы() Экспорт
	Если Отбор = 0 Тогда
		Элементы.ЗагружаемыеОбъекты.ОтборСтрок = Неопределено;
	Иначе
		Элементы.ЗагружаемыеОбъекты.ОтборСтрок = Новый ФиксированнаяСтруктура("СоответствиеУстановлено",Отбор = 2); 
	КонецЕсли;		
	Элементы.ЗагружаемыеОбъекты.ВыделенныеСтроки.Очистить();
КонецПроцедуры


&НаКлиенте
Процедура ЗагружаемыеОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	
	Если Поле = Элементы.ЗагружаемыеОбъектыПредставлениеДокумента Тогда
				
		Если ВладелецФормы.ЭтоВебКлиент Тогда
			//Переходим по навигационной ссылке на pdf
			ВладелецФормы._ЗФ_Команда_ПерейтиПоСсылке("https://app.entera.pro/api/v1/documents/" + ТекСтрока.ДокументИД + "/printForm?view");
		Иначе
			//Получим файл на локальную машину и откроем штатным просмотрщиком pdf
			Если ЗначениеЗаполнено(ТекСтрока.АдресХранилищаСканаДокумента) Тогда
				//Печатная форма уже получена ранее
				АдресХранилищаСканаДокумента = ТекСтрока.АдресХранилищаСканаДокумента;
			Иначе
					
				//Получаем печатную форму PDF
				РезультатЗапроса = ВладелецФормы.ПолучитьПечатнуюФормуСканаДокумента(ТекСтрока.ДокументИД,ТекСтрока.ПредставлениеДокумента);
				Если РезультатЗапроса.Успешно Тогда
					
					Если РезультатЗапроса.ТребуетсяПовтор Тогда
						СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
					Иначе
						АдресХранилищаСканаДокумента = РезультатЗапроса.АдресВХ;
						ТекСтрока.АдресХранилищаСканаДокумента = РезультатЗапроса.АдресВХ;
						ТекСтрока.ИмяФайлаСканаДокумента = РезультатЗапроса.ИмяФайла;
						
						АдресХранилищаСканаДокумента = РезультатЗапроса.АдресВХ;
						
						//Установим полученное значение для всех строк этого документа
						СтрокиДокумента = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ДокументИД",ТекСтрока.ДокументИД));
						Для Каждого СтрокаДокумента Из СтрокиДокумента Цикл
							СтрокаДокумента.АдресХранилищаСканаДокумента = РезультатЗапроса.АдресВХ;
							СтрокаДокумента.ИмяФайлаСканаДокумента = РезультатЗапроса.ИмяФайла;
						КонецЦикла;
						
					КонецЕсли;
				Иначе
					СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЭтоАдресВременногоХранилища(АдресХранилищаСканаДокумента) Тогда
				//Открываем полученный скан системным просмотрщиком
				ВладелецФормы._ЗФ_Команда_ПоказатьФайлСкана(АдресХранилищаСканаДокумента);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагружаемыеОбъектыПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		
		Если ТекСтрока.ПолучитьИдентификатор() = ИдентификаторТекущейСтроки Тогда
			Возврат;
		КонецЕсли;
		
		//Сбросим возможно установленные ранее параметры выбора
		Элементы.ЗагружаемыеОбъектыОбъект1с.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);	
				
		Если ТекСтрока.ТипОбъекта = "Документ" Тогда
			
			//Вид операции может быть зафиксирован при выборе пользователем типа создаваемого документа (Основные средства)
			Если ТекСтрока.Документ_ВидОперацииЗаданПринудительно = Истина Тогда
				Элементы.Документ_ВидОперации.Доступность = Ложь;
				Элементы.Документ_ВидОперации.Подсказка = "Вид операции определен при выборе типа документа";
			Иначе
				//Вид операции доступен для изменения только для значений, предусмотренных дальнейшим заполнением по виду операции документа
				ДоступныеВидыОпераций = СтруктураНастроек.СведенияОКонфигурации.ВидыОперацийЗаполняемыхДокументов.Получить(ТекСтрока.ТипСоздаваемогоДокумента);
				Если ДоступныеВидыОпераций <> Неопределено И ДоступныеВидыОпераций.Количество() > 0 Тогда
					Элементы.Документ_ВидОперации.Доступность = Истина;
					Элементы.Документ_ВидОперации.Подсказка = "Вид операции создаваемого документа";
				Иначе
					Элементы.Документ_ВидОперации.Доступность = Ложь;
					Элементы.Документ_ВидОперации.Подсказка = "Для создаваемого типа документа недоступен выбор вида операции";
				КонецЕсли;
			КонецЕсли;
			
			//Назначение платежа видно только для типа создаваемого документа, у которого есть реквизит НазначениеПлатежа
			Элементы.Документ_НазначениеПлатежа.Видимость = РеквизитСуществует("Документы",ТекСтрока.ТипСоздаваемогоДокумента,"НазначениеПлатежа");
			
			//Подотчетное лицо видимо только для типа создаваемого документа АвансовыйОтчет
			Элементы.Документ_ПодотчетноеЛицо.Видимость = ТекСтрока.ТипСоздаваемогоДокумента = "АвансовыйОтчет"
			    //2023.09.26 ( БП30 KAZ
				Или ТекСтрока.ТипСоздаваемогоДокумента = "Доверенность"
				// ) 2023.09.26
				// 2022.02.24 ( Для УТ, КА, ERP
				Или (ТекСтрока.ТипСоздаваемогоДокумента = "ПриобретениеТоваровУслуг" И ЗначениеЗаполнено(ТекСтрока.Документ_ВидОперации));
				// ) 2022.02.24
				
			Элементы.Документ_НазначениеАванса.Видимость = ТекСтрока.ТипСоздаваемогоДокумента = "АвансовыйОтчет";
			
			//E1C-509: Документ-основание пока что отображаем только для типа создаваемого документа СчетФактураПолученный с видом операции НаАванс (других пока тут и не предполагаем)
			Если ТекСтрока.ТипСоздаваемогоДокумента = "СчетФактураПолученный" Тогда
				Элементы.Документ_ДокументОснование.Видимость = Истина;
				
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(Тип("ДокументСсылка.СписаниеСРасчетногоСчета"));
				МассивТипов.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
				Элементы.Документ_ДокументОснование.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
				
			Иначе
				Элементы.Документ_ДокументОснование.Видимость = Ложь;
			КонецЕсли;
			
			//E1C-308: для документа ПоступлениеДопРасходов
			Если ТекСтрока.ТипСоздаваемогоДокумента = "ПоступлениеДопРасходов" Тогда
				Элементы.Документ_ДокументыПоступленияДляДопРасходов.Видимость = Истина;
				Элементы.Документ_СодержаниеУслугиДляДопРасходов.Видимость = Истина;
			
				Если ЗначениеЗаполнено(ТекСтрока.Документ_ДокументыПоступленияДляДопРасходов) Тогда
					ЗначенияСписка = ТекСтрока.Документ_ДокументыПоступленияДляДопРасходов;
					ТекСтрока.Документ_ДокументыПоступленияДляДопРасходовСписок = ЗначениеИзСтрокиВнутрСервер(ЗначенияСписка);
				Иначе
					ТекСтрока.Документ_ДокументыПоступленияДляДопРасходовСписок = Новый СписокЗначений;
				КонецЕсли;
				
				//Зададим тип значения списка значений
				ТекСтрока.Документ_ДокументыПоступленияДляДопРасходовСписок.ТипЗначения = Новый ОписаниеТипов("ДокументСсылка.ПоступлениеТоваровУслуг");
				
			Иначе
				Элементы.Документ_ДокументыПоступленияДляДопРасходов.Видимость = Ложь;
				Элементы.Документ_СодержаниеУслугиДляДопРасходов.Видимость = Ложь;
				
			КонецЕсли;
			
			//+++ Если заполняем авансовый отчет, выделим жирным заголовок ПодотчетногоЛица для первого документа списка (для шапки документа) 
			
		Иначе
			Элементы.ЗагружаемыеОбъектыДополнительноеОписаниеОбъекта.ТолькоПросмотр = ТекСтрока.ДополнительноеОписание_СписокВыбора = "";
					
			// 2019.02.28 ( Никита попросил сделать, чтобы выпадашка с похожими работала "в 2 клика"
			РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
			КнопкаВыпадающегоСписка = Неопределено;
			КнопкаСоздания = Неопределено;
			РедактированиеТекста = Истина;
			ИсторияВыбора = ИсторияВыбораПриВводе.Авто;
			
			Если (ТекСтрока.ТипОбъекта = "Номенклатура" И СтруктураНастроек.Номенклатура_ИспользоватьПомощникПоиска = Истина)
				Или (ТекСтрока.ТипОбъекта = "Контрагенты" И СтруктураНастроек.Контрагенты_ИспользоватьПомощникПоиска = Истина)
				Или (ТекСтрока.ТипОбъекта = "Организации" И СтруктураНастроек.Контрагенты_ИспользоватьПомощникПоиска = Истина)
				Или (ТекСтрока.ТипОбъекта = "Договоры" И СтруктураНастроек.ЗаполнениеШапки_РучноеРедактированиеДоговора = Истина)
				Или (ТекСтрока.ТипОбъекта = "БанковскиеСчета" И СтруктураНастроек.ЗаполнениеШапки_СоздаватьБанковскийСчетКонтрагента = Истина) Тогда
				
				КнопкаВыпадающегоСписка = Ложь;
				КнопкаСоздания = Ложь;
				РедактированиеТекста = Истина; //2019.07.05 - снова изменили на доступность редактирования, будет многоклик для "умного" поиска
				ИсторияВыбора = ИсторияВыбораПриВводе.НеИспользовать;
				
				//Отбор при выборе договора
				Если ТекСтрока.ТипОбъекта = "Договоры" Тогда
					
					//E1C-516:
					КнопкаСоздания = Истина;
					
					//Зададим параметры выбора для этого поля: организация и контрагент известны, если не заполнены - не даем выбрать
					НайденныеСтроки = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ДокументИД,ТипОбъекта",ТекСтрока.ДокументИД,"Контрагенты"));
					Если НайденныеСтроки.Количество() > 0 Тогда
						КонтрагентСсылка = НайденныеСтроки[0].Объект1с;
					КонецЕсли;
					
					НайденныеСтроки = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ДокументИД,ТипОбъекта",ТекСтрока.ДокументИД,"Организации"));
					Если НайденныеСтроки.Количество() > 0 Тогда
						ОрганизацияСсылка = НайденныеСтроки[0].Объект1с;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(КонтрагентСсылка) И ЗначениеЗаполнено(ОрганизацияСсылка) Тогда
						
						//задаем параметры выбора			
						ОтборОрганизация = Новый ПараметрВыбора("Отбор.Организация",ОрганизацияСсылка);
						
						ОтборВладелец = Новый ПараметрВыбора("Отбор.Владелец",КонтрагентСсылка);
						ОтборКонтрагент = Новый ПараметрВыбора("Отбор.Контрагент",КонтрагентСсылка);
						
						//+++ возможно, следует определять по конфе, какой отбор накладывать
						МассивПараметров = Новый Массив();
						МассивПараметров.Добавить(ОтборОрганизация);
						
						Если СтруктураНастроек.СведенияОКонфигурации.Договоры_ВладелецКонтрагенты Тогда
							МассивПараметров.Добавить(ОтборВладелец);
						Иначе
							МассивПараметров.Добавить(ОтборКонтрагент);
						КонецЕсли;
						
						//E1C-327: Если тип создаваемого документа ОтчетКомиссионераОПродажах, добавляем в отбор ВидДоговора
						Если ТекСтрока.ТипСоздаваемогоДокумента = "ОтчетКомиссионераОПродажах" Тогда							
							Если РеквизитСуществует("Перечисления","ВидыДоговоровКонтрагентов","СКомиссионером") Тогда
								ОтборВидДоговора = Новый ПараметрВыбора("Отбор.ВидДоговора",ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером"));
								МассивПараметров.Добавить(ОтборВидДоговора);
							КонецЕсли;
							
						//2024.04.23 ( УНФ
						ИначеЕсли ТекСтрока.ТипСоздаваемогоДокумента = "ОтчетКомиссионера" Тогда
							Если РеквизитСуществует("Перечисления","ВидыДоговоров","СКомиссионером") Тогда
								ОтборВидДоговора = Новый ПараметрВыбора("Отбор.ВидДоговора",ПредопределенноеЗначение("Перечисление.ВидыДоговоров.СКомиссионером"));
								МассивПараметров.Добавить(ОтборВидДоговора);								
							КонецЕсли;
						// ) 2024.04.23
						
						КонецЕсли;
						
						Элементы.ЗагружаемыеОбъектыОбъект1с.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
						
					КонецЕсли;
				КонецЕсли;
					
				//Отбор при выборе банковского счета контрагента
				Если ТекСтрока.ТипОбъекта = "БанковскиеСчета" Тогда
							
					//Зададим параметры выбора для этого поля: организация и контрагент известны, если не заполнены - не даем выбрать
					НайденныеСтроки = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ДокументИД,ТипОбъекта",ТекСтрока.ДокументИД,"Контрагенты"));
					Если НайденныеСтроки.Количество() > 0 Тогда
						КонтрагентСсылка = НайденныеСтроки[0].Объект1с;
					КонецЕсли;
											
					Если ЗначениеЗаполнено(КонтрагентСсылка) Тогда
						
						ОтборВладелец = Новый ПараметрВыбора("Отбор.Владелец",КонтрагентСсылка);
						
						МассивПараметров = Новый Массив();
						МассивПараметров.Добавить(ОтборВладелец);
						
						Элементы.ЗагружаемыеОбъектыОбъект1с.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
						
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			Элементы.ЗагружаемыеОбъектыОбъект1с.РежимРедактирования = РежимРедактирования;
			Элементы.ЗагружаемыеОбъектыОбъект1с.КнопкаВыпадающегоСписка = КнопкаВыпадающегоСписка;
			Элементы.ЗагружаемыеОбъектыОбъект1с.КнопкаСоздания = КнопкаСоздания;
			Элементы.ЗагружаемыеОбъектыОбъект1с.РедактированиеТекста = РедактированиеТекста;
			Элементы.ЗагружаемыеОбъектыОбъект1с.ИсторияВыбораПриВводе = ИсторияВыбора;
						
		КонецЕсли;
		// ) 2019.02.28
		
		//2020.10.07 (
		Элементы.ЗагружаемыеОбъектыОбъект1с.ТолькоПросмотр = ТекСтрока.ТипОбъекта = "Номенклатура" И НЕ ТекСтрока.Номенклатура_ТребуетсяСозданиеНоменклатуры = Истина;
		// ) 2020.10.07
		
		УстановитьОграничениеТипа_ЭлементТекущейСтроки(ТекСтрока);
		
		//Отображаем группа описания выбранного типа элемента
		Элементы.ГруппаОписаниеДокумент.Видимость = ТекСтрока.ТипОбъекта = "Документ";
		Элементы.ГруппаОписаниеНоменклатура.Видимость = ТекСтрока.ТипОбъекта = "Номенклатура";
		Элементы.ГруппаОписаниеОсновныеСредства.Видимость = ТекСтрока.ТипОбъекта = "ОсновныеСредства";
		Элементы.ГруппаОписаниеОрганизации.Видимость = ТекСтрока.ТипОбъекта = "Организации";
		Элементы.ГруппаОписаниеКонтрагенты.Видимость = ТекСтрока.ТипОбъекта = "Контрагенты";
		Элементы.ГруппаОписаниеДоговоры.Видимость = ТекСтрока.ТипОбъекта = "Договоры";
		Элементы.ГруппаОписаниеБанковскиеСчета.Видимость = ТекСтрока.ТипОбъекта = "БанковскиеСчета";
		Элементы.ГруппаОписаниеУпаковкиЕдиницыИзмерения.Видимость = ТекСтрока.ТипОбъекта = "УпаковкиЕдиницыИзмерения";
		Элементы.ГруппаОписаниеНомераГТД.Видимость = ТекСтрока.ТипОбъекта = "НомераГТД";
		Элементы.ГруппаОписаниеСтраныМира.Видимость = ТекСтрока.ТипОбъекта = "СтраныМира";
		Элементы.ГруппаОписаниеИсточникиПроисхождения.Видимость = ТекСтрока.ТипОбъекта = "ИсточникиПроисхождения";
		
		//Костылим отключение повторного выполнения ПриАктивацииСтроки,
		//которое срабатывает после изменения видимости элементов групп-описаний
		ИдентификаторТекущейСтроки = ТекСтрока.ПолучитьИдентификатор();
		
		//Показываем скан документа
		Если ПоказыватьСканДокумента Тогда
			СканДокумента_ПоказатьСканДокумента();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура УстановитьВидимостьЭлементов_ДополнительноеОписаниеЭлемента() Экспорт
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	Элементы.ГруппаОписаниеНоменклатура.Видимость = ТекСтрока.ТипОбъекта = "Номенклатура";
	Элементы.ГруппаОписаниеКонтрагенты.Видимость = ТекСтрока.ТипОбъекта = "Контрагенты";
	Элементы.ГруппаОписаниеБанковскиеСчета.Видимость = ТекСтрока.ТипОбъекта = "БанковскиеСчета";
	Элементы.ГруппаОписаниеУпаковкиЕдиницыИзмерения.Видимость = ТекСтрока.ТипОбъекта = "УпаковкиЕдиницыИзмерения";
	Элементы.ГруппаОписаниеНомераГТД.Видимость = ТекСтрока.ТипОбъекта = "НомераГТД";
	Элементы.ГруппаОписаниеСтраныМира.Видимость = ТекСтрока.ТипОбъекта = "СтраныМира";
КонецПроцедуры

&НаКлиенте
Процедура ЗагружаемыеОбъектыПриИзменении(Элемент)
	
	ТекСтрока = Элемент.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		
		Если Элемент.ТекущийЭлемент = Элементы.ЗагружаемыеОбъектыПредставлениеОбъекта Тогда
			//EN-225: Пользователю нельзя дать возможность изменив наименование создать дубль существующей номеклатуры
			//при изменении представления номенклатуры выполним ее поиск по наименованию
			Если ТекСтрока.ТипОбъекта = "Номенклатура" И ЗначениеЗаполнено(ТекСтрока.ПредставлениеОбъекта) Тогда
				Если Не ЗначениеЗаполнено(ТекСтрока.Объект1с) Тогда
					//2024.04.17 ( Поиск по наименованию выполняем только если это предполагает настройка
					Если СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Наименование,Артикул"
						Или СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Наименование" Тогда
						// ) 2024.04.17
						ТекСтрока.Объект1с = ПолучитьСсылку_ОбъектПоНаименованию("Номенклатура",ТекСтрока.ПредставлениеОбъекта);
						ТекСтрока.СоответствиеУстановлено = ЗначениеЗаполнено(ТекСтрока.Объект1с);
						ТекСтрока.Пометка = Не ТекСтрока.СоответствиеУстановлено;
					КонецЕсли;
					
					//E1C-9: краткое наименование равно полному наименованию. Спросим у пользователя
					ДопПараметры = Новый Структура;
					ДопПараметры.Вставить("ТекСтрока",ТекСтрока);
					
					ТекстВопроса = "Установить это значение для поля <Полное наименование>?";
					Кнопки = РежимДиалогаВопрос.ДаНет;
					ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","Продолжить_УстановитьПолноеНаименованиеПоКраткому",ДопПараметры,ТекстВопроса,Кнопки);
					
					_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
				КонецЕсли;
				
				ТекСтрока.Номенклатура_ПредставлениеИзменено = Истина;
			КонецЕсли;
			
		ИначеЕсли Элемент.ТекущийЭлемент = Элементы.ЗагружаемыеОбъектыОбъект1с Тогда
		
			ТекСтрока.СоответствиеУстановлено = ЗначениеЗаполнено(ТекСтрока.Объект1с);
			ТекСтрока.СработавшийВариантПоиска = "РучнойВыбор";
			
			//2019.02.20 ( раз соответствие не установлено - устанавливаем флаг создания
			ТекСтрока.Пометка = Не ТекСтрока.СоответствиеУстановлено;
			// ) 2019.02.20
						
			//2019.02.15 ( сохраняем установленную пользователем связь номенклатуры поставщика и Номенклатуры
			Если ТекСтрока.ТипОбъекта = "Номенклатура" Тогда
				Если СтруктураНастроек.Номенклатура_ЗапоминатьУстановленныеВручнуюСоответствия = Истина Тогда
					ТекстОповещения = ЗаписатьСоответствиеНоменклатуры(ТекСтрока.Объект1с,ТекСтрока.Номенклатура_Характеристика,ТекСтрока.ПредставлениеОбъекта,ТекСтрока.КонтрагентИД);
					ПоказатьОповещениеПользователя("Сохранено",,ТекстОповещения);
				КонецЕсли;
				
				УстановитьДополнительныеРеквизиты(ТекСтрока);
				
			ИначеЕсли ТекСтрока.ТипОбъекта = "Контрагенты" Тогда
				ТекстОповещения = ЗаписатьСоответствиеКонтрагента(ТекСтрока.Объект1с,ТекСтрока.Контрагенты_Наименование,ТекСтрока.Контрагенты_НаименованиеПолное);
				ПоказатьОповещениеПользователя("Сохранено",,ТекстОповещения);
			
				УстановитьДополнительныеРеквизиты(ТекСтрока);
				
				//2020.04.14 ( для конфигураций, предполагающих наличие справочника Партнеры нужно заполнить партнера при выборе контрагента
				Если РеквизитСуществует("Справочники","Контрагенты","Партнер") Тогда
					ТекСтрока.Контрагенты_Партнер = ПолучитьЗначениеРеквизитаОбъекта(ТекСтрока.Объект1с,"Партнер");
				КонецЕсли;
				// ) 2020.04.14
				
			ИначеЕсли ТекСтрока.ТипОбъекта = "Организации" Тогда
				//Организация влияет на счет учета номенклатуры, поэтому перезаполним у строк номенклатуры этого документа счета учета
				СтруктураПоиска = Новый Структура("ТипОбъекта,ДокументИД","Номенклатура",ТекСтрока.ДокументИД);
				СтрокиНоменклатуры = Объект.ЗагружаемыеОбъекты.НайтиСтроки(СтруктураПоиска);
				Для Каждого СтрокаНоменклатуры Из СтрокиНоменклатуры Цикл
					СчетаУчета_ЗаполнитьСчетаУчетаВСтрокеНоменклатуры(СтрокаНоменклатуры,ТекСтрока.Объект1с);
				КонецЦикла;
				
			КонецЕсли;
			// ) 2019.02.15
			
			ЗаполнитьВсеСоответствующиеЗначения(ТекСтрока.ПолучитьИдентификатор());
			
			УстановитьОграничениеТипа_ЭлементТекущейСтроки(ТекСтрока);
			
		ИначеЕсли Элемент.ТекущийЭлемент = Элементы.ЗагружаемыеОбъектыДополнительноеОписаниеОбъекта Тогда
			Если ТекСтрока.ТипОбъекта = "Номенклатура" Тогда
				СчетаУчета_ЗаполнитьСчетаУчетаВСтрокеНоменклатуры(ТекСтрока);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("УстановитьОтборСтрокТаблицы",1,Истина);
	
КонецПроцедуры
&НаКлиенте
Процедура УстановитьДополнительныеРеквизиты(ТекСтрока)
	
	Если ТекСтрока.ТипОбъекта = "Номенклатура" Тогда
		
		Если ЗначениеЗаполнено(ТекСтрока.Объект1с) Тогда
			
			Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаВидНоменклатуры) Тогда
				ТекСтрока.Номенклатура_ВидНоменклатуры = ПолучитьЗначениеРеквизитаОбъекта(ТекСтрока.Объект1с,СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаВидНоменклатуры);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаРодитель) Тогда
				ТекСтрока.Номенклатура_Родитель = ПолучитьЗначениеРеквизитаОбъекта(ТекСтрока.Объект1с,СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаРодитель);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаКатегория) Тогда
				ТекСтрока.Номенклатура_Категория = ПолучитьЗначениеРеквизитаОбъекта(ТекСтрока.Объект1с,СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаКатегория);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаНаправлениеДеятельности) Тогда
				ТекСтрока.Номенклатура_НаправлениеДеятельности = ПолучитьЗначениеРеквизитаОбъекта(ТекСтрока.Объект1с,СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаНаправлениеДеятельности);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаСтатьяЗатрат) Тогда
				ТекСтрока.Номенклатура_СтатьяЗатрат = ПолучитьЗначениеРеквизитаОбъекта(ТекСтрока.Объект1с,СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаСтатьяЗатрат);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаАртикул) Тогда
				ТекСтрока.Номенклатура_Артикул1с = ПолучитьЗначениеРеквизитаОбъекта(ТекСтрока.Объект1с,СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаАртикул);
			КонецЕсли;
			
			//E1C-66: отображаем счет учета, устанавливаемый по умолчанию для данной номенклатуры
			СчетаУчета_ЗаполнитьСчетаУчетаВСтрокеНоменклатуры(ТекСтрока);
			
		Иначе
			Номенклатура_ЗаполнитьЗначенияПоУмолчанию(ТекСтрока);
			
		КонецЕсли;
		
		//Поищем связанную единицу измерения
		Если СтруктураНастроек.СведенияОКонфигурации.ЕдиницыИзмерения_ВладелецНоменклатура = Истина Тогда
			//пробуем найти существующую единицу измерения, пока под конфу, на которой это вызвало проблему
			Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат = "БИТСтоматология"
				//2023.05.24 (
				Или СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Имя = "дсуУАТ" Тогда
				// ) 2023.05.24
				
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("ИдентификаторСтроки",ТекСтрока.ПолучитьИдентификатор());
				
				ТекСтрока.Номенклатура_ЕдиницаИзмерения = ПолучитьСсылку_УпаковкаЕдиницаИзмерения(ДопПараметры);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура Продолжить_УстановитьПолноеНаименованиеПоКраткому(Результат,ДопПараметры)
	Если Результат = КодВозвратаДиалога.Да Тогда
		ДопПараметры.ТекСтрока.Номенклатура_НаименованиеПолное = ДопПараметры.ТекСтрока.ПредставлениеОбъекта;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагружаемыеОбъектыОбъект1сСоздание(Элемент, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		
		ТипОбъекта = ТекСтрока.ТипОбъекта;
		
		ПользовательскиеПараметрыЗаполнения = Новый Структура;
		
		Если ТекСтрока.ТипОбъекта = "БанковскиеСчета" Тогда
			//Справочник БанковскиеСчета в разных конфигурациях называется по-разному
			ТипОбъекта = СтруктураНастроек.СведенияОКонфигурации.Банк_ИмяСправочникаБанковскиеСчетаКонтрагентов;
			
			//передадим контрагента-владельца банковского счета
			НайденныеСтроки = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ДокументИД,ТипОбъекта",ТекСтрока.ДокументИД,"Контрагенты"));
			Если НайденныеСтроки.Количество() > 0 И ЗначениеЗаполнено(НайденныеСтроки[0].Объект1с) Тогда
				ПараметрыОткрытияФормы = Новый Структура("Владелец",НайденныеСтроки[0].Объект1с);
			КонецЕсли;
			
		ИначеЕсли ТекСтрока.ТипОбъекта = "Договоры" Тогда
			ТипОбъекта = СтруктураНастроек.СведенияОКонфигурации.Договоры_ИмяСправочникаДоговорыКонтрагентов;
			
			//Для договора нужно передать потенциально измененные в форме сведения о договоре
			ПользовательскиеПараметрыЗаполнения.Вставить("Наименование",ТекСтрока.ПредставлениеОбъекта);
			ПользовательскиеПараметрыЗаполнения.Вставить("Номер",ТекСтрока.Договоры_Номер);
			ПользовательскиеПараметрыЗаполнения.Вставить("Дата",ТекСтрока.Договоры_Дата);
			
		ИначеЕсли ТекСтрока.ТипОбъекта = "ИсточникиПроисхождения" Тогда
			ТипОбъекта = "НомераГТД";
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТипОбъекта) Тогда
			Возврат;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		
		//делаем через заполнение нового объекта формы и КопироватьДанныеФормы()
		Попытка
			ФормаНовогоОбъекта = ПолучитьФорму("Справочник." + ТипОбъекта + ".ФормаОбъекта",ПараметрыОткрытияФормы,ЭтаФорма);
		Исключение
			
		КонецПопытки;
		
		Если ФормаНовогоОбъекта <> Неопределено Тогда
			
			//2019.06.25 ( Теперь пользователь может переопределить направление для каждого документа пакета
			СтрокиДокумента = Объект.СписокДокументов.НайтиСтроки(Новый Структура("ДокументИД",ТекСтрока.ДокументИД));
			Если СтрокиДокумента.Количество() > 0 Тогда
				НаправлениеСоздаваемогоДокумента = СтрокиДокумента[0].НаправлениеСоздаваемогоДокумента;
			Иначе
				СообщитьСообщение("Внутренняя ошибка модуля: не удалось найти строку документа по идентификатору для определения направления документа");
			КонецЕсли;
						
			ОбъектФормы = ФормаНовогоОбъекта.Объект;
			
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("ТипОбъекта",ТекСтрока.ТипОбъекта);
			ПараметрыЗаполнения.Вставить("ИдентификаторОбъекта",ТекСтрока.ИдентификаторОбъекта);
			ПараметрыЗаполнения.Вставить("ДополнительноеОписаниеОбъекта",ТекСтрока.ДополнительноеОписаниеОбъекта);
			ПараметрыЗаполнения.Вставить("НаправлениеСоздаваемогоДокумента",НаправлениеСоздаваемогоДокумента);
			ПараметрыЗаполнения.Вставить("ПользовательскиеПараметрыЗаполнения",ПользовательскиеПараметрыЗаполнения);
			
			СтруктураЗаполнения = ПредзаполнитьНовыйОбъект(ОбъектФормы,СтруктураНастроек,АдресХранилищаДанныхПортала,
				ТекСтрока.ДокументИД,ПараметрыЗаполнения);
			
			КопироватьДанныеФормы(ОбъектФормы,ФормаНовогоОбъекта.Объект);
			
			//У Далиона может присутствовать реквизит ЕдиницаИзмеренияОтчетов, который будучи скрытым, но предзаполненным при стандартной работе
			//не позволит записать заполняемы элемент справочника Номенклатура.
			Если СтруктураЗаполнения.Свойство("ЕдиницаИзмерения") Тогда
				СтруктураЗаполненияФормы = Новый Структура;
				СтруктураЗаполненияФормы.Вставить("ЕдиницаИзмеренияОтчетов",СтруктураЗаполнения.ЕдиницаИзмерения);
				ЗаполнитьЗначенияСвойств(ФормаНовогоОбъекта,СтруктураЗаполненияФормы);
			КонецЕсли;
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ТипОбъекта",ТекСтрока.ТипОбъекта);
			ДополнительныеПараметры.Вставить("ИдентификаторСтроки",ТекСтрока.ПолучитьИдентификатор());
			ДополнительныеПараметры.Вставить("Форма",ФормаНовогоОбъекта);
			
			//Открываем форму нового объекта с предзаполненным объектом
			ФормаНовогоОбъекта.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ЗакрытиеФормыСозданияОбъекта",ЭтаФорма,ДополнительныеПараметры);
			
			ФормаНовогоОбъекта.Открыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗакрытиеФормыСозданияОбъекта(Результат,ДополнительныеПараметры) Экспорт
	
	ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	
	//2022.01.20 ( На 8.3.18 и 8.3.20 у пользователей возникает ситуация при работе в тонком клиенте в базе, опубликованной на веб-сервере,
	//что Форма, переданная в дополнительных параметрах, возвращается Неопределено и ссылку на объект из нее не получить.
	//В БП30 ПриЗакрытии формы элемента Номенклатуры в ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры помещается Объект.Ссылка
	//+++ Возможен еще вариант костыля: устанавливать новому заполняемому объекту ссылку и после закрытия формы проверять,
	//существует ли что-то с такой ссылкой в базе
	Если ДополнительныеПараметры.Форма = Неопределено Тогда
		Если ДополнительныеПараметры.ТипОбъекта = "Номенклатура"
			И ДополнительныеПараметры.Свойство("Номенклатура") Тогда
			ТекСтрока.Объект1с = ДополнительныеПараметры.Номенклатура;
			ТекСтрока.СоответствиеУстановлено = Истина;
		КонецЕсли;
		
	Иначе
	// ) 2022.01.20
	
		ОбъектСсылка = ДополнительныеПараметры.Форма.Объект.Ссылка;
		
		Если ТекСтрока <> Неопределено
			И ЗначениеЗаполнено(ОбъектСсылка) Тогда
			
			ТекСтрока.Объект1с = ОбъектСсылка;
			ТекСтрока.СоответствиеУстановлено = Истина;
				
			Если ТекСтрока.ТипОбъекта = "Контрагенты" Тогда
				Если РеквизитСуществует("Справочники","Контрагенты","Партнер") Тогда
					ТекСтрока.Контрагенты_Партнер = ПолучитьЗначениеРеквизитаОбъекта(ОбъектСсылка,"Партнер");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//Платформа не отпускает объект
		ДополнительныеПараметры.Форма = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагружаемыеОбъектыПередНачаломИзменения(Элемент, Отказ)
		
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	
	Если ТекСтрока.ТипОбъекта = "Документ" Тогда
		//Для аудитора: у создаваемого документа реквизиты редактируются в доп. описании в панели справа.
		//Но поскольку редактирование других типов создаваемых объектов разрешается в самом поле таблицы формы,
		//допустимость такого редактирования регулируется переменной Отказ. Выводить дополнительное уведомление пользователю
		//при каждом двойном клике в табличной части раздражает пользователя, так как это и так является для него очевидным.
		//Поэтому лишних уведомлений в этом условии выводить не предполагается.
		Отказ = Истина;
	
	//для Номенклатуры нужно позволить выбрать тип Товар/Услуга
	ИначеЕсли Элемент.ТекущийЭлемент = Элементы.ЗагружаемыеОбъектыДополнительноеОписаниеОбъекта Тогда
			
		Если ЗначениеЗаполнено(ТекСтрока.ДополнительноеОписание_СписокВыбора) Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ДополнительныеПараметры = Новый Структура("ИдентификаторСтроки,ИсходноеЗначение",ТекСтрока.ПолучитьИдентификатор(),ТекСтрока.ДополнительноеОписаниеОбъекта);
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборЗначенияИзСписка",ЭтаФорма,ДополнительныеПараметры);
			
			СписокВыбора = ЗначениеИзСтрокиВнутрСервер(ТекСтрока.ДополнительноеОписание_СписокВыбора);
			ПоказатьВыборИзМеню(ОписаниеОповещения,СписокВыбора);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьВыборЗначенияИзСписка(Результат,ДополнительныеПараметры) Экспорт
	ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	Если Результат = Неопределено Тогда
		ТекСтрока.ДополнительноеОписаниеОбъекта = ДополнительныеПараметры.ИсходноеЗначение;
		
	Иначе
		ТекСтрока.ДополнительноеОписаниеОбъекта = Результат.Значение;
		
		Если ТекСтрока.ТипОбъекта = "Номенклатура" Тогда
			Если Не ЗначениеЗаполнено(ТекСтрока.Объект1с) Тогда
				Номенклатура_ЗаполнитьЗначенияПоУмолчанию(ТекСтрока);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_ЗаполнитьЗначенияПоУмолчанию(ТекСтрока)
	
	Если ТекСтрока.ДополнительноеОписаниеОбъекта = "Услуга" Тогда
		ТекСтрока.Номенклатура_ВидНоменклатуры = СтруктураНастроек.Номенклатура_ВидНоменклатурыПоУмолчаниюУслуга;
		ТекСтрока.Номенклатура_Родитель = СтруктураНастроек.Номенклатура_ГруппаСоздаваемойНоменклатурыУслуги;
		ТекСтрока.Номенклатура_НоменклатурнаяГруппа = СтруктураНастроек.Номенклатура_НоменклатурнаяГруппаУслуга;
		ТекСтрока.Номенклатура_СчетУчета = СтруктураНастроек.ЗаполнениеТЧ_СчетУчетаПоУмолчаниюУслуга;
		ТекСтрока.Номенклатура_СчетУчетаНДС = СтруктураНастроек.ЗаполнениеТЧ_СчетУчетаНДСПоУмолчаниюУслуга
		
	ИначеЕсли ТекСтрока.ДополнительноеОписаниеОбъекта = "Товар" Тогда
		ТекСтрока.Номенклатура_ВидНоменклатуры = СтруктураНастроек.Номенклатура_ВидНоменклатурыПоУмолчаниюТовар;
		ТекСтрока.Номенклатура_Родитель = СтруктураНастроек.Номенклатура_ГруппаСоздаваемойНоменклатуры;
		ТекСтрока.Номенклатура_НоменклатурнаяГруппа = СтруктураНастроек.Номенклатура_НоменклатурнаяГруппаТовар;
		ТекСтрока.Номенклатура_СчетУчета = СтруктураНастроек.ЗаполнениеТЧ_СчетУчетаПоУмолчаниюТовар;
		ТекСтрока.Номенклатура_СчетУчетаНДС = СтруктураНастроек.ЗаполнениеТЧ_СчетУчетаНДСПоУмолчаниюТовар;
		
	Иначе
		//Расходы
		ТекСтрока.Номенклатура_ВидНоменклатуры = Неопределено;
		ТекСтрока.Номенклатура_Родитель = Неопределено;
		ТекСтрока.Номенклатура_СчетУчета = Неопределено;
		ТекСтрока.Номенклатура_СчетУчетаНДС = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Флажки_УстановитьФлаг_ВсемДокументам(Команда)
	УстановитьСнятьФлажкиВТаблице(Истина,Истина);
КонецПроцедуры
&НаКлиенте
Процедура Флажки_УстановитьФлаг_ПустымДокументам(Команда)
	УстановитьСнятьФлажкиВТаблице(Истина,Ложь);
КонецПроцедуры
&НаКлиенте
Процедура Флажки_СнятьФлаг_ВсемДокументам(Команда)
	УстановитьСнятьФлажкиВТаблице(Ложь,Истина);
КонецПроцедуры
&НаКлиенте
Процедура Флажки_СнятьФлаг_ЗаполненнымДокументам(Команда)
	УстановитьСнятьФлажкиВТаблице(Ложь,Ложь);
КонецПроцедуры
&НаКлиенте
Процедура УстановитьСнятьФлажкиВТаблице(Флаг, ВсемДокументам = Истина)
	Для Каждого Строка Из Объект.ЗагружаемыеОбъекты Цикл 
		
		//Обрабатывать только видимые строки
		Если Не Элементы.ЗагружаемыеОбъекты.ПроверитьСтроку(Строка.ПолучитьИдентификатор()) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВсемДокументам Тогда
			Строка.Пометка = Флаг;
		Иначе
			Если Флаг Тогда
				Строка.Пометка = Не ЗначениеЗаполнено(Строка.Объект1с);
			Иначе
				Строка.Пометка = Не ЗначениеЗаполнено(Строка.Объект1с) И Строка.Пометка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


// ================= Отправка изменений номенклатуры на портал ===================

&НаКлиенте
Функция ОбновлениеДанныхДокументов_ОтправкаНаПортал()
	
	//PUT https://app.entera.pro/api/v1/documents/{{documentId}}/accept
	//{
	// "items": [
	// { "id": "{{itemId}}", "serialNumber": 1, "name": "Новое название" }
	// ]
	//}
	
	//Запросы могут выполняться на клиенте, по каждому документу нужно выполнить отдельный запрос.
	//Получаем список различных идентификаторов документов в форме сопоставления, поочередно по каждому пуляем запрос
	
	СписокДокументов = ОбновлениеДанныхДокументов_ПолучитьСписокИдентификаторовДокументов();
	Счетчик = 0;
	Для Каждого ЭлементСписка Из СписокДокументов Цикл
		
		ДокументИД = ЭлементСписка.Значение;
		
		Счетчик = Счетчик + 1;
		Прогресс = Счетчик / СписокДокументов.Количество() * 100;
		Состояние("Обновление данных документа на портале...",Прогресс,ЭлементСписка.Представление);
		
		ТелоЗапроса = ОбновлениеДанныхДокументов_СформироватьТелоЗапроса(ДокументИД);
		
		//отправляем запрос, обновляем данные документа
		МетодAPI = "/api/v1/documents/" + ДокументИД + "/accept?format=xml";
		РезультатЗапроса = ВладелецФормы.ВыполнитьЗапрос("ОбновлениеДанныхДокументов","PUT",МетодAPI,ТелоЗапроса);
		
		Если РезультатЗапроса.Успешно Тогда
			//
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Строка(ЭлементСписка.Представление) + ": ошибка при обновлении данных портала" + Символы.ПС + РезультатЗапроса.ТекстОшибки;
			Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
			Сообщение.Сообщить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции
&НаСервере
Функция ОбновлениеДанныхДокументов_СформироватьТелоЗапроса(ДокументИД)
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	ТелоЗапроса = РеквизитОбъект.ОбновлениеДанныхДокументов_СформироватьТелоЗапроса_items(ДокументИД);
	
	Возврат ТелоЗапроса;
КонецФункции
&НаСервере
Функция ОбновлениеДанныхДокументов_ПолучитьСписокИдентификаторовДокументов()
	
	СписокДокументов = Новый СписокЗначений;
	
	//Нам нужны только строки номенклатуры
	НайденныеСтроки = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ТипОбъекта,Номенклатура_ПредставлениеИзменено","Номенклатура",Истина));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		ОбновлениеДанныхДокументов_ПеренестиИзмененияНоменклатурыВДанныеПортала(НайденныеСтроки);
		
		ТаблицаДокументов = Объект.ЗагружаемыеОбъекты.Выгрузить(НайденныеСтроки,"ДокументИД,ПредставлениеДокумента");
		ТаблицаДокументов.Свернуть("ДокументИД,ПредставлениеДокумента");
		
		Для Каждого СтрокаТаблицы Из ТаблицаДокументов Цикл
			СписокДокументов.Добавить(СтрокаТаблицы.ДокументИД,СтрокаТаблицы.ПредставлениеДокумента);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СписокДокументов;
	
КонецФункции
&НаСервере
Процедура ОбновлениеДанныхДокументов_ПеренестиИзмененияНоменклатурыВДанныеПортала(НайденныеСтроки)
	
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		ДанныеНоменклатурыПортала = ДанныеПортала.documentItems.Найти(СтрокаТаблицы.ИдентификаторОбъекта,"Id");
		ДанныеНоменклатурыПортала.name = СтрокаТаблицы.ПредставлениеОбъекта;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ДанныеПортала,АдресХранилищаДанныхПортала);
	
КонецПроцедуры


// ================= Создание элементов справочников по данным портала ===================

&НаКлиенте
Процедура СоздатьОбъекты(Команда)
	
	//E1C-158: проверка заполнения Организации документа: они не создаются и должны быть заполнены до создания документа
	ДокументыБезОрганизации = "";
	СтруктураПоиска = Новый Структура("ТипОбъекта","Организации");
	СтрокиОрганизации = Объект.ЗагружаемыеОбъекты.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого СтрокаТаблицы Из СтрокиОрганизации Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Объект1с) Тогда
			ДокументыБезОрганизации = ДокументыБезОрганизации + Символы.ПС + СтрокаТаблицы.ПредставлениеДокумента;
			//Запомним идентификатор первого документа без организации, чтобы вывести сообщение к этой строке
			СтрокаБезОрганизаций = ?(СтрокаБезОрганизаций = Неопределено,Объект.ЗагружаемыеОбъекты.Индекс(СтрокаТаблицы),СтрокаБезОрганизаций);
		КонецЕсли;
	КонецЦикла;
	
	//E1C-258: Отключение подтверждающего окна "склад" для документов, где находятся только услуги
	//и для документов, где используется вообще не требуется склад. Общая для обоих интерфейсов функция в модуле объекта
	РезультатПроверки = КонтрольЗаполнения_Склады_НаСервере();
	
	ТекстСообщения = "";
	Если ЗначениеЗаполнено(ДокументыБезОрганизации) Тогда
		ТекстСообщения = "Необходимо выбрать Организацию в следующих документах:" + ДокументыБезОрганизации + Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатПроверки.ДокументыБезСклада) Тогда
		ТекстСообщения = ТекстСообщения + "Не выбран Склад в следующих документах:" + РезультатПроверки.ДокументыБезСклада;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		
		ДопПараметры = Новый Структура;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		
		Если ЗначениеЗаполнено(ДокументыБезОрганизации) Тогда
			Сообщение.Поле = "Объект.ЗагружаемыеОбъекты[" + СтрокаБезОрганизаций + "].Объект1с";
			Сообщение.Сообщить();
			Возврат;
		ИначеЕсли ЗначениеЗаполнено(РезультатПроверки.ДокументыБезСклада) Тогда
			Сообщение.Поле = "Объект.ЗагружаемыеОбъекты[" + РезультатПроверки.СтрокаБезСклада + "].ПредставлениеОбъекта";
			Сообщение.Сообщить();
			
			//Задаем вопрос, продолжать без склада, или нет
			ТекстВопроса = "В данных следующих документов не заполнен склад, продолжить?" + Символы.ПС + РезультатПроверки.ДокументыБезСклада;
			Кнопки = РежимДиалогаВопрос.ДаНет;
			ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","ПродолжитьСозданиеОбъектов_НеЗаполненСклад",ДопПараметры,ТекстВопроса,Кнопки);
			
			_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
		КонецЕсли;
	Иначе
		ПродолжитьСозданиеОбъектов_НеЗаполненСклад(КодВозвратаДиалога.Да,ДопПараметры);
	КонецЕсли;			
		
КонецПроцедуры
&НаКлиенте
Процедура ПродолжитьСозданиеОбъектов_НеЗаполненСклад(Результат,ДопПараметры)
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		//E1C-69: проверка на наличие ИНН контрагента для строк с незаполненной ссылкой Контрагента
		ДокументыБезИНН = "";
		СтрокиКонтрагентов = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ТипОбъекта","Контрагенты"));
		
		Для Каждого СтрокаКонтрагента Из СтрокиКонтрагентов Цикл
			Если Не ЗначениеЗаполнено(СтрокаКонтрагента.Контрагенты_ИНН)
				И Не ЗначениеЗаполнено(СтрокаКонтрагента.Объект1с) Тогда
				ДокументыБезИНН = ДокументыБезИНН + Символы.ПС + СтрокаКонтрагента.ПредставлениеДокумента;
			КонецЕсли;
		КонецЦикла;
		
		ДопПараметры = Новый Структура;
		
		Если ДокументыБезИНН = "" Тогда
			ПродолжитьСозданиеОбъектов_КонтрольИНН_Контрагентов(КодВозвратаДиалога.Да,ДопПараметры);
			
		Иначе
			ТекстВопроса = "В данных следующих документов отсутствует ИНН контрагентов, создать новых контрагентов без ИНН?" + ДокументыБезИНН;
			Кнопки = РежимДиалогаВопрос.ДаНетОтмена;
			ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","ПродолжитьСозданиеОбъектов_КонтрольИНН_Контрагентов",ДопПараметры,ТекстВопроса,Кнопки);
			
			_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПродолжитьСозданиеОбъектов_КонтрольИНН_Контрагентов(Результат,ДопПараметры)
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	Иначе
		СоздаватьКонтрагентовБезИНН = Результат = КодВозвратаДиалога.Да;
	КонецЕсли;
	
	ПараметрыСозданияОбъектов = Новый Структура;
	ПараметрыСозданияОбъектов.Вставить("СоздаватьКонтрагентовБезИНН",СоздаватьКонтрагентовБезИНН);
	
	РезультатСозданияДокументов = СоздатьОбъектыНаСервере(ПараметрыСозданияОбъектов);
	
	Если РезультатСозданияДокументов.Успешно Тогда
		
		//Переходим к заполнению документов
		РезультатСозданияДокументов.Вставить("ДопПараметры",ДополнительныеПараметрыФормы);
		
		//Обновим данные объекта формы-владельца (в частности, протокол работы)
		КопироватьДанныеФормы(ЭтаФорма.Объект,ВладелецФормы.Объект);
		
		ЭтаФорма.Закрыть(РезультатСозданияДокументов);
		// ) 2021.06.08
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = РезультатСозданияДокументов.ТекстОшибки;
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Функция СоздатьОбъектыНаСервере(ПараметрыСозданияОбъектов)
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	
	Результат = Новый Структура("Успешно,ТекстОшибки",Истина);
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	// ( модуль кастомизации
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("АдресХранилищаДанныхПортала",АдресХранилищаДанныхПортала);
	ПараметрыМК.Вставить("ДанныеПортала",ДанныеПортала);
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыМК.Вставить("ЗагружаемыеОбъекты",Объект.ЗагружаемыеОбъекты);
	ПараметрыМК.Вставить("Отказ",Ложь);
	ПараметрыМК.Вставить("ПричинаОтказа","");
	ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
	
	РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Сопоставление_ПередСозданиемОбъектов",ПараметрыМК);
	
	Если ПараметрыМК.Отказ = Истина Тогда
		Результат.Успешно = Ложь;
		Результат.ТекстОшибки = ПараметрыМК.ПричинаОтказа;
		Возврат Результат;
	КонецЕсли;
	
	Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
	
		ОбщийТекстОшибки = "";
		
		Для Каждого СтрокаОбъекта Из Объект.ЗагружаемыеОбъекты Цикл
			
			ТекстОшибки = "";
			
			ИдентификаторСтроки = СтрокаОбъекта.ПолучитьИдентификатор();
			
			ДанныеДокументаПортала = ДанныеПортала.documents.Найти(СтрокаОбъекта.ДокументИД,"id");
			ДанныеНоменклатурыПортала = ДанныеПортала.documentItems.Найти(СтрокаОбъекта.ИдентификаторОбъекта,"Id");
			
			//2019.06.25 ( Теперь пользователь может переопределить направление для каждого документа пакета
			СтрокиДокумента = Объект.СписокДокументов.НайтиСтроки(Новый Структура("ДокументИД",СтрокаОбъекта.ДокументИД));
			Если СтрокиДокумента.Количество() > 0 Тогда
				НаправлениеСоздаваемогоДокумента = СтрокиДокумента[0].НаправлениеСоздаваемогоДокумента;
			Иначе
				СообщитьСообщение("Внутренняя ошибка модуля: не удалось найти строку документа по идентификатору для определения направления документа");
			КонецЕсли;
			
			//+++ Переделать получение структуры заполнения объекта на функцию ПолучитьСтруктуруЗаполненияНовогоОбъекта()
			
			ОбъектСоздан = Ложь;
			Если СтрокаОбъекта.ТипОбъекта = "Документ" Тогда
				ДанныеДокументаПортала.number = СтрокаОбъекта.Документ_Номер;
				ДанныеДокументаПортала.date = СтрокаОбъекта.Документ_Дата;
				ДанныеДокументаПортала.ДатаДокумента = СтрокаОбъекта.Документ_ДатаСоздаваемогоДокумента;
				ДанныеДокументаПортала.СкладСсылка = СтрокаОбъекта.Документ_Склад;
				ДанныеДокументаПортала.ПодразделениеСсылка = СтрокаОбъекта.Документ_Подразделение;
				ДанныеДокументаПортала.ПодразделениеОрганизацииСсылка = СтрокаОбъекта.Документ_ПодразделениеОрганизации;
				ДанныеДокументаПортала.ИФОСсылка = СтрокаОбъекта.Документ_ИФО;
				ДанныеДокументаПортала.ПодотчетноеЛицоСсылка = СтрокаОбъекта.Документ_ПодотчетноеЛицо;
				ДанныеДокументаПортала.НоменклатурнаяГруппаСсылка = СтрокаОбъекта.Документ_НоменклатурнаяГруппа;
				ДанныеДокументаПортала.НаправлениеДеятельностиСсылка = СтрокаОбъекта.Документ_НаправлениеДеятельности;
				ДанныеДокументаПортала.ОбъектРасчетовСсылка = СтрокаОбъекта.Документ_ОбъектРасчетов;
				ДанныеДокументаПортала.ВидОперацииСсылка = СтрокаОбъекта.Документ_ВидОперации;
				ДанныеДокументаПортала.ИмяТабличнойЧасти = СтрокаОбъекта.Документ_ИмяТабличнойЧасти;
				ДанныеДокументаПортала.НазначениеАванса = СтрокаОбъекта.Документ_НазначениеАванса;
				ДанныеДокументаПортала.НазначениеПлатежа = СтрокаОбъекта.Документ_НазначениеПлатежа;
				ДанныеДокументаПортала.ОригиналПолучен = СтрокаОбъекта.Документ_ОригиналПолучен;
				ДанныеДокументаПортала.ДокументОснованиеСсылка = СтрокаОбъекта.Документ_ДокументОснование;
				ДанныеДокументаПортала.ДокументыПоступленияДляДопРасходов = СтрокаОбъекта.Документ_ДокументыПоступленияДляДопРасходов;
				ДанныеДокументаПортала.СодержаниеУслугиДляДопРасходов = СтрокаОбъекта.Документ_СодержаниеУслугиДляДопРасходов;
				ДанныеДокументаПортала.ВедетсяУчетПредметовАренды = СтрокаОбъекта.Документ_ВедетсяУчетПредметовАренды;
			
			ИначеЕсли СтрокаОбъекта.ТипОбъекта = "Организации" Тогда
				
				//Организации не создаем, только позволяем выбирать
			    Если НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
					ДанныеДокументаПортала.ПлательщикСсылка = СтрокаОбъекта.Объект1с;
				Иначе
					ДанныеДокументаПортала.ПоставщикСсылка = СтрокаОбъекта.Объект1с;
				КонецЕсли;
				
			ИначеЕсли СтрокаОбъекта.ТипОбъекта = "Контрагенты" Тогда
				Если Не ЗначениеЗаполнено(СтрокаОбъекта.Объект1с) Тогда
					
					СтруктураЗаполнения = Новый Структура("Наименование,НаименованиеПолное,ИНН,КПП",СтрокаОбъекта.Контрагенты_Наименование,СтрокаОбъекта.Контрагенты_НаименованиеПолное,СтрокаОбъекта.Контрагенты_ИНН,СтрокаОбъекта.Контрагенты_КПП);
					СтруктураЗаполнения.Вставить("СсылкаНовогоОбъекта",СтрокаОбъекта.СсылкаНовогоОбъекта);
					СтруктураЗаполнения.Вставить("ДокументИД",СтрокаОбъекта.ДокументИД);
					СтруктураЗаполнения.Вставить("ДокументТип",СтрокаОбъекта.ДокументТип);
					
					Наименование = ?(ЗначениеЗаполнено(СтруктураЗаполнения.Наименование),СтруктураЗаполнения.Наименование,СтруктураЗаполнения.НаименованиеПолное);
					Если ЗначениеЗаполнено(Наименование) Тогда //совсем без наименования, наверное, не стоит создавать?
						
						Если СтрокаОбъекта.Пометка = Истина Тогда
							//2020.05.12 (
							Если Не ЗначениеЗаполнено(СтруктураЗаполнения.ИНН) И ПараметрыСозданияОбъектов.СоздаватьКонтрагентовБезИНН = Ложь Тогда
								//пропускаем
							Иначе
							// ) 2020.05.12
								СтрокаОбъекта.Объект1с = СоздатьЭлементСправочника_Контрагент(СтруктураЗаполнения,ТекстОшибки);
								ОбъектСоздан = ЗначениеЗаполнено(СтрокаОбъекта.Объект1с);
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
				
				Если НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
					ДанныеДокументаПортала.ПоставщикСсылка = СтрокаОбъекта.Объект1с;
					ОрганизацияСсылка = ДанныеДокументаПортала.ПлательщикСсылка;
				Иначе
					ДанныеДокументаПортала.ПлательщикСсылка = СтрокаОбъекта.Объект1с;
					ОрганизацияСсылка = ДанныеДокументаПортала.ПоставщикСсылка;
				КонецЕсли;
				
				Если РеквизитСуществует("Справочники","Контрагенты","Партнер") Тогда
					Если ЗначениеЗаполнено(СтрокаОбъекта.Объект1с) Тогда
						ДанныеДокументаПортала.ПартнерСсылка = СтрокаОбъекта.Объект1с.Партнер;
					КонецЕсли;
					Если Не ЗначениеЗаполнено(СтрокаОбъекта.Контрагенты_Партнер) Тогда
						СтрокаОбъекта.Контрагенты_Партнер = ДанныеДокументаПортала.ПартнерСсылка;
					КонецЕсли;
				КонецЕсли;
				
				ДанныеДокументаПортала.СоглашениеСсылка = СтрокаОбъекта.Контрагенты_Соглашение;
				
				//Договор может быть выбран в форме пользователем, его еще нет в данных документа портала
				СтрокаДоговора = Неопределено;
				СтрокиДоговора = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ТипОбъекта,ДокументИД","Договоры",СтрокаОбъекта.ДокументИД));
				Если СтрокиДоговора.Количество() > 0 Тогда
					СтрокаДоговора = СтрокиДоговора[0];
				КонецЕсли; 
				
				//2018.12.13 (			
				Если СтруктураНастроек.ЗаполнениеШапки_СоздаватьДоговор = Истина
					И ЗначениеЗаполнено(СтрокаОбъекта.Объект1с) И ЗначениеЗаполнено(ОрганизацияСсылка)
					И (ЗначениеЗаполнено(СтруктураНастроек.ЗаполнениеШапки_НаименованиеНовогоДоговора)
						Или СтрокаДоговора <> Неопределено И ЗначениеЗаполнено(СтрокаДоговора.ПредставлениеОбъекта)) Тогда
					
					Если СтрокаДоговора <> Неопределено Тогда
						//2025.05.15 ( Ниже сохранен исходный вариант
						Если Истина Тогда
							ДанныеДокументаПортала.ДоговорСсылка = СтрокаДоговора.Объект1с;
						Иначе
						// ) 2025.05.15
							Если ЗначениеЗаполнено(СтрокиДоговора[0].Объект1с) Тогда
								ДанныеДокументаПортала.ДоговорСсылка = СтрокаДоговора.Объект1с;
							КонецЕсли;
						КонецЕсли;
						НаименованиеДоговора = СтрокаДоговора.ПредставлениеОбъекта;
					Иначе
						НаименованиеДоговора = Неопределено;
					КонецЕсли;
					
					//Проверим найденный договор, если он с другой организацией - он нам не подходит
					Если ЗначениеЗаполнено(ДанныеДокументаПортала.ДоговорСсылка)
						И ДанныеДокументаПортала.ДоговорСсылка.Организация <> ОрганизацияСсылка Тогда
						ДанныеДокументаПортала.ДоговорСсылка = Неопределено;
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(ДанныеДокументаПортала.ДоговорСсылка) Тогда
						//2025.07.21 ( Задача 305690: убираем логику поиска существующего договора: если строка "красная" - создаем договор
						Если Ложь Тогда
							//Сперва поискать договор между этой организацией и контрагентом перед созданием
							ДанныеДокументаПортала.ДоговорСсылка = РеквизитОбъект.ПолучитьСсылку_Договор(ДанныеДокументаПортала,НаправлениеСоздаваемогоДокумента,СтруктураНастроек);
						КонецЕсли;
						
						//Если не нашли - создаем новый
						Если Не ЗначениеЗаполнено(ДанныеДокументаПортала.ДоговорСсылка)
							//2020.07.30 ( У документа может отсутствовать этот реквизит, не создаем договор
							И Не ДанныеДокументаПортала.ДоговорНеТребуется = Истина Тогда
							// ) 2020.07.30				
							
							НаименованиеДоговора = ?(ЗначениеЗаполнено(НаименованиеДоговора),НаименованиеДоговора,СтруктураНастроек.ЗаполнениеШапки_НаименованиеНовогоДоговора);
							СтруктураЗаполнения = Новый Структура("Наименование,Контрагент,Организация",НаименованиеДоговора,СтрокаОбъекта.Объект1с,ОрганизацияСсылка);
							
							Если Конф = "УТ11" Или Конф = "КА2" Или Конф = "ERP" Тогда
								СтруктураЗаполнения.Вставить("Партнер",СтрокаОбъекта.Объект1с.Партнер);
							КонецЕсли;
							
							//Добавляем для заполнения реквизиты Договоров
							Если СтрокаДоговора <> Неопределено Тогда
								СтруктураЗаполнения.Вставить("Наименование",СтрокаДоговора.ПредставлениеОбъекта);
								СтруктураЗаполнения.Вставить("Номер",СтрокаДоговора.Договоры_Номер);								
								СтруктураЗаполнения.Вставить("Дата",СтрокаДоговора.Договоры_Дата);
								
								СтруктураЗаполнения.Вставить("НомерДоговора",СтрокаДоговора.Договоры_Номер);								
								СтруктураЗаполнения.Вставить("ДатаДоговора",СтрокаДоговора.Договоры_Дата);
								
								СтруктураЗаполнения.Вставить("Подразделение",СтрокаДоговора.Договоры_Подразделение);
								СтруктураЗаполнения.Вставить("НаправлениеДеятельности",СтрокаДоговора.Договоры_НаправлениеДеятельности);
								СтруктураЗаполнения.Вставить("СтатьяДвиженияДенежныхСредств",СтрокаДоговора.Договоры_СтатьяДДС);
							КонецЕсли;
														
							ПараметрыЗаполнения = Новый Структура;
							ПараметрыЗаполнения.Вставить("ТипСоздаваемогоДокумента",СтрокаОбъекта.ТипСоздаваемогоДокумента);
							ПараметрыЗаполнения.Вставить("ДокументИД",СтрокаОбъекта.ДокументИД);
							
							ДанныеДокументаПортала.ДоговорСсылка = СоздатьЭлементСправочника_Договор(СтруктураЗаполнения,ПараметрыЗаполнения,ТекстОшибки);
							
							Если ЗначениеЗаполнено(ДанныеДокументаПортала.ДоговорСсылка) Тогда
								
								//Установим этот договор строкам с совпадающими поставщиками/плательщиками
								Для Каждого СтрокаДанных Из ДанныеПортала.documents Цикл
									
									Если НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
										
										Если СтрокаДанных.supplierId = СтрокаОбъекта.ИдентификаторОбъекта //Поставщики совпадают
											И СтрокаДанных.ПлательщикСсылка = ДанныеДокументаПортала.ПлательщикСсылка Тогда //Плательщики совпадают
											СтрокаДанных.ДоговорСсылка = ДанныеДокументаПортала.ДоговорСсылка;
										КонецЕсли;
										
									Иначе
										
										Если СтрокаДанных.customerId = СтрокаОбъекта.ИдентификаторОбъекта //Плательщики совпадают
											И СтрокаДанных.ПоставщикСсылка = ДанныеДокументаПортала.ПоставщикСсылка Тогда //Плательщики совпадают
											СтрокаДанных.ДоговорСсылка = ДанныеДокументаПортала.ДоговорСсылка;
										КонецЕсли;
										
									КонецЕсли;
									
								КонецЦикла;
								
								//Созданный обработкой договор сделаем основным, чтобы в дальнейшем при наличии других договоров можно было использовать его
								МодульРаботыВБезопасномРежиме = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("РаботаВБезопасномРежиме");
								
								Если МодульРаботыВБезопасномРежиме <> Неопределено Тогда
									
									Если Конф = "БП30" Тогда
										
										Если Метаданные.ОбщиеМодули.Найти("РаботаСДоговорамиКонтрагентовБП") <> Неопределено Тогда
											
											ПараметрыВыполнения = Новый Структура;
											ПараметрыВыполнения.Вставить("ДоговорСсылка",ДанныеДокументаПортала.ДоговорСсылка);
											
											Попытка
												МодульРаботыВБезопасномРежиме.ВыполнитьВБезопасномРежиме("РаботаСДоговорамиКонтрагентовБП.УстановитьОсновнойДоговорКонтрагента(Параметры.ДоговорСсылка)",ПараметрыВыполнения);
											Исключение
												
											КонецПопытки;
											
										КонецЕсли;
										
									КонецЕсли;
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;	
				// ) 2018.12.13
				
			ИначеЕсли СтрокаОбъекта.ТипОбъекта = "Договоры" И ЗначениеЗаполнено(СтрокаОбъекта.Объект1с) Тогда
				ДанныеДокументаПортала.ДоговорСсылка = СтрокаОбъекта.Объект1с;
				
			ИначеЕсли СтрокаОбъекта.ТипОбъекта = "БанковскиеСчета" Тогда
				Если Не ЗначениеЗаполнено(СтрокаОбъекта.Объект1с) Тогда
					
					СтруктураЗаполнения = Новый Структура("БИК,НаименованиеБанка,НомерСчета",СтрокаОбъекта.БанковскиеСчета_БИК,СтрокаОбъекта.БанковскиеСчета_НаименованиеБанка,СтрокаОбъекта.БанковскиеСчета_НомерСчета);
					СтруктураЗаполнения.Вставить("ДокументИД",СтрокаОбъекта.ДокументИД);
					
					Если ЗначениеЗаполнено(ДанныеДокументаПортала.ПоставщикСсылка) Тогда
						ВладелецБанковскогоСчета = ДанныеДокументаПортала.ПоставщикСсылка;
						
					Иначе
						ВладелецБанковскогоСчета = Справочники.Контрагенты.ПолучитьСсылку();
						СтрокаОбъекта.СсылкаНовогоОбъекта = ВладелецБанковскогоСчета;
					КонецЕсли;
					
					СтруктураЗаполнения.Вставить("Владелец",ВладелецБанковскогоСчета);
					
					СтрокаОбъекта.Объект1с = СоздатьЭлементСправочника_БанковскийСчет(СтруктураЗаполнения,ТекстОшибки);
					
				КонецЕсли;
				ДанныеДокументаПортала.БанковскийСчетКонтрагентаСсылка = СтрокаОбъекта.Объект1с;
				
			ИначеЕсли СтрокаОбъекта.ТипОбъекта = "ОсновныеСредства" Тогда
				Если Не ЗначениеЗаполнено(СтрокаОбъекта.Объект1с) Тогда
					
					СтруктураЗаполнения = Новый Структура("ИдентификаторСтроки,Наименование",ИдентификаторСтроки,СтрокаОбъекта.ПредставлениеОбъекта);
					СтрокаОбъекта.Объект1с = СоздатьЭлементСправочника_ОсновноеСредство(СтруктураЗаполнения,ТекстОшибки);
					
				КонецЕсли;
				ДанныеНоменклатурыПортала.ОсновноеСредствоСсылка = СтрокаОбъекта.Объект1с;	
				ДанныеНоменклатурыПортала.ИнвентарныйНомер = СтрокаОбъекта.ОсновныеСредства_ИнвентарныйНомер;
				ДанныеНоменклатурыПортала.СрокСлужбы = СтрокаОбъекта.ОсновныеСредства_СрокСлужбы;
				
			ИначеЕсли СтрокаОбъекта.ТипОбъекта = "Номенклатура" Тогда
							
				Если СтрокаОбъекта.ДополнительноеОписаниеОбъекта = "Расходы" Тогда
					//Для этой строки не создаем номенклатуру, так как сумма этой строки будет перенесена в документ поступления доп. расходов
					ПеренестиНаДопРасходы = Истина;
					
				Иначе
					ПеренестиНаДопРасходы = Ложь;
				
					//2022.07.18 ( Создаем номенклатуру поставщика, даже если пользователь выбрал для Номенклатуры сопоставление вручную
					Если СтрокаОбъекта.Номенклатура_ТребуетсяСозданиеНоменклатуры Тогда
					// ) 2022.07.18
						
						//Если используется работа со справочником НоменклатураПоставщиков, номенклатура может быть получена оттуда
						Если ПоискПоНоменклатуреПоставщиков Тогда
							Если ЗначениеЗаполнено(СтрокаОбъекта.Номенклатура_НоменклатураПоставщика) Тогда
								Если Не ЗначениеЗаполнено(СтрокаОбъекта.Объект1с) Тогда
									СтрокаОбъекта.Объект1с = СтрокаОбъекта.Номенклатура_НоменклатураПоставщика.Номенклатура;
								КонецЕсли;
							Иначе
								Если ЗначениеЗаполнено(СтрокаОбъекта.Объект1с) Тогда
									НоваяНоменклатураСсылка = СтрокаОбъекта.Объект1с;
									
								ИначеЕсли ЗначениеЗаполнено(СтруктураНастроек.Номенклатура_СсылкаДляНовойНоменклатурыПоставщика) Тогда
									НоваяНоменклатураСсылка = СтруктураНастроек.Номенклатура_СсылкаДляНовойНоменклатурыПоставщика;
									СтрокаОбъекта.Объект1с = НоваяНоменклатураСсылка;
									
								Иначе
									НоваяНоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку();									
									СтрокаОбъекта.СсылкаНовогоОбъекта = НоваяНоменклатураСсылка;
								КонецЕсли;
								
								//Создаем элемент справочника НоменклатураПоставщиков, в качестве ссылки на номенклатуру указываем сформированную ссылку нового
								СтруктураЗаполнения = Новый Структура("ИдентификаторСтроки,Наименование,Упаковка,Номенклатура",ИдентификаторСтроки,СтрокаОбъекта.ПредставлениеОбъекта,СтрокаОбъекта.Номенклатура_ЕдиницаИзмерения,НоваяНоменклатураСсылка);
								
								//В справочнике НоменклатураКонтрагентов расширен набор реквизитов элемента
								СтруктураЗаполнения.Вставить("НаименованиеУпаковки",ДанныеНоменклатурыПортала.unitName);
								СтруктураЗаполнения.Вставить("КодОКЕИБазовойЕдиницыИзмерения",ДанныеНоменклатурыПортала.unitCode);
								СтруктураЗаполнения.Вставить("НаименованиеБазовойЕдиницыИзмерения",ДанныеНоменклатурыПортала.unitName);
								СтруктураЗаполнения.Вставить("КоличествоУпаковок",1);
								СтруктураЗаполнения.Вставить("КоличествоБазовойЕдиницыИзмерения",1);
								СтруктураЗаполнения.Вставить("СтавкаНДС",ДанныеНоменклатурыПортала.СтавкаНДССсылка);
								СтруктураЗаполнения.Вставить("НаименованиеНоменклатуры",СтрокаОбъекта.ПредставлениеОбъекта);
								СтруктураЗаполнения.Вставить("НаименованиеПолное",СтрокаОбъекта.ПредставлениеОбъекта);
								
								СтруктураЗаполнения.Вставить("Характеристика",СтрокаОбъекта.Номенклатура_Характеристика);
								СтруктураЗаполнения.Вставить("НаименованиеХарактеристики",Строка(СтрокаОбъекта.Номенклатура_Характеристика));
								
								СтрокаОбъекта.Номенклатура_НоменклатураПоставщика = СоздатьЭлементСправочника_НоменклатураПоставщика(СтруктураЗаполнения,ТекстОшибки);
								
								Если ЗначениеЗаполнено(СтрокаОбъекта.Номенклатура_НоменклатураПоставщика)
									И Не РеквизитОбъект.ОбъектНеНайден(СтрокаОбъекта.Номенклатура_НоменклатураПоставщика.Номенклатура) Тогда
									//Ссылка на номенклатуру могла быть установлена в модуле кастомизации при заполнении Номенклатуры поставщика
									СтрокаОбъекта.Объект1с = СтрокаОбъекта.Номенклатура_НоменклатураПоставщика.Номенклатура;
									СтрокаОбъекта.СсылкаНовогоОбъекта = СтрокаОбъекта.Объект1с;
								КонецЕсли;
									
							КонецЕсли;
						КонецЕсли;
						
						Если Не ЗначениеЗаполнено(СтрокаОбъекта.Объект1с) Тогда
							//2019.05.15 ( EN-229: По настройке выполним поиск номенклатуры по заданному алгоритму
							ДанныеНоменклатурыПортала.name = СтрокаОбъекта.ПредставлениеОбъекта;
							//+++ код-артикул тоже перенести в ДанныеНоменклатурыПортала.nomenclatureCode?
							
							//2020.03.04 ( E1C-23: Не создавать новую номенклатуру если есть точное совпадение по наименованию,
							//При поиске по Номенклатуре контрагентов настройка должна игнорироваться?
							Если Не ПоискПоНоменклатуреПоставщиков И СтруктураНастроек.Номенклатура_НеСоздаватьЕслиЕстьПолноеСовпадениеПоНаименованию = Истина Тогда
								СтрокаОбъекта.Объект1с = РеквизитОбъект.ПолучитьСсылку_НоменклатураПоЗаданномуАлгоритмуПоиска(ДанныеНоменклатурыПортала,ДанныеДокументаПортала,СтруктураНастроек);
							КонецЕсли;
							// ) 2020.03.04
							
							Если Не ЗначениеЗаполнено(СтрокаОбъекта.Объект1с)
								Или РеквизитОбъект.ОбъектНеНайден(СтрокаОбъекта.Объект1с) Тогда
							// ) 2019.05.15
								
								Если Не ЗначениеЗаполнено(СтрокаОбъекта.Номенклатура_ЕдиницаИзмерения) Тогда
									
									//Пробуем найти созданную ранее
									СтрокаОбъекта.Номенклатура_ЕдиницаИзмерения = РеквизитОбъект.ПолучитьСсылку_УпаковкаЕдиницаИзмерения(ДанныеНоменклатурыПортала,СтруктураНастроек);
									
									Если Не ЗначениеЗаполнено(СтрокаОбъекта.Номенклатура_ЕдиницаИзмерения) Тогда
										
										КодЕИДляПоиска = ?(ЗначениеЗаполнено(ДанныеНоменклатурыПортала.unitCode),ДанныеНоменклатурыПортала.unitCode,ДанныеНоменклатурыПортала.recognizedUnitCode);
										СтруктураЕдиницыИзмерения = Новый Структура("Код,Наименование",КодЕИДляПоиска,ДанныеНоменклатурыПортала.userUnitName);
										
										СтрокаОбъекта.Номенклатура_ЕдиницаИзмерения = СоздатьЭлементСправочника_ЕдиницаИзмерения(СтруктураЕдиницыИзмерения,ТекстОшибки);
										
									КонецЕсли;
								КонецЕсли;
								
								СтрокиГТД = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ТипОбъекта,ИдентификаторОбъекта","НомераГТД",СтрокаОбъекта.ИдентификаторОбъекта));
								ВестиУчетПоГТД = СтрокиГТД.Количество() > 0 И ЗначениеЗаполнено(ДанныеНоменклатурыПортала.recognizedCustomsDeclaration);
												
								СтруктураЗаполнения = Новый Структура("ИдентификаторСтроки,Наименование,СтавкаНДС,ВестиУчетПоГТД,СсылкаНовогоОбъекта",ИдентификаторСтроки,СтрокаОбъекта.ПредставлениеОбъекта,ДанныеНоменклатурыПортала.СтавкаНДССсылка,ВестиУчетПоГТД,СтрокаОбъекта.СсылкаНовогоОбъекта);
								СтруктураЗаполнения.Вставить("ДокументИД",СтрокаОбъекта.ДокументИД);
								СтруктураЗаполнения.Вставить("ДанныеНоменклатурыПортала",ДанныеНоменклатурыПортала);
								
								Если СтрокаОбъекта.Пометка = Истина Тогда
									СтрокаОбъекта.Объект1с = СоздатьЭлементСправочника_Номенклатура(СтруктураЗаполнения,СтрокаОбъекта.ДополнительноеОписаниеОбъекта,ТекстОшибки);
									ОбъектСоздан = ЗначениеЗаполнено(СтрокаОбъекта.Объект1с);
								КонецЕсли;
								
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;			
				ДанныеНоменклатурыПортала.НоменклатураСсылка = СтрокаОбъекта.Объект1с;
				ДанныеНоменклатурыПортала.name = СтрокаОбъекта.Номенклатура_НаименованиеПолное;
				ДанныеНоменклатурыПортала.ЕдиницаИзмеренияСсылка = СтрокаОбъекта.Номенклатура_ЕдиницаИзмерения;
				
				ДанныеНоменклатурыПортала.СчетУчетаСсылка = СтрокаОбъекта.Номенклатура_СчетУчета;
				ДанныеНоменклатурыПортала.СчетУчетаНДССсылка = СтрокаОбъекта.Номенклатура_СчетУчетаНДС;
				ДанныеНоменклатурыПортала.СтатьяЗатратСсылка = СтрокаОбъекта.Номенклатура_СтатьяЗатрат;
				ДанныеНоменклатурыПортала.НоменклатурнаяГруппаСсылка = СтрокаОбъекта.Номенклатура_НоменклатурнаяГруппа;
				ДанныеНоменклатурыПортала.ПодразделениеЗатратСсылка = СтрокаОбъекта.Номенклатура_ПодразделениеЗатрат;
				ДанныеНоменклатурыПортала.ОбъектСсылка = СтрокаОбъекта.Номенклатура_Объект;
				ДанныеНоменклатурыПортала.СпособУчетаНДС = СтрокаОбъекта.Номенклатура_СпособУчетаНДС;			
				ДанныеНоменклатурыПортала.СтатьяРасходовСсылка = СтрокаОбъекта.Номенклатура_СтатьяРасходов;
				ДанныеНоменклатурыПортала.АналитикаРасходовСсылка = СтрокаОбъекта.Номенклатура_АналитикаРасходов;
				ДанныеНоменклатурыПортала.СтатьяДоходовСсылка = СтрокаОбъекта.Номенклатура_СтатьяДоходов;				
				
				ДанныеНоменклатурыПортала.КПССсылка = СтрокаОбъекта.Номенклатура_КПС;
				ДанныеНоменклатурыПортала.КФОСсылка = СтрокаОбъекта.Номенклатура_КФО;
				ДанныеНоменклатурыПортала.КЭКСсылка = СтрокаОбъекта.Номенклатура_КЭК;
				
				ДанныеНоменклатурыПортала.ХарактеристикаСсылка = СтрокаОбъекта.Номенклатура_Характеристика;
				ДанныеНоменклатурыПортала.НоменклатураПоставщикаСсылка = СтрокаОбъекта.Номенклатура_НоменклатураПоставщика;
				
				ДанныеНоменклатурыПортала.КоэффициентПересчета = СтрокаОбъекта.Номенклатура_КоэффициентПересчета;
				ДанныеНоменклатурыПортала.ПеренестиНаДопРасходы = ПеренестиНаДопРасходы;
				ДанныеНоменклатурыПортала.Направление = НаправлениеСоздаваемогоДокумента;
				
				//+++ Пока убрал: для переноса в субконто при заполнении документа
				Если Ложь Тогда
					ДанныеНоменклатурыПортала.СкладСсылка = ДанныеДокументаПортала.СкладСсылка;
				КонецЕсли;
				
				ДанныеНоменклатурыПортала.НДСВидПоступленияСсылка = СтрокаОбъекта.Номенклатура_НДСВидПоступления;
				
				//E1C-257: Агентские услуги
				ДанныеНоменклатурыПортала.ЭтоАгентскаяУслуга = СтрокаОбъекта.ДополнительноеОписаниеОбъекта = "АгентскиеУслуги";
				ДанныеНоменклатурыПортала.КомитентСсылка = СтрокаОбъекта.Номенклатура_Комитент;
				ДанныеНоменклатурыПортала.ДоговорКомитентаСсылка = СтрокаОбъекта.Номенклатура_ДоговорКомитента;
				
			ИначеЕсли СтрокаОбъекта.ТипОбъекта = "НомераГТД" Тогда
				Если Не ЗначениеЗаполнено(СтрокаОбъекта.Объект1с) Тогда
					
					//2019.11.19 ( В УТ11 СтранаПроисхождения в реквизите справочника НомерГТД, обязательна к заполнению
					НомерГТД_СтранаМира = Неопределено;
					НайденныеСтроки = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ТипОбъекта,ИдентификаторОбъекта","СтраныМира",СтрокаОбъекта.ИдентификаторОбъекта));
					Если НайденныеСтроки.Количество() > 0 Тогда
						НайденнаяСтрока = НайденныеСтроки[0];
						Если ЗначениеЗаполнено(НайденнаяСтрока.Объект1с) Тогда
							НомерГТД_СтранаМира = НайденнаяСтрока.Объект1с;
						Иначе
							СтруктураЗаполнения = Новый Структура("Код,Наименование",ДанныеНоменклатурыПортала.recognizedCountryCode,ДанныеНоменклатурыПортала.recognizedCountryShortName);
							СтруктураЗаполнения.Вставить("ДокументИД",СтрокаОбъекта.ДокументИД);
							
							НомерГТД_СтранаМира = СоздатьЭлементСправочника_СтранаМира(СтруктураЗаполнения,ТекстОшибки);
							НайденнаяСтрока.Объект1с = НомерГТД_СтранаМира;
							
							НайденнаяСтрока.СоответствиеУстановлено = Истина;
							ЗаполнитьВсеСоответствующиеЗначения(НайденнаяСтрока.ПолучитьИдентификатор());
						КонецЕсли;
					КонецЕсли;
					// ) 2019.11.19
					
					СтруктураЗаполнения = Новый Структура("Код",СтрокаОбъекта.ПредставлениеОбъекта);
					СтруктураЗаполнения.Вставить("ДокументИД",СтрокаОбъекта.ДокументИД);
					СтруктураЗаполнения.Вставить("СтранаПроисхождения",НомерГТД_СтранаМира);
					СтруктураЗаполнения.Вставить("ИдентификаторСтроки",ИдентификаторСтроки);
					
					Если СтрокаОбъекта.Пометка = Истина Тогда
						СтрокаОбъекта.Объект1с = СоздатьЭлементСправочника_НомерГТД(СтруктураЗаполнения,ТекстОшибки);
						ОбъектСоздан = ЗначениеЗаполнено(СтрокаОбъекта.Объект1с);
					КонецЕсли;
					
				КонецЕсли;
				ДанныеНоменклатурыПортала.НомерГТДСсылка = СтрокаОбъекта.Объект1с;
				
			ИначеЕсли СтрокаОбъекта.ТипОбъекта = "СтраныМира" Тогда
				Если Не ЗначениеЗаполнено(СтрокаОбъекта.Объект1с) Тогда
					СтруктураЗаполнения = Новый Структура("Код,Наименование",ДанныеНоменклатурыПортала.recognizedCountryCode,ДанныеНоменклатурыПортала.recognizedCountryShortName);
					СтруктураЗаполнения.Вставить("ДокументИД",СтрокаОбъекта.ДокументИД);
					
					Если СтрокаОбъекта.Пометка = Истина Тогда
						СтрокаОбъекта.Объект1с = СоздатьЭлементСправочника_СтранаМира(СтруктураЗаполнения,ТекстОшибки);
						ОбъектСоздан = ЗначениеЗаполнено(СтрокаОбъекта.Объект1с);
					КонецЕсли;
					
				КонецЕсли;
				ДанныеНоменклатурыПортала.СтранаПроисхожденияСсылка = СтрокаОбъекта.Объект1с;
				
			ИначеЕсли СтрокаОбъекта.ТипОбъекта = "ИсточникиПроисхождения" Тогда
				Если Не ЗначениеЗаполнено(СтрокаОбъекта.Объект1с) Тогда
										
					СтруктураЗаполнения = Новый Структура("Код",СтрокаОбъекта.ИсточникиПроисхождения_Код);
					СтруктураЗаполнения.Вставить("Наименование",СтрокаОбъекта.ПредставлениеОбъекта);
					СтруктураЗаполнения.Вставить("ДокументИД",СтрокаОбъекта.ДокументИД);
					СтруктураЗаполнения.Вставить("СтранаПроисхождения",НомерГТД_СтранаМира);
					СтруктураЗаполнения.Вставить("ИдентификаторСтроки",ИдентификаторСтроки);
					
					СтрокиНоменклатуры = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ТипОбъекта,ИдентификаторОбъекта","Номенклатура",СтрокаОбъекта.ИдентификаторОбъекта));
					
					Если СтрокиНоменклатуры.Количество() > 0 Тогда
						СтруктураЗаполнения.Вставить("НаименованиеТовара",СтрокиНоменклатуры[0].ПредставлениеОбъекта);
					КонецЕсли;
					
					Если СтрокаОбъекта.Пометка = Истина Тогда
						СтрокаОбъекта.Объект1с = СоздатьЭлементСправочника_ИсточникПроисхождения(СтруктураЗаполнения,ТекстОшибки);
						ОбъектСоздан = ЗначениеЗаполнено(СтрокаОбъекта.Объект1с);
					КонецЕсли;
					
				КонецЕсли;
				ДанныеНоменклатурыПортала.ИсточникПроисхожденияСсылка = СтрокаОбъекта.Объект1с;
				
			КонецЕсли;
						
			//2025.05.21 ( 
			ПараметрыМК.Вставить("СтрокаОбъекта",СтрокаОбъекта);
			ПараметрыМК.Вставить("ДанныеДокументаПортала",ДанныеДокументаПортала);
			ПараметрыМК.Вставить("ДанныеНоменклатурыПортала",ДанныеНоменклатурыПортала);
			РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Сопоставление_ПослеПереносаСтрокиДанныхДокумента",ПараметрыМК);
			// ) 2025.05.21
			
			
			Если ОбъектСоздан = Истина И ЗначениеЗаполнено(СтрокаОбъекта.Объект1с) Тогда
				СтрокаОбъекта.СоответствиеУстановлено = Истина;
				ЗаполнитьВсеСоответствующиеЗначения(СтрокаОбъекта.ПолучитьИдентификатор());
			КонецЕсли;
			
			Если ТекстОшибки <> "" Тогда
				Результат.Успешно = Ложь;
				ОбщийТекстОшибки = ОбщийТекстОшибки + ТекстОшибки + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
		
		Результат.ТекстОшибки = ОбщийТекстОшибки;
		
		ПоместитьВоВременноеХранилище(ДанныеПортала,АдресХранилищаДанныхПортала);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
&НаСервере
Процедура ЗаполнитьВсеСоответствующиеЗначения(ИдентификаторСтроки)
	
	ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СтруктураПоиска = Новый Структура("ТипОбъекта",ТекСтрока.ТипОбъекта);
	
	Если ТекСтрока.ТипОбъекта = "Договоры" Тогда
		//+++ Добавить групповую установку договоров
		Возврат;
		
    //2023.08.10 ( Возможен поиск только по артикулу 
	ИначеЕсли ТекСтрока.ТипОбъекта = "Номенклатура" Тогда
		Если СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Артикул" Тогда
			Если ЗначениеЗаполнено(ТекСтрока.Номенклатура_Код) Тогда
				СтруктураПоиска.Вставить("Номенклатура_Код",ТекСтрока.Номенклатура_Код);
			Иначе
				Возврат;
			КонецЕсли;
		Иначе
			//В ряде кейсов для пользователя допустимо создание дубликатов по наименованию, в этом случае не ищем по наименованию
			Если СтруктураНастроек.Номенклатура_НеСоздаватьЕслиЕстьПолноеСовпадениеПоНаименованию = Истина Тогда
				СтруктураПоиска.Вставить("ПредставлениеОбъекта",ТекСтрока.ПредставлениеОбъекта);
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
	// ) 2023.08.10
	
	ИначеЕсли ТекСтрока.ТипОбъекта = "Организации"
		Или ТекСтрока.ТипОбъекта = "Контрагенты" Тогда
		СтруктураПоиска.Вставить("ИдентификаторОбъекта",ТекСтрока.ИдентификаторОбъекта);
	Иначе
		СтруктураПоиска.Вставить("ПредставлениеОбъекта",ТекСтрока.ПредставлениеОбъекта);
	КонецЕсли;
	
	СтрокиОбъекта = Объект.ЗагружаемыеОбъекты.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого СтрокаОбъекта Из СтрокиОбъекта Цикл
		Если Не ЗначениеЗаполнено(СтрокаОбъекта.Объект1с) Тогда
			СтрокаОбъекта.Объект1с = ТекСтрока.Объект1с;
			
			Если ТекСтрока.ТипОбъекта = "Контрагенты" Тогда
				СтрокаОбъекта.Контрагенты_Партнер = ТекСтрока.Контрагенты_Партнер;
			ИначеЕсли ТекСтрока.ТипОбъекта = "Номенклатура" Тогда
				СтрокаОбъекта.Номенклатура_НоменклатураПоставщика = ТекСтрока.Номенклатура_НоменклатураПоставщика;
			КонецЕсли;
			
		КонецЕсли;
		СтрокаОбъекта.СоответствиеУстановлено = ЗначениеЗаполнено(ТекСтрока.Объект1с);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция КонтрольЗаполнения_Склады_НаСервере()
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	Результат = РеквизитОбъект.КонтрольЗаполнения_ФормаСопоставления_Склады();
	
	//Если в табличной части были добавлены дополнительные реквизиты, они будут сброшены
	//помещении значения объекта в реквизит формы
	
	Возврат Результат;
КонецФункции


&НаСервере
Функция СоздатьЭлементСправочника_Контрагент(СтруктураЗаполнения,ТекстОшибки)
		
	//EN-371: Не давать создавать дубликаты контрагентов
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	ПоляПоиска = Новый Структура("ИНН,КПП,ИдентификационныйКодЛичности,Наименование,НаименованиеПолное",СтруктураЗаполнения.ИНН,СтруктураЗаполнения.КПП,СтруктураЗаполнения.ИНН);
	КонтрагентСсылка = РеквизитОбъект.ПолучитьСсылку_КонтрагентОрганизацияПоИННКПП("Контрагенты",ПоляПоиска,СтруктураНастроек);
	
	Если Не ЗначениеЗаполнено(КонтрагентСсылка) Тогда
	// ) EN-371
	
	    //Пока что ИИН/БИН передан в форму сопоставления в реквизите ИНН контрагента
		СтруктураЗаполнения.Вставить("ИдентификационныйКодЛичности",СтруктураЗаполнения.ИНН);
		
		Если НаправлениеСоздаваемогоДокумента = "Исходящий" Тогда
			СтруктураЗаполнения.Вставить("Покупатель",Истина);
		КонецЕсли;	
		СтруктураЗаполнения.Вставить("Поставщик",Истина);
		
		СтруктураЗаполнения.Вставить("ВестиРасчетыПоДоговорам",Истина);
		
		//2019.08.06 ( БГУ2
		Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат = "БГУ2" Тогда
			Если СтрДлина(СтруктураЗаполнения.ИНН) = 12 Тогда
				ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо");
				ЮрФизЛицоМенеджер = Справочники.ФизическиеЛица;
				
			Иначе
				ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо");
				ЮрФизЛицоМенеджер = Справочники.ЮридическиеЛица;
				
			КонецЕсли;
			
			ЮрФизЛицо = ЮрФизЛицоМенеджер.НайтиПоРеквизиту("ИНН",СтруктураЗаполнения.ИНН);
			
			Если Не ЗначениеЗаполнено(ЮрФизЛицо) И СтруктураНастроек.ЗаполнениеШапки_АлгоритмПоискаКонтрагента = "ИНН,Наименование" Тогда
				ЮрФизЛицо = ЮрФизЛицоМенеджер.НайтиПоНаименованию(СтруктураЗаполнения.Наименование,Истина);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ЮрФизЛицо) Тогда
				ЮрФизЛицо = ЮрФизЛицоМенеджер.ПолучитьСсылку();
			КонецЕсли;
			
			СтруктураЗаполнения.Вставить("ЮридическоеФизическоеЛицо", ЮрФизЛицо);
			СтруктураЗаполнения.Вставить("ВидКонтрагента", ВидКонтрагента);
			
		Иначе
		// ) БГУ2 2019.08.06 
		
			Если Метаданные.Перечисления.Найти("ЮрФизЛицо") <> Неопределено Тогда
				ЗначениеЮрЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
				ЗначениеФизЛицо = ?(РеквизитСуществует("Перечисления","ЮрФизЛицо","ИндивидуальныйПредприниматель"),
									Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель,
									Перечисления.ЮрФизЛицо.ФизЛицо);
									
			ИначеЕсли Метаданные.Перечисления.Найти("ВидыКонтрагентов") <> Неопределено Тогда // УНФ
				ЗначениеЮрЛицо = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
				ЗначениеФизЛицо = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
				
				//Для УНФ попробуем заполнить счета учета по умолчанию
				Попытка
					Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
						СтруктураЗаполнения.Вставить("СчетУчетаАвансовПокупателя",ПредопределенноеЗначение("ПланСчетов.Управленческий.КраткосрочныеАвансыПолученные"));
						СтруктураЗаполнения.Вставить("СчетУчетаАвансовПоставщику",ПредопределенноеЗначение("ПланСчетов.Управленческий.КраткосрочныеАвансыВыданные"));
						СтруктураЗаполнения.Вставить("СчетУчетаРасчетовСПокупателем",ПредопределенноеЗначение("ПланСчетов.Управленческий.КраткосрочнаяДебиторскаяЗадолженностьПокупателейИЗаказчиков"));
						СтруктураЗаполнения.Вставить("СчетУчетаРасчетовСПоставщиком",ПредопределенноеЗначение("ПланСчетов.Управленческий.КраткосрочнаяЗадолженностьПоставщикамИПодрядчикам"));
					Иначе					
						СтруктураЗаполнения.Вставить("СчетУчетаАвансовПокупателя",ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыПоАвансамПолученным"));
						СтруктураЗаполнения.Вставить("СчетУчетаАвансовПоставщику",ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыПоАвансамВыданным"));
						СтруктураЗаполнения.Вставить("СчетУчетаРасчетовСПокупателем",ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыСПокупателями"));
						СтруктураЗаполнения.Вставить("СчетУчетаРасчетовСПоставщиком",ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыСПоставщиками"));
					КонецЕсли;
				Исключение
					
				КонецПопытки;
				
			ИначеЕсли Метаданные.Перечисления.Найти("ЮридическоеФизическоеЛицо") <> Неопределено Тогда 
				ЗначениеЮрЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
				ЗначениеФизЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;		
				
			Иначе
				//+++
				
			КонецЕсли;
				
			//E1C-421: Костыль: для KAZ-конфигураций
			Если СтруктураНастроек.РегионПространства = "KAZ" Тогда
				//Номер ИИН можно отличить от номера БИН по пятой цифре: у ИИН это 0, 1, 2 или 3; а у БИН это 4, 5 или 6
				Если ЗначениеЗаполнено(СтруктураЗаполнения.ИНН) Тогда
					ПятаяЦифра = Сред(СтруктураЗаполнения.ИНН,5,1);
					Если ПятаяЦифра = "0" Или ПятаяЦифра = "1" Или ПятаяЦифра = "2" Или ПятаяЦифра = "3" Тогда
						ЮрФизЛицо = ЗначениеФизЛицо;
					Иначе
						ЮрФизЛицо = ЗначениеЮрЛицо;
					КонецЕсли;
				Иначе
					ЮрФизЛицо = ЗначениеЮрЛицо;
				КонецЕсли;
			Иначе
				ЮрФизЛицо = ?(СтрДлина(СтруктураЗаполнения.ИНН) = 12,ЗначениеФизЛицо,ЗначениеЮрЛицо);
			КонецЕсли;
			
			СтруктураЗаполнения.Вставить("ЮрФизЛицо", ЮрФизЛицо);
			СтруктураЗаполнения.Вставить("ЮридическоеФизическоеЛицо", ЮрФизЛицо);
			СтруктураЗаполнения.Вставить("ВидКонтрагента", ЮрФизЛицо);
			
		КонецЕсли;
		
		//E1C-457: Самозанятых создаем с отдельным видом (в БП30 - флаг Самозанятый
		Если СтруктураЗаполнения.ДокументТип = "SELF_EMPLOYED_RECEIPT" Тогда
			СтруктураЗаполнения.Вставить("Самозанятый",Истина);
		КонецЕсли;
		
		//Флаг Индивидуальный предприниматель
		Если Найти(Нрег(СтруктураЗаполнения.НаименованиеПолное),"индивидуальный") > 0
			Или Найти(Нрег(СтруктураЗаполнения.НаименованиеПолное),"предприниматель") > 0
			Или Найти(Нрег(СтруктураЗаполнения.НаименованиеПолное),"ип ") > 0 Тогда
			СтруктураЗаполнения.Вставить("ИндивидуальныйПредприниматель",Истина);
		КонецЕсли;
		
		Если РеквизитСуществует("Справочники","Контрагенты","СтранаРегистрации")
			И Метаданные.Справочники.Найти("СтраныМира") <> Неопределено Тогда
			СтруктураЗаполнения.Вставить("СтранаРегистрации",Справочники.СтраныМира.Россия);
		КонецЕсли;
		
		Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат = "УНФ" Тогда
			Если РеквизитСуществует("Константы","ВестиРасчетыПоДоговорам") Тогда
				СтруктураЗаполнения.Вставить("ВестиРасчетыПоДоговорам",Константы.ВестиРасчетыПоДоговорам.Получить());
			КонецЕсли;
			
			Если РеквизитСуществует("Константы","ВестиРасчетыПоДокументам") Тогда
				СтруктураЗаполнения.Вставить("ВестиРасчетыПоДокументам",Константы.ВестиРасчетыПоДокументам.Получить());
			КонецЕсли;
			
			Если РеквизитСуществует("Константы","ВестиРасчетыПоЗаказам") Тогда
				СтруктураЗаполнения.Вставить("ВестиРасчетыПоЗаказам",Константы.ВестиРасчетыПоЗаказам.Получить());
			КонецЕсли;
			
			Если РеквизитСуществует("Константы","ВестиУчетОплатыПоСчетам") Тогда
				СтруктураЗаполнения.Вставить("ВестиУчетОплатыПоСчетам",Константы.ВестиУчетОплатыПоСчетам.Получить());
			КонецЕсли;			
		КонецЕсли;
		
		СтруктураЗаполнения.Вставить("Комментарий","#Создан автоматически при загрузке из сервиса Entera.pro");
		
		// Схема с формированием наименования вида <НаименованиеКраткое ОПФ>
		Если СтруктураНастроек.ЗаполнениеШапки_ФормироватьНаименованиеКонтрагентаПоШаблону = Истина Тогда
			СтруктураНаименования = РеквизитОбъект.Энтера_НаименованиеОрганизации(СтруктураЗаполнения.НаименованиеПолное);
			
			//Пока костыль: если полное и краткое при преобразовании оказались одинаковыми,
			//значит не удалось обработать наименование, оставим краткое наименование по данным Синтеки
			Если СтруктураНаименования.СокращенноеНаименование <> СтруктураНаименования.ПолноеНаименование Тогда
				СтруктураЗаполнения.Вставить("Наименование", СтруктураНаименования.СокращенноеНаименование);
			КонецЕсли;
		КонецЕсли;
		
		НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		
		//Может быть передана ссылка на элемент справочника Контрагенты, если ее использовали при создании банковского счета
		Если СтруктураЗаполнения.Свойство("СсылкаНовогоОбъекта") И ЗначениеЗаполнено(СтруктураЗаполнения.СсылкаНовогоОбъекта) Тогда
			НовыйКонтрагент.УстановитьСсылкуНового(СтруктураЗаполнения.СсылкаНовогоОбъекта);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НовыйКонтрагент,СтруктураЗаполнения);
		
		Если Метаданные.Справочники.Найти("Партнеры") <> Неопределено Тогда
			НовыйПартнер = Справочники.Партнеры.СоздатьЭлемент();
			
			Если НаправлениеСоздаваемогоДокумента = "Исходящий" Тогда
				НовыйПартнер.Клиент = Истина;
			КонецЕсли;
			НовыйПартнер.Поставщик = Истина;
			
			НовыйПартнер.ПрочиеОтношения = Истина;
			НовыйПартнер.ДатаРегистрации = ТекущаяДата();
			НовыйПартнер.Комментарий = "#Создан автоматически при загрузке из сервиса Entera.pro";
			НовыйПартнер.Наименование = НовыйКонтрагент.Наименование;
			НовыйПартнер.НаименованиеПолное = НовыйКонтрагент.НаименованиеПолное;
			
			Если НовыйПартнер.Метаданные().Реквизиты.Найти("ЮрФизЛицо") <> Неопределено Тогда
				НовыйПартнер.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания;
			КонецЕсли;
			
			НовыйПартнер.Записать();
			НовыйПартнер = НовыйПартнер.Ссылка;
			
			НовыйКонтрагент.Партнер = НовыйПартнер;
		Иначе
			НовыйПартнер = Неопределено;
		КонецЕсли;
		
		// ( модуль кастомизации
		ПараметрыМК = Новый Структура;
		ПараметрыМК.Вставить("АдресХранилищаДанныхПортала",АдресХранилищаДанныхПортала);
		ПараметрыМК.Вставить("СтруктураЗаполнения",СтруктураЗаполнения);
		ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
		ПараметрыМК.Вставить("ДокументИД",СтруктураЗаполнения.ДокументИД);
		ПараметрыМК.Вставить("НаправлениеСоздаваемогоДокумента",НаправлениеСоздаваемогоДокумента);
		ПараметрыМК.Вставить("Объект",НовыйКонтрагент);
		ПараметрыМК.Вставить("Ссылка",КонтрагентСсылка);
		ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
		
		РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Сопоставление_Контрагент_ПередЗаписью",ПараметрыМК);
		
		Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
		// ) модуль кастомизации
		
			Попытка
				НовыйКонтрагент.Записать();
				КонтрагентСсылка = НовыйКонтрагент.Ссылка;
			Исключение
				ТекстОшибки = "Запись контрагента " + СтруктураЗаполнения.Наименование + ": " + КраткоеОписаниеОшибки(ОписаниеОшибки());
			КонецПопытки;
		
			//2019.08.06 ( БГУ2: запишем элемент справочника ЮрФизЛицо
			Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат = "БГУ2"
				И ЗначениеЗаполнено(ПараметрыМК.Ссылка) Тогда
					
				ЮрФизЛицоОбъект = ЮрФизЛицоМенеджер.СоздатьЭлемент();
				ЮрФизЛицоОбъект.УстановитьСсылкуНового(ЮрФизЛицо);
				ЗаполнитьЗначенияСвойств(ЮрФизЛицоОбъект,СтруктураЗаполнения);
				
				Попытка
					ЮрФизЛицоОбъект.Записать();
				Исключение
					ТекстОшибки = "Запись юридического/физического лица контрагента " + СтруктураЗаполнения.Наименование + ": " + КраткоеОписаниеОшибки(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
			// ) БГУ2 2019.08.06 
		Иначе
			КонтрагентСсылка = ПараметрыМК.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КонтрагентСсылка;
	
КонецФункции
&НаСервере
Функция СоздатьЭлементСправочника_Договор(СтруктураЗаполнения,ПараметрыЗаполнения,ТекстОшибки)
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Метаданные.Справочники.Найти("ДоговорыКонтрагентов") <> Неопределено Тогда
		ДоговорМенеджер = Справочники.ДоговорыКонтрагентов;
		Если Метаданные.Справочники.ДоговорыКонтрагентов.Владельцы.Содержит(Метаданные.Справочники.Контрагенты) Тогда
			СтруктураЗаполнения.Вставить("Владелец",СтруктураЗаполнения.Контрагент);
		КонецЕсли;
		
	ИначеЕсли Метаданные.Справочники.Найти("Договоры") <> Неопределено Тогда
		ДоговорМенеджер = Справочники.Договоры;
		Если Метаданные.Справочники.Договоры.Владельцы.Содержит(Метаданные.Справочники.Контрагенты) Тогда
			СтруктураЗаполнения.Вставить("Владелец",СтруктураЗаполнения.Контрагент);
		КонецЕсли;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
			
	//E1C-327: ( Для документа ОтчетКомиссионераОПродажах создаем договор с видом СКомиссионером
	Если ПараметрыЗаполнения.ТипСоздаваемогоДокумента = "ОтчетКомиссионераОПродажах" Тогда
		Если РеквизитСуществует("Перечисления","ВидыДоговоровКонтрагентов","СКомиссионером") Тогда
			СтруктураЗаполнения.Вставить("ВидДоговора",Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
		КонецЕсли;
	// ) E1C-327
	
	//E1C-337: ( Для документа ОтчетКомиссионера создаем договор с видом СКомиссионером
	ИначеЕсли ПараметрыЗаполнения.ТипСоздаваемогоДокумента = "ОтчетКомиссионера" Тогда
		Если РеквизитСуществует("Перечисления","ХозяйственныеОперации","ПередачаНаКомиссию") Тогда
			СтруктураЗаполнения.Вставить("ХозяйственныеОперации",Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
		КонецЕсли;
		
		//2024.04.23 ( УНФ
		Если РеквизитСуществует("Перечисления","ВидыДоговоров","СКомиссионером") Тогда
			СтруктураЗаполнения.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.СКомиссионером);
		КонецЕсли;
		// ) 2024.04.23
		
	Иначе
	// ) E1C-337
	
		Если НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
			Если РеквизитСуществует("Перечисления","ВидыДоговоровКонтрагентов","СПоставщиком") Тогда
				СтруктураЗаполнения.Вставить("ВидДоговора",Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ТипыДоговоров","СПоставщиком") Тогда
				СтруктураЗаполнения.Вставить("ТипДоговора",Перечисления.ТипыДоговоров.СПоставщиком);
			КонецЕсли;
			
		Иначе
			Если РеквизитСуществует("Перечисления","ВидыДоговоровКонтрагентов","СПокупателем") Тогда
				СтруктураЗаполнения.Вставить("ВидДоговора",Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
			КонецЕсли;
			
			Если РеквизитСуществует("Перечисления","ТипыДоговоров","СПокупателем") Тогда
				СтруктураЗаполнения.Вставить("ТипДоговора",Перечисления.ТипыДоговоров.СПокупателем);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если РеквизитСуществует("Перечисления","СпособыВыставленияДокументов","Автоматически") Тогда
		СтруктураЗаполнения.Вставить("СпособВыставленияДокументов",Перечисления.СпособыВыставленияДокументов.Автоматически);
	КонецЕсли;
	
	Если РеквизитСуществует("Перечисления","СтатусыДоговоровКонтрагентов","Действует") Тогда
		СтруктураЗаполнения.Вставить("Статус",Перечисления.СтатусыДоговоровКонтрагентов.Действует);
	КонецЕсли;
	
	//УТ11
	Если Метаданные.Константы.Найти("ВариантПриемкиТоваров") <> Неопределено Тогда
		СтруктураЗаполнения.Вставить("ВариантПриемкиТоваров",Константы.ВариантПриемкиТоваров.Получить());
	КонецЕсли;
	
	Если РеквизитСуществует("Перечисления","ПорядокРасчетов","ПоНакладным") Тогда
		СтруктураЗаполнения.Вставить("ВариантПриемкиТоваров",Перечисления.ПорядокРасчетов.ПоНакладным);
	КонецЕсли;
	
	СтруктураЗаполнения.Вставить("ПредъявляетНДС",Истина);
		
	СтруктураЗаполнения.Вставить("ВалютаВзаиморасчетов",СтруктураНастроек.СведенияОКонфигурации.ВалютаУчета);
		
	// БГУ2 2019.08.06 (
	//ОтдельныйСчетДляРасчетовПоГОЗ
	//ГосударственныйКонтрактПоГОЗ
	// ) БГУ2 2019.08.06 
	
	СтруктураЗаполнения.Вставить("Комментарий","#Создан автоматически при загрузке из сервиса Entera.pro");
	
	ДоговорОбъект = ДоговорМенеджер.СоздатьЭлемент();
			
	Попытка ДоговорОбъект.Заполнить(СтруктураЗаполнения); Исключение; КонецПопытки;
	
	ЗаполнитьЗначенияСвойств(ДоговорОбъект,СтруктураЗаполнения);
	
	// ( модуль кастомизации
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("АдресХранилищаДанныхПортала",АдресХранилищаДанныхПортала);
	ПараметрыМК.Вставить("СтруктураЗаполнения",СтруктураЗаполнения);
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыМК.Вставить("ДокументИД",ПараметрыЗаполнения.ДокументИД);
	ПараметрыМК.Вставить("НаправлениеСоздаваемогоДокумента",НаправлениеСоздаваемогоДокумента);
	ПараметрыМК.Вставить("Объект",ДоговорОбъект);
	ПараметрыМК.Вставить("Ссылка",ДоговорМенеджер.ПустаяСсылка());
	ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
	
	РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Сопоставление_Договор_ПередЗаписью",ПараметрыМК);
	
	Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
	// ) модуль кастомизации
	
		Попытка
			ДоговорОбъект.Записать();
			ПараметрыМК.Ссылка = ДоговорОбъект.Ссылка;
		Исключение
			ТекстОшибки = "Запись договора " + СтруктураЗаполнения.Наименование + ": " + КраткоеОписаниеОшибки(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
		
	Возврат ПараметрыМК.Ссылка;
	
КонецФункции
&НаСервере
Функция СоздатьЭлементСправочника_БанковскийСчет(СтруктураЗаполнения,ТекстОшибки)
	
	СтруктураЗаполнения.Вставить("Валюта",СтруктураНастроек.СведенияОКонфигурации.ВалютаУчета);
	
	//Поищем существующий банковский счет
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	Результат = РеквизитОбъект.ПолучитьСсылку_БанковскийСчет(СтруктураЗаполнения,СтруктураНастроек);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда	
		
		ИмяСправочникаБанковскиеСчета = СтруктураНастроек.СведенияОКонфигурации.Банк_ИмяСправочникаБанковскиеСчетаКонтрагентов;
		ИмяСправочникаБанки = СтруктураНастроек.СведенияОКонфигурации.Банк_ИмяСправочникаБанки;
		ИмяСправочникаКлассификаторБанков = СтруктураНастроек.СведенияОКонфигурации.Банк_ИмяСправочникаКлассификаторБанков;
		
		НачатьТранзакцию();
	
		Если ЗначениеЗаполнено(ИмяСправочникаБанки) Тогда
			БанкСсылка = Справочники[ИмяСправочникаБанки].НайтиПоКоду(СтруктураЗаполнения.БИК);
			
			Если Не ЗначениеЗаполнено(БанкСсылка) Тогда
				БанкОбъект = Справочники[ИмяСправочникаБанки].СоздатьЭлемент();
				
				Если ЗначениеЗаполнено(ИмяСправочникаКлассификаторБанков) Тогда
					БанкПоКлассификатору = Справочники[ИмяСправочникаКлассификаторБанков].НайтиПоКоду(СтруктураЗаполнения.БИК);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(БанкПоКлассификатору) Тогда
					ЗаполнитьЗначенияСвойств(БанкОбъект,БанкПоКлассификатору,,"Владелец");
				Иначе
					
					Банк_СтруктураЗаполнения = Новый Структура;
					Банк_СтруктураЗаполнения.Вставить("Код",СтруктураЗаполнения.БИК);
					Банк_СтруктураЗаполнения.Вставить("Наименование",СтруктураЗаполнения.НаименованиеБанка);
					Банк_СтруктураЗаполнения.Вставить("РучноеИзменение",1);
					
					ЗаполнитьЗначенияСвойств(БанкОбъект,Банк_СтруктураЗаполнения);
					
					_3Ф_УстановитьРежимЗаписи_ОбменДаннымиЗагрузка(БанкОбъект);
				КонецЕсли;
				
				Попытка
					БанкОбъект.Записать();
					БанкСсылка = БанкОбъект.Ссылка;
				Исключение
					ТекстОшибки = ТекстОшибки + "Не удалось создать банк """ + СтруктураЗаполнения.НаименованиеБанка + """ (БИК " + СтруктураЗаполнения.БИК + ")";
					ОтменитьТранзакцию();
					Возврат Неопределено;
				КонецПопытки;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(БанкСсылка) Тогда
				
				Если ЗначениеЗаполнено(ИмяСправочникаБанковскиеСчета) Тогда
					
					СчетОбъект = Справочники[ИмяСправочникаБанковскиеСчета].СоздатьЭлемент();
					
					СтруктураЗаполнения_Счет = Новый Структура;
					СтруктураЗаполнения_Счет.Вставить("Банк",БанкСсылка);
					СтруктураЗаполнения_Счет.Вставить("Владелец",СтруктураЗаполнения.Владелец);
					СтруктураЗаполнения_Счет.Вставить("ВалютаДенежныхСредств",СтруктураЗаполнения.Валюта);
					СтруктураЗаполнения_Счет.Вставить("ВидСчета","Расчетный");
					
					Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат = "БГУ2" Тогда
						СтруктураЗаполнения_Счет.Вставить("Код",СтруктураЗаполнения.НомерСчета);
					КонецЕсли;
					
					СтруктураЗаполнения_Счет.Вставить("НомерСчета",СтруктураЗаполнения.НомерСчета);
					
					//E1C-501: При создании нового банковского счета поле "Наименование" заполнять в формате "Номер счета, Наименование банка"
					Наименование = Строка(СтруктураЗаполнения.НомерСчета)
						+ ?(ЗначениеЗаполнено(СтруктураЗаполнения.НомерСчета),", ","") + Строка(БанкСсылка);
					СтруктураЗаполнения_Счет.Вставить("Наименование",Наименование);
					
					ЗаполнитьЗначенияСвойств(СчетОбъект,СтруктураЗаполнения_Счет);
					
					_3Ф_УстановитьРежимЗаписи_ОбменДаннымиЗагрузка(СчетОбъект);
					
					Попытка
						СчетОбъект.Записать();
						Результат = СчетОбъект.Ссылка;
					Исключение
						ТекстОшибки = ТекстОшибки + "Не удалось создать банковский счет """ + СтруктураЗаполнения.НаименованиеБанка + """ (БИК " + СтруктураЗаполнения.БИК + ")";
						Возврат Неопределено;
					КонецПопытки;
					
				Иначе
					СообщитьСообщение("Внутренняя ошибка: не удалось определить имя метаданных справочника <Банковские счета>");
					ОтменитьТранзакцию();
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(ИмяСправочникаКлассификаторБанков) Тогда //Ищем в классификаторе банков, УТ11, ERP, Розница2
			БанкСсылка = Справочники[ИмяСправочникаКлассификаторБанков].НайтиПоКоду(СтруктураЗаполнения.БИК);
			
			Если ЗначениеЗаполнено(БанкСсылка) Тогда
				
				Если ЗначениеЗаполнено(ИмяСправочникаБанковскиеСчета) Тогда
					
					СчетОбъект = Справочники[ИмяСправочникаБанковскиеСчета].СоздатьЭлемент();
					
					СтруктураЗаполнения_Счет = Новый Структура;
					СтруктураЗаполнения_Счет.Вставить("Банк",БанкСсылка);
					СтруктураЗаполнения_Счет.Вставить("Владелец",СтруктураЗаполнения.Владелец);
					СтруктураЗаполнения_Счет.Вставить("ВалютаДенежныхСредств",СтруктураЗаполнения.Валюта);
					
					СтруктураЗаполнения_Счет.Вставить("НомерСчета",СтруктураЗаполнения.НомерСчета);
					СтруктураЗаполнения_Счет.Вставить("Наименование",СтруктураЗаполнения.НомерСчета);
					
					СтруктураЗаполнения_Счет.Вставить("БИКБанка",БанкСсылка.Код);
					СтруктураЗаполнения_Счет.Вставить("НаименованиеБанка",БанкСсылка.Наименование);
					СтруктураЗаполнения_Счет.Вставить("КоррСчетБанка",БанкСсылка.КоррСчет);
					СтруктураЗаполнения_Счет.Вставить("ГородБанка",БанкСсылка.Город);
					СтруктураЗаполнения_Счет.Вставить("АдресБанка",БанкСсылка.Адрес);
					СтруктураЗаполнения_Счет.Вставить("ТелефоныБанка",БанкСсылка.Телефоны);
					
					ЗаполнитьЗначенияСвойств(СчетОбъект,СтруктураЗаполнения_Счет);				
					
					_3Ф_УстановитьРежимЗаписи_ОбменДаннымиЗагрузка(СчетОбъект);
					Попытка
						СчетОбъект.Записать();
						Результат = СчетОбъект.Ссылка;
					Исключение
						ТекстОшибки = ТекстОшибки + "Не удалось создать банковский счет """ + СтруктураЗаполнения.НаименованиеБанка + """ (БИК " + СтруктураЗаполнения.БИК + "): " + КраткоеОписаниеОшибки(ОписаниеОшибки());
						ОтменитьТранзакцию();
						Возврат Неопределено;
					КонецПопытки;
					
				Иначе
					СообщитьСообщение("Внутренняя ошибка: не удалось определить имя метаданных справочника <Банковские счета>");
					ОтменитьТранзакцию();
				КонецЕсли;
				
			Иначе
				ТекстОшибки = ТекстОшибки + "Не удалось определить банк """ + СтруктураЗаполнения.НаименованиеБанка + """ (БИК " + СтруктураЗаполнения.БИК + "): " + КраткоеОписаниеОшибки(ОписаниеОшибки());
			КонецЕсли;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
				
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
&НаСервере
Функция СоздатьЭлементСправочника_Номенклатура(СтруктураЗаполнения,ДополнительноеОписание,ТекстОшибки)
	
	ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(СтруктураЗаполнения.ИдентификаторСтроки);
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	Результат = Справочники.Номенклатура.ПустаяСсылка();
	
	СтруктураЗаполнения.Вставить("НаименованиеПолное",ТекСтрока.Номенклатура_НаименованиеПолное);
	СтруктураЗаполнения.Вставить("ВидНоменклатуры",ТекСтрока.Номенклатура_ВидНоменклатуры);
	СтруктураЗаполнения.Вставить("ЕдиницаИзмерения",ТекСтрока.Номенклатура_ЕдиницаИзмерения);
	СтруктураЗаполнения.Вставить("ГруппаФинансовогоУчета",ТекСтрока.Номенклатура_ГруппаФинансовогоУчета);
	СтруктураЗаполнения.Вставить("ГруппаАналитическогоУчета",ТекСтрока.Номенклатура_ГруппаАналитическогоУчета);
	СтруктураЗаполнения.Вставить("НоменклатурнаяГруппа",ТекСтрока.Номенклатура_НоменклатурнаяГруппа);
	
	//БП30 для Казахстана
	СтруктураЗаполнения.Вставить("БазоваяЕдиницаИзмерения",ТекСтрока.Номенклатура_ЕдиницаИзмерения);
	
	
	//БИТ:Стоматология
	СтруктураЗаполнения.Вставить("ЕдиницаХраненияОстатков",ТекСтрока.Номенклатура_ЕдиницаИзмерения);
	СтруктураЗаполнения.Вставить("ЕдиницаТоваров",ТекСтрока.Номенклатура_ЕдиницаИзмерения);
	
	//2020.03.04 ( E1C-22: При создании новой номенклатуры артикул должен записываться в поле "Артикул"
	Если СтруктураНастроек.Номенклатура_ЗаполнятьАртикулы = Истина Тогда
		Если ЗначениеЗаполнено(ТекСтрока.Номенклатура_Код) Тогда
			СтруктураЗаполнения.Вставить("Артикул",ТекСтрока.Номенклатура_Код);
		КонецЕсли;
	КонецЕсли;
	// ) 2020.03.04
	
	//2021.12.09 (
	Если Не ЗначениеЗаполнено(СтруктураЗаполнения.НоменклатурнаяГруппа) Тогда
		Если ДополнительноеОписание = "Услуга"
			Или ДополнительноеОписание = "АгентскиеУслуги" Тогда
			СтруктураЗаполнения.Вставить("НоменклатурнаяГруппа",СтруктураНастроек.Номенклатура_НоменклатурнаяГруппаУслуга);			
		Иначе
			СтруктураЗаполнения.Вставить("НоменклатурнаяГруппа",СтруктураНастроек.Номенклатура_НоменклатурнаяГруппаТовар);
		КонецЕсли;
	КонецЕсли;
	// ) 2021.12.09 
	
	//E1C-165: При выключенной настройке <Учитывать НДС при заполнении документа> при создании номенклатуры использовать ставку БезНДС
	Если СтруктураНастроек.ЗаполнениеШапки_УчитыватьНДС = Ложь Тогда
		СтруктураЗаполнения.Вставить("СтавкаНДС",СтруктураНастроек.СведенияОКонфигурации.СтавкиНДС.БезНДС);
	КонецЕсли;
		
	Если ДополнительноеОписание = "Услуга"
		Или ДополнительноеОписание = "АгентскиеУслуги" Тогда
		
		СтруктураЗаполнения.Вставить("Услуга",Истина);
		СтруктураЗаполнения.Вставить("СчетУчетаЗатрат",ТекСтрока.Номенклатура_СчетУчета);
		
		Если РеквизитСуществует("Справочники","ВидыНоменклатуры") Тогда
			Если РеквизитСуществует("Справочники","ВидыНоменклатуры","ТипНоменклатуры") Тогда
				СтруктураЗаполнения.Вставить("ТипНоменклатуры",ТекСтрока.Номенклатура_ВидНоменклатуры.ТипНоменклатуры);
			КонецЕсли;
			
		ИначеЕсли РеквизитСуществует("Перечисления","ТипыНоменклатуры","Услуга") Тогда //УНФ
				СтруктураЗаполнения.Вставить("ТипНоменклатуры",Перечисления.ТипыНоменклатуры.Услуга);
				
		КонецЕсли;
					
	Иначе
		СтруктураЗаполнения.Вставить("Услуга",Ложь);
		СтруктураЗаполнения.Вставить("СчетУчетаЗапасов",СтруктураНастроек.ЗаполнениеТЧ_СчетУчетаПоУмолчаниюТовар);
		
		//2023.05.31 ( Статью затрат заполняем только для НЕ-Услуг
		СтруктураЗаполнения.Вставить("СтатьяЗатрат",ТекСтрока.Номенклатура_СтатьяЗатрат);
		// ) 2023.05.31
		
		Если РеквизитСуществует("Справочники","ВидыНоменклатуры") Тогда			
			Если РеквизитСуществует("Справочники","ВидыНоменклатуры","ТипНоменклатуры")
				И ЗначениеЗаполнено(ТекСтрока.Номенклатура_ВидНоменклатуры) Тогда
				СтруктураЗаполнения.Вставить("ТипНоменклатуры",ТекСтрока.Номенклатура_ВидНоменклатуры.ТипНоменклатуры);
			КонецЕсли;
			
		ИначеЕсли РеквизитСуществует("Перечисления","ТипыНоменклатуры","Запас") Тогда //УНФ
			СтруктураЗаполнения.Вставить("ТипНоменклатуры",Перечисления.ТипыНоменклатуры.Запас);
			
		КонецЕсли;
				
	КонецЕсли;
	
	Родитель = ТекСтрока.Номенклатура_Родитель;
	Если ЗначениеЗаполнено(Родитель) И Родитель.ЭтоГруппа Тогда
		СтруктураЗаполнения.Вставить("Родитель",Родитель);
	КонецЕсли;	
	
	Если РеквизитСуществует("Перечисления","ГрадацииКачества","Новый") Тогда
		СтруктураЗаполнения.Вставить("Качество",Перечисления.ГрадацииКачества.Новый);
	КонецЕсли;
	
	Если РеквизитСуществует("Перечисления","ВариантыИспользованияХарактеристикНоменклатуры","НеИспользовать") Тогда
		СтруктураЗаполнения.Вставить("ИспользованиеХарактеристик",Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать);
	КонецЕсли;
	
	Если РеквизитСуществует("Справочники","ВидыНоменклатуры") И РеквизитСуществует("Справочники","ВидыНоменклатуры","ГруппаДоступа") Тогда
		СтруктураЗаполнения.Вставить("ГруппаДоступа",СтруктураНастроек.Номенклатура_ВидНоменклатурыПоУмолчаниюТовар.ГруппаДоступа);
	КонецЕсли;
	
	//2019.05.21 ( УНФ: предзаполним счета учета запасов/затрат по умолчанию, если не заданы в настройках
	Если Конф = "УНФ" Тогда
		Если ЗначениеЗаполнено(ТекСтрока.Номенклатура_СчетУчетаЗапасов) Тогда
			СчетУчетаЗапасов = ТекСтрока.Номенклатура_СчетУчетаЗапасов;
		ИначеЕсли ЗначениеЗаполнено(СтруктураНастроек.ЗаполнениеТЧ_СчетУчетаПоУмолчаниюТовар) Тогда
			СчетУчетаЗапасов = СтруктураНастроек.ЗаполнениеТЧ_СчетУчетаПоУмолчаниюТовар;
		Иначе
			Попытка	СчетУчетаЗапасов = ПредопределенноеЗначение("ПланСчетов.Управленческий.СырьеИМатериалы"); Исключение; КонецПопытки;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекСтрока.Номенклатура_СчетУчетаЗатрат) Тогда
			СчетУчетаЗатрат = ТекСтрока.Номенклатура_СчетУчетаЗатрат;		
		ИначеЕсли ЗначениеЗаполнено(СтруктураНастроек.ЗаполнениеТЧ_СчетУчетаПоУмолчаниюУслуга) Тогда
			СчетУчетаЗатрат = СтруктураНастроек.ЗаполнениеТЧ_СчетУчетаПоУмолчаниюУслуга;
		Иначе
			Попытка	СчетУчетаЗатрат = ПредопределенноеЗначение("ПланСчетов.Управленческий.КоммерческиеРасходы"); Исключение; КонецПопытки;
		КонецЕсли;		
		
		СтруктураЗаполнения.Вставить("СчетУчетаЗапасов",СчетУчетаЗапасов);
		СтруктураЗаполнения.Вставить("СчетУчетаЗатрат",СчетУчетаЗатрат);
		
		//2022.05.25 ( определяем и заполняем ВидСтавкиНДС
		Если РеквизитСуществует("Перечисления","ВидыСтавокНДС") Тогда
			Попытка
				СтруктураЗаполнения.Вставить("ВидСтавкиНДС",Перечисления.ВидыСтавокНДС.ВидСтавки(СтруктураЗаполнения.СтавкаНДС));
			Исключение
				//Не обрабатываем
			КонецПопытки;
		КонецЕсли;
		// ) 2022.05.25
		
	КонецЕсли;
	// ) 2019.05.21
	
	Если ЗначениеЗаполнено(ТекСтрока.Номенклатура_Категория) Тогда
		СтруктураЗаполнения.Вставить("КатегорияНоменклатуры",ТекСтрока.Номенклатура_Категория);
	Иначе
		Если Метаданные.Справочники.Найти("КатегорииНоменклатуры") <> Неопределено Тогда
			Попытка СтруктураЗаполнения.Вставить("КатегорияНоменклатуры",Справочники.КатегорииНоменклатуры.БезКатегории); Исключение; КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	// 2023.08.24 ( Часть заполнения может выполняться по данным выбранной категории
	Если СтруктураЗаполнения.Свойство("КатегорияНоменклатуры")
		И ЗначениеЗаполнено(СтруктураЗаполнения.КатегорияНоменклатуры)
		И РеквизитСуществует("Справочники","КатегорииНоменклатуры","МетодОценки") Тогда
		СтруктураЗаполнения.Вставить("МетодОценки",СтруктураЗаполнения.КатегорияНоменклатуры.МетодОценки);
	КонецЕсли;
	// ) 2023.08.24
	
	Если ЗначениеЗаполнено(ТекСтрока.Номенклатура_НаправлениеДеятельности) Тогда
		СтруктураЗаполнения.Вставить("НаправлениеДеятельности",ТекСтрока.Номенклатура_НаправлениеДеятельности);
	КонецЕсли;
	
	//По идее, если номенклатуру создают, а не выбирают из списка, то характеристика на этом этапе еще не выбрана,
	//значит новая номенклатура создается без ведения учета по характеристикам? Пока оставляю код ниже, может быть будет другая логика
	УстанавливатьФлагИспользованияХарактеристик = Ложь;
	
	Если УстанавливатьФлагИспользованияХарактеристик Тогда
		Если СтруктураНастроек.Свойство("ЗаполнениеТЧ_ИспользоватьХарактеристики")
			И СтруктураНастроек.ЗаполнениеТЧ_ИспользоватьХарактеристики = Истина Тогда
			Если РеквизитСуществует("Перечисления","ВариантыИспользованияХарактеристикНоменклатуры","ИндивидуальныеДляНоменклатуры") Тогда
				СтруктураЗаполнения.Вставить("ИспользованиеХарактеристик",Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	НоменклатураОбъект = Справочники.Номенклатура.СоздатьЭлемент();
	Если СтруктураЗаполнения.Свойство("СсылкаНовогоОбъекта") И ЗначениеЗаполнено(СтруктураЗаполнения.СсылкаНовогоОбъекта) Тогда
		НоменклатураОбъект.УстановитьСсылкуНового(СтруктураЗаполнения.СсылкаНовогоОбъекта);
	КонецЕсли;
	
	//2021.10.08 ( в УТ-подобных конфигурациях базовое заполнение объекта Номенклатуры выполняется по виду номенклатуры,
	//если такой реквизит у Номенклатуры есть - заполним его до вызова ОбработкиЗаполнения объекта
	Если НоменклатураОбъект.Метаданные().Реквизиты.Найти("ВидНоменклатуры") <> Неопределено Тогда
		НоменклатураОбъект.ВидНоменклатуры = СтруктураЗаполнения.ВидНоменклатуры;
		
		//2022.06.08 ( В Рознице по виду номенклатуры заполняем ценовую группу
		Если Конф = "РОЗН2" Тогда
			
			//Из модуля менеджера типовой Розницы
			СтруктураРеквизитов = Новый Структура;
			СтруктураРеквизитов.Вставить("ТипНоменклатуры", 				"ТипНоменклатуры");
			СтруктураРеквизитов.Вставить("АгентскиеУслуги", 				"АгентскиеУслуги");
			СтруктураРеквизитов.Вставить("АлкогольнаяПродукция", 			"АлкогольнаяПродукция");
			СтруктураРеквизитов.Вставить("ВидАлкогольнойПродукцииЕГАИС", 	"ВидАлкогольнойПродукцииЕГАИС");
			СтруктураРеквизитов.Вставить("ИмпортнаяАлкогольнаяПродукция", 	"ИмпортнаяАлкогольнаяПродукция");
			СтруктураРеквизитов.Вставить("ЕдиницаИзмерения", 				"ЕдиницаИзмерения");
			СтруктураРеквизитов.Вставить("НаборУпаковок", 					"НаборУпаковок");
			СтруктураРеквизитов.Вставить("ЦеноваяГруппа", 					"ЦеноваяГруппа");
			СтруктураРеквизитов.Вставить("ТоварнаяГруппа", 					"ТоварнаяГруппа");
			СтруктураРеквизитов.Вставить("ОсобенностьУчета", 				"ОсобенностьУчета");
			СтруктураРеквизитов.Вставить("ПродукцияМаркируемаяДляГИСМ", 	"ПродукцияМаркируемаяДляГИСМ");
			СтруктураРеквизитов.Вставить("КиЗГИСМ", 						"КиЗГИСМ");
			СтруктураРеквизитов.Вставить("ИспользоватьRFIDМеткиСерии", 		"ИспользоватьRFIDМеткиСерии");
			СтруктураРеквизитов.Вставить("ИспользоватьНомерКИЗГИСМСерии", 	"ИспользоватьНомерКИЗГИСМСерии");
			СтруктураРеквизитов.Вставить("ИспользоватьВидКИЗГИСМСерии", 	"ИспользоватьВидКИЗГИСМСерии");
			СтруктураРеквизитов.Вставить("СтранаПроисхождения", 			"СтранаПроисхождения");
			СтруктураРеквизитов.Вставить("Производитель", 					"Производитель");
			СтруктураРеквизитов.Вставить("Марка", 							"Марка");
			СтруктураРеквизитов.Вставить("ТипСрокаДействия", 				"ТипСрокаДействия");
			СтруктураРеквизитов.Вставить("ТоварнаяКатегория", 				"ТоварнаяКатегория");
			СтруктураРеквизитов.Вставить("ВидМехаГИСМ", 					"ВидМехаГИСМ");
			СтруктураРеквизитов.Вставить("КодТНВЭД", 						"КодТНВЭД");
			
			Попытка
				Справочники.Номенклатура.ОбновитьПризнакиНоменклатурыВыборочно(НоменклатураОбъект,СтруктураРеквизитов,Истина);
			Исключение
				//не обрабатываем
			КонецПопытки;
		КонецЕсли;
		// ) 2022.06.08 
		
	Иначе
		//2022.11.11 ( Хеликс.Стоматология: ВидаНоменклатуры нет, но может быть выбрано перечисление ТипНоменклатуры
		Если РеквизитСуществует("Перечисления","ТипыНоменклатуры")
			И ТипЗнч(СтруктураЗаполнения.ВидНоменклатуры) = Тип("ПеречислениеСсылка.ТипыНоменклатуры") Тогда
			СтруктураЗаполнения.Вставить("ТипНоменклатуры",СтруктураЗаполнения.ВидНоменклатуры);
		КонецЕсли;
		// ) 2022.11.11
		
	КонецЕсли;
	// ) 2021.10.08
	
	//E1C-477: При создании новой номенклатуры в карточке кроме стандартных полей заполнять дополнительные:
	//Код ТНВЭД - значением из поля "UnitCode";
	//Идентификатор товара (ЭСФ) - значением из поля "catalogTruId";
	//Комментарий - Создан по данным документа ЭСФ *№ Number* от *Date*.
	Если СтруктураНастроек.ЗаполнениеТЧ_ЗаполнятьДанныеИсточникПроисхождения = Истина Тогда
		СтруктураЗаполнения.Вставить("КодТНВЭД",СтруктураЗаполнения.ДанныеНоменклатурыПортала.esfKzUnitCode);
		СтруктураЗаполнения.Вставить("ИдентификаторТовараЭСФ",СтруктураЗаполнения.ДанныеНоменклатурыПортала.esfKzCatalogTruId);
		
		Комментарий = "Создан по данным документа ЭСФ №" + ТекСтрока.Документ_Номер + " от " + Формат(ТекСтрока.Документ_Дата,"ДФ=dd.MM.yyyy");
		СтруктураЗаполнения.Вставить("Комментарий",Комментарий);
	КонецЕсли;
	
	НоменклатураОбъект.Заполнить(СтруктураЗаполнения);
	
	ЗаполнитьЗначенияСвойств(НоменклатураОбъект,СтруктураЗаполнения);
	
	// ( модуль кастомизации
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("ТекущаяСтрока",ТекСтрока);
	ПараметрыМК.Вставить("АдресХранилищаДанныхПортала",АдресХранилищаДанныхПортала);
	ПараметрыМК.Вставить("СтруктураЗаполнения",СтруктураЗаполнения);
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыМК.Вставить("ДокументИД",СтруктураЗаполнения.ДокументИД);
	ПараметрыМК.Вставить("НаправлениеСоздаваемогоДокумента",НаправлениеСоздаваемогоДокумента);
	ПараметрыМК.Вставить("Объект",НоменклатураОбъект);
	ПараметрыМК.Вставить("Ссылка",Результат);
	ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
	
	РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Сопоставление_Номенклатура_ПередЗаписью",ПараметрыМК);
		
	Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
	// ) модуль кастомизации
	
		Попытка
			НоменклатураОбъект.Записать();
			Результат = НоменклатураОбъект.Ссылка;
		Исключение
			ТекстОшибки = "Запись номенклатуры " + СтруктураЗаполнения.Наименование + ": " + КраткоеОписаниеОшибки(ОписаниеОшибки());
		КонецПопытки;
		
	Иначе
		Результат = ПараметрыМК.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
&НаСервере
Функция СоздатьЭлементСправочника_НоменклатураПоставщика(СтруктураЗаполнения,ТекстОшибки)
	
	ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(СтруктураЗаполнения.ИдентификаторСтроки);
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	НоменклатураПоставщиков_ИмяСправочника = СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_ИмяСправочника;
	
	Результат = Справочники[НоменклатураПоставщиков_ИмяСправочника].ПустаяСсылка();
	
	//2020.03.04 ( E1C-22: При создании новой номенклатуры артикул должен записываться в поле "Артикул"
	Если СтруктураНастроек.Номенклатура_ЗаполнятьАртикулы = Истина Тогда
		Если ЗначениеЗаполнено(ТекСтрока.Номенклатура_Код) Тогда
			СтруктураЗаполнения.Вставить("Артикул",ТекСтрока.Номенклатура_Код);
		КонецЕсли;
	КонецЕсли;
	// ) 2020.03.04
	
	//Владелец уже должен быть на этом этапе
	СтрокиКонтрагента = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ТипОбъекта,ДокументИД","Контрагенты",ТекСтрока.ДокументИД));
	Если СтрокиКонтрагента.Количество() > 0 Тогда
		Если СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_Владелец = "Партнер" Тогда
			СтруктураЗаполнения.Вставить("Владелец",СтрокиКонтрагента[0].Контрагенты_Партнер);
			СтруктураЗаполнения.Вставить("ВладелецНоменклатуры",СтрокиКонтрагента[0].Контрагенты_Партнер);
		ИначеЕсли СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_Владелец = "Контрагент" Тогда
			СтруктураЗаполнения.Вставить("Владелец",СтрокиКонтрагента[0].Объект1с);
		Иначе
			//Отбор по владельцу не будем устанавливать
			СтруктураЗаполнения.Вставить("Владелец");
		КонецЕсли;
	КонецЕсли;
	
	НоменклатураОбъект = Справочники[НоменклатураПоставщиков_ИмяСправочника].СоздатьЭлемент();
	
	//Заполним ИдентификаторНоменклатуры
	Если НоменклатураПоставщиков_ИмяСправочника = "НоменклатураКонтрагентов" Тогда
		Попытка
			ИдентификаторНоменклатуры = Справочники.НоменклатураКонтрагентов.ИдентификаторНоменклатурыКонтрагентаПоНаименованию(СтруктураЗаполнения.Наименование,,СтруктураЗаполнения.НаименованиеУпаковки);
			СтруктураЗаполнения.Вставить("Идентификатор",ИдентификаторНоменклатуры);
			СтруктураЗаполнения.Вставить("ИдентификаторНоменклатуры",ИдентификаторНоменклатуры);
		Исключение
			НоменклатураОбъект.ДополнительныеСвойства.Вставить("ТребуетсяЗаписьПриОбновленииНоменклатурыКонтрагентов",Ложь);
			_3Ф_УстановитьРежимЗаписи_ОбменДаннымиЗагрузка(НоменклатураОбъект);
		КонецПопытки;
	КонецЕсли;
	
	НоменклатураОбъект.Заполнить(СтруктураЗаполнения);
	
	ЗаполнитьЗначенияСвойств(НоменклатураОбъект,СтруктураЗаполнения);
		
	// ( модуль кастомизации
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("ТекущаяСтрока",ТекСтрока);
	ПараметрыМК.Вставить("АдресХранилищаДанныхПортала",АдресХранилищаДанныхПортала);
	ПараметрыМК.Вставить("СтруктураЗаполнения",СтруктураЗаполнения);
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыМК.Вставить("ДокументИД",ТекСтрока.ДокументИД);
	ПараметрыМК.Вставить("НаправлениеСоздаваемогоДокумента",НаправлениеСоздаваемогоДокумента);
	ПараметрыМК.Вставить("Объект",НоменклатураОбъект);
	ПараметрыМК.Вставить("Ссылка",Результат);
	ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
	
	РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Сопоставление_НоменклатураПоставщика_ПередЗаписью",ПараметрыМК);
	
	Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
	// ) модуль кастомизации
	
		Попытка
			НоменклатураОбъект.Записать();
			Результат = НоменклатураОбъект.Ссылка;
		Исключение
			ТекстОшибки = "Запись номенклатуры поставщика " + СтруктураЗаполнения.Наименование + ": " + КраткоеОписаниеОшибки(ОписаниеОшибки());
		КонецПопытки;
		
	Иначе
		Результат = ПараметрыМК.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
&НаСервере
Функция СоздатьЭлементСправочника_ЕдиницаИзмерения(СтруктураЗаполнения,ТекстОшибки)
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Конф = "БП30" Тогда
		
		Результат = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
	
		//В бухгалтерия для Кыргызстана классификатор представлен как дерево значений в xml
		Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KGZ" Тогда
			
			Классификатор = Справочники.КлассификаторЕдиницИзмерения.ПолучитьДанныеКлассификатора();
			
			НайденныеСтроки = Новый Массив;
				
			Если ЗначениеЗаполнено(СтруктураЗаполнения.Наименование)  Тогда //Ищем по наименованию ЕИ
				СтруктураПоиска = Новый Структура("УсловноеОбозначениеНациональное",СтруктураЗаполнения.Наименование);
				НайденныеСтроки = Классификатор.Строки.НайтиСтроки(СтруктураПоиска,Истина);
			КонецЕсли;
			
			Если НайденныеСтроки.Количество() = 0 Тогда //Ищем по коду ЕИ
				СтруктураПоиска = Новый Структура("КодЧисловой",СтруктураЗаполнения.Код);
				НайденныеСтроки = Классификатор.Строки.НайтиСтроки(СтруктураПоиска,Истина);
			КонецЕсли;
			
			Если НайденныеСтроки.Количество() > 0 Тогда
								
				ЕдиницаОбъект = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
				ЕдиницаОбъект.Код = НайденныеСтроки[0].КодЧисловой;
				ЕдиницаОбъект.Наименование = НайденныеСтроки[0].УсловноеОбозначениеНациональное;
				ЕдиницаОбъект.НаименованиеПолное = НайденныеСтроки[0].Наименование; 
				ЕдиницаОбъект.МеждународноеСокращение = НайденныеСтроки[0].КодовоеБуквенноеОбозначениеМеждународное; //в xml-классификаторе кривые международные единицы измерения с переносом
				
				Попытка
					ЕдиницаОбъект.Записать();
					Результат = ЕдиницаОбъект.Ссылка;
				Исключение
					ТекстОшибки = "Запись единицы измерения " + СтруктураЗаполнения.Наименование + ": " + КраткоеОписаниеОшибки(ОписаниеОшибки());
				КонецПопытки;
				
			КонецЕсли;
			
		Иначе
			
			//В БП для Казахстана структура макета Классификатора отличается
			Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
				ТабличныйДокумент = Справочники.КлассификаторЕдиницИзмерения.ПолучитьМакет("ПФ_MXL_КлассификаторЕдиницИзмерения");
				ОбластьКодЭСФ = ТабличныйДокумент.Области.КодЭСФ;
			Иначе
				ТабличныйДокумент = Справочники.КлассификаторЕдиницИзмерения.ПолучитьМакет("КлассификаторЕдиницИзмерения");
			КонецЕсли;
			
			ОбластьКодЧисловой = ТабличныйДокумент.Области.КодЧисловой;
			ОбластьНаименованиеКраткое = ТабличныйДокумент.Области.НаименованиеКраткое;
			ОбластьНаименованиеПолное = ТабличныйДокумент.Области.НаименованиеПолное;
			
			//Сперва поиск выполняем по наименованию, так как пользователь имеет возможность его скорректировать
			Если ЗначениеЗаполнено(СтруктураЗаполнения.Наименование) Тогда			
				ТекущаяОбласть = ТабличныйДокумент.НайтиТекст(СтруктураЗаполнения.Наименование, , ОбластьНаименованиеКраткое, , Истина, , Истина);
			КонецЕсли;
			
			Если ТекущаяОбласть = Неопределено И ЗначениеЗаполнено(СтруктураЗаполнения.Код) Тогда
				ТекущаяОбласть = ТабличныйДокумент.НайтиТекст(СтруктураЗаполнения.Код, , ОбластьКодЧисловой, , Истина, , Истина);
			КонецЕсли;	
					
			Если ТекущаяОбласть <> Неопределено Тогда
				ТабличныйДокумент.ТекущаяОбласть = ТекущаяОбласть;
							
				Код = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьКодЧисловой.Лево, ТекущаяОбласть.Низ, ОбластьКодЧисловой.Право).Текст;
				Наименование = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеКраткое.Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеКраткое.Право).Текст;
				НаименованиеПолное = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеПолное. Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеПолное.Право).Текст;
				
				Если ОбластьКодЭСФ <> Неопределено Тогда
					КодЭСФ = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьКодЭСФ.Лево, ТекущаяОбласть.Низ, ОбластьКодЭСФ.Право).Текст;
				КонецЕсли;
			КонецЕсли;
				
			Если ТекущаяОбласть <> Неопределено Тогда
				СтруктураЗаполнения.Вставить("Код",Код);
				СтруктураЗаполнения.Вставить("Наименование",Наименование);
				СтруктураЗаполнения.Вставить("НаименованиеПолное",НаименованиеПолное);
				СтруктураЗаполнения.Вставить("КодЭСФ",КодЭСФ);
			
				ЕдиницаОбъект = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(ЕдиницаОбъект,СтруктураЗаполнения);
				
				Попытка
					ЕдиницаОбъект.Записать();
					Результат = ЕдиницаОбъект.Ссылка;
				Исключение
					ТекстОшибки = "Запись единицы измерения " + СтруктураЗаполнения.Наименование + ": " + КраткоеОписаниеОшибки(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Конф = "УТ11" Или Конф = "КА2" Или Конф = "ERP" Тогда
		
		Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Полн = "УТ11.1" Тогда
			Результат = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
			
			//Поищем созданную ранее, чтобы не создавать одинаковых единиц измерения
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЕдиницыИзмерения.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
			               |ГДЕ
			               |	ЕдиницыИзмерения.Код = &Код";
			Запрос.УстановитьПараметр("Код",СтруктураЗаполнения.Код);
			
			Выборка = Запрос.Выполнить().Выбрать();
					
			Если Выборка.Следующий() Тогда 
				Результат = Выборка.Ссылка;
				
			Иначе
				
				//создание упаковки единицы измерения в УТ 11.1
				Классификатор = Справочники.ЕдиницыИзмерения.ПолучитьДанныеКлассификатора();
				
				НайденныеСтроки = Новый Массив;
				
				Если ЗначениеЗаполнено(СтруктураЗаполнения.Наименование)  Тогда //Ищем по наименованию ЕИ
					СтруктураПоиска = Новый Структура("УсловноеОбозначениеНациональное",СтруктураЗаполнения.Наименование);
					НайденныеСтроки = Классификатор.Строки.НайтиСтроки(СтруктураПоиска,Истина);
				КонецЕсли;
				
				Если НайденныеСтроки.Количество() = 0 Тогда //Ищем по коду ЕИ
					СтруктураПоиска = Новый Структура("КодЧисловой",СтруктураЗаполнения.Код);
					НайденныеСтроки = Классификатор.Строки.НайтиСтроки(СтруктураПоиска,Истина);
				КонецЕсли;
				
				Если НайденныеСтроки.Количество() > 0 Тогда
									
					ЕдиницаОбъект = Справочники.УпаковкиЕдиницыИзмерения.СоздатьЭлемент();
					ЕдиницаОбъект.Владелец = Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения;
					ЕдиницаОбъект.Код = НайденныеСтроки[0].КодЧисловой;
					ЕдиницаОбъект.Наименование = НайденныеСтроки[0].УсловноеОбозначениеНациональное;
					ЕдиницаОбъект.НаименованиеПолное = НайденныеСтроки[0].Наименование; 
					ЕдиницаОбъект.МеждународноеСокращение = НайденныеСтроки[0].КодовоеБуквенноеОбозначениеМеждународное; //в xml-классификаторе кривые международные единицы измерения с переносом
					
					Попытка
						ЕдиницаОбъект.Записать();
						Результат = ЕдиницаОбъект.Ссылка;
					Исключение
						ТекстОшибки = "Запись единицы измерения " + СтруктураЗаполнения.Наименование + ": " + КраткоеОписаниеОшибки(ОписаниеОшибки());
					КонецПопытки;
					
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			Результат = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
			
			//Поищем созданную ранее, чтобы не создавать одинаковых единиц измерения
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
			               |ГДЕ
			               |	УпаковкиЕдиницыИзмерения.Код = &Код
			               |	И УпаковкиЕдиницыИзмерения.Владелец = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.БазовыеЕдиницыИзмерения)";
			Запрос.УстановитьПараметр("Код",СтруктураЗаполнения.Код);
			
			Выборка = Запрос.Выполнить().Выбрать();
					
			Если Выборка.Следующий() Тогда 
				Результат = Выборка.Ссылка;
				
			Иначе
				
				//создание упаковки единицы измерения в УТ 11.2+
				Классификатор = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьДанныеКлассификатора();
				
				НайденныеСтроки = Новый Массив;
				
				Если ЗначениеЗаполнено(СтруктураЗаполнения.Наименование)  Тогда //Ищем по наименованию ЕИ
					СтруктураПоиска = Новый Структура("УсловноеОбозначениеНациональное",СтруктураЗаполнения.Наименование);
					НайденныеСтроки = Классификатор.Строки.НайтиСтроки(СтруктураПоиска,Истина);
				КонецЕсли;
				
				Если НайденныеСтроки.Количество() = 0 Тогда //Ищем по коду ЕИ
					СтруктураПоиска = Новый Структура("КодЧисловой",СтруктураЗаполнения.Код);
					НайденныеСтроки = Классификатор.Строки.НайтиСтроки(СтруктураПоиска,Истина);
				КонецЕсли;
				
				Если НайденныеСтроки.Количество() > 0 Тогда
									
					ЕдиницаОбъект = Справочники.УпаковкиЕдиницыИзмерения.СоздатьЭлемент();
					ЕдиницаОбъект.Владелец = Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения;
					ЕдиницаОбъект.Код = НайденныеСтроки[0].КодЧисловой;
					ЕдиницаОбъект.Наименование = НайденныеСтроки[0].УсловноеОбозначениеНациональное;
					ЕдиницаОбъект.НаименованиеПолное = НайденныеСтроки[0].Наименование; 
					ЕдиницаОбъект.МеждународноеСокращение = НайденныеСтроки[0].КодовоеБуквенноеОбозначениеМеждународное; //в xml-классификаторе кривые международные единицы измерения с переносом
					
					Попытка
						ЕдиницаОбъект.Записать();
						Результат = ЕдиницаОбъект.Ссылка;
					Исключение
						ТекстОшибки = "Запись единицы измерения " + СтруктураЗаполнения.Наименование + ": " + КраткоеОписаниеОшибки(ОписаниеОшибки());
					КонецПопытки;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Конф = "УНФ" Или Конф = "РОЗН3" Тогда
		Результат = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
	
		//создание упаковки единицы измерения в УНФ
		Классификатор = Справочники.КлассификаторЕдиницИзмерения.ПолучитьДанныеКлассификатора();
		
		НайденныеСтроки = Новый Массив;
		
		Если ЗначениеЗаполнено(СтруктураЗаполнения.Наименование) Тогда //Ищем по наименованию ЕИ
			СтруктураПоиска = Новый Структура("УсловноеОбозначениеНациональное",СтруктураЗаполнения.Наименование);
			НайденныеСтроки = Классификатор.Строки.НайтиСтроки(СтруктураПоиска,Истина);
		КонецЕсли;
		
		Если НайденныеСтроки.Количество() = 0 Тогда //Ищем по коду ЕИ
			СтруктураПоиска = Новый Структура("КодЧисловой",СтруктураЗаполнения.Код);
			НайденныеСтроки = Классификатор.Строки.НайтиСтроки(СтруктураПоиска,Истина);
		КонецЕсли;
				
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтруктураЗаполнения.Вставить("Код",СокрЛП(НайденныеСтроки[0].КодЧисловой));
			СтруктураЗаполнения.Вставить("Наименование",СтрЗаменить(НайденныеСтроки[0].УсловноеОбозначениеНациональное,Символы.ПС, "/"));
			СтруктураЗаполнения.Вставить("НаименованиеПолное",СтрЗаменить(НайденныеСтроки[0].Наименование,Символы.ПС,"/"));
			СтруктураЗаполнения.Вставить("МеждународноеСокращение",СтрЗаменить(НайденныеСтроки[0].КодовоеБуквенноеОбозначениеМеждународное, Символы.ПС, "/"));
			
			Если ЗначениеЗаполнено(НайденныеСтроки[0].ТипИзмеряемойВеличины) Тогда
				СтруктураЗаполнения.Вставить("ТипИзмеряемойВеличины",Перечисления.ТипыИзмеряемыхВеличин[НайденныеСтроки[0].ТипИзмеряемойВеличины]);
			КонецЕсли;
		
			ЕдиницаОбъект = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(ЕдиницаОбъект,СтруктураЗаполнения);
			
			Попытка
				ЕдиницаОбъект.Записать();
				Результат = ЕдиницаОбъект.Ссылка;
			Исключение
				ТекстОшибки = "Запись единицы измерения " + СтруктураЗаполнения.Наименование + ": " + КраткоеОписаниеОшибки(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
	//2021.03.31 (	
	ИначеЕсли Конф = "ITОтдел" Тогда
		Результат = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
		
		ЕдиницаОбъект = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(ЕдиницаОбъект,СтруктураЗаполнения);
		
		Попытка
			ЕдиницаОбъект.Записать();
			Результат = ЕдиницаОбъект.Ссылка;
		Исключение
			ТекстОшибки = "Запись единицы измерения " + СтруктураЗаполнения.Наименование + ": " + КраткоеОписаниеОшибки(ОписаниеОшибки());
		КонецПопытки;		
	// ) 2021.03.31
	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
&НаСервере
Функция СоздатьЭлементСправочника_НомерГТД(СтруктураЗаполнения,ТекстОшибки)
	
	ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(СтруктураЗаполнения.ИдентификаторСтроки);
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Метаданные.Справочники.Найти("НомераГТД") = Неопределено Тогда
		Результат = СтруктураЗаполнения.Код;
	Иначе
		Результат = Справочники.НомераГТД.НайтиПоКоду(СтруктураЗаполнения.Код);
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			НомерГТДОбъект = Справочники.НомераГТД.СоздатьЭлемент(); 		
			
			//2019.09.25 ( УНФ: Отключаем контроль
			СтруктураЗаполнения.Вставить("ДопускаетсяЗаписьСОшибкой",Истина);
			// ) 2019.09.25
			
			//2023.12.15 ( В этом же справочнике хранятся номера РНПТ
			Если РеквизитСуществует("Перечисления","ТипыНомеровГТД","НомерГТД") Тогда
				СтруктураЗаполнения.Вставить("ТипНомераГТД",Перечисления.ТипыНомеровГТД.НомерГТД);
			КонецЕсли;
			// ) 2023.12.15
			
			ЗаполнитьЗначенияСвойств(НомерГТДОбъект,СтруктураЗаполнения);
			
			// ( модуль кастомизации
			ПараметрыМК = Новый Структура;
			ПараметрыМК.Вставить("ТекущаяСтрока",ТекСтрока);
			ПараметрыМК.Вставить("АдресХранилищаДанныхПортала",АдресХранилищаДанныхПортала);
			ПараметрыМК.Вставить("СтруктураЗаполнения",СтруктураЗаполнения);
			ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
			ПараметрыМК.Вставить("ДокументИД",СтруктураЗаполнения.ДокументИД);
			ПараметрыМК.Вставить("НаправлениеСоздаваемогоДокумента",НаправлениеСоздаваемогоДокумента);
			ПараметрыМК.Вставить("Объект",НомерГТДОбъект);
			ПараметрыМК.Вставить("Ссылка",Результат);
			ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
			
			РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Сопоставление_НомерГТД_ПередЗаписью",ПараметрыМК);
			
			Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
			// ) модуль кастомизации
			
				Попытка
					НомерГТДОбъект.Записать();
					Результат = НомерГТДОбъект.Ссылка;
				Исключение
					ТекстОшибки = "Запись номера ГТД " + СтруктураЗаполнения.Код + ": " + КраткоеОписаниеОшибки(ОписаниеОшибки());
				КонецПопытки;
				
			Иначе
				Результат = ПараметрыМК.Ссылка;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции
&НаСервере
Функция СоздатьЭлементСправочника_СтранаМира(СтруктураЗаполнения,ТекстОшибки)
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	СправочникСтраныМира = СтруктураНастроек.СведенияОКонфигурации.СправочникСтраныМира;
				
	Если ЗначениеЗаполнено(СправочникСтраныМира) Тогда
		Если ЗначениеЗаполнено(СтруктураЗаполнения.Код) Тогда
			Результат = Справочники[СправочникСтраныМира].НайтиПоКоду(СтруктураЗаполнения.Код,Истина);
		КонецЕсли;
		
		//Если не нашли страну по коду - повторим поиск по наименованию
		Если Не ЗначениеЗаполнено(Результат) И ЗначениеЗаполнено(СтруктураЗаполнения.Наименование) Тогда
			Результат = Справочники[СправочникСтраныМира].НайтиПоНаименованию(СтруктураЗаполнения.Наименование,Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
	
		Если РеквизитСуществует("Справочники","СтраныМира") Тогда
			
			Результат = Справочники.СтраныМира.ПустаяСсылка();
			
			Макет = Справочники.СтраныМира.ПолучитьМакет("Классификатор");
			
			Чтение = Новый ЧтениеXML;
			Чтение.УстановитьСтроку(Макет.ПолучитьТекст());
			
			ТаблицаСтран = СериализаторXDTO.ПрочитатьXML(Чтение);
			
			Если ЗначениеЗаполнено(СтруктураЗаполнения.Код) Тогда
				НайденнаяСтрока = ТаблицаСтран.Найти(СтруктураЗаполнения.Код);
			КонецЕсли;
			
			Если НайденнаяСтрока = Неопределено Тогда
				Если ЗначениеЗаполнено(СтруктураЗаполнения.Наименование) Тогда
					НайденнаяСтрока = ТаблицаСтран.Найти(СтруктураЗаполнения.Наименование);
				КонецЕсли;
			КонецЕсли;
			
			//2019.04.18 ( Обрабатываем возможно отсутствующие элементы классификатора
			Если НайденнаяСтрока = Неопределено Тогда
				НайденнаяСтрока = РеквизитОбъект.Классификатор_ПолучитьСтрануМира(СтруктураЗаполнения);
			КонецЕсли;
			// ) 2019.04.18
			
			Если НайденнаяСтрока <> Неопределено Тогда
				СтруктураЗаполнения.Вставить("Код",НайденнаяСтрока.Код);
				СтруктураЗаполнения.Вставить("Наименование",НайденнаяСтрока.Наименование);
				СтруктураЗаполнения.Вставить("НаименованиеПолное",НайденнаяСтрока.НаименованиеПолное);
				СтруктураЗаполнения.Вставить("КодАльфа2",НайденнаяСтрока.КодАльфа2);
				СтруктураЗаполнения.Вставить("КодАльфа3",НайденнаяСтрока.КодАльфа3);
			
				СтранаОбъект = Справочники.СтраныМира.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(СтранаОбъект,СтруктураЗаполнения);
			КонецЕсли;
			
			
		ИначеЕсли РеквизитСуществует("Справочники","КлассификаторСтранМира") Тогда
		
			Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
				ТабличныйДокумент = Справочники.КлассификаторСтранМира.ПолучитьМакет("ПФ_MXL_КлассификаторСтранМира");
			КонецЕсли;
			
			ОбластьКодЧисловой = ТабличныйДокумент.Области.КодЧисловой;
			ОбластьНаименованиеКраткое = ТабличныйДокумент.Области.НаименованиеКраткое;
			ОбластьНаименованиеПолное = ТабличныйДокумент.Области.НаименованиеПолное;
			ОбластьКодАльфа2 = ТабличныйДокумент.Области.КодАльфа2;
			ОбластьКодАльфа3 = ТабличныйДокумент.Области.КодАльфа3;
			
			Если ЗначениеЗаполнено(СтруктураЗаполнения.Код) Тогда
				ТекущаяОбласть = ТабличныйДокумент.НайтиТекст(СтруктураЗаполнения.Код, , ОбластьКодЧисловой, , Истина, , Истина);
			КонецЕсли;
			
			Если ТекущаяОбласть = Неопределено Тогда
				Если ЗначениеЗаполнено(СтруктураЗаполнения.Наименование) Тогда
					ТекущаяОбласть = ТабличныйДокумент.НайтиТекст(СтруктураЗаполнения.Наименование, , ОбластьНаименованиеКраткое, , Истина, , Истина);
				КонецЕсли;
			КонецЕсли;	
					
			Если ТекущаяОбласть <> Неопределено Тогда
				ТабличныйДокумент.ТекущаяОбласть = ТекущаяОбласть;
							
				Код = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьКодЧисловой.Лево, ТекущаяОбласть.Низ, ОбластьКодЧисловой.Право).Текст;
				Наименование = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеКраткое.Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеКраткое.Право).Текст;
				НаименованиеПолное = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеПолное. Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеПолное.Право).Текст;
				КодАльфа2 = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьКодАльфа2. Лево, ТекущаяОбласть.Низ, ОбластьКодАльфа2.Право).Текст;
				КодАльфа3 = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьКодАльфа3. Лево, ТекущаяОбласть.Низ, ОбластьКодАльфа3.Право).Текст;
				
			КонецЕсли;
				
			Если ТекущаяОбласть <> Неопределено Тогда
				СтруктураЗаполнения.Вставить("Код",Код);
				СтруктураЗаполнения.Вставить("Наименование",Наименование);
				СтруктураЗаполнения.Вставить("НаименованиеПолное",НаименованиеПолное);
				СтруктураЗаполнения.Вставить("КодАльфа2",КодАльфа2);
				СтруктураЗаполнения.Вставить("КодАльфа3",КодАльфа3);
			
				СтранаОбъект = Справочники.КлассификаторСтранМира.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(СтранаОбъект,СтруктураЗаполнения);
				
			КонецЕсли;
		КонецЕсли;	
					
		// ( модуль кастомизации
		ПараметрыМК = Новый Структура;
		ПараметрыМК.Вставить("АдресХранилищаДанныхПортала",АдресХранилищаДанныхПортала);
		ПараметрыМК.Вставить("СтруктураЗаполнения",СтруктураЗаполнения);
		ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
		ПараметрыМК.Вставить("ДокументИД",СтруктураЗаполнения.ДокументИД);
		ПараметрыМК.Вставить("НаправлениеСоздаваемогоДокумента",НаправлениеСоздаваемогоДокумента);
		ПараметрыМК.Вставить("Объект",СтранаОбъект);
		ПараметрыМК.Вставить("Ссылка",Результат);
		ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
		
		РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Сопоставление_СтранаМира_ПередЗаписью",ПараметрыМК);
		
		Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
		// ) модуль кастомизации
		
			Если СтранаОбъект <> Неопределено Тогда
				Попытка
					СтранаОбъект.Записать();
					Результат = СтранаОбъект.Ссылка;
				Исключение
					ТекстОшибки = "Запись страны " + СтруктураЗаполнения.Наименование + ": " + КраткоеОписаниеОшибки(ОписаниеОшибки());
				КонецПопытки;
				
			КонецЕсли;
		Иначе
			Результат = ПараметрыМК.Ссылка;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
&НаСервере
Функция СоздатьЭлементСправочника_ОсновноеСредство(СтруктураЗаполнения,ТекстОшибки)
	
	ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(СтруктураЗаполнения.ИдентификаторСтроки);
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
		
	Результат = Справочники.ОсновныеСредства.ПустаяСсылка();
	
	СтруктураЗаполнения.Вставить("НаименованиеПолное",ТекСтрока.ОсновныеСредства_НаименованиеПолное);
	СтруктураЗаполнения.Вставить("Изготовитель",ТекСтрока.ОсновныеСредства_Изготовитель);
	СтруктураЗаполнения.Вставить("ЗаводскойНомер",ТекСтрока.ОсновныеСредства_ЗаводскойНомер);
	СтруктураЗаполнения.Вставить("НомерПаспорта",ТекСтрока.ОсновныеСредства_НомерПаспорта);
	СтруктураЗаполнения.Вставить("ДатаВыпуска",ТекСтрока.ОсновныеСредства_ДатаВыпуска);
	СтруктураЗаполнения.Вставить("КодПоОКОФ",ТекСтрока.ОсновныеСредства_КодПоОКОФ);
	СтруктураЗаполнения.Вставить("ГруппаОС",ТекСтрока.ОсновныеСредства_ГруппаОС);
	СтруктураЗаполнения.Вставить("АмортизационнаяГруппа",ТекСтрока.ОсновныеСредства_АмортизационнаяГруппа);
	СтруктураЗаполнения.Вставить("ТипОС",ТекСтрока.ОсновныеСредства_ТипОС);
	СтруктураЗаполнения.Вставить("ЕдиницаУчета",ТекСтрока.ОсновныеСредства_ЕдиницаУчета);
	
	Родитель = ТекСтрока.ОсновныеСредства_Родитель;
	Если ЗначениеЗаполнено(Родитель) И Родитель.ЭтоГруппа Тогда
		СтруктураЗаполнения.Вставить("Родитель",Родитель);
	КонецЕсли;
	
	ОсновноеСредствоОбъект = Справочники.ОсновныеСредства.СоздатьЭлемент();
		
	ОсновноеСредствоОбъект.Заполнить(СтруктураЗаполнения);
	
	ЗаполнитьЗначенияСвойств(ОсновноеСредствоОбъект,СтруктураЗаполнения);
		
	// ( модуль кастомизации
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("ТекущаяСтрока",ТекСтрока);
	ПараметрыМК.Вставить("АдресХранилищаДанныхПортала",АдресХранилищаДанныхПортала);
	ПараметрыМК.Вставить("СтруктураЗаполнения",СтруктураЗаполнения);
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыМК.Вставить("ДокументИД",ТекСтрока.ДокументИД);
	ПараметрыМК.Вставить("НаправлениеСоздаваемогоДокумента",НаправлениеСоздаваемогоДокумента);
	ПараметрыМК.Вставить("Объект",ОсновноеСредствоОбъект);
	ПараметрыМК.Вставить("Ссылка",Результат);
	ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
	
	РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Сопоставление_ОсновноеСредство_ПередЗаписью",ПараметрыМК);
	
	Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
	// ) модуль кастомизации
	
		Попытка
			ОсновноеСредствоОбъект.Записать();
			Результат = ОсновноеСредствоОбъект.Ссылка;
		Исключение
			ТекстОшибки = "Запись основного средства " + СтруктураЗаполнения.Наименование + ": " + КраткоеОписаниеОшибки(ОписаниеОшибки());
		КонецПопытки;
		
	Иначе
		Результат = ПараметрыМК.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
&НаСервере
Функция СоздатьЭлементСправочника_ИсточникПроисхождения(СтруктураЗаполнения,ТекстОшибки)
	
	ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(СтруктураЗаполнения.ИдентификаторСтроки);
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Метаданные.Справочники.Найти("НомераГТД") = Неопределено Тогда
		Результат = СтруктураЗаполнения.Код;
	Иначе
		
		ПараметрыПоиска = Новый Структура("Код,КодТНВЭД,НомерСтрокиГТД",
			ТекСтрока.ИсточникиПроисхождения_Код,ТекСтрока.ИсточникиПроисхождения_КодТНВЭД,ТекСтрока.ИсточникиПроисхождения_НомерСтрокиГТД);
		Результат = РеквизитОбъект.ПолучитьСсылку_ИсточникПроисхождения(ПараметрыПоиска);
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			НомерГТДОбъект = Справочники.НомераГТД.СоздатьЭлемент(); 		
			
			СтруктураЗаполнения.Вставить("СтранаПроисхожденияТовара",ТекСтрока.ИсточникиПроисхождения_СтранаПроисхождения);
			СтруктураЗаполнения.Вставить("СпособПроисхожденияТовара",ТекСтрока.ИсточникиПроисхождения_СпособПроисхождения);
			СтруктураЗаполнения.Вставить("ПризнакПроисхождения",ТекСтрока.ИсточникиПроисхождения_ПризнакПроисхождения);
			СтруктураЗаполнения.Вставить("НомерСтрокиГТД",ТекСтрока.ИсточникиПроисхождения_НомерСтрокиГТД);
			СтруктураЗаполнения.Вставить("КодТНВЭД",ТекСтрока.ИсточникиПроисхождения_КодТНВЭД);
			
			СтруктураЗаполнения.Вставить("Комментарий","#Создан автоматически при загрузке из сервиса Entera.pro");
			
			ЗаполнитьЗначенияСвойств(НомерГТДОбъект,СтруктураЗаполнения);
			
			// ( модуль кастомизации
			ПараметрыМК = Новый Структура;
			ПараметрыМК.Вставить("ТекущаяСтрока",ТекСтрока);
			ПараметрыМК.Вставить("АдресХранилищаДанныхПортала",АдресХранилищаДанныхПортала);
			ПараметрыМК.Вставить("СтруктураЗаполнения",СтруктураЗаполнения);
			ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
			ПараметрыМК.Вставить("ДокументИД",СтруктураЗаполнения.ДокументИД);
			ПараметрыМК.Вставить("НаправлениеСоздаваемогоДокумента",НаправлениеСоздаваемогоДокумента);
			ПараметрыМК.Вставить("Объект",НомерГТДОбъект);
			ПараметрыМК.Вставить("Ссылка",Результат);
			ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
			
			РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Сопоставление_ИсточникПроисхождения_ПередЗаписью",ПараметрыМК);
			
			Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
			// ) модуль кастомизации
			
				Попытка
					НомерГТДОбъект.Записать();
					Результат = НомерГТДОбъект.Ссылка;
				Исключение
					ТекстОшибки = "Запись номера ГТД " + СтруктураЗаполнения.Код + ": " + КраткоеОписаниеОшибки(ОписаниеОшибки());
				КонецПопытки;
				
			Иначе
				Результат = ПараметрыМК.Ссылка;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаписатьСоответствиеНоменклатуры(НоменклатураСсылка,ХарактеристикаСсылка,Наименование,КонтрагентИД)
	
	//таблица хранится по исходной схеме в настройках текущего пользователя
	СвязьНоменклатуры = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СвязьНоменклатуры");
	
	Если СвязьНоменклатуры = Неопределено Тогда
		СвязьНоменклатуры = Новый ТаблицаЗначений;
		СвязьНоменклатуры.Колонки.Добавить("Ссылка");
		СвязьНоменклатуры.Колонки.Добавить("Наименование");
		СвязьНоменклатуры.Колонки.Добавить("КонтрагентИД");
	КонецЕсли;
	
	//2020.01.13 ( добавлена работа с характеристиками
	Если СвязьНоменклатуры.Колонки.Найти("Характеристика") = Неопределено Тогда
		СвязьНоменклатуры.Колонки.Добавить("Характеристика");
	КонецЕсли;
	// ) 2020.01.13
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Наименование",Наименование);
	СтруктураПоиска.Вставить("КонтрагентИД",КонтрагентИД);
	
	НайденныеСтроки = СвязьНоменклатуры.НайтиСтроки(СтруктураПоиска);
	
	Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = СвязьНоменклатуры.Добавить();
			ТекстОповещения = "Связь номенклатуры добавлена";
		Иначе
			НоваяСтрока = НайденныеСтроки[0];
			ТекстОповещения = "Связь номенклатуры обновлена"
		КонецЕсли;
		
		НоваяСтрока.Ссылка = НоменклатураСсылка;
		НоваяСтрока.Наименование = Наименование;
		НоваяСтрока.КонтрагентИД = КонтрагентИД;
		НоваяСтрока.Характеристика = ХарактеристикаСсылка;
		
	Иначе
		Если НайденныеСтроки.Количество() > 0 Тогда
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				СвязьНоменклатуры.Удалить(НайденнаяСтрока);
			КонецЦикла;		
			ТекстОповещения = "Связь номенклатуры очищена";
		КонецЕсли;
	КонецЕсли;
	
	//сохраняем по исходной схеме, в настройках пользователя
	ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","СвязьНоменклатуры",СвязьНоменклатуры);
	
	Возврат ТекстОповещения;
	
КонецФункции
&НаСервере
Функция ЗаписатьСоответствиеКонтрагента(Ссылка,Наименование,НаименованиеПолное)
		
	//Получаем таблицу соответствий
	СвязьКонтрагентов = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СвязьКонтрагентов");
	
	Если СвязьКонтрагентов = Неопределено Тогда
		СвязьКонтрагентов = Новый ТаблицаЗначений;
		СвязьКонтрагентов.Колонки.Добавить("Ссылка");
		СвязьКонтрагентов.Колонки.Добавить("Наименование");
		СвязьКонтрагентов.Колонки.Добавить("НаименованиеПолное");
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Наименование",Наименование);
	
	НайденныеСтроки = СвязьКонтрагентов.НайтиСтроки(СтруктураПоиска);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = СвязьКонтрагентов.Добавить();
			ТекстОповещения = "Связь контрагента добавлена";
		Иначе
			НоваяСтрока = НайденныеСтроки[0];
			ТекстОповещения = "Связь контрагента обновлена"
		КонецЕсли;
		
		НоваяСтрока.Ссылка = Ссылка;
		НоваяСтрока.Наименование = Наименование;
		НоваяСтрока.НаименованиеПолное = НаименованиеПолное;
		
	Иначе
		Если НайденныеСтроки.Количество() > 0 Тогда
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				СвязьКонтрагентов.Удалить(НайденнаяСтрока);
			КонецЦикла;		
			ТекстОповещения = "Связь контрагента очищена";
		КонецЕсли;
	КонецЕсли;
	
	//сохраняем по исходной схеме, в настройках пользователя
	ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","СвязьКонтрагентов",СвязьКонтрагентов);
	
	Возврат ТекстОповещения;
	
КонецФункции
&НаСервере
Функция ЗаписатьСоответствиеОрганизации(Ссылка,Наименование,НаименованиеПолное)
		
	//Получаем таблицу соответствий
	СвязьОрганизаций = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СвязьОрганизаций");
	
	Если СвязьОрганизаций = Неопределено Тогда
		СвязьОрганизаций = Новый ТаблицаЗначений;
		СвязьОрганизаций.Колонки.Добавить("Ссылка");
		СвязьОрганизаций.Колонки.Добавить("Наименование");
		СвязьОрганизаций.Колонки.Добавить("НаименованиеПолное");
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Наименование",Наименование);
	
	НайденныеСтроки = СвязьОрганизаций.НайтиСтроки(СтруктураПоиска);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = СвязьОрганизаций.Добавить();
			ТекстОповещения = "Связь организации добавлена";
		Иначе
			НоваяСтрока = НайденныеСтроки[0];
			ТекстОповещения = "Связь организации обновлена"
		КонецЕсли;
		
		НоваяСтрока.Ссылка = Ссылка;
		НоваяСтрока.Наименование = Наименование;
		НоваяСтрока.НаименованиеПолное = НаименованиеПолное;
		
	Иначе
		Если НайденныеСтроки.Количество() > 0 Тогда
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				СвязьОрганизаций.Удалить(НайденнаяСтрока);
			КонецЦикла;		
			ТекстОповещения = "Связь организации очищена";
		КонецЕсли;
	КонецЕсли;
	
	//сохраняем по исходной схеме, в настройках пользователя
	ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","СвязьОрганизаций",СвязьОрганизаций);
	
	Возврат ТекстОповещения;
	
КонецФункции
&НаСервере
Функция ЗаписатьСоответствиеЕдиницыИзмерения(ИдентификаторСтроки)
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	
	СтрокаТаблицы = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	НоменклатураСсылка = СтрокаТаблицы.Объект1с;
	НаименованиеНоменклатуры = СтрокаТаблицы.Номенклатура_НаименованиеПолное;
	КонтрагентИД = СтрокаТаблицы.КонтрагентИД;
	Наименование = СтрокаТаблицы.Номенклатура_ЕдиницаИзмеренияПредставление;
	ЕдиницаИзмеренияСсылка = СтрокаТаблицы.Номенклатура_ЕдиницаИзмерения;
	КоэффициентПересчета = СтрокаТаблицы.Номенклатура_КоэффициентПересчета;	
	
	//возможно, таблица хранится по исходной схеме в настройках текущего пользователя
	СвязьЕдиницы = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СвязьЕдиницыИзмерения");
	
	Если СвязьЕдиницы = Неопределено Тогда
		//Номенклатура + Контрагент + РаспознаннаяЕдиница (строка) -> Коэффициент + Конечная единица?
		СвязьЕдиницы = Новый ТаблицаЗначений;
		СвязьЕдиницы.Колонки.Добавить("НоменклатураСсылка");
		СвязьЕдиницы.Колонки.Добавить("НаименованиеНоменклатуры");
		СвязьЕдиницы.Колонки.Добавить("КонтрагентИД");
		СвязьЕдиницы.Колонки.Добавить("Наименование");		
		СвязьЕдиницы.Колонки.Добавить("Ссылка");
		СвязьЕдиницы.Колонки.Добавить("КоэффициентПересчета");
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Наименование",Наименование);
	СтруктураПоиска.Вставить("КонтрагентИД",КонтрагентИД);
	
	Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда
		СтруктураПоиска.Вставить("НоменклатураСсылка",НоменклатураСсылка);
	Иначе
		СтруктураПоиска.Вставить("НаименованиеНоменклатуры",НаименованиеНоменклатуры);
	КонецЕсли;
	
	НайденныеСтроки = СвязьЕдиницы.НайтиСтроки(СтруктураПоиска);
	
	Если ЗначениеЗаполнено(ЕдиницаИзмеренияСсылка)
		//E1C-494: Для УТ11, КА2, ERP сохраняем сопоставление даже с пустой единицей,
		//так как пустое значение ЕИ в документе определяет использование единицы хранения Номенклатуры
		Или (Конф = "УТ11" Или Конф = "ERP" Или Конф = "КА2") Тогда
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = СвязьЕдиницы.Добавить();
			ТекстОповещения = "Связь единицы измерения добавлена";
		Иначе
			НоваяСтрока = НайденныеСтроки[0];
			ТекстОповещения = "Связь единицы измерения обновлена"
		КонецЕсли;
		
		НоваяСтрока.НоменклатураСсылка = НоменклатураСсылка;
		НоваяСтрока.НаименованиеНоменклатуры = НаименованиеНоменклатуры;
		НоваяСтрока.КонтрагентИД = КонтрагентИД;
		НоваяСтрока.Наименование = Наименование;
		НоваяСтрока.Ссылка = ЕдиницаИзмеренияСсылка;
		НоваяСтрока.КоэффициентПересчета = КоэффициентПересчета;
		
	Иначе
		Если НайденныеСтроки.Количество() > 0 Тогда
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				СвязьЕдиницы.Удалить(НайденнаяСтрока);
			КонецЦикла;		
			ТекстОповещения = "Связь единицы измерения очищена";
		КонецЕсли;
	КонецЕсли;
	
	//сохраняем по исходной схеме, в настройках пользователя
	ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","СвязьЕдиницыИзмерения",СвязьЕдиницы);
	
	Возврат ТекстОповещения;
КонецФункции

&НаСервереБезКонтекста
Функция ПредзаполнитьНовыйОбъект(ОбъектФормы,СтруктураНастроек,АдресХранилищаДанныхПортала,ДокументИД,ПараметрыЗаполнения)
	
	СтруктураЗаполнения = ПолучитьСтруктуруЗаполненияНовогоОбъекта(СтруктураНастроек,АдресХранилищаДанныхПортала,ДокументИД,ПараметрыЗаполнения);
	ЗаполнитьЗначенияСвойств(ОбъектФормы,СтруктураЗаполнения);
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	
	//2020.03.12 ( при работе с характеристиками в УТ11 может потребоваться заполнение владельца характеристики по виду номенклатуры
	Если ПараметрыЗаполнения.ТипОбъекта = "Номенклатура" Тогда
		Если Конф = "УТ11" Или Конф = "ERP" Или Конф = "КА2" Тогда
			Если ЗначениеЗаполнено(ОбъектФормы.ВидНоменклатуры) Тогда
				
				Попытка
					Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(ОбъектФормы);
				Исключение
					//Не обрабатываем
				КонецПопытки;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// ) 2020.03.12
	
	//На всякий случай вернем структуру заполнения, если потребуется дозаполнение реквизитов формы на клиенте
	Возврат СтруктураЗаполнения;
	
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьСтруктуруЗаполненияНовогоОбъекта(СтруктураНастроек,АдресХранилищаДанныхПортала,ДокументИД,ПараметрыЗаполнения)
	
	ИдентификаторОбъекта = ПараметрыЗаполнения.ИдентификаторОбъекта;
	ТипОбъекта = ПараметрыЗаполнения.ТипОбъекта;
	ДополнительноеОписаниеОбъекта = ПараметрыЗаполнения.ДополнительноеОписаниеОбъекта;
	НаправлениеСоздаваемогоДокумента = ПараметрыЗаполнения.НаправлениеСоздаваемогоДокумента;
	ПользовательскиеПараметрыЗаполнения = ПараметрыЗаполнения.ПользовательскиеПараметрыЗаполнения;
		
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
				
	ДанныеДокументаПортала = ДанныеПортала.documents.Найти(ДокументИД,"id");
	ДанныеНоменклатурыПортала = ДанныеПортала.documentItems.Найти(ИдентификаторОбъекта,"Id");
	
	Если ТипОбъекта = "Контрагенты" Тогда
		Если НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
			СтруктураЗаполнения = Новый Структура("Наименование,НаименованиеПолное,ИНН,КПП,ИдентификационныйКодЛичности",ДанныеДокументаПортала.supplierShortName,ДанныеДокументаПортала.supplierName,ДанныеДокументаПортала.supplierInn,ДанныеДокументаПортала.supplierKpp,ДанныеДокументаПортала.supplierTaxId);
		Иначе
			СтруктураЗаполнения = Новый Структура("Наименование,НаименованиеПолное,ИНН,КПП,ИдентификационныйКодЛичности",ДанныеДокументаПортала.customerShortName,ДанныеДокументаПортала.customerName,ДанныеДокументаПортала.customerInn,ДанныеДокументаПортала.customerKpp,ДанныеДокументаПортала.customerTaxId);
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = "Договоры" Тогда
		Если НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
			СтруктураЗаполнения = Новый Структура("Наименование,Контрагент,Организация",СтруктураНастроек.ЗаполнениеШапки_НаименованиеНовогоДоговора,ДанныеДокументаПортала.ПоставщикСсылка,ДанныеДокументаПортала.ПлательщикСсылка);
		Иначе
			СтруктураЗаполнения = Новый Структура("Наименование,Контрагент,Организация",СтруктураНастроек.ЗаполнениеШапки_НаименованиеНовогоДоговора,ДанныеДокументаПортала.ПлательщикСсылка,ДанныеДокументаПортала.ПоставщикСсылка);
		КонецЕсли;
		
		СтруктураЗаполнения.Вставить("Номер",ПользовательскиеПараметрыЗаполнения.Номер);
		СтруктураЗаполнения.Вставить("Дата",ПользовательскиеПараметрыЗаполнения.Дата);
		СтруктураЗаполнения.Вставить("Наименование",ПользовательскиеПараметрыЗаполнения.Наименование);
		
	ИначеЕсли ТипОбъекта = "Номенклатура" Тогда	
		ВестиУчетПоГТД = ЗначениеЗаполнено(ДанныеНоменклатурыПортала.recognizedCustomsDeclaration);
		СтруктураЗаполнения = Новый Структура("Наименование,НаименованиеПолное,СтавкаНДС,ЕдиницаИзмерения,ВестиУчетПоГТД",ДанныеНоменклатурыПортала.name,ДанныеНоменклатурыПортала.name,ДанныеНоменклатурыПортала.СтавкаНДССсылка,ДанныеНоменклатурыПортала.ЕдиницаИзмеренияСсылка,ВестиУчетПоГТД);
		
		Если ДополнительноеОписаниеОбъекта = "Услуга" Тогда
			СтруктураЗаполнения.Вставить("ВидНоменклатуры",СтруктураНастроек.Номенклатура_ВидНоменклатурыПоУмолчаниюУслуга);
			СтруктураЗаполнения.Вставить("НоменклатурнаяГруппа",СтруктураНастроек.Номенклатура_НоменклатурнаяГруппаУслуга);
			СтруктураЗаполнения.Вставить("Услуга",Истина);
			Родитель = СтруктураНастроек.Номенклатура_ГруппаСоздаваемойНоменклатурыУслуги;
			
		Иначе
			СтруктураЗаполнения.Вставить("ВидНоменклатуры",СтруктураНастроек.Номенклатура_ВидНоменклатурыПоУмолчаниюТовар);
			СтруктураЗаполнения.Вставить("НоменклатурнаяГруппа",СтруктураНастроек.Номенклатура_НоменклатурнаяГруппаТовар);
			СтруктураЗаполнения.Вставить("Услуга",Ложь);
			Родитель = СтруктураНастроек.Номенклатура_ГруппаСоздаваемойНоменклатуры;
		КонецЕсли;
	
		Если ЗначениеЗаполнено(Родитель) И Родитель.ЭтоГруппа Тогда
			СтруктураЗаполнения.Вставить("Родитель",Родитель);
		КонецЕсли;
		
		Если РеквизитСуществует("Перечисления","ГрадацииКачества","Новый") Тогда
			СтруктураЗаполнения.Вставить("Качество",Перечисления.ГрадацииКачества.Новый);
		КонецЕсли;
		
		Если РеквизитСуществует("Перечисления","ВариантыИспользованияХарактеристикНоменклатуры","НеИспользовать") Тогда
			СтруктураЗаполнения.Вставить("ИспользованиеХарактеристик",Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать);
		КонецЕсли;
		
		Если РеквизитСуществует("Справочники","ВидыНоменклатуры","ГруппаДоступа") Тогда
			СтруктураЗаполнения.Вставить("ГруппаДоступа",СтруктураНастроек.Номенклатура_ВидНоменклатурыПоУмолчаниюТовар.ГруппаДоступа);
		КонецЕсли;
		
		//попробуем предзаполнить единицу измерения
		Если РеквизитСуществует("Справочники","УпаковкиЕдиницыИзмерения") Тогда
			
			Если РеквизитСуществует("Справочники","НаборыУпаковок") Тогда
				
				ВладелецЕдиницы = Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения;
				НайденнаяЕдиница = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду(ДанныеНоменклатурыПортала.recognizedUnitCode,Ложь,,ВладелецЕдиницы);
				
				Если Не ЗначениеЗаполнено(НайденнаяЕдиница) Тогда
					НайденнаяЕдиница = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию(ДанныеНоменклатурыПортала.unitName,Ложь,,ВладелецЕдиницы);
				КонецЕсли;
				
				СтруктураЗаполнения.Вставить("ЕдиницаИзмерения",НайденнаяЕдиница);
				
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = "УпаковкиЕдиницыИзмерения" Тогда
		СтруктураЗаполнения = Новый Структура("Код,Наименование,Номенклатура",ДанныеНоменклатурыПортала.recognizedUnitCode,ДанныеНоменклатурыПортала.unitName,ДанныеНоменклатурыПортала.НоменклатураСсылка);		
			
	ИначеЕсли ТипОбъекта = "НомераГТД" Тогда
		СтруктураЗаполнения = Новый Структура("Код",ДанныеНоменклатурыПортала.recognizedCustomsDeclaration);
			
	ИначеЕсли ТипОбъекта = "СтраныМира" Тогда
		СтруктураЗаполнения = Новый Структура("Код,Наименование",ДанныеНоменклатурыПортала.recognizedCountryCode,ДанныеНоменклатурыПортала.recognizedCountryShortName);
		
	ИначеЕсли ТипОбъекта = "ИсточникиПроисхождения" Тогда
		СтруктураЗаполнения = Новый Структура("Код,КодТНВЭД,НомерСтрокиГТД,ПризнакПроисхождения,НаименованиеТовара,Наименование",
			ДанныеНоменклатурыПортала.esfKzProductDeclaration,ДанныеНоменклатурыПортала.esfKzUnitCode,
			ДанныеНоменклатурыПортала.esfKzProductNumberInDeclaration,ДанныеНоменклатурыПортала.esfKzTruOriginCode,
			ДанныеНоменклатурыПортала.name,ДанныеНоменклатурыПортала.esfKzProductDeclaration);
			
	КонецЕсли;
	
	Возврат СтруктураЗаполнения;
	
КонецФункции
&НаСервереБезКонтекста
Функция РеквизитСуществует(РазделМетаданных, ОбъектМетаданных, ИмяРеквизита = Неопределено, ИмяТабЧасти = Неопределено)
	
	Существует = Ложь;
		
	Если Метаданные[РазделМетаданных].Найти(ОбъектМетаданных) <> Неопределено Тогда
		Если ИмяРеквизита = Неопределено И ИмяТабЧасти = Неопределено Тогда
			Существует = Истина;
		Иначе	
			Если ИмяТабЧасти = Неопределено Тогда
				Если РазделМетаданных = "Перечисления" Тогда
					Если Метаданные[РазделМетаданных][ОбъектМетаданных].ЗначенияПеречисления.Найти(ИмяРеквизита) <> Неопределено Тогда
						Существует = Истина;
					КонецЕсли;
				Иначе
					Если Метаданные[РазделМетаданных][ОбъектМетаданных].Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
						Существует = Истина;
					КонецЕсли;
				КонецЕсли;
			Иначе
				ТабличнаяЧасть = Метаданные[РазделМетаданных][ОбъектМетаданных].ТабличныеЧасти.Найти(ИмяТабЧасти);
				Если ТабличнаяЧасть <> Неопределено И ТабличнаяЧасть.Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
					Существует = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Существует;
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьСсылку_ОбъектПоНаименованию(ТипОбъекта,Наименование)
	
	Результат = Справочники[ТипОбъекта].ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	НЕ Номенклатура.ЭтоГруппа
	               |	И Номенклатура.Наименование = &Наименование";	
	Запрос.УстановитьПараметр("Наименование",Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизитаОбъекта(ОбъектСсылка,ИмяРеквизита)
	Попытка Результат = ОбъектСсылка[ИмяРеквизита]; Исключение; КонецПопытки;	
	Возврат Результат;	
КонецФункции
&НаСервереБезКонтекста
Функция ЗначениеИзСтрокиВнутрСервер(Параметр)
	Возврат ЗначениеИзСтрокиВнутр(Параметр); 
КонецФункции
&НаСервереБезКонтекста
Функция ЗначениеВСтрокуВнутрСервер(Параметр)
	Возврат ЗначениеВСтрокуВнутр(Параметр); 
КонецФункции
&НаСервереБезКонтекста
Функция КраткоеОписаниеОшибки(ТекстОшибки)
	
	КонецСлужебнойИнформации = Найти(ТекстОшибки,"}: ");
	Если КонецСлужебнойИнформации > 0 Тогда
		ТекстОшибки = Сред(ТекстОшибки,КонецСлужебнойИнформации + 3);
	КонецЕсли;				
	
	Возврат ТекстОшибки;
	
КонецФункции
&НаКлиентеНаСервереБезКонтекста
Процедура СообщитьСообщение(Текст,Поле = Неопределено,ИдентификаторНазначения = Неопределено) Экспорт
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = Текст;
	СообщениеПользователю.Поле = Поле;
	
	Если ТипЗнч(ИдентификаторНазначения) = Тип("УникальныйИдентификатор") Тогда
		СообщениеПользователю.ИдентификаторНазначения = ИдентификаторНазначения;
	КонецЕсли;
	
	СообщениеПользователю.Сообщить();
	
КонецПроцедуры


//EN-200: Поиск похожих соответствий в справочнике
&НаКлиенте
Процедура ЗагружаемыеОбъектыОбъект1сНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
		
	Если СтруктураНастроек.Номенклатура_ИспользоватьПомощникПоиска = Истина
		И ТекСтрока <> Неопределено И ТекСтрока.ТипОбъекта = "Номенклатура" Тогда
		
		Элементы.ЗагружаемыеОбъектыОбъект1с.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		
		Если ТекСтрока <> Неопределено И ЗначениеЗаполнено(ТекСтрока.ПредставлениеОбъекта) Тогда
			СтандартнаяОбработка = Ложь;
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("СтрокаПоиска",ТекСтрока.ПредставлениеОбъекта);
			СтруктураПоиска.Вставить("КонтрагентИД",ТекСтрока.КонтрагентИД);
			СтруктураПоиска.Вставить("ДополнятьПользовательскимиСоответствиями",СтруктураНастроек.Номенклатура_ИспользоватьВподбореУстановленныеВручнуюСоответствия);
			СтруктураПоиска.Вставить("Приоритет",СтруктураНастроек.Номенклатура_ПриоритетПриПоискеСопоставленийНоменклатуры);
			СтруктураПоиска.Вставить("РазмерСпискаПохожейНоменклатуры",РазмерСпискаПохожейНоменклатуры);
			
			//Для поиска по Номенклатуре поставщиков нужен отбор по Владельцу
			СтруктураПоиска.Вставить("ПоискПоНоменклатуреПоставщиков",ПоискПоНоменклатуреПоставщиков);
			
			Если ПоискПоНоменклатуреПоставщиков Тогда
				СтрокиКонтрагента = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ТипОбъекта,ДокументИД","Контрагенты",ТекСтрока.ДокументИД));
				Если СтрокиКонтрагента.Количество() > 0 Тогда
					Если СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_Владелец = "Партнер" Тогда
						СтруктураПоиска.Вставить("Владелец",СтрокиКонтрагента[0].Контрагенты_Партнер);
					ИначеЕсли СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_Владелец = "Контрагент" Тогда
						СтруктураПоиска.Вставить("Владелец",СтрокиКонтрагента[0].Объект1с);
					Иначе
						//Отбор по владельцу не будем устанавливать
						СтруктураПоиска.Вставить("Владелец");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			//2020.12.23 ( Добавлена настройка для выбора групп поиска
			Если Не ПоискПоНоменклатуреПоставщиков Тогда
				СписокГрупп = ПолучитьСписокГруппДляПоискаНоменклатуры(ТекСтрока);
					
				Если СписокГрупп.Количество() > 0 Тогда
					СтруктураПоиска.Вставить("СписокГрупп",СписокГрупп);
				КонецЕсли;
			КонецЕсли;
			// ) 2020.12.23
			
			СтруктураПоиска.Вставить("НоменклатураПоставщиков_ИмяСправочника",СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_ИмяСправочника);
			
			//2022.06.29 ( Поиск по полному наименованию	
			Если СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Наименование полное" Тогда
				СтруктураПоиска.Вставить("ИмяРеквизита","НаименованиеПолное");
			КонецЕсли;
			// ) 2022.06.29
			
			//УНФ: отбор по реквизиту 
			Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаНедействителен) И ПоискПоНоменклатуреПоставщиков = Ложь Тогда
				КлючОтбора = СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаНедействителен;
				СтруктураПоиска.Вставить("ОтборНедействителен",КлючОтбора);
			КонецЕсли;
			
			СписокВыбора = ПолучитьСписокПохожейНоменклатуры(СтруктураПоиска);
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ИдентификаторСтроки",ТекСтрока.ПолучитьИдентификатор());
			
			Если ПоискПоНоменклатуреПоставщиков Тогда
				ДополнительныеПараметры.Вставить("Элемент",Элементы.Номенклатура_НоменклатураПоставщика);
				ДополнительныеПараметры.Вставить("ЭлементНоменклатура",Элемент);
			Иначе
				ДополнительныеПараметры.Вставить("Элемент",Элемент);
			КонецЕсли;
			
			ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ОбработатьВыборНоменклатуры",ЭтаФорма,ДополнительныеПараметры),СписокВыбора);
		КонецЕсли;
		
	//Контрагенты
	ИначеЕсли СтруктураНастроек.Контрагенты_ИспользоватьПомощникПоиска = Истина
		И ТекСтрока <> Неопределено И ТекСтрока.ТипОбъекта = "Контрагенты" Тогда
		
		Элементы.ЗагружаемыеОбъектыОбъект1с.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		
		Если ТекСтрока <> Неопределено И ЗначениеЗаполнено(ТекСтрока.ПредставлениеОбъекта) Тогда
			СтандартнаяОбработка = Ложь;
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("СтрокаПоиска",ТекСтрока.Контрагенты_Наименование);
			СтруктураПоиска.Вставить("КонтрагентИД",ТекСтрока.КонтрагентИД);
			СтруктураПоиска.Вставить("ДополнятьПользовательскимиСоответствиями",Ложь);
			СтруктураПоиска.Вставить("РазмерСпискаПохожейНоменклатуры",РазмерСпискаПохожейНоменклатуры);
			
			СписокВыбора = ПолучитьСписокПохожихКонтрагентов(СтруктураПоиска);
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ИдентификаторСтроки",ТекСтрока.ПолучитьИдентификатор());
			ДополнительныеПараметры.Вставить("Элемент",Элемент);
			
			ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ОбработатьВыборКонтрагента",ЭтаФорма,ДополнительныеПараметры),СписокВыбора);
		КонецЕсли;
		
	//Организации
	ИначеЕсли СтруктураНастроек.Контрагенты_ИспользоватьПомощникПоиска = Истина
		И ТекСтрока <> Неопределено И ТекСтрока.ТипОбъекта = "Организации" Тогда
		
		Элементы.ЗагружаемыеОбъектыОбъект1с.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		
		Если ТекСтрока <> Неопределено И ЗначениеЗаполнено(ТекСтрока.ПредставлениеОбъекта) Тогда
			СтандартнаяОбработка = Ложь;
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("СтрокаПоиска",ТекСтрока.Организации_Наименование);
			СтруктураПоиска.Вставить("КонтрагентИД",ТекСтрока.Организации_ИНН);
			СтруктураПоиска.Вставить("ДополнятьПользовательскимиСоответствиями",Ложь);
			СтруктураПоиска.Вставить("РазмерСпискаПохожейНоменклатуры",РазмерСпискаПохожейНоменклатуры);
			
			СписокВыбора = ПолучитьСписокПохожихОрганизаций(СтруктураПоиска);
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ИдентификаторСтроки",ТекСтрока.ПолучитьИдентификатор());
			ДополнительныеПараметры.Вставить("Элемент",Элемент);
			
			ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ОбработатьВыборОрганизации",ЭтаФорма,ДополнительныеПараметры),СписокВыбора);
		КонецЕсли;
		
	Иначе
		Элементы.ЗагружаемыеОбъектыОбъект1с.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.Авто;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборНоменклатуры(Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
		Если Результат.Значение = "СтрокаПоиска" Тогда
			//ничего не делаем
			
		ИначеЕсли Результат.Значение = "СоздатьЭлемент" Тогда
			Элементы.ЗагружаемыеОбъекты.ТекущаяСтрока = ДополнительныеПараметры.ИдентификаторСтроки;
			ЗагружаемыеОбъектыОбъект1сСоздание(Элементы.ЗагружаемыеОбъекты,Истина);
			
		ИначеЕсли Результат.Значение = "СтандартныйПодборНоменклатура" Тогда
			
			ПараметрыОткрытия = Новый Структура;
			ФормаВыбора = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыОткрытия,ДополнительныеПараметры.ЭлементНоменклатура);
			
			ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
			ФормаВыбора.ЗакрыватьПриЗакрытииВладельца = Истина;
			ФормаВыбора.Открыть();
			
		ИначеЕсли Результат.Значение = "СтандартныйПодбор" Тогда
			
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("РежимВыбора",Истина); //УНФ
			
			Если ПоискПоНоменклатуреПоставщиков Тогда
				
				//справочник имеет владельца, добавим отбор
				СтрокиКонтрагента = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ТипОбъекта,ДокументИД","Контрагенты",ТекСтрока.ДокументИД));
				Если СтрокиКонтрагента.Количество() > 0 Тогда
					Если СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_Владелец = "Партнер" Тогда
						ОтборВладелец = Новый Структура("Владелец",СтрокиКонтрагента[0].Контрагенты_Партнер);
					ИначеЕсли СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_Владелец = "Контрагент" Тогда
						ОтборВладелец = Новый Структура("Владелец",СтрокиКонтрагента[0].Объект1с);
					КонецЕсли;
					
					Если ОтборВладелец <> Неопределено Тогда
						ПараметрыОткрытия.Вставить("Отбор",ОтборВладелец);
					КонецЕсли; 
				КонецЕсли;
				
				ФормаВыбора = ПолучитьФорму("Справочник." + СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_ИмяСправочника + ".ФормаВыбора",ПараметрыОткрытия,ДополнительныеПараметры.Элемент);
			Иначе
				ФормаВыбора = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыОткрытия,ДополнительныеПараметры.Элемент);
			КонецЕсли;
			
			ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
			ФормаВыбора.ЗакрыватьПриЗакрытииВладельца = Истина;
			ФормаВыбора.Открыть();
		Иначе
			
			Если ПоискПоНоменклатуреПоставщиков Тогда
				ТекСтрока.Номенклатура_НоменклатураПоставщика = Результат.Значение;
				ТекСтрока.Объект1с = ПолучитьЗначениеРеквизитаОбъекта(Результат.Значение,"Номенклатура");
				ТекСтрока.Номенклатура_Характеристика = ПолучитьЗначениеРеквизитаОбъекта(Результат.Значение,"Характеристика");
				
				//В данном случае связь Номенклатура поставщика - Номенклатура и так есть в самой конфигурации, не записываем в нашу таблицу
				
			Иначе
				ТекСтрока.Объект1с = Результат.Значение;
				
				//сбрасываем характеристику, при "программном" выборе номенклатуры связь по владельцу не отрабатывает
				ТекСтрока.Номенклатура_Характеристика = Неопределено;
				
				Если СтруктураНастроек.Номенклатура_ЗапоминатьУстановленныеВручнуюСоответствия = Истина Тогда
					ТекстОповещения = ЗаписатьСоответствиеНоменклатуры(ТекСтрока.Объект1с,ТекСтрока.Номенклатура_Характеристика,ТекСтрока.ПредставлениеОбъекта,ТекСтрока.КонтрагентИД);
					ПоказатьОповещениеПользователя("Сохранено",,ТекстОповещения);
				КонецЕсли;
			КонецЕсли;
			
			ТекСтрока.СработавшийВариантПоиска = "РучнойВыбор";
			
			ЗаполнитьВсеСоответствующиеЗначения(ТекСтрока.ПолучитьИдентификатор());
			УстановитьДополнительныеРеквизиты(ТекСтрока);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция ПолучитьСписокПохожейНоменклатуры(СтруктураПоиска)
		
	ПоискПоНоменклатуреПоставщиков = СтруктураПоиска.Свойство("ПоискПоНоменклатуреПоставщиков") И СтруктураПоиска.ПоискПоНоменклатуреПоставщиков = Истина;
	
	СписокВыбора = Новый СписокЗначений;
	
	//пункт "Вы искали"
	НовыйЭлемент = СписокВыбора.Добавить();
	НовыйЭлемент.Значение = "СтрокаПоиска";
	НовыйЭлемент.Представление = "Вы искали: " + СтруктураПоиска.СтрокаПоиска;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.Найти;
	
	//Покажем, в какой группе это искали
	Если ПоискПоНоменклатуреПоставщиков Тогда
		ИмяСправочника = СтруктураПоиска.НоменклатураПоставщиков_ИмяСправочника;
	Иначе
		ИмяСправочника = "Номенклатура";
		Если СтруктураПоиска.Свойство("СписокГрупп") Тогда
			СтрокаГрупп = " [";
			Для Каждого ГруппаПоиска Из СтруктураПоиска.СписокГрупп Цикл
				Запятая = ?(СтруктураПоиска.СписокГрупп.Найти(ГруппаПоиска) = СтруктураПоиска.СписокГрупп.Вграница(),"",",");
				СтрокаГрупп = СтрокаГрупп + ГруппаПоиска + Запятая;
			КонецЦикла;
			НовыйЭлемент.Представление = НовыйЭлемент.Представление + СтрокаГрупп + "]";
		КонецЕсли;
	КонецЕсли;
	
	Таблица = ЗаполнитьТаблицуСравнения(ИмяСправочника,СтруктураПоиска);
	
	Попытка КартинкаИстория = БиблиотекаКартинок.История; Исключение; КартинкаИстория = Новый Картинка; КонецПопытки;
	
	Если Таблица <> Неопределено Тогда
		Для Каждого СтрокаТаблицы Из Таблица Цикл
			Если СписокВыбора.НайтиПоЗначению(СтрокаТаблицы.Ссылка) = Неопределено Тогда
				НовыйЭлемент = СписокВыбора.Добавить();
				НовыйЭлемент.Значение = СтрокаТаблицы.Ссылка;
				НовыйЭлемент.Представление = СтрокаТаблицы.Представление;
				
				Если СтрокаТаблицы.ИсточникЗначения = 0 Тогда
					НовыйЭлемент.Картинка = КартинкаИстория;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//Если в настройках включена работа со справочником Номенклатура поставщиков,
	//дадим возможность выбрать соответствующую существующую Номенклатуру, а номенклатура поставщика будет создана
	Если ПоискПоНоменклатуреПоставщиков Тогда
		
		//пункт Стандартный поиск по Номенклатуре поставщика
		НовыйЭлемент = СписокВыбора.Добавить();
		НовыйЭлемент.Значение = "СтандартныйПодбор";
		НовыйЭлемент.Представление = "Стандартный подбор [Номенклатура поставщика]...";
		НовыйЭлемент.Картинка = БиблиотекаКартинок.Справочник;
		
		//пункт Стандартный поиск по Номенклатуре
		НовыйЭлемент = СписокВыбора.Добавить();
		НовыйЭлемент.Значение = "СтандартныйПодборНоменклатура";
		НовыйЭлемент.Представление = "Стандартный подбор [Номенклатура]...";
		НовыйЭлемент.Картинка = БиблиотекаКартинок.Справочник;
		
	Иначе
		//пункт Стандартный поиск
		НовыйЭлемент = СписокВыбора.Добавить();
		НовыйЭлемент.Значение = "СтандартныйПодбор";
		НовыйЭлемент.Представление = "Стандартный подбор...";
		НовыйЭлемент.Картинка = БиблиотекаКартинок.Справочник;
	
	КонецЕсли;
	
	//пункт Создать элемент справочника
	НовыйЭлемент = СписокВыбора.Добавить();
	НовыйЭлемент.Значение = "СоздатьЭлемент";
	НовыйЭлемент.Представление = "Создать новый элемент...";
	НовыйЭлемент.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
	
	Возврат СписокВыбора;
	
КонецФункции
&НаСервере
Процедура ЗаполнитьКэшФормы_СловаМаркеры()
	ДанныеСвязей = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СловаМаркеры");
	Если ТипЗнч(ДанныеСвязей) = Тип("ТаблицаЗначений") Тогда
		Для Каждого СтрокаМаркер Из ДанныеСвязей Цикл
			Если СтрокаМаркер.Маркер <> "" И СтрокаМаркер.Номенклатура.ЭтоГруппа Тогда
				НоваяСтрока = СловаМаркеры.Добавить();
				НоваяСтрока.Маркер = СтрокаМаркер.Маркер;
				НоваяСтрока.Номенклатура = СтрокаМаркер.Номенклатура;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Функция ПолучитьСписокГруппДляПоискаНоменклатуры(СтрокаТаблицы)
	
	СписокГрупп = Новый Массив;

	// Получаем таблицу "маркеров" - подстрок поиска номенклатуры в иерархии группы
	СтрокаДляПоиска = Нрег(СтрокаТаблицы.ПредставлениеОбъекта);				
	Для Каждого СтрокаМаркер Из СловаМаркеры Цикл
		Если Найти(СтрокаДляПоиска,Нрег(СтрокаМаркер.Маркер)) > 0 Тогда
			СписокГрупп.Добавить(СтрокаМаркер.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Если СтруктураНастроек.Свойство("Номенклатура_ГруппаДляПоискаПохожейНоменклатуры")
		И ЗначениеЗаполнено(СтруктураНастроек.Номенклатура_ГруппаДляПоискаПохожейНоменклатуры) Тогда
		
		Если ТипЗнч(СтруктураНастроек.Номенклатура_ГруппаДляПоискаПохожейНоменклатуры) = Тип("СписокЗначений") Тогда
			Для Каждого ЭлементСписка Из СтруктураНастроек.Номенклатура_ГруппаДляПоискаПохожейНоменклатуры Цикл
				СписокГрупп.Добавить(ЭлементСписка.Значение);
			КонецЦикла;
		Иначе
			СписокГрупп.Добавить(СтруктураНастроек.Номенклатура_ГруппаДляПоискаПохожейНоменклатуры);
		КонецЕсли;
	КонецЕсли;
		
	Возврат СписокГрупп;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборКонтрагента(Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
		Если Результат.Значение = "СтрокаПоиска" Тогда
			//ничего не делаем
			
		ИначеЕсли Результат.Значение = "СоздатьЭлемент" Тогда
			Элементы.ЗагружаемыеОбъекты.ТекущаяСтрока = ДополнительныеПараметры.ИдентификаторСтроки;
			ЗагружаемыеОбъектыОбъект1сСоздание(Элементы.ЗагружаемыеОбъекты,Истина);
			
		ИначеЕсли Результат.Значение = "СтандартныйПодбор" Тогда
			ПараметрыОткрытия = Новый Структура;
			ФормаВыбора = ПолучитьФорму("Справочник.Контрагенты.ФормаВыбора",ПараметрыОткрытия,ДополнительныеПараметры.Элемент);
			ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
			ФормаВыбора.ЗакрыватьПриЗакрытииВладельца = Истина;
			ФормаВыбора.Открыть();
			
		Иначе
			ТекСтрока.Объект1с = Результат.Значение;
			ТекстОповещения = ЗаписатьСоответствиеКонтрагента(ТекСтрока.Объект1с,ТекСтрока.Контрагенты_Наименование,ТекСтрока.Контрагенты_НаименованиеПолное);
			ПоказатьОповещениеПользователя("Сохранено",,ТекстОповещения);
			
			//2020.04.14 ( для конфигураций, предполагающих наличие справочника Партнеры нужно заполнить партнера при выборе контрагента
			Если РеквизитСуществует("Справочники","Контрагенты","Партнер") Тогда
				ТекСтрока.Контрагенты_Партнер = ПолучитьЗначениеРеквизитаОбъекта(ТекСтрока.Объект1с,"Партнер");
			КонецЕсли;
			// ) 2020.04.14
			
			ЗаполнитьВсеСоответствующиеЗначения(ТекСтрока.ПолучитьИдентификатор());
			УстановитьДополнительныеРеквизиты(ТекСтрока);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция ПолучитьСписокПохожихКонтрагентов(СтруктураПоиска)
		
	СписокВыбора = Новый СписокЗначений;
	
	//пункт "Вы искали"
	НовыйЭлемент = СписокВыбора.Добавить();
	НовыйЭлемент.Значение = "СтрокаПоиска";
	НовыйЭлемент.Представление = "Вы искали: " + СтруктураПоиска.СтрокаПоиска;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.Найти;
	
	Таблица = ЗаполнитьТаблицуСравнения("Контрагенты",СтруктураПоиска);
	
	Попытка КартинкаИстория = БиблиотекаКартинок.История; Исключение; КартинкаИстория = Новый Картинка; КонецПопытки;
	
	Если Таблица <> Неопределено Тогда
		Для Каждого СтрокаТаблицы Из Таблица Цикл
			Если СписокВыбора.НайтиПоЗначению(СтрокаТаблицы.Ссылка) = Неопределено Тогда
				НовыйЭлемент = СписокВыбора.Добавить();
				НовыйЭлемент.Значение = СтрокаТаблицы.Ссылка;
				НовыйЭлемент.Представление = СтрокаТаблицы.Представление;
				
				Если СтрокаТаблицы.ИсточникЗначения = 0 Тогда
					НовыйЭлемент.Картинка = КартинкаИстория;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//пункт Стандартный поиск
	НовыйЭлемент = СписокВыбора.Добавить();
	НовыйЭлемент.Значение = "СтандартныйПодбор";
	НовыйЭлемент.Представление = "Стандартный подбор...";
	НовыйЭлемент.Картинка = БиблиотекаКартинок.Справочник;
	
	//пункт Создать элемент справочника
	НовыйЭлемент = СписокВыбора.Добавить();
	НовыйЭлемент.Значение = "СоздатьЭлемент";
	НовыйЭлемент.Представление = "Создать новый элемент...";
	НовыйЭлемент.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборОрганизации(Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
		Если Результат.Значение = "СтрокаПоиска" Тогда
			//ничего не делаем
		ИначеЕсли Результат.Значение = "СтандартныйПодбор" Тогда
			ПараметрыОткрытия = Новый Структура;
			ФормаВыбора = ПолучитьФорму("Справочник.Организации.ФормаВыбора",ПараметрыОткрытия,ДополнительныеПараметры.Элемент);
						
			ПараметрыВызова = Новый Структура("Обработчик,ФормаВыбора,ДопПараметры","ОбработатьВыборИзФормыСписка_Организации",ФормаВыбора,ДополнительныеПараметры);
			_ЗФ_ОбработатьАсинхронныйВызов("ВыборЗначенияИзФормыСписка",ПараметрыВызова);
			
		Иначе
			ТекСтрока.Объект1с = Результат.Значение;
			ТекстОповещения = ЗаписатьСоответствиеОрганизации(ТекСтрока.Объект1с,ТекСтрока.Организации_Наименование,ТекСтрока.Организации_НаименованиеПолное);
			ПоказатьОповещениеПользователя("Сохранено",,ТекстОповещения);
			
			ЗаполнитьВсеСоответствующиеЗначения(ТекСтрока.ПолучитьИдентификатор());
			УстановитьДополнительныеРеквизиты(ТекСтрока);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьВыборИзФормыСписка_Организации(Результат,ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ДопПараметры.ИдентификаторСтроки);
		ТекстОповещения = ЗаписатьСоответствиеОрганизации(Результат,ТекСтрока.Организации_Наименование,ТекСтрока.Организации_НаименованиеПолное);
		ПоказатьОповещениеПользователя("Сохранено",,ТекстОповещения);
	
		ЗаполнитьВсеСоответствующиеЗначения(ТекСтрока.ПолучитьИдентификатор());
		УстановитьДополнительныеРеквизиты(ТекСтрока);
	КонецЕсли;
КонецПроцедуры
&НаСервереБезКонтекста
Функция ПолучитьСписокПохожихОрганизаций(СтруктураПоиска)
		
	СписокВыбора = Новый СписокЗначений;
	
	//пункт "Вы искали"
	НовыйЭлемент = СписокВыбора.Добавить();
	НовыйЭлемент.Значение = "СтрокаПоиска";
	НовыйЭлемент.Представление = "Вы искали: " + СтруктураПоиска.СтрокаПоиска;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.Найти;
	
	Таблица = ЗаполнитьТаблицуСравнения("Организации",СтруктураПоиска);
	
	Попытка КартинкаИстория = БиблиотекаКартинок.История; Исключение; КартинкаИстория = Новый Картинка; КонецПопытки;
	
	Если Таблица <> Неопределено Тогда
		Для Каждого СтрокаТаблицы Из Таблица Цикл
			Если СписокВыбора.НайтиПоЗначению(СтрокаТаблицы.Ссылка) = Неопределено Тогда
				НовыйЭлемент = СписокВыбора.Добавить();
				НовыйЭлемент.Значение = СтрокаТаблицы.Ссылка;
				НовыйЭлемент.Представление = СтрокаТаблицы.Представление;
				
				Если СтрокаТаблицы.ИсточникЗначения = 0 Тогда
					НовыйЭлемент.Картинка = КартинкаИстория;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//пункт Стандартный поиск
	НовыйЭлемент = СписокВыбора.Добавить();
	НовыйЭлемент.Значение = "СтандартныйПодбор";
	НовыйЭлемент.Представление = "Стандартный подбор...";
	НовыйЭлемент.Картинка = БиблиотекаКартинок.Справочник;
	
	Возврат СписокВыбора;
	
КонецФункции


// ( идея подсмотрена у 42cloud
&НаСервереБезКонтекста
Функция ЗаполнитьТаблицуСравнения(ИмяСправочника,СтруктураПоиска) Экспорт

	Если СтруктураПоиска.Свойство("ИмяРеквизита") Тогда
		ИмяРеквизита = СтруктураПоиска.ИмяРеквизита;
	Иначе
		ИмяРеквизита = "Наименование";
	КонецЕсли;
	
	СтрокаПоиска = СтруктураПоиска.СтрокаПоиска;
	
	Если СтруктураПоиска.Свойство("Владелец") Тогда
		Владелец = СтруктураПоиска.Владелец;
	КонецЕсли;
	
	Если СтруктураПоиска.Свойство("СписокГрупп") Тогда
		СписокГрупп = СтруктураПоиска.СписокГрупп;
	КонецЕсли;
	
	СтрокаВ = ВРег(СтрЗаменить(СтрокаПоиска, """", ""));
	ДлинаВ = СтрДлина(СтрокаВ);
	Список = Новый СписокЗначений;
	
	Если ДлинаВ > 100 Тогда
		ДлинаПодстроки = 10; 
	ИначеЕсли ДлинаВ > 50 Тогда
		ДлинаПодстроки = 5;
	ИначеЕсли ДлинаВ > 28 Тогда
		ДлинаПодстроки = 4;
	ИначеЕсли ДлинаВ > 12 Тогда
		ДлинаПодстроки = 3;
	ИначеЕсли ДлинаВ > 2 Тогда
		ДлинаПодстроки = 2;
	Иначе
		ДлинаПодстроки = ДлинаВ;
	КонецЕсли;
	
	Для ПозСтрВ = 1 По ДлинаВ - ДлинаПодстроки + 1 Цикл
		ПодстрокаВ = Сред(СтрокаВ, ПозСтрВ, ДлинаПодстроки);
		Список.Добавить(ПодстрокаВ);
	КонецЦикла; 
		
	РазмерСписка = Список.Количество() - 1;
	ДлинаСтроки = Метаданные.Справочники[ИмяСправочника].ДлинаНаименования;
	Если ДлинаСтроки = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//Проверка нужен ли поиск только в заданных группах
	Если СписокГрупп <> Неопределено Тогда
		ВИерархии = "И ИсходныйСправочник.Ссылка В ИЕРАРХИИ (&СписокГрупп)";
	Иначе
		ВИерархии = "";
	КонецЕсли;	
	
	//Проверка является ли справочник иерархическим
	Иерархический = ?(Метаданные.Справочники[ИмяСправочника].Иерархический И Метаданные.Справочники[ИмяСправочника].ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов, Истина, Ложь);
	Если Иерархический Тогда
		НЕГруппа = "И НЕ ИсходныйСправочник.ЭтоГруппа";
	Иначе
		НЕГруппа = "";
	КонецЕсли;
	
	//Проверка на наличие реквизита "Владелец" у справочника
	ОтборПоВладельцу = "";
	Если Метаданные.Справочники[ИмяСправочника].Владельцы.Количество() > 0 И Владелец <> Неопределено Тогда
		Если ТипЗнч(Владелец) = Тип("Строка") Тогда
			ОтборПоВладельцу = "И ИсходныйСправочник.Владелец.Наименование = &Владелец ";
		Иначе
			ОтборПоВладельцу = "И ИсходныйСправочник.Владелец = &Владелец ";
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураПоиска.Свойство("ОтборНедействителен") Тогда
		ОтборНедействителен = "И ИсходныйСправочник." + СтруктураПоиска.ОтборНедействителен + " = Ложь";
	Иначе
		ОтборНедействителен = "";
	КонецЕсли;
	
	Запрос = Новый Запрос; 
	
	//EN-291: Первыми в списке должны идти ранее устанавливашиеся ручные соответствия
	ДополнятьПользовательскимиСоответствиями = Ложь;
	Если СтруктураПоиска.Свойство("ДополнятьПользовательскимиСоответствиями") И СтруктураПоиска.ДополнятьПользовательскимиСоответствиями = Истина Тогда
		
		СвязьНоменклатуры = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СвязьНоменклатуры");
		Если ТипЗнч(СвязьНоменклатуры) = Тип("ТаблицаЗначений") И СвязьНоменклатуры.Количество() > 0 Тогда
			
			ТаблицаСоответствий = Новый ТаблицаЗначений;
			ТаблицаСоответствий.Колонки.Добавить("Ссылка",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			ТаблицаСоответствий.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка"));
			
			Для Каждого СтрокаСвязи Из СвязьНоменклатуры Цикл
				//+++ Замерить выполнение перебором или поиском строк
				Если СтрокаСвязи.КонтрагентИД = СтруктураПоиска.КонтрагентИД Тогда
					НоваяСтрока = ТаблицаСоответствий.Добавить();
					НоваяСтрока.Ссылка = СтрокаСвязи.Ссылка;
					НоваяСтрока.Наименование = СтрокаСвязи.Наименование;
				КонецЕсли;
			КонецЦикла;
			
			Если ТаблицаСоответствий.Количество() > 0 Тогда
				ДополнятьПользовательскимиСоответствиями = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнятьПользовательскимиСоответствиями Тогда
				
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Соответствия.Ссылка КАК Ссылка,
			|	ВЫРАЗИТЬ(Соответствия.Наименование КАК Строка(1000)) КАК Наименование
			|ПОМЕСТИТЬ ВТ_Связи
			|ИЗ
			|	&ТаблицаСоответствий КАК Соответствия;
			|
 			|////////////////////////////////////////////////////////////////////////////////
			|
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		 	|	ИсходныйСправочник.Ссылка КАК Ссылка,
			|	1 КАК ИсточникЗначения,
			|	ВЫРАЗИТЬ(ИсходныйСправочник." + ИмяРеквизита + " КАК Строка(1000)) КАК Наименование  
			|ПОМЕСТИТЬ ОтобраноДляПоиска
		 	|ИЗ
		 	|	Справочник." + ИмяСправочника + " КАК ИсходныйСправочник
		 	|ГДЕ
		 	|	НЕ ИсходныйСправочник.ПометкаУдаления 
		 	|	" + ВИерархии + "
		 	|	" + НЕГруппа + "
			|	" + ОтборПоВладельцу + "
			|	" + ОтборНедействителен + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
		 	|
			|ВЫБРАТЬ
			|	Соответствия.Ссылка,
			|	0,
			|	Выразить(Соответствия.Наименование КАК Строка(1000))
			|ИЗ
			|	ВТ_Связи КАК Соответствия;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|
			|ВЫБРАТЬ
			|	ОтобраноДляПоиска.Ссылка КАК Ссылка,
			|	МИНИМУМ(ОтобраноДляПоиска.ИсточникЗначения) КАК ИсточникЗначения,
			|	ОтобраноДляПоиска.Наименование КАК Наименование
			|ПОМЕСТИТЬ ОтфильтрованоДляПоиска
			|ИЗ
			|	ОтобраноДляПоиска КАК ОтобраноДляПоиска
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтобраноДляПоиска.Ссылка,
			|	ОтобраноДляПоиска.Наименование
			|
	  		|ИНДЕКСИРОВАТЬ ПО
	  		|	Ссылка
		 	|;";
		
		Запрос.УстановитьПараметр("ТаблицаСоответствий",ТаблицаСоответствий);
	
	Иначе
	// ) EN-291
	
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		 	|	ИсходныйСправочник.Ссылка КАК Ссылка,
			|	1 КАК ИсточникЗначения,
			|	ВЫРАЗИТЬ(ИсходныйСправочник." + ИмяРеквизита + " КАК Строка(1000)) КАК Наименование  
			|ПОМЕСТИТЬ ОтфильтрованоДляПоиска
		 	|ИЗ
		 	|	Справочник." + ИмяСправочника + " КАК ИсходныйСправочник
		 	|ГДЕ
		 	|	НЕ ИсходныйСправочник.ПометкаУдаления 
		 	|	" + ВИерархии + "
		 	|	" + НЕГруппа + "
			|	" + ОтборПоВладельцу + "
			|	" + ОтборНедействителен + "
			|
	  		|ИНДЕКСИРОВАТЬ ПО
	  		|	Ссылка
		 	|;";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	 	|
	 	|////////////////////////////////////////////////////////////////////////////////

		| ВЫБРАТЬ ПЕРВЫЕ 5
		| 	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
		| 	ВложенныйЗапрос.Ссылка,
		| 	МИНИМУМ(ВложенныйЗапрос.ИсточникЗначения) КАК ИсточникЗначения,
		| 	ВложенныйЗапрос.Представление КАК Представление,
		|	&УпорядочиваниеДопТаблицы КАК ПроцентВхождения
		|ИЗ
		| (";
		
	Для к = 0 По РазмерСписка Цикл
		
		//E1C-142: Экранируем спецсимволы ПОДОБНО
		ТекущееЗначение = "%" + ЭкранироватьСпецсимволыПодобно(Список[к].Значение) + "%";
		Запрос.УстановитьПараметр("Шаблон" + СтрЗаменить(к,Символы.НПП,""),ТекущееЗначение);
		
		Запрос.Текст =  Запрос.Текст + "
		|ВЫБРАТЬ
		|	ПоискПодстроки.Ссылка КАК Ссылка,
		|	ПоискПодстроки.Наименование КАК Представление,
		|	ПоискПодстроки.ИсточникЗначения КАК ИсточникЗначения,
		|	1 КАК Количество
		| ИЗ
		|	ОтфильтрованоДляПоиска КАК ПоискПодстроки
		| ГДЕ
		|	ПоискПодстроки.Наименование ПОДОБНО &Шаблон" + СтрЗаменить(к,Символы.НПП,"") + " СПЕЦСИМВОЛ ""~""
		| 	" + ?(к < РазмерСписка, "ОБЪЕДИНИТЬ ВСЕ", "");
	КонецЦикла; 
	
	Запрос.Текст = Запрос.Текст + 
		") КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.Представление
		|УПОРЯДОЧИТЬ ПО
		|	Количество УБЫВ";
	
	//Проверка на наличие реквизита "Владелец" у справочника
	Если ОтборПоВладельцу <> "" И Владелец <> Неопределено Тогда
		Запрос.УстановитьПараметр("Владелец",Владелец);
	КонецЕсли;
	Если СписокГрупп <> Неопределено Тогда
		Запрос.УстановитьПараметр("СписокГрупп",СписокГрупп);
	КонецЕсли;
	
	//2019.11.22 ( Если выполняем автопоиск нам не нужно, чтобы сверху оказывались строки из ручных сопоставлений,
	//за это у нас отвечает ключ структуры ПроцентСоответствияАвтоПоиск
	Если СтруктураПоиска.Свойство("ПроцентСоответствияАвтоПоиск") Тогда
		Запрос.УстановитьПараметр("УпорядочиваниеДопТаблицы",1);
	Иначе
		Запрос.УстановитьПараметр("УпорядочиваниеДопТаблицы",0);
	КонецЕсли;
	// ) 2019.11.22
	
	//2019.04.15 (
	Попытка РазмерСпискаПохожих = Число(СтруктураПоиска.РазмерСпискаПохожейНоменклатуры); Исключение РазмерСпискаПохожих = 1; КонецПопытки;
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПЕРВЫЕ 5","ПЕРВЫЕ " + СтрЗаменить(РазмерСпискаПохожих,Символы.НПП,""));
	// ) 2019.04.15
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		СтрокаТаблицы.ПроцентВхождения = ПодсчитатьПроцентВхождения(СтрокаПоиска,СтрокаТаблицы.Представление);
		СтрокаТаблицы.Представление = "[" + СтрокаТаблицы.ПроцентВхождения + "%] " + СтрокаТаблицы.Ссылка[ИмяРеквизита];
	КонецЦикла;
	
	//E1C-68: Настройка действует на порядок отображения значений в выпадашке с подходящими и на автозаполнение подходящих
	Если СтруктураПоиска.Свойство("Приоритет") И СтруктураПоиска.Приоритет = "Лучшее из всех доступных" Тогда
		Таблица.Сортировать("ПроцентВхождения УБЫВ");
	Иначе
		Таблица.Сортировать("ИсточникЗначения ВОЗР,ПроцентВхождения УБЫВ");
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции
&НаСервереБезКонтекста
Функция ПодсчитатьПроцентВхождения(Знач СтрокаПоиска, Знач Строка) 
	
	КвоВхождений = 0;
	КвоВхождений2 = 0;
	СтепеньСовпадения = 0;
	
	СтрокаПоиска = СокрЛП(ВРЕГ(СтрокаПоиска));
	Строка = СокрЛП(ВРЕГ(Строка));
	
	СтрокаПоиска = СтрЗаменить(СтрокаПоиска, """", "");
	Строка = СтрЗаменить(Строка, """", "");
	
	ДлинаВ = СтрДлина(Строка);
	Если ДлинаВ > 100 Тогда
		ДлинаПодстрокиНач = 3;
	ИначеЕсли ДлинаВ > 50 Тогда
		ДлинаПодстрокиНач = 2;
	Иначе
		ДлинаПодстрокиНач = 1;
	КонецЕсли;
 
	Если НЕ (СтрДлина(СтрокаПоиска) = 0 ИЛИ СтрДлина(Строка) = 0) Тогда
		
		Для ДлинаПодстроки = ДлинаПодстрокиНач По 3 Цикл
			
			НачНомерПодстроки = 1;
			НомерСимвола = 0;
			Пока НомерСимвола + ДлинаПодстроки <= СтрДлина(Строка) Цикл
				Подстрока = СРЕД(Строка, НачНомерПодстроки, ДлинаПодстроки);
				Если Найти(СтрокаПоиска, Подстрока) > 0 Тогда
					КвоВхождений2=КвоВхождений2 + 1;
				КонецЕсли;
				КвоВхождений = КвоВхождений + 1;
				НачНомерПодстроки = НачНомерПодстроки + 1;
				НомерСимвола = НомерСимвола + 1;
			КонецЦикла;
			
			НачНомерПодстроки = 1;
			НомерСимвола = 0;
			Пока НомерСимвола + ДлинаПодстроки <= СтрДлина(СтрокаПоиска) Цикл
				Подстрока = СРЕД(СтрокаПоиска, НачНомерПодстроки, ДлинаПодстроки);
				Если Найти(Строка, Подстрока) <> 0 Тогда
					КвоВхождений2=КвоВхождений2 + 1;
				КонецЕсли;
				КвоВхождений = КвоВхождений + 1;
				НачНомерПодстроки = НачНомерПодстроки + 1;
				НомерСимвола = НомерСимвола + 1;
			КонецЦикла;
			
		КонецЦикла;

	КонецЕсли;

	Если КвоВхождений > 0 Тогда
		Результат = ?(КвоВхождений>КвоВхождений2, Окр((КвоВхождений2/КвоВхождений)*100),Окр((КвоВхождений/КвоВхождений2)*100));
		Результат = ?(Результат = 100 И КвоВхождений<>КвоВхождений2, 99, Результат);
	Иначе
		Результат = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
// ) идея подсмотрена у 42cloud
// ) EN-200

&НаСервереБезКонтекста
Функция ЭкранироватьСпецсимволыПодобно(Строка)
	
	//В качестве спецсимвола используем ~
	Строка = СтрЗаменить(Строка,"[","~[");
	Строка = СтрЗаменить(Строка,"]","~]");
	Строка = СтрЗаменить(Строка,"?","~?");
	Строка = СтрЗаменить(Строка,"%","~%");
	Строка = СтрЗаменить(Строка,"_","~_");
	Строка = СтрЗаменить(Строка,"^","~^");
	
	Возврат Строка;
	
КонецФункции


// ================= Заполнение счетов учета и аналитики ===================

&НаКлиенте
Процедура СчетаУчета_ЗаполнитьСчетаУчетаНоменклатуры()
	СтруктураПоиска = Новый Структура("ТипОбъекта","Организации");
	СтрокиОрганизации = Объект.ЗагружаемыеОбъекты.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого СтрокаОрганизации Из СтрокиОрганизации Цикл
		СтруктураПоиска = Новый Структура("ТипОбъекта,ДокументИД","Номенклатура",СтрокаОрганизации.ДокументИД);
		СтрокиНоменклатуры = Объект.ЗагружаемыеОбъекты.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаНоменклатуры Из СтрокиНоменклатуры Цикл
			СчетаУчета_ЗаполнитьСчетаУчетаВСтрокеНоменклатуры(СтрокаНоменклатуры,СтрокаОрганизации.Объект1с);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
&НаКлиенте
Процедура СчетаУчета_ЗаполнитьСчетаУчетаВСтрокеНоменклатуры(СтрокаНоменклатуры,Организация = Неопределено)
	
	СтруктураДанных = СчетаУчета_ПолучитьСтруктуруДанныхДляОпределения(СтрокаНоменклатуры,Организация);
	
	Если ЗначениеЗаполнено(СтрокаНоменклатуры.Объект1с) Тогда
		
		СчетаУчета = СчетаУчета_ПолучитьСчетаУчетаНоменклатуры(СтруктураНастроек,СтруктураДанных);
		
		Если СчетаУчета <> Неопределено Тогда
			Если СтруктураДанных.АгентскиеУслуги Тогда
				СтрокаНоменклатуры.Номенклатура_СчетУчета = СчетаУчета.СчетРасчетовСКомитентом;
				СтрокаНоменклатуры.Номенклатура_СчетУчетаНДС = Неопределено;
			Иначе
				СтрокаНоменклатуры.Номенклатура_СчетУчета = СчетаУчета.СчетУчета;
				СтрокаНоменклатуры.Номенклатура_СчетУчетаНДС = СчетаУчета.СчетУчетаНДС;
			КонецЕсли;
		КонецЕсли;		
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаНоменклатуры.Номенклатура_СчетУчета) Тогда
		//Заполняем значениями по умолчанию из настроек			
		Если СтрокаНоменклатуры.ДополнительноеОписаниеОбъекта = "Услуга" Тогда
			СтрокаНоменклатуры.Номенклатура_СчетУчета = СтруктураНастроек.ЗаполнениеТЧ_СчетУчетаПоУмолчаниюУслуга;
			СтрокаНоменклатуры.Номенклатура_СчетУчетаНДС = СтруктураНастроек.ЗаполнениеТЧ_СчетУчетаНДСПоУмолчаниюУслуга;
			
		ИначеЕсли СтрокаНоменклатуры.ДополнительноеОписаниеОбъекта = "Товар" Тогда
			СтрокаНоменклатуры.Номенклатура_СчетУчета = СтруктураНастроек.ЗаполнениеТЧ_СчетУчетаПоУмолчаниюТовар;
			СтрокаНоменклатуры.Номенклатура_СчетУчетаНДС = СтруктураНастроек.ЗаполнениеТЧ_СчетУчетаНДСПоУмолчаниюТовар;
			
		Иначе
			СтрокаНоменклатуры.Номенклатура_СчетУчета = Неопределено;
			СтрокаНоменклатуры.Номенклатура_СчетУчетаНДС = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не СтруктураДанных.АгентскиеУслуги Тогда
		СчетаУчета_ЗаполнитьАналитикуСчетовУчета(СтрокаНоменклатуры,СчетаУчета);
	КонецЕсли;
		
КонецПроцедуры
&НаКлиенте
Функция СчетаУчета_ПолучитьСтруктуруДанныхДляОпределения(СтрокаНоменклатуры,Организация = Неопределено)
	
	СтруктураДанных = Новый Структура("Номенклатура,Склад,Организация,Дата");
	СтруктураДанных.Номенклатура = СтрокаНоменклатуры.Объект1с;
	
	//2020.09.15 ( Склад теперь присутствует в форме сопоставления для каждого документа, получим его оттуда
	СтруктураПоиска = Новый Структура("ТипОбъекта,ДокументИД","Документ",СтрокаНоменклатуры.ДокументИД);
	СтрокиСклада = Объект.ЗагружаемыеОбъекты.НайтиСтроки(СтруктураПоиска);
	Если СтрокиСклада.Количество() > 0 Тогда
		Если ЗначениеЗаполнено(СтрокиСклада[0].Документ_Склад) Тогда
			СтруктураДанных.Склад = СтрокиСклада[0].Документ_Склад;
		КонецЕсли;
	КонецЕсли;
	// ) 2020.09.15
	
	Если СтруктураНастроек.ЗаполнениеШапки_ИспользоватьДатуВходящегоДокумента = Истина Тогда
		СтруктураДанных.Дата = СтрокаНоменклатуры.Документ_Дата;
	Иначе
		СтруктураДанных.Дата = ТекущаяДата();
	КонецЕсли;
	
	Если Организация = Неопределено Тогда
		//Определим организацию текущего документа
		СтруктураПоиска = Новый Структура("ТипОбъекта,ДокументИД","Организации",СтрокаНоменклатуры.ДокументИД);
		СтрокиОрганизации = Объект.ЗагружаемыеОбъекты.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиОрганизации.Количество() > 0 Тогда
			СтруктураДанных.Организация = СтрокиОрганизации[0].Объект1с;
		КонецЕсли;
	Иначе
		СтруктураДанных.Организация = Организация;
	КонецЕсли;
	
	СтруктураДанных.Вставить("АгентскиеУслуги",СтрокаНоменклатуры.ДополнительноеОписаниеОбъекта = "АгентскиеУслуги");
	СтруктураДанных.Вставить("Комитент",СтрокаНоменклатуры.Номенклатура_Комитент);
	СтруктураДанных.Вставить("ДоговорКомитента",СтрокаНоменклатуры.Номенклатура_ДоговорКомитента);
	СтруктураДанных.Вставить("ТипСоздаваемогоДокумента",СтрокаНоменклатуры.ТипСоздаваемогоДокумента);
	
	Возврат СтруктураДанных;
	
КонецФункции
&НаСервереБезКонтекста
Функция СчетаУчета_ПолучитьСчетаУчетаНоменклатуры(СтруктураНастроек,СтруктураДанных)
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	
	Если Конф = "БП30" Тогда
		
		Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
			
			МодульСчетаУчетаВДокументах = _ЗФ_ПолучитьОбщийМодульКонфигурации("СчетаУчетаВДокументах");
			Если МодульСчетаУчетаВДокументах <> Неопределено Тогда
				
				Кзаполнению = Новый Соответствие;
				
				ДанныеСтроки = Новый Структура("Номенклатура,СчетУчетаБУ,СчетДоходовБУ",СтруктураДанных.Номенклатура);
				
				Если СтруктураДанных.Номенклатура.Услуга Тогда
					ИмяРеквизитаСчет = "СчетДоходовБУ";
					ИмяТЧ = "Услуги";
				Иначе
					ИмяРеквизитаСчет = "СчетУчетаБУ";
					ИмяТЧ = "Товары";
				КонецЕсли;
				
				Кзаполнению.Вставить(ИмяТЧ + "." + ИмяРеквизитаСчет,Истина);
				
				Попытка
					СчетаУчета = МодульСчетаУчетаВДокументах.ЗаполнитьРеквизитыПриИзменении(Документы[СтруктураДанных.ТипСоздаваемогоДокумента],
						Кзаполнению,СтруктураДанных,ИмяТЧ,ДанныеСтроки,Ложь);
					СчетаУчета.Вставить("СчетУчета",СчетаУчета[ИмяРеквизитаСчет]);
					СчетаУчета.Вставить("СчетУчетаНДС");
				Исключение
					//Не обрабатываем
				КонецПопытки;
			КонецЕсли;
			
		Иначе
			
			МодульБухгалтерскийУчетПереопределяемый = _ЗФ_ПолучитьОбщийМодульКонфигурации("БухгалтерскийУчетПереопределяемый");
			Если МодульБухгалтерскийУчетПереопределяемый <> Неопределено Тогда
				Попытка
					Если СтруктураДанных.АгентскиеУслуги Тогда
						СчетаУчета = МодульБухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(СтруктураДанных.Организация,
							СтруктураДанных.Комитент,СтруктураДанных.ДоговорКомитента);
					Иначе
						СчетаУчета = МодульБухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(СтруктураДанных.Организация,
							СтруктураДанных.Номенклатура,СтруктураДанных.Склад,СтруктураДанных.Дата);
					КонецЕсли;
				Исключение
					//Не обрабатываем
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Конф = "УНФ" Тогда
		// Не заполняем
		
	ИначеЕсли Конф = "БГУ2" Тогда
		СчетаУчета = Новый Структура("СчетУчета,СчетУчетаНДС,ДанныеСчетаДляСтроки");
		
		//+++ В зависимости от типа заполняемого документа общий модуль может быть другой, пока предполагаем, что заполняется ПоступлениеМЗ
		МодульУправлениеМатериальнымиЗапасамиВызовСервера = _ЗФ_ПолучитьОбщийМодульКонфигурации("УправлениеМатериальнымиЗапасамиВызовСервера");
		Если МодульУправлениеМатериальнымиЗапасамиВызовСервера <> Неопределено Тогда
			СчетаУчета.СчетУчета = МодульУправлениеМатериальнымиЗапасамиВызовСервера.СчетУчетаНоменклатуры(СтруктураДанных.Номенклатура);
		КонецЕсли;
		
		МодульУправлениеМатериальнымиЗапасамиКлиентСервер = _ЗФ_ПолучитьОбщийМодульКонфигурации("УправлениеМатериальнымиЗапасамиКлиентСервер");

		//Данных об объекте документа у нас пока нет, передадим пустой объект
		ПараметрыОбработки = МодульУправлениеМатериальнымиЗапасамиКлиентСервер.ПараметрыУстановкиСчетаУчетаВСтроке(Документы.ПоступлениеМЗ.СоздатьДокумент());
		СчетаУчета.ДанныеСчетаДляСтроки = МодульУправлениеМатериальнымиЗапасамиВызовСервера.ПолучитьДанныеСчетаУчетаНоменклатуры(ПараметрыОбработки);
	КонецЕсли;
	
	Возврат СчетаУчета;
	
КонецФункции

&НаКлиенте
Функция СчетаУчета_ЗаполнитьАналитикуСчетовУчета(СтрокаНоменклатуры,СчетаУчета = Неопределено)
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	
	Если Конф = "БП30" Тогда
		//Определяем по типу значения субконто, в какое из полей доп. описания поместить значение каждого полученного Субконто
		Если СчетаУчета <> Неопределено Тогда
			
			Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
				//+++ Пока не обрабатываем
				
			ИначеЕсли СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "BLR" Тогда
				//+++ Пока не обрабатываем
				
			Иначе
				Если ТипЗнч(СчетаУчета.Субконто1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
					СтрокаНоменклатуры.Номенклатура_СтатьяЗатрат = СчетаУчета.Субконто1;
				ИначеЕсли ТипЗнч(СчетаУчета.Субконто2) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
					СтрокаНоменклатуры.Номенклатура_СтатьяЗатрат = СчетаУчета.Субконто2;
				ИначеЕсли ТипЗнч(СчетаУчета.Субконто3) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
					СтрокаНоменклатуры.Номенклатура_СтатьяЗатрат = СчетаУчета.Субконто3;
				КонецЕсли;
				
				Если ТипЗнч(СчетаУчета.Субконто1) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
					СтрокаНоменклатуры.Номенклатура_НоменклатурнаяГруппа = СчетаУчета.Субконто1;
				ИначеЕсли ТипЗнч(СчетаУчета.Субконто2) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
					СтрокаНоменклатуры.Номенклатура_НоменклатурнаяГруппа = СчетаУчета.Субконто2;
				ИначеЕсли ТипЗнч(СчетаУчета.Субконто3) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
					СтрокаНоменклатуры.Номенклатура_НоменклатурнаяГруппа = СчетаУчета.Субконто3;
				КонецЕсли;
				
				//Заполняем ПодразделениеЗатрат и СпособУчетаНДС, установленные для счета учета настройками базы
				СтрокаНоменклатуры.Номенклатура_СпособУчетаНДС = СчетаУчета.СпособУчетаНДС;
				Если СчетаУчета.Свойство("ПодразделениеЗатрат") Тогда
					СтрокаНоменклатуры.Номенклатура_ПодразделениеЗатрат = СчетаУчета.ПодразделениеЗатрат;
				КонецЕсли;		
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Конф = "БГУ2" Тогда
		//+++ заполнение аналитики по данным счета
				
	КонецЕсли;
	
	//Если не заполнили - берем из настроек
	Если Не ЗначениеЗаполнено(СтрокаНоменклатуры.Номенклатура_СтатьяЗатрат) Тогда
		СтрокаНоменклатуры.Номенклатура_СтатьяЗатрат = СтруктураНастроек.Номенклатура_СтатьяЗатратПоУмолчанию;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаНоменклатуры.Номенклатура_НоменклатурнаяГруппа) Тогда
		Если СтрокаНоменклатуры.ДополнительноеОписаниеОбъекта = "Услуга" Тогда
			СтрокаНоменклатуры.Номенклатура_НоменклатурнаяГруппа = СтруктураНастроек.Номенклатура_НоменклатурнаяГруппаУслуга;
		ИначеЕсли СтрокаНоменклатуры.ДополнительноеОписаниеОбъекта = "Товар" Тогда
			СтрокаНоменклатуры.Номенклатура_НоменклатурнаяГруппа = СтруктураНастроек.Номенклатура_НоменклатурнаяГруппаТовар;
		Иначе
			СтрокаНоменклатуры.Номенклатура_НоменклатурнаяГруппа = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаНоменклатуры.Номенклатура_СпособУчетаНДС) Тогда
		СтрокаНоменклатуры.Номенклатура_СпособУчетаНДС = СтруктураНастроек.ЗаполнениеТЧ_СпособУчетаНДСПоУмолчанию;
	КонецЕсли;
	
КонецФункции


// ================= Групповая обработка выделенных строк ===================

&НаКлиенте
Процедура ЗагружаемыеОбъекты_ВыбратьНоменклатуру(Команда)
	
	МассивИдентификаторов = Новый Массив;
	ЕстьЗаполненнныеЗначения = Ложь;
	
	Для Каждого ИдентификаторСтроки Из Элементы.ЗагружаемыеОбъекты.ВыделенныеСтроки Цикл
		ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		Если ТекСтрока.ТипОбъекта = "Номенклатура" Тогда
			
			МассивИдентификаторов.Добавить(ИдентификаторСтроки);
			
			Если ЗначениеЗаполнено(ТекСтрока.Объект1с) Тогда
				ЕстьЗаполненнныеЗначения = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивИдентификаторов.Количество() = 0 Тогда
		Попытка КартинкаОшибка = БиблиотекаКартинок.Ошибка32; Исключение; КартинкаОшибка = Новый Картинка; КонецПопытки;
		ПоказатьОповещениеПользователя("Нет выделенных строк для выбора номенклатуры",,,КартинкаОшибка);
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("МассивИдентификаторов",МассивИдентификаторов);
	
	Если ЕстьЗаполненнныеЗначения Тогда
		ТекстВопроса = "Действие для уже установленных соответствий номенклатуры в выбранных строках:";
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("Пропускать","Пропускать");
		Кнопки.Добавить("Перезаполнять","Перезаполнять");
		Кнопки.Добавить("Отмена","Отмена");
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","ЗагружаемыеОбъекты_ВыбратьНоменклатуру_ОбработатьРанееЗаполненные",ДопПараметры,ТекстВопроса,Кнопки);
		
		_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
	Иначе
		ЗагружаемыеОбъекты_ВыбратьНоменклатуру_ОбработатьРанееЗаполненные("Перезаполнять",ДопПараметры)
	КонецЕсли;
		
КонецПроцедуры
&НаКлиенте
Процедура ЗагружаемыеОбъекты_ВыбратьНоменклатуру_ОбработатьРанееЗаполненные(Результат,ДопПараметры)
	
	Если Результат = Неопределено Или Результат = "Отмена" Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры.Вставить("Перезаполнять",Результат = "Перезаполнять");
	
	ПараметрыОткрытия = Новый Структура;
	ФормаВыбора = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыОткрытия,ЭтаФорма);
				
	ПараметрыВызова = Новый Структура("Обработчик,ФормаВыбора,ДопПараметры","ОбработатьВыборИзФормыСписка_ОбщаяНоменклатура",ФормаВыбора,ДопПараметры);
	_ЗФ_ОбработатьАсинхронныйВызов("ВыборЗначенияИзФормыСписка",ПараметрыВызова);
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьВыборИзФормыСписка_ОбщаяНоменклатура(Результат,ДопПараметры)
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ИдентификаторСтроки Из ДопПараметры.МассивИдентификаторов Цикл
		ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ДопПараметры.Перезаполнять = Истина Или Не ЗначениеЗаполнено(ТекСтрока.Объект1с) Тогда
			ТекСтрока.Объект1с = Результат;
			ТекСтрока.СоответствиеУстановлено = Истина;
			ТекСтрока.СработавшийВариантПоиска = "Авто_ЧастичноеСовпадениеНаименования";
			
			УстановитьДополнительныеРеквизиты(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагружаемыеОбъекты_ЗапомнитьСопоставления(Команда)
	
	Для Каждого ИдентификаторСтроки Из Элементы.ЗагружаемыеОбъекты.ВыделенныеСтроки Цикл
		
		ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		//Обрабатываем только строки Номенклатуры
		Если ТекСтрока.ТипОбъекта = "Номенклатура" И ЗначениеЗаполнено(ТекСтрока.Объект1с) Тогда
			ТекстОповещения = ЗаписатьСоответствиеНоменклатуры(ТекСтрока.Объект1с,ТекСтрока.Номенклатура_Характеристика,ТекСтрока.ПредставлениеОбъекта,ТекСтрока.КонтрагентИД);
			ПоказатьОповещениеПользователя("Сохранено",,ТекстОповещения);
			ТекСтрока.СоответствиеУстановлено = Истина;
			ТекСтрока.СработавшийВариантПоиска = "Авто_ПолноеСовпадениеНаименования";			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗагружаемыеОбъекты_ОчиститьСоответствие(Команда)
	
	Для Каждого ИдентификаторСтроки Из Элементы.ЗагружаемыеОбъекты.ВыделенныеСтроки Цикл
		
		ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		//Очищаем только найденные соответствия
		Если ЗначениеЗаполнено(ТекСтрока.Объект1с) Тогда
			ТекСтрока.Объект1с = Неопределено;
			ТекСтрока.Пометка = Истина;
			ТекСтрока.СоответствиеУстановлено = Ложь;
			ТекСтрока.СработавшийВариантПоиска = "";
			
			УстановитьДополнительныеРеквизиты(ТекСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗагружаемыеОбъекты_ВыполнитьПоискПохожих(Команда)
	
	ДопПараметры = Новый Структура;
	
	//E1C-21: Умный поиск по артикулу, с отображением найденных номенклатур и их артикула
	Если СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Артикул"
		Или СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Артикул,Наименование"
		Или СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Наименование,Артикул" Тогда
		
		Попытка Картинка_Артикул = БиблиотекаКартинок.НайтиВСодержании; Исключение; Картинка_Артикул = Новый Картинка; КонецПопытки;
		Попытка Картинка_Наименование = БиблиотекаКартинок.Найти; Исключение; Картинка_Наименование = Новый Картинка; КонецПопытки;
		
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить("Артикул","Поиск по артикулам",,Картинка_Артикул);
		СписокВыбора.Добавить("Наименование","Поиск по наименованиям",,Картинка_Наименование);
			
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,СписокВыбора","ОбработатьВыборВариантаПоиска_АртикулНаименование",ДопПараметры,СписокВыбора);
		
		_ЗФ_ОбработатьАсинхронныйВызов("ВыборИзМеню",ПараметрыВызова);
		
	Иначе
		//Сразу выполняем поиск по наименованию, в настройках артикул не используется
		ОбработатьВыборВариантаПоиска_АртикулНаименование(Новый Структура("Значение","Наименование"),ДопПараметры);
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьВыборВариантаПоиска_АртикулНаименование(Результат,ДопПараметры)
	
	Если Результат <> Неопределено Тогда
	
		//Логика будет такая: если выделено > 1 строки - выполняем поиск только для них,
		//Если выделена одна или ни одной - для всех, для которых можно выполнить поиск похожих
		Если Элементы.ЗагружаемыеОбъекты.ВыделенныеСтроки.Количество() > 1 Тогда
			//Обрабатываем все
			МассивСтрок = Элементы.ЗагружаемыеОбъекты.ВыделенныеСтроки;		
		КонецЕсли;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрок",МассивСтрок);
		ДопПараметры.Вставить("ВариантПоиска",Результат.Значение);
		
		Если Результат.Значение = "Наименование" Тогда
			
			ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,Число,Подсказка,Длина,Точность","ОбработатьВыборПроцента_ВыполнитьПоискПохожих",ДопПараметры,ПроцентСоответствияАвтоПоиск,"Минимальный % совпадения",3,0);
			
			_ЗФ_ОбработатьАсинхронныйВызов("ВводЧисла",ПараметрыВызова);
			
		ИначеЕсли Результат.Значение = "Артикул" Тогда
			ОбработатьВыборПроцента_ВыполнитьПоискПохожих(ПроцентСоответствияАвтоПоиск,ДопПараметры);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборПроцента_ВыполнитьПоискПохожих(Результат,ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ПроцентСоответствияАвтоПоиск = Результат;
				
		ОбрабатываемТолькоВыделенныеСтроки = ЗначениеЗаполнено(ДопПараметры.МассивСтрок);
		
		Для Каждого СтрокаТаблицы Из Объект.ЗагружаемыеОбъекты Цикл
			
			ПроцентВыполнения = Объект.ЗагружаемыеОбъекты.Индекс(СтрокаТаблицы) / Объект.ЗагружаемыеОбъекты.Количество() * 100;
			Состояние("Выполняется поиск номенклатуры...",ПроцентВыполнения);
			
			Если ОбрабатываемТолькоВыделенныеСтроки
				И ДопПараметры.МассивСтрок.Найти(СтрокаТаблицы.ПолучитьИдентификатор()) = Неопределено Тогда
				//Невыделенные строки при переданном массиве идентификаторов пропускаем
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.Объект1с) Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура("ПроцентСоответствияАвтоПоиск",ПроцентСоответствияАвтоПоиск);
			
			//Поиск похожих сейчас выполняется только для номенклатуры
			Если СтрокаТаблицы.ТипОбъекта = "Номенклатура" Тогда
				
				РезультатПоиска = Неопределено;
				
				Если ДопПараметры.ВариантПоиска = "Наименование" Тогда
				
					СтруктураПоиска.Вставить("СтрокаПоиска",СтрокаТаблицы.ПредставлениеОбъекта);
					СтруктураПоиска.Вставить("КонтрагентИД",СтрокаТаблицы.КонтрагентИД);
					СтруктураПоиска.Вставить("ДополнятьПользовательскимиСоответствиями",СтруктураНастроек.Номенклатура_ИспользоватьВподбореУстановленныеВручнуюСоответствия);
					СтруктураПоиска.Вставить("Приоритет",СтруктураНастроек.Номенклатура_ПриоритетПриПоискеСопоставленийНоменклатуры);
					СтруктураПоиска.Вставить("РазмерСпискаПохожейНоменклатуры",10);
					
					//Для поиска по Номенклатуре поставщиков нужен отбор по Владельцу
					СтруктураПоиска.Вставить("ПоискПоНоменклатуреПоставщиков",ПоискПоНоменклатуреПоставщиков);
					СтруктураПоиска.Вставить("НоменклатураПоставщиков_ИмяСправочника",СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_ИмяСправочника);
					
					//2020.12.23 ( Добавлена настройка для выбора групп поиска
					СписокГрупп = ПолучитьСписокГруппДляПоискаНоменклатуры(СтрокаТаблицы);
						
					Если СписокГрупп.Количество() > 0 Тогда
						СтруктураПоиска.Вставить("СписокГрупп",СписокГрупп);
					КонецЕсли;
					// ) 2020.12.23
					
					Если ПоискПоНоменклатуреПоставщиков Тогда
						СтрокиКонтрагента = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ТипОбъекта,ДокументИД","Контрагенты",СтрокаТаблицы.ДокументИД));
						Если СтрокиКонтрагента.Количество() > 0 Тогда
							Если СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_Владелец = "Партнер" Тогда
								СтруктураПоиска.Вставить("Владелец",СтрокиКонтрагента[0].Контрагенты_Партнер);
							ИначеЕсли СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_Владелец = "Контрагент" Тогда
								СтруктураПоиска.Вставить("Владелец",СтрокиКонтрагента[0].Объект1с);
							Иначе
								//Отбор по владельцу не будем устанавливать
								СтруктураПоиска.Вставить("Владелец");
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					//2022.06.29 ( Поиск по полному наименованию	
					Если СтруктураНастроек.Номенклатура_АлгоритмПоискаНоменклатуры = "Наименование полное" Тогда
						СтруктураПоиска.Вставить("ИмяРеквизита","НаименованиеПолное");
					КонецЕсли;
					// ) 2022.06.29
					
					//УНФ: отбор по реквизиту 
					Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаНедействителен) И ПоискПоНоменклатуреПоставщиков = Ложь Тогда
						КлючОтбора = СтруктураНастроек.СведенияОКонфигурации.Номенклатура_ИмяРеквизитаНедействителен;
						СтруктураПоиска.Вставить("ОтборНедействителен",КлючОтбора);
					КонецЕсли;
					
					РезультатПоиска = ОбработатьВыборПроцента_ВыполнитьПоискПохожихНаСервере("Номенклатура",СтруктураПоиска);
					
				Иначе
					//Пустые артикулы пропускаем
					Если ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура_Код) Тогда
						СтруктураПоиска.Вставить("СтрокаПоиска",СтрокаТаблицы.Номенклатура_Код);
						СтруктураПоиска.Вставить("КонтрагентИД",СтрокаТаблицы.КонтрагентИД);
						СтруктураПоиска.Вставить("РазмерСпискаПохожейНоменклатуры",1); //большее количество не требуется
						
						//Для поиска по Номенклатуре поставщиков нужен отбор по Владельцу
						СтруктураПоиска.Вставить("ПоискПоНоменклатуреПоставщиков",ПоискПоНоменклатуреПоставщиков);
						
						Если ПоискПоНоменклатуреПоставщиков Тогда
							СтрокиКонтрагента = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ТипОбъекта,ДокументИД","Контрагенты",СтрокаТаблицы.ДокументИД));
							Если СтрокиКонтрагента.Количество() > 0 Тогда
								Если СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_Владелец = "Партнер" Тогда
									СтруктураПоиска.Вставить("Владелец",СтрокиКонтрагента[0].Контрагенты_Партнер);
								ИначеЕсли СтруктураНастроек.СведенияОКонфигурации.НоменклатураПоставщиков_Владелец = "Контрагент" Тогда
									СтруктураПоиска.Вставить("Владелец",СтрокиКонтрагента[0].Объект1с);
								Иначе
									//Отбор по владельцу не будем устанавливать
									СтруктураПоиска.Вставить("Владелец");
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						
						РезультатПоиска = ВыполнитьПоиск_Артикул("Номенклатура",СтруктураПоиска);
						
					Иначе
						СтрокаТаблицы.СработавшийВариантПоиска = "Авто_АртикулНеЗаполнен";
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если РезультатПоиска <> Неопределено Тогда
					
					Если ПоискПоНоменклатуреПоставщиков Тогда
						СтрокаТаблицы.Номенклатура_НоменклатураПоставщика = РезультатПоиска.Ссылка;
						СтрокаТаблицы.Объект1с = ПолучитьЗначениеРеквизитаОбъекта(РезультатПоиска.Ссылка,"Номенклатура");
						СтрокаТаблицы.Номенклатура_Характеристика = ПолучитьЗначениеРеквизитаОбъекта(РезультатПоиска.Ссылка,"Характеристика");
						
					Иначе
						СтрокаТаблицы.Объект1с = РезультатПоиска.Ссылка;
						
					КонецЕсли;
					
					СтрокаТаблицы.СоответствиеУстановлено = ЗначениеЗаполнено(СтрокаТаблицы.Объект1с);
					
					Если СтрокаТаблицы.СоответствиеУстановлено Тогда
						СтрокаТаблицы.Пометка = Ложь;
						Если ДопПараметры.ВариантПоиска = "Наименование" Тогда
							Если РезультатПоиска.ПроцентВхождения = 100 Тогда
								СтрокаТаблицы.СработавшийВариантПоиска = "Авто_ПолноеСовпадениеНаименования";
							Иначе
								СтрокаТаблицы.СработавшийВариантПоиска = "Авто_ЧастичноеСовпадениеНаименования";
							КонецЕсли;
							
						ИначеЕсли ДопПараметры.ВариантПоиска = "Артикул" Тогда
							Если РезультатПоиска.ПроцентВхождения = 100 Тогда
								СтрокаТаблицы.СработавшийВариантПоиска = "Авто_ПолноеСовпадениеАртикула";
							Иначе
								СтрокаТаблицы.СработавшийВариантПоиска = "Авто_ЧастичноеСовпадениеАртикула";
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли;				
					
					УстановитьДополнительныеРеквизиты(СтрокаТаблицы);
					
				КонецЕсли;
				
			КонецЕсли;
						
		КонецЦикла;
			
	КонецЕсли;
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция ОбработатьВыборПроцента_ВыполнитьПоискПохожихНаСервере(ТипОбъекта,СтруктураПоиска)
	
	Результат = Новый Структура("Ссылка,ПроцентВхождения",,0);
	
	ПоискПоНоменклатуреПоставщиков = СтруктураПоиска.Свойство("ПоискПоНоменклатуреПоставщиков") И СтруктураПоиска.ПоискПоНоменклатуреПоставщиков = Истина;
	
	//Поиск похожих сейчас выполняется только для номенклатуры
	Если ТипОбъекта = "Номенклатура" Тогда
		Если ПоискПоНоменклатуреПоставщиков Тогда
			ИмяСправочника = СтруктураПоиска.НоменклатураПоставщиков_ИмяСправочника;
		Иначе
			ИмяСправочника = "Номенклатура";
		КонецЕсли;
		Таблица = ЗаполнитьТаблицуСравнения(ИмяСправочника,СтруктураПоиска);
	КонецЕсли;
	
	Если Таблица <> Неопределено И Таблица.Количество() > 0 Тогда
		Если Таблица[0].ПроцентВхождения >= СтруктураПоиска.ПроцентСоответствияАвтоПоиск Тогда
			Результат.Ссылка = Таблица[0].Ссылка;
			Результат.ПроцентВхождения = Таблица[0].ПроцентВхождения;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
&НаСервереБезКонтекста
Функция ВыполнитьПоиск_Артикул(ТипОбъекта,СтруктураПоиска)
	
	Результат = Новый Структура("Ссылка,ПроцентВхождения",,0);
	
	//Поиск похожих сейчас выполняется только для номенклатуры
	Если ТипОбъекта = "Номенклатура" Тогда
		
		ПоискПоНоменклатуреПоставщиков = СтруктураПоиска.Свойство("ПоискПоНоменклатуреПоставщиков") И СтруктураПоиска.ПоискПоНоменклатуреПоставщиков = Истина;
	
		Если ПоискПоНоменклатуреПоставщиков Тогда
			ИмяСправочника = СтруктураПоиска.НоменклатураПоставщиков_ИмяСправочника;
		Иначе
			ИмяСправочника = "Номенклатура";
		КонецЕсли;
		
		СоответствияСимволов = ПолучитьСоответствияКириллицыЛатиницы();
		
		//Формируем строку для поиска: по описанию задачи исключаем из поиска знаки препинания, оставляем только числовые и буквенные значения
		//подходящей номенклатурой будет считаться та, у которой встречается та же последовательность знаков, как и в искомой строке
		
		СтрокаПоиска = "";
		СтрокаПодсчетаВхождения = "";
		
		Для Счет = 1 По СтрДлина(СтруктураПоиска.СтрокаПоиска) Цикл
			ТекСимвол = Сред(СтруктураПоиска.СтрокаПоиска,Счет,1);
			
			//Исключить символы, не подходящие под условие задачи
			Если Не СимволАртикулаСоответствуетШаблону(ТекСимвол) Тогда
				Продолжить;
			КонецЕсли;
			
			//Если есть аналогичный символ в другой раскладке - добавим его в той же позиции
			Аналог = СоответствияСимволов.Получить(ТекСимвол);
			
			Если Аналог = Неопределено Тогда
				СтрокаПоиска = СтрокаПоиска + "" + ТекСимвол + "%";
			Иначе
				СтрокаПоиска = СтрокаПоиска + "[" + ТекСимвол + Аналог + "]%";
			КонецЕсли;
			
			СтрокаПодсчетаВхождения = СтрокаПодсчетаВхождения + ТекСимвол;
		КонецЦикла;
		
		Если СтруктураПоиска.Свойство("Владелец") Тогда
			Владелец = СтруктураПоиска.Владелец;
		КонецЕсли;
		
		//Проверка на наличие реквизита "Владелец" у справочника
		ОтборПоВладельцу = "";
		Если Метаданные.Справочники[ИмяСправочника].Владельцы.Количество() > 0 И Владелец <> Неопределено Тогда
			Если ТипЗнч(Владелец) = Тип("Строка") Тогда
				ОтборПоВладельцу = "И ИсходныйСправочник.Владелец.Наименование = &Владелец ";
			Иначе
				ОтборПоВладельцу = "И ИсходныйСправочник.Владелец = &Владелец ";
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
			СтрокаПоиска = "%" + СтрокаПоиска;
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ИсходныйСправочник.Ссылка КАК Ссылка,
						   |	ИсходныйСправочник.Наименование КАК Представление,
						   |	ИсходныйСправочник.Артикул КАК Артикул,
			               |	0 КАК ПроцентВхождения
			               |ИЗ
			               |	Справочник." + ИмяСправочника + " КАК ИсходныйСправочник
			               |ГДЕ
			               |	ИсходныйСправочник.Артикул ПОДОБНО &СтрокаПоиска " + ОтборПоВладельцу;
			Запрос.УстановитьПараметр("СтрокаПоиска",СтрокаПоиска);
			
			//Проверка на наличие реквизита "Владелец" у справочника
			Если ОтборПоВладельцу <> "" И Владелец <> Неопределено Тогда
				Запрос.УстановитьПараметр("Владелец",Владелец);
			КонецЕсли;
						
			Таблица = Запрос.Выполнить().Выгрузить();
	
			Для Каждого СтрокаТаблицы Из Таблица Цикл
				СтрокаТаблицы.ПроцентВхождения = ПодсчитатьПроцентВхождения(СтрокаПодсчетаВхождения,СтрокаТаблицы.Артикул);
				СтрокаТаблицы.Представление = "[" + СтрокаТаблицы.ПроцентВхождения + "%] " + СтрокаТаблицы.Представление + " [А]";
			КонецЦикла;
			
			Таблица.Сортировать("ПроцентВхождения УБЫВ");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Таблица <> Неопределено И Таблица.Количество() > 0 Тогда
		Результат.Ссылка = Таблица[0].Ссылка;
		Результат.ПроцентВхождения = Таблица[0].ПроцентВхождения;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
&НаСервереБезКонтекста
Функция СимволАртикулаСоответствуетШаблону(Символ)
	ИсключаемыеСимволы = " -,.?/\|";
	Возврат Найти(ИсключаемыеСимволы,Символ) = 0;
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьСоответствияКириллицыЛатиницы()
	
	//Артикул с буквами, имеющими одинаковое написание в латинице и кириллице, может быть распознан в раскладке,
	//отличающейся от той, в которой он был введен в 1с, сформируем варинты возможных написаний артикула:
	//E,T,O,P,A,H,K,X,C,B,M
	//e,y,o,p,a,x,c
	
	Соответствия = Новый Соответствие;
	Соответствия.Вставить("E","Е");
	Соответствия.Вставить("T","Т");
	Соответствия.Вставить("O","О");
	Соответствия.Вставить("P","Р");
	Соответствия.Вставить("A","А");
	Соответствия.Вставить("H","Н");
	Соответствия.Вставить("K","К");
	Соответствия.Вставить("X","Х");
	Соответствия.Вставить("C","С");
	Соответствия.Вставить("B","В");
	Соответствия.Вставить("M","М");
	Соответствия.Вставить("e","е");
	Соответствия.Вставить("y","у");
	Соответствия.Вставить("o","о");
	Соответствия.Вставить("p","р");
	Соответствия.Вставить("a","а");
	Соответствия.Вставить("x","х");
	Соответствия.Вставить("c","с");
	
	//Также предусмотрим обратную ситуацию
	Для Каждого ЭлементСоответствия Из Соответствия Цикл
		Соответствия.Вставить(ЭлементСоответствия.Значение,ЭлементСоответствия.Ключ);
	КонецЦикла;
	
	Возврат Соответствия;
	
КонецФункции

&НаКлиенте
Процедура УстановитьТипНоменклатурыВыделеннымСтрокам(Команда) Экспорт
	
	Значение = СтрЗаменить(Команда.Имя,"ТипНоменклатуры_","");
	
	Для Каждого ИдентификаторСтроки Из Элементы.ЗагружаемыеОбъекты.ВыделенныеСтроки Цикл
		ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ТекСтрока.ТипОбъекта = "Номенклатура" Тогда
			ОбработатьВыборЗначенияИзСписка(Новый Структура("Значение",Значение),Новый Структура("ИдентификаторСтроки",ИдентификаторСтроки));
			СчетаУчета_ЗаполнитьСчетаУчетаВСтрокеНоменклатуры(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМаркерНоменклатуры(Команда) Экспорт
	
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда		
		Если ТекСтрока.ТипОбъекта = "Номенклатура" И ЗначениеЗаполнено(ТекСтрока.ПредставлениеОбъекта) Тогда
			
			НовыйМаркер = Новый Структура;
			НовыйМаркер.Вставить("Маркер",ТекСтрока.ПредставлениеОбъекта);
			НовыйМаркер.Вставить("Номенклатура",ТекСтрока.Объект1с);
			
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("ДоступноОписаниеОповещения",ДоступноОписаниеОповещения);
			ПараметрыОткрытия.Вставить("СтруктураНастроек",СтруктураНастроек);
			ПараметрыОткрытия.Вставить("ПрефиксИмениФорм",ПрефиксИмениФорм);
			ПараметрыОткрытия.Вставить("НовыйМаркер",НовыйМаркер);			
			
			ФормаСопоставлений = ПолучитьФорму(ПрефиксИмениФорм + "УФ_РедактированиеСопоставлений", ПараметрыОткрытия, ВладелецФормы);
			ФормаСопоставлений.Открыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Номенклатура_ВидНоменклатурыПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_ВидНоменклатуры");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_РодительПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_Родитель");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_ЕдиницаИзмеренияПриИзменении(Элемент)
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	
	Если Конф = "УНФ" Или Конф = "РОЗН3" Тогда
		//Групповая установка единиц измерения не выполняется, единицы могут быть подчинены владельцу
		
	Иначе
		//2019.09.03 ( Сохраняем связь единицы измерения
		Если СтруктураНастроек.ЗаполнениеТЧ_ИспользоватьКоэффициентПересчета Тогда
			ТекстОповещения = ЗаписатьСоответствиеЕдиницыИзмерения(Элементы.ЗагружаемыеОбъекты.ТекущаяСтрока);
			ПоказатьОповещениеПользователя("Сохранено",,ТекстОповещения);
		КонецЕсли;
		// ) 2019.09.03
	
		ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_ЕдиницаИзмерения");
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_КоэффициентПересчетаПриИзменении(Элемент)
	
	//2019.09.03 ( Сохраняем связь единицы измерения
	Если СтруктураНастроек.ЗаполнениеТЧ_ИспользоватьКоэффициентПересчета Тогда
		ТекстОповещения = ЗаписатьСоответствиеЕдиницыИзмерения(Элементы.ЗагружаемыеОбъекты.ТекущаяСтрока);
		ПоказатьОповещениеПользователя("Сохранено",,ТекстОповещения);
	КонецЕсли;
	// ) 2019.09.03
	
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_КоэффициентПересчета");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_СчетУчетаПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_СчетУчета");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_СчетУчетаНДСПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_СчетУчетаНДС");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_СчетУчетаЗапасовПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_СчетУчетаЗапасов");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_СчетУчетаЗатратПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_СчетУчетаЗатрат");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_ГруппаФинансовогоУчетаПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_ГруппаФинансовогоУчета");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_ГруппаАналитическогоУчетаПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_ГруппаАналитическогоУчета");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_СтатьяДоходовПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_СтатьяДоходов");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_СтатьяРасходовПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	
	//Тип связанного элемента
	ЭлементАналитика = Элементы.Номенклатура_АналитикаРасходов;
	ЭлементАналитика.ОграничениеТипа = ПолучитьЗначениеРеквизитаОбъекта(ТекСтрока.Номенклатура_СтатьяРасходов,"ТипЗначения");
	
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_СтатьяРасходов");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_АналитикаРасходовПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_АналитикаРасходов");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_СтатьяЗатратПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_СтатьяЗатрат");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_НоменклатурнаяГруппаПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_НоменклатурнаяГруппа");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_ПодразделениеЗатратПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_ПодразделениеЗатрат");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_КатегорияПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_Категория");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_НаправлениеДеятельностиПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_НаправлениеДеятельности");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_ОбъектПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_Объект");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_СпособУчетаНДСПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_СпособУчетаНДС");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_КПСПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_КПС");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_КФОПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_КФО");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_КЭКПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_КЭК");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_НДСВидПоступленияПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_НДСВидПоступления");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_КомитентПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_Комитент");
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_ДоговорКомитентаПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_ДоговорКомитента");
КонецПроцедуры

&НаКлиенте
Процедура Номенклатура_СпособУчетаНДСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//E1C-259: Выбор в настройках Способ учета НДС любых значений этого перечисления,
	//включая "Списывается, не принимается к НУ", доступный программно из Авансового отчета
	НовыйПараметр = Новый ПараметрВыбора("ОграничениеСпискаВыбора", "НеОграничивать");
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элемент.ПараметрыВыбора = НовыеПараметры;
КонецПроцедуры


&НаКлиенте
Процедура ОсновныеСредства_ЗаводскойНомерПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("ОсновныеСредства_ЗаводскойНомер");
КонецПроцедуры
&НаКлиенте
Процедура ОсновныеСредства_ТипОСПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("ОсновныеСредства_ТипОС");
КонецПроцедуры
&НаКлиенте
Процедура ОсновныеСредства_РодительПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("ОсновныеСредства_Родитель");
КонецПроцедуры
&НаКлиенте
Процедура ОсновныеСредства_ГруппаОСПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("ОсновныеСредства_ГруппаОС");
КонецПроцедуры
&НаКлиенте
Процедура ОсновныеСредства_ЕдиницаУчетаПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("ОсновныеСредства_ЕдиницаУчета");
КонецПроцедуры
&НаКлиенте
Процедура ОсновныеСредства_АмортизационнаяГруппаПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("ОсновныеСредства_АмортизационнаяГруппа");
КонецПроцедуры
&НаКлиенте
Процедура ОсновныеСредства_КодПоОКОФПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("ОсновныеСредства_КодПоОКОФ");
КонецПроцедуры
&НаКлиенте
Процедура ОсновныеСредства_ИзготовительПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("ОсновныеСредства_Изготовитель");
КонецПроцедуры
&НаКлиенте
Процедура ОсновныеСредства_ИнвентарныйНомерПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("ОсновныеСредства_ИнвентарныйНомер");
КонецПроцедуры
&НаКлиенте
Процедура ОсновныеСредства_НомерПаспортаПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("ОсновныеСредства_НомерПаспорта");
КонецПроцедуры
&НаКлиенте
Процедура ОсновныеСредства_СрокСлужбыПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("ОсновныеСредства_СрокСлужбы");
КонецПроцедуры
&НаКлиенте
Процедура ОсновныеСредства_ДатаВыпускаПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("ОсновныеСредства_ДатаВыпуска");
КонецПроцедуры


&НаКлиенте
Процедура ИсточникиПроисхождения_СтранаПроисхожденияПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("ИсточникиПроисхождения_СтранаПроисхождения");
КонецПроцедуры
&НаКлиенте
Процедура ИсточникиПроисхождения_ПризнакПроисхожденияПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("ИсточникиПроисхождения_ПризнакПроисхождения");
КонецПроцедуры
&НаКлиенте
Процедура ИсточникиПроисхождения_СпособПроисхожденияПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("ИсточникиПроисхождения_СпособПроисхождения");
КонецПроцедуры


&НаКлиенте
Процедура Документ_ДатаСоздаваемогоДокументаПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Документ_ДатаСоздаваемогоДокумента");
КонецПроцедуры
&НаКлиенте
Процедура Документ_СкладПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Документ_Склад");
КонецПроцедуры
&НаКлиенте
Процедура Документ_ПодотчетноеЛицоПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Документ_ПодотчетноеЛицо");
КонецПроцедуры
&НаКлиенте
Процедура Документ_НаправлениеДеятельностиПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Документ_НаправлениеДеятельности");
КонецПроцедуры
&НаКлиенте
Процедура Документ_ОбъектРасчетовПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Документ_ОбъектРасчетов");
КонецПроцедуры
&НаКлиенте
Процедура Документ_ВедетсяУчетПредметовАрендыПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Документ_ВедетсяУчетПредметовАренды");
КонецПроцедуры
&НаКлиенте
Процедура Документ_НоменклатурнаяГруппаПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Документ_НоменклатурнаяГруппа");
КонецПроцедуры
&НаКлиенте
Процедура Документ_ПодразделениеПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Документ_Подразделение");
КонецПроцедуры
&НаКлиенте
Процедура Документ_ПодразделениеОрганизацииПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Документ_ПодразделениеОрганизации");
КонецПроцедуры
&НаКлиенте
Процедура Документ_ИФОПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Документ_ИФО");
КонецПроцедуры
&НаКлиенте
Процедура Документ_ОригиналПолученПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Документ_ОригиналПолучен");
КонецПроцедуры
&НаКлиенте
Процедура Документ_ДокументОснованиеПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Документ_ДокументОснование");
КонецПроцедуры


&НаКлиенте
Процедура Документ_ВидОперацииПриИзменении(Элемент)
	// 2022.02.24 ( Дадим выбрать подотчетное лицо
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	
	Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат = "БП30" Тогда
		
		//2023.09.13 (
		Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","УслугиАренды") Тогда
			Элементы.Документ_ВедетсяУчетПредметовАренды.Видимость = ТекСтрока.ТипСоздаваемогоДокумента = "ПоступлениеТоваровУслуг"
				И ТекСтрока.Документ_ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.УслугиАренды");
		Иначе
			Элементы.Документ_ВедетсяУчетПредметовАренды.Видимость = Ложь;
		КонецЕсли;
		// ) 2023.09.13
		
	Иначе
		Элементы.Документ_ПодотчетноеЛицо.Видимость = (ТекСтрока.ТипСоздаваемогоДокумента = "ПриобретениеТоваровУслуг"
				И ТекСтрока.Документ_ВидОперации = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо"))
			//2025.08.13 ( Старая УТ11.1	
			Или (СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Полн = "УТ11.1" И ТекСтрока.ТипСоздаваемогоДокумента = "ПоступлениеТоваровУслуг"
				И ТекСтрока.Документ_ВидОперации = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо"));
			// ) 2025.08.13	
		
	КонецЕсли;
	// ) 2022.02.24
КонецПроцедуры
&НаКлиенте
Процедура Документ_ВидОперацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> Неопределено Тогда
		Элементы.ЗагружаемыеОбъекты.ТекущиеДанные.Документ_ВидОперации = ВыбранноеЗначение;
		ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Документ_ВидОперации");
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура Документ_ВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СтруктураНастроек.СведенияОКонфигурации.ВидыОперацийЗаполняемыхДокументов.Получить(Элементы.ЗагружаемыеОбъекты.ТекущиеДанные.ТипСоздаваемогоДокумента);
КонецПроцедуры

&НаКлиенте
Процедура Документ_ИмяТабличнойЧастиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьДанныеВыбора_ТабличныеЧастиДокумента(Элементы.ЗагружаемыеОбъекты.ТекущиеДанные.ТипСоздаваемогоДокумента);
КонецПроцедуры
&НаКлиенте
Процедура Документ_ИмяТабличнойЧастиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> Неопределено Тогда
		Элементы.ЗагружаемыеОбъекты.ТекущиеДанные.Документ_ИмяТабличнойЧасти = ВыбранноеЗначение;
		ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Документ_ИмяТабличнойЧасти");
	КонецЕсли;
КонецПроцедуры
&НаСервереБезКонтекста
Функция ПолучитьДанныеВыбора_ТабличныеЧастиДокумента(ТипСоздаваемогоДокумента)
	
	СписокТЧ = Новый СписокЗначений;
	
	Для Каждого ИмяТЧ Из Метаданные.Документы[ТипСоздаваемогоДокумента].ТабличныеЧасти Цикл
		СписокТЧ.Добавить(ИмяТЧ.Имя,ИмяТЧ.Синоним);
	КонецЦикла;
	
	Возврат СписокТЧ;
	
КонецФункции

&НаКлиенте
Процедура Документ_ОбъектРасчетовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбъектРасчетов = ПредопределенноеЗначение("Справочник.ОбъектыРасчетов.ПустаяСсылка");
	
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ОбъектРасчетов = ТекСтрока.Документ_ОбъектРасчетов;
		Сумма = ТекСтрока.Документ_Сумма;
		
		СтрокиКонтрагента = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ТипОбъекта,ДокументИД","Контрагенты",ТекСтрока.ДокументИД));
		Если СтрокиКонтрагента.Количество() > 0 Тогда
			Контрагент = СтрокиКонтрагента[0].Объект1с;
			Партнер = СтрокиКонтрагента[0].Контрагенты_Партнер;
		КонецЕсли;
		
		СтрокиОрганизации = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ТипОбъекта,ДокументИД","Организации",ТекСтрока.ДокументИД));
		Если СтрокиОрганизации.Количество() > 0 Тогда
			Организация = СтрокиОрганизации[0].Объект1с;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗначенияОтбора = Новый Структура;
	Если ЗначениеЗаполнено(Организация) Тогда
		ЗначенияОтбора.Вставить("Организация",Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ЗначенияОтбора.Вставить("Контрагент",Контрагент);
	КонецЕсли;
	Если ЗначениеЗаполнено(Партнер) Тогда
		ЗначенияОтбора.Вставить("Партнер",Партнер);
	КонецЕсли;
	
	НастройкиВыбора = Новый Структура;
	НастройкиВыбора.Вставить("УчитыватьФилиалы", Истина);
	НастройкиВыбора.Вставить("ВыборОснованияПлатежа", Ложь);
	НастройкиВыбора.Вставить("РедактируемыйДокумент", Неопределено);
	НастройкиВыбора.Вставить("Сумма", Сумма);
	НастройкиВыбора.Вставить("Отбор", ЗначенияОтбора);
	
	Если ОбъектРасчетов <> Неопределено Тогда
		НастройкиВыбора.Вставить("ТекущееЗначение", ОбъектРасчетов);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ОбъектыРасчетов.Форма.ФормаВыбора", НастройкиВыбора, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Документ_ДокументыПоступленияДляДопРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура Документ_ДокументыПоступленияДляДопРасходовПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		ЗначенияСпискаВыбора = ТекСтрока.Документ_ДокументыПоступленияДляДопРасходовСписок;
		Если ЗначениеЗаполнено(ЗначенияСпискаВыбора) Тогда
			ТекСтрока.Документ_ДокументыПоступленияДляДопРасходов = ЗначениеВСтрокуВнутрСервер(ЗначенияСпискаВыбора); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Контрагенты_НаименованиеПриИзменении(Элемент)
	
	//EN-357: Если контрагент не распознан, то на этапе сопоставления пользователь сможет
	//в панели доп.описания (справа) изменить поле "наименование" с трансляцией
	//этого наименования в поле "Полное наименование"
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(ТекСтрока.ПредставлениеОбъекта) Тогда
			ТекСтрока.ПредставлениеОбъекта = ТекСтрока.Контрагенты_Наименование;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекСтрока.Контрагенты_НаименованиеПолное) Тогда
			ТекСтрока.Контрагенты_НаименованиеПолное = ТекСтрока.Контрагенты_Наименование;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура Контрагенты_СоглашениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//Нужно в зависимости от направления документа выбрать тип справочника
	//и установить отбор по партнеру, если партнер еще не заполнен/создан - соглашение не выбираем
	
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		
		СтруктураОтбора = Новый Структура;
		
		Если ЗначениеЗаполнено(ТекСтрока.Контрагенты_Партнер) Тогда
			СтруктураОтбора.Вставить("Партнер",ТекСтрока.Контрагенты_Партнер);
		Иначе
			Попытка КартинкаОшибка = БиблиотекаКартинок.Ошибка32; Исключение; КартинкаОшибка = Новый Картинка; КонецПопытки;
			ПоказатьОповещениеПользователя("Не выбран партнер",,,КартинкаОшибка);
			Возврат;
		КонецЕсли;
		
		//Нужен отбор по организации? Форма выбора соглашения такого отбора в процедуре ПриСозданииНаСервере не предполагает
		
		ПараметрыОткрытияФормы = Новый Структура("Отбор",СтруктураОтбора);
		
		//E1C-337: ( Для документа ОтчетКомиссионера выбираем из соглашений с клиентами
		Если ТекСтрока.ТипСоздаваемогоДокумента = "ОтчетКомиссионера" Тогда
			ФормаВыбора = ПолучитьФорму("Справочник.СоглашенияСКлиентами.ФормаВыбора",ПараметрыОткрытияФормы,Элемент);
			
		Иначе
			Если ТекСтрока.Документ_Направление = "Исходящий" Тогда
				ФормаВыбора = ПолучитьФорму("Справочник.СоглашенияСКлиентами.ФормаВыбора",ПараметрыОткрытияФормы,Элемент);
			Иначе
				ФормаВыбора = ПолучитьФорму("Справочник.СоглашенияСПоставщиками.ФормаВыбора",ПараметрыОткрытияФормы,Элемент);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ФормаВыбора <> Неопределено Тогда
			ФормаВыбора.ЗакрыватьПриЗакрытииВладельца = Истина;
			ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
			ФормаВыбора.Открыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Договоры_ПодразделениеПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Договоры_Подразделение");
КонецПроцедуры
&НаКлиенте
Процедура Договоры_НаправлениеДеятельностиПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Договоры_НаправлениеДеятельности");
КонецПроцедуры
&НаКлиенте
Процедура Договоры_СтатьяДДСПриИзменении(Элемент)
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Договоры_СтатьяДДС");
КонецПроцедуры

&НаКлиенте
Процедура Договоры_НаименованиеПриИзменении(Элемент)
	Договоры_СформироватьПредставление(Элементы.ЗагружаемыеОбъекты.ТекущаяСтрока);
КонецПроцедуры
&НаКлиенте
Процедура Договоры_НомерПриИзменении(Элемент)
	Договоры_СформироватьПредставление(Элементы.ЗагружаемыеОбъекты.ТекущаяСтрока);
КонецПроцедуры
&НаКлиенте
Процедура Договоры_ДатаПриИзменении(Элемент)
	Договоры_СформироватьПредставление(Элементы.ЗагружаемыеОбъекты.ТекущаяСтрока);
КонецПроцедуры
&НаСервере
Функция Договоры_СформироватьПредставление(ИдентификаторСтроки)
	
	ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если ТекСтрока <> Неопределено Тогда
		
		СтруктураДанных = Новый Структура("transferBaseDate,transferBaseName,transferBaseNumber,transferBaseAdditionalInfo",
			ТекСтрока.Договоры_Дата,ТекСтрока.Договоры_Наименование,ТекСтрока.Договоры_Номер,ТекСтрока.Договоры_ДопИнформация);
			
		РеквизитОбъект = РеквизитФормыВЗначение("Объект");
		Представление = РеквизитОбъект.ЗаполнениеДокумента_Договор_СформироватьПредставление(СтруктураДанных,СтруктураНастроек);
		
		Если ЗначениеЗаполнено(Представление) Тогда
			ТекСтрока.ПредставлениеОбъекта = Представление;
		Иначе
			ТекСтрока.ПредставлениеОбъекта = СтруктураНастроек.ЗаполнениеШапки_НаименованиеНовогоДоговора;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура ВыполнитьГрупповуюОбработкуВыделенныхСтрок(ИмяРеквизита)
	
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	
	Если ТекСтрока.ТипОбъекта = "Номенклатура"
		Или ТекСтрока.ТипОбъекта = "ОсновныеСредства"
		Или ТекСтрока.ТипОбъекта = "Документ"
		Или ТекСтрока.ТипОбъекта = "Договоры"
		Или ТекСтрока.ТипОбъекта = "ИсточникиПроисхождения" Тогда
	
		Если ТекСтрока <> Неопределено И ЗначениеЗаполнено(ТекСтрока[ИмяРеквизита]) Тогда
			
			//Срабатывать должно только если выделено больше одной строки
			ВыделенныеСтроки = Элементы.ЗагружаемыеОбъекты.ВыделенныеСтроки;
			
			Если ВыделенныеСтроки.Количество() > 1 Тогда
				
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("ИмяРеквизита",ИмяРеквизита);
				ДопПараметры.Вставить("ТипОбъекта",ТекСтрока.ТипОбъекта);
				ДопПараметры.Вставить("ИдентификаторСтроки",ТекСтрока.ПолучитьИдентификатор());
				ДопПараметры.Вставить("ВыделенныеСтроки",ВыделенныеСтроки);
				
				ТекстВопроса = "Установить это значение для всех выделенных строк данного типа?";
				Кнопки = РежимДиалогаВопрос.ДаНет;
				ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","ПродолжитьВыполнениеГрупповойОбработкиВыделенныхСтрок",ДопПараметры,ТекстВопроса,Кнопки);
				
				_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
				
			ИначеЕсли ВыделенныеСтроки.Количество() = 1 Тогда
				
				Если ТекСтрока.ТипОбъекта = "Номенклатура"
					Или ТекСтрока.ТипОбъекта = "ОсновныеСредства" Тогда
					
					ОбрабатываемаяСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ВыделенныеСтроки[0]);
					
					//Заполним аналитику по выбранному счету учета
					Если ИмяРеквизита = "Номенклатура_СчетУчета" Тогда
						СтруктураДанных = СчетаУчета_ПолучитьСтруктуруДанныхДляОпределения(ОбрабатываемаяСтрока);
						СчетаУчета = СчетаУчета_ПолучитьСчетаУчетаНоменклатуры(СтруктураНастроек,СтруктураДанных);
						Если СчетаУчета <> Неопределено И Не СтруктураДанных.АгентскиеУслуги Тогда
							СчетаУчета_ЗаполнитьАналитикуСчетовУчета(ОбрабатываемаяСтрока,СчетаУчета);
						КонецЕсли;
						
					ИначеЕсли ИмяРеквизита = "Номенклатура_Комитент" Тогда
						СчетаУчета_ЗаполнитьСчетаУчетаВСтрокеНоменклатуры(ОбрабатываемаяСтрока);
						
					ИначеЕсли ИмяРеквизита = "Номенклатура_ВидНоменклатуры" Тогда
						//E1C-523: На этапе сопоставления заполнять поле "Группа финансового учета"
						СтруктураЗаполненияСвязанныхРеквизитов = ВидНоменклатуры_ПолучитьСтруктуруЗаполненияСвязанныхРеквизитов(СтруктураНастроек,ТекСтрока.Номенклатура_ВидНоменклатуры);
						Если СтруктураЗаполненияСвязанныхРеквизитов <> Неопределено Тогда
							ЗаполнитьЗначенияСвойств(ОбрабатываемаяСтрока,СтруктураЗаполненияСвязанныхРеквизитов);
						КонецЕсли;
						
					КонецЕсли;
					
				ИначеЕсли ТекСтрока.ТипОбъекта = "Документ" Тогда
					// 2022.02.24 ( Дадим выбрать подотчетное лицо
					Если ИмяРеквизита = "Документ_ВидОперации" Тогда
						ЗагружаемыеОбъектыПриАктивизацииСтроки(Элементы.ЗагружаемыеОбъекты);
					КонецЕсли;
					// ) 2022.02.24
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПродолжитьВыполнениеГрупповойОбработкиВыделенныхСтрок(Результат,ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ДопПараметры.ИдентификаторСтроки);
		Значение = ТекСтрока[ДопПараметры.ИмяРеквизита];
				
		Для Каждого ИдентификаторСтроки Из ДопПараметры.ВыделенныеСтроки Цикл

			ОбрабатываемаяСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ИдентификаторСтроки);
			
			//Обрабатываем строки с тем же типом объекта, как в исходной
			Если ОбрабатываемаяСтрока.ТипОбъекта = ДопПараметры.ТипОбъекта Тогда
				
				//E1C-178: Вид операции документа обработаем только для строк, имеющих такой же тип создаваемого документа
				Если ТекСтрока.ТипОбъекта = "Документ" Тогда
					Если ОбрабатываемаяСтрока.ТипСоздаваемогоДокумента = ТекСтрока.ТипСоздаваемогоДокумента Тогда
						ОбрабатываемаяСтрока[ДопПараметры.ИмяРеквизита] = Значение;
					КонецЕсли;
						
				Иначе
					//Исходная логика
				
					ОбрабатываемаяСтрока[ДопПараметры.ИмяРеквизита] = Значение;
					
					//Заполним аналитику по выбранному счету учета
					Если ДопПараметры.ИмяРеквизита = "Номенклатура_СчетУчета" Тогда
						СтруктураДанных = СчетаУчета_ПолучитьСтруктуруДанныхДляОпределения(ОбрабатываемаяСтрока);
						СчетаУчета = СчетаУчета_ПолучитьСчетаУчетаНоменклатуры(СтруктураНастроек,СтруктураДанных);
						Если СчетаУчета <> Неопределено И Не СтруктураДанных.АгентскиеУслуги Тогда
							СчетаУчета_ЗаполнитьАналитикуСчетовУчета(ОбрабатываемаяСтрока,СчетаУчета);
						КонецЕсли;
						
					ИначеЕсли ДопПараметры.ИмяРеквизита = "Номенклатура_Комитент" Тогда
						ОбрабатываемаяСтрока.Номенклатура_ДоговорКомитента = ТекСтрока.Номенклатура_ДоговорКомитента;
						СчетаУчета_ЗаполнитьСчетаУчетаВСтрокеНоменклатуры(ОбрабатываемаяСтрока);
						
					ИначеЕсли ДопПараметры.ИмяРеквизита = "Номенклатура_ВидНоменклатуры" Тогда
						//E1C-523: На этапе сопоставления заполнять поле "Группа финансового учета"
						СтруктураЗаполненияСвязанныхРеквизитов = ВидНоменклатуры_ПолучитьСтруктуруЗаполненияСвязанныхРеквизитов(СтруктураНастроек,ТекСтрока.Номенклатура_ВидНоменклатуры);
						Если СтруктураЗаполненияСвязанныхРеквизитов <> Неопределено Тогда
							ЗаполнитьЗначенияСвойств(ОбрабатываемаяСтрока,СтруктураЗаполненияСвязанныхРеквизитов);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Номенклатура_ХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВидНоменклатуры = УстановитьСвязьПараметровВыбора_СправочникаХарактеристики(Элементы.ЗагружаемыеОбъекты.ТекущаяСтрока,СтандартнаяОбработка);
	Если СтандартнаяОбработка = Ложь Тогда
		ПоказатьОповещениеПользователя("<" + ВидНоменклатуры + ">",,"Для вида номенклатуры учет по характеристикам не используется");
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция УстановитьСвязьПараметровВыбора_СправочникаХарактеристики(ИдентификаторСтроки,СтандартнаяОбработка)
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	
	ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ИдентификаторСтроки);
	ВидНоменклатуры = ТекСтрока.Номенклатура_ВидНоменклатуры;
	
	Если Конф = "УНФ" Тогда
		ТекСтрока.Номенклатура_ВладелецХарактеристик = ТекСтрока.Объект1с;
		
	ИначеЕсли Конф = "БИТСтоматология" Тогда
		ТекСтрока.Номенклатура_ВладелецХарактеристик = ТекСтрока.Объект1с;
	
	ИначеЕсли РеквизитСуществует("Перечисления","ВариантыИспользованияХарактеристикНоменклатуры") Тогда
		//УТ11, КА2, ERP
		Если ВидНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры Тогда
			ТекСтрока.Номенклатура_ВладелецХарактеристик = ТекСтрока.Объект1с;
		ИначеЕсли ВидНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры Тогда
			ТекСтрока.Номенклатура_ВладелецХарактеристик = ТекСтрока.Номенклатура_ВидНоменклатуры;
		ИначеЕсли ВидНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры Тогда
			ТекСтрока.Номенклатура_ВладелецХарактеристик = ТекСтрока.Объект1с.ВладелецХарактеристик;
		ИначеЕсли ВидНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать Тогда
			ТекСтрока.Номенклатура_ВладелецХарактеристик = Неопределено;
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
	ИначеЕсли РеквизитСуществует("Перечисления","ВариантыВеденияДополнительныхДанныхПоНоменклатуре") Тогда
		//Розница2
		Если ВидНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ИндивидуальныеДляНоменклатуры Тогда
			ТекСтрока.Номенклатура_ВладелецХарактеристик = ТекСтрока.Объект1с;
		ИначеЕсли ВидНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ОбщиеДляВидаНоменклатуры Тогда
			ТекСтрока.Номенклатура_ВладелецХарактеристик = ТекСтрока.Номенклатура_ВидНоменклатуры;
		ИначеЕсли ВидНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.НеИспользовать Тогда
			ТекСтрока.Номенклатура_ВладелецХарактеристик = Неопределено;
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Номенклатура_Характеристика.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив);
	Если ЗначениеЗаполнено(ТекСтрока.Номенклатура_ВладелецХарактеристик) Тогда
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Элементы.ЗагружаемыеОбъекты.ТекущиеДанные.Номенклатура_ВладелецХарактеристик");
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		Элементы.Номенклатура_Характеристика.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
	КонецЕсли;
	
	Возврат ВидНоменклатуры;
	
КонецФункции

&НаКлиенте
Процедура Номенклатура_ХарактеристикаПриИзменении(Элемент)
	
	ВыполнитьГрупповуюОбработкуВыделенныхСтрок("Номенклатура_Характеристика");
	
	//Обработаем сохранение Номенклатуры + Характеристики для выделенных строк
	ВыделенныеСтроки = Элементы.ЗагружаемыеОбъекты.ВыделенныеСтроки;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ВыделеннаяСтрока);
		
		// сохраняем установленную пользователем связь номенклатуры поставщика и Номенклатуры + Характеристики
		Если ТекСтрока.ТипОбъекта = "Номенклатура" И ЗначениеЗаполнено(ТекСтрока.Объект1с) Тогда
			Если СтруктураНастроек.Номенклатура_ЗапоминатьУстановленныеВручнуюСоответствия = Истина Тогда
				ТекстОповещения = ЗаписатьСоответствиеНоменклатуры(ТекСтрока.Объект1с,ТекСтрока.Номенклатура_Характеристика,ТекСтрока.ПредставлениеОбъекта,ТекСтрока.КонтрагентИД);
				ПоказатьОповещениеПользователя("Сохранено",,ТекстОповещения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Номенклатура_НоменклатураПоставщикаПриИзменении(Элемент)
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекСтрока.Номенклатура_НоменклатураПоставщика) Тогда
		ТекСтрока.Объект1с = ПолучитьЗначениеРеквизитаОбъекта(ТекСтрока.Номенклатура_НоменклатураПоставщика,"Номенклатура");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Номенклатура_ЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	
	Если Конф = "УНФ"
		//2024.10.22 (
		Или Конф = "РОЗН3" Тогда
		// ) 2024.10.22
		ДопПараметры = Новый Структура;
		Если ЗначениеЗаполнено(ТекСтрока.Объект1с) Тогда
			ДопПараметры.Вставить("Владелец",ТекСтрока.Объект1с);
		КонецЕсли;
		ДанныеВыбора = УНФ_ПолучитьДанныеВыбора_ЕдиницаИзмерения(ДопПараметры,СтандартнаяОбработка);
		
	ИначеЕсли Конф = "Далион" Тогда
		ДопПараметры = Новый Структура;
		Если ЗначениеЗаполнено(ТекСтрока.Объект1с) Тогда
			ДопПараметры.Вставить("Владелец",ТекСтрока.Объект1с);
		КонецЕсли;
		ДанныеВыбора = Далион_ПолучитьДанныеВыбора_ЕдиницаИзмерения(ДопПараметры,СтандартнаяОбработка);
		
	ИначеЕсли Конф = "КА2"
		Или Конф = "УТ11" Тогда
		
		МассивПараметров = Новый Массив;
		
		Если ЗначениеЗаполнено(ТекСтрока.Объект1с) Тогда
			МассивПараметров.Добавить(Новый ПараметрВыбора("Номенклатура",ТекСтрока.Объект1с));
		КонецЕсли;
		
		Элементы.Номенклатура_ЕдиницаИзмерения.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура Номенклатура_ЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		Если Конф = "УНФ" Или Конф = "РОЗН3" Тогда
			//+++ реализовать расчет коэффциента из распознанной единицы в выбранную единицу и перенести в документ
			
		КонецЕсли;
	Иначе
		
		Если Конф = "КА2" Тогда
			//Не заполненная единица измерения может предполагать, что выбрана единица хранения номенклатуры,
			//по логике конфигурации ее не заполняем в табличной части. Для спокойствия пользователя отобразим ее тут,
			//при заполнении документа в основной форме если значение совпадает с единицей хранения - очистим
			ЕдиницаХранения = ПолучитьЗначениеРеквизитаОбъекта(ТекСтрока.Объект1с, "ЕдиницаИзмерения");
			ТекСтрока.Номенклатура_ЕдиницаИзмерения = ЕдиницаХранения;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция УНФ_ПолучитьДанныеВыбора_ЕдиницаИзмерения(ДопПараметры,СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ДопПараметры.Свойство("Владелец") Тогда
		ПараметрыОтбор = Новый Структура("Отбор",ДопПараметры);
		ДанныеВыбора = Справочники.КлассификаторЕдиницИзмерения.ПолучитьДанныеВыбора(ПараметрыОтбор);
	Иначе
		ДанныеВыбора = Новый СписокЗначений;
		Выборка = Справочники.КлассификаторЕдиницИзмерения.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДанныеВыбора;
	
КонецФункции
&НаСервереБезКонтекста
Функция Далион_ПолучитьДанныеВыбора_ЕдиницаИзмерения(ДопПараметры,СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ДопПараметры.Свойство("Владелец") Тогда
		ПараметрыОтбор = Новый Структура("Отбор",ДопПараметры);
		ДанныеВыбора = Справочники.ЕдиницыИзмерения.ПолучитьДанныеВыбора(ПараметрыОтбор);
	Иначе
		ДанныеВыбора = Новый СписокЗначений;
		Выборка = Справочники.КлассификаторЕдиницИзмерения.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДанныеВыбора;
	
КонецФункции
&НаСервере
Функция ПолучитьСсылку_УпаковкаЕдиницаИзмерения(ДопПараметры)
	
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	ТекСтрока = Объект.ЗагружаемыеОбъекты.НайтиПоИдентификатору(ДопПараметры.ИдентификаторСтроки);
	ДанныеНоменклатурыПортала = ДанныеПортала.documentItems.Найти(ТекСтрока.ИдентификаторОбъекта,"Id");
	
	Если ЗначениеЗаполнено(ТекСтрока.Объект1с) Тогда
		ДанныеНоменклатурыПортала.НоменклатураСсылка = ТекСтрока.Объект1с;
	КонецЕсли;
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	Номенклатура_ЕдиницаИзмерения = РеквизитОбъект.ПолучитьСсылку_УпаковкаЕдиницаИзмерения(ДанныеНоменклатурыПортала,СтруктураНастроек);
	
	ПоместитьВоВременноеХранилище(ДанныеПортала,АдресХранилищаДанныхПортала);
	
	Возврат Номенклатура_ЕдиницаИзмерения;
	
КонецФункции

&НаКлиенте
Процедура Номенклатура_АналитикаРасходовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	
	МассивПараметров = Новый Массив;
		
	Если ЗначениеЗаполнено(ТекСтрока.Номенклатура_СтатьяРасходов) Тогда
		МассивПараметров.Добавить(Новый ПараметрВыбора("Владелец",ТекСтрока.Номенклатура_СтатьяРасходов));
	КонецЕсли;
	
	Элементы.Номенклатура_АналитикаРасходов.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидНоменклатуры_ПолучитьСтруктуруЗаполненияСвязанныхРеквизитов(СтруктураНастроек,ВидНоменклатуры)
	
	//E1C-523: КА 2. На этапе сопоставления заполнять поле "Группа финансового учета" значением из карточки Номенклатуры
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	
	Если Конф = "КА2" Тогда
	
		Результат = Новый Структура;
		
		СтруктураЗаполнения = Новый Структура("ГруппаФинансовогоУчета,ГруппаАналитическогоУчета");
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения,ВидНоменклатуры);
		
		Результат.Вставить("Номенклатура_ГруппаФинансовогоУчета",СтруктураЗаполнения.ГруппаФинансовогоУчета);
		Результат.Вставить("Номенклатура_ГруппаАналитическогоУчета",СтруктураЗаполнения.ГруппаАналитическогоУчета);
		
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции


// ================= Работа со сканами документов ===================

&НаКлиенте
Процедура СканДокумента_ПоказатьСканДокумента()
	
	Если ПоказыватьСканДокументаСредствамиEntera Тогда
		Если ПоказыватьСканДокумента Тогда
			СканДокумента_ПоказатьСканДокумента_ENTERA();
		Иначе
			ОтображаемыйАдрес = Неопределено;
		КонецЕсли;
		
	Иначе
		Элементы.ГруппаПросмотрСкана_PNG.Видимость = ПоказыватьСканДокумента;
		Если ПоказыватьСканДокумента Тогда
			СканДокумента_ПоказатьСканДокумента_PNG();
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СканДокумента_ПоказатьСканДокумента_ENTERA()
	
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		Если СтруктураНастроек.СозданиеДокумента_ИспользоватьПоискКомплектов = Истина Тогда
			Если ЗначениеЗаполнено(ТекСтрока.parentId) Тогда
				СвязанныйДокумент = ТекСтрока.parentId;
			ИначеЕсли ЗначениеЗаполнено(ТекСтрока.childrenId) Тогда
				СвязанныйДокумент = ТекСтрока.childrenId;
			КонецЕсли;
		КонецЕсли;
		
		АдресДокумента = "https://" + СтруктураПодключения.Адрес + "/api/v1/pages/documentPagesViewer?documentId=" + ТекСтрока.ДокументИД;
	
		Если ЗначениеЗаполнено(СвязанныйДокумент) Тогда
			АдресДокумента = АдресДокумента + "&documentId=" + СвязанныйДокумент;
		КонецЕсли;
			
		//Страница для отображения документа может быть еще не готова
		ПодключитьОбработчикОжидания("СканДокумента_ПоказатьСканДокумента_ПоГотовностиСтраницы",1);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура СканДокумента_ПоказатьСканДокумента_ПоГотовностиСтраницы() Экспорт
	
	ИспользуетсяОтдельнаяФормаПросмотра = Ложь;
	
	Если ИспользуетсяОтдельнаяФормаПросмотра Тогда
		
		//Показываем в отдельной форме, исходный вариант
		
		Если ФормаПросмотра = Неопределено Тогда
			ОтключитьОбработчикОжидания("СканДокумента_ПоказатьСканДокумента_ПоГотовностиСтраницы");
		Иначе
			//Проверяем, готова ли страница для отображения документа
			СтатусЗавершено = "complete";
			Если Нрег(ФормаПросмотра.Элементы.HTML_СканДокумента.Документ.readyState) = СтатусЗавершено Тогда
				ОтключитьОбработчикОжидания("СканДокумента_ПоказатьСканДокумента_ПоГотовностиСтраницы");
				ФормаПросмотра.ОтобразитьДокумент(ВладелецФормы.Токен,АдресДокумента);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		//Показываем в этой же форме
		
		Если Элементы.ГруппаПросмотраСкана_HTML.Видимость = Ложь Тогда
			ОтключитьОбработчикОжидания("СканДокумента_ПоказатьСканДокумента_ПоГотовностиСтраницы");
		Иначе
			//Проверяем, готова ли страница для отображения документа
			СтатусЗавершено = "complete";
			Если Нрег(Элементы.HTML_СканДокумента.Документ.readyState) = СтатусЗавершено Тогда
				ОтключитьОбработчикОжидания("СканДокумента_ПоказатьСканДокумента_ПоГотовностиСтраницы");
				
				Если ОтображаемыйАдрес = АдресДокумента Тогда
					//пропускаем, мы это уже показываем
					
				Иначе
				
					Попытка
						//При первом отображении выполняем метод этой страницы для авторизации и перехода к требуемому документу
						Элементы.HTML_СканДокумента.Документ.defaultView.setCookieAndRedirect(ВладелецФормы.Токен,АдресДокумента);
						ОтображаемыйАдрес = АдресДокумента;
						
						//документ еще может быть не готов, на 8.3.27 проблема устраняется повторным назначение адреса
						Если ПоказыватьСканДокумента_ОбновлятьАдрес Тогда
							ПодключитьОбработчикОжидания("СканДокумента_ПоказатьСканДокумента_ПоГотовностиСтраницы_ОтложенноеОбновление",0.5,Истина);							
						КонецЕсли;
						
					Исключение
						ОписаниеСобытия = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						
						//При последующих - только меняем location, так как мы уже авторизованы в этом окне
						Попытка
							Элементы.HTML_СканДокумента.Документ.location.assign(АдресДокумента);
							ОтображаемыйАдрес = АдресДокумента;
							
						Исключение
							ОписаниеСобытия = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
							ПоказатьОповещениеПользователя("Ошибка отображения документ",,ОписаниеСобытия);
							
							ВладелецФормы.ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"ОтображениеСкана",ОписаниеСобытия,"ОтображениеСкана");
						КонецПопытки;
						
					КонецПопытки;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура СканДокумента_ПоказатьСканДокумента_ПоГотовностиСтраницы_ОтложенноеОбновление() Экспорт
	
	Попытка
		Элементы.HTML_СканДокумента.Документ.location.assign(АдресДокумента);
	Исключение
		ОписаниеСобытия = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ПоказатьОповещениеПользователя("Ошибка отображения документ",,ОписаниеСобытия);
		
		ВладелецФормы.ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"ОтображениеСкана",ОписаниеСобытия,"ОтображениеСкана");
	КонецПопытки;
	
КонецПроцедуры
&НаКлиенте
Процедура СканДокумента_ИнициализироватьСтраницу_ENTERA()
	
	ИспользуетсяОтдельнаяФормаПросмотра = Ложь;
	
	Если ИспользуетсяОтдельнаяФормаПросмотра Тогда
		
		//Показываем в отдельной форме, исходный вариант
	
		Если ПоказыватьСканДокумента Тогда
			Если ФормаПросмотра = Неопределено Тогда
				ПараметрыОткрытия = Новый Структура;
				ФормаПросмотра = ПолучитьФорму(ПрефиксИмениФорм + "УФ_ПросмотрСкана", ПараметрыОткрытия, ВладелецФормы);
				ФормаПросмотра.ЗакрыватьПриЗакрытииВладельца = Истина;
				ФормаПросмотра.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
				ФормаПросмотра.СтруктураПодключения = СтруктураПодключения;
				
				ФормаПросмотра.Открыть();
			КонецЕсли;
		Иначе
			Если ФормаПросмотра <> Неопределено Тогда
				ФормаПросмотра.Закрыть();
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		//Показываем в этой же форме
		
		Если ПоказыватьСканДокумента Тогда
			Элементы.ГруппаПросмотраСкана_HTML.Видимость = Истина;
			АдресСтраницы = "https://" + СтруктураПодключения.АдресСервераАвторизации + "/api/v1/pages/setCookieAndRedirect";
			HTML_СканДокумента = АдресСтраницы;
			Попытка
				//документ еще может быть не готов
				Элементы.HTML_СканДокумента.Документ.location.assign(АдресСтраницы);
			Исключение
				
			КонецПопытки;
		Иначе
			Элементы.ГруппаПросмотраСкана_HTML.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СканДокумента_ПоказатьСканДокумента_PNG()
	
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		//Получаем файл скана текущей страницы текущего документа, сперва проверяем его  в списке
		//уже полученных страниц таблицы documentPages, если его там еще нет, получаем с портала
		
		documentId = Строка(ТекСтрока.ДокументИД);
		number = Строка(ТекСтрока.СканДокумента_ТекущаяСтраница);
		
		//Попробуем хранения клиентского кэша с адресами хранилища страниц документов, чтобы получать адрес без вызова сервера
		ЗначениеКэша = СканДокумента_ПолучитьЗначениеИзКлиентскогоКэша(documentId,number);
		
		Если ЗначениеКэша <> Неопределено Тогда
			НовыйАдресСкана = ЗначениеКэша;
			
		Иначе
		
			Результат = СканДокумента_ПолучитьАдресХранилищаИзТаблицы_documentPages(АдресХранилищаДанныхПортала,documentId,number);
			
			Если Результат.Успешно Тогда			
				Если ЭтоАдресВременногоХранилища(Результат.АдресВХ) Тогда
					//ранее уже загружали
					НовыйАдресСкана = Результат.АдресВХ;
					
					//дополним клиентский кэш
					СканДокумента_ПоместитьЗначениеВКлиентскийКэш(documentId,number,АдресХранилищаСканаДокумента);
				Иначе
				
					ПараметрыЗапроса = Новый Структура;
					ПараметрыЗапроса.Вставить("ЗапросФайла",Истина);
					ПараметрыЗапроса.Вставить("ДокументИД",documentId);
					
					МетодAPI = Результат.url;
									
					РезультатЗапроса = ВладелецФормы.ВыполнитьЗапрос("ПолучениеФайлаСкана","GET",МетодAPI,"",ПараметрыЗапроса);
					
					Если РезультатЗапроса.Успешно Тогда
						НовыйАдресСкана = РезультатЗапроса.АдресВХ;
						
						//при успешном результате запроса нужно записать адрес хранилища скана в таблицу documentPages
						Результат = СканДокумента_ПоместитьАдресХранилищаВТаблицу_documentPages(АдресХранилищаДанныхПортала,documentId,number,НовыйАдресСкана);
						
						//дополним клиентский кэш
						СканДокумента_ПоместитьЗначениеВКлиентскийКэш(documentId,number,НовыйАдресСкана);
						
						Если Не Результат.Успешно Тогда
							СообщитьСообщение(Результат.ТекстОшибки);
						КонецЕсли;
					Иначе
						СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				СообщитьСообщение(Результат.ТекстОшибки);
			КонецЕсли;
		КонецЕсли;
		
		Если АдресХранилищаСканаДокумента <> НовыйАдресСкана Тогда
			АдресХранилищаСканаДокумента = НовыйАдресСкана;
			ТекСтрока.СканДокумента_АдресХранилища = НовыйАдресСкана;
		КонецЕсли;
		
		//Устанавливаем этот скан всем строкам этого документа.
		СтрокиДокумента = Объект.ЗагружаемыеОбъекты.НайтиСтроки(Новый Структура("ДокументИД",documentId));
		Для Каждого СтрокаДокумента Из СтрокиДокумента Цикл
			СтрокаДокумента.СканДокумента_ТекущаяСтраница = ТекСтрока.СканДокумента_ТекущаяСтраница;
			СтрокаДокумента.СканДокумента_АдресХранилища = ТекСтрока.СканДокумента_АдресХранилища;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Функция СканДокумента_ПолучитьЗначениеИзКлиентскогоКэша(documentId,number)
	
	//Кэш документов - соответствие, хранящее соответствия
	Если Кэш_СканыДокументов <> Неопределено Тогда
		ТекущийДокумент = Кэш_СканыДокументов.Получить(documentId);
		Если ТекущийДокумент <> Неопределено Тогда
			Страница = ТекущийДокумент.Получить(number);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Страница;
	
КонецФункции
&НаКлиенте
Функция СканДокумента_ПоместитьЗначениеВКлиентскийКэш(documentId,number,Значение)
	
	//Кэш документов - соответствие, хранящее соответствия
	Если Кэш_СканыДокументов = Неопределено Тогда
		Кэш_СканыДокументов = Новый Соответствие;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(Значение) Тогда
		ТекущийДокумент = Кэш_СканыДокументов.Получить(documentId);
		Если ТекущийДокумент = Неопределено Тогда
			ТекущийДокумент = Новый Соответствие;
		КонецЕсли;
		
		ТекущийДокумент.Вставить(number,Значение);
		
		Кэш_СканыДокументов.Вставить(documentId,ТекущийДокумент);
	КонецЕсли;
	
КонецФункции
&НаСервереБезКонтекста
Функция СканДокумента_ПолучитьАдресХранилищаИзТаблицы_documentPages(АдресХранилищаДанныхПортала,documentId,number)
		
	Результат = Новый Структура("Успешно,ТекстОшибки,url,АдресВХ",Истина);
	
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	НайденныеСтроки = ДанныеПортала.documentPages.НайтиСтроки(Новый Структура("documentId,number",documentId,Строка(number)));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Результат.url = НайденныеСтроки[0].url;
		Результат.АдресВХ = НайденныеСтроки[0].АдресВХ;
	Иначе
		Результат.Успешно = Ложь;
		Результат.ТекстОшибки = "Внутренняя ошибка модуля: не удалось найти данные скана в таблице страниц документов";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
&НаСервереБезКонтекста
Функция СканДокумента_ПоместитьАдресХранилищаВТаблицу_documentPages(АдресХранилищаДанныхПортала,documentId,number,АдресХранилищаСканаДокумента)
		
	Результат = Новый Структура("Успешно,ТекстОшибки",Истина);
	
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	НайденныеСтроки = ДанныеПортала.documentPages.НайтиСтроки(Новый Структура("documentId,number",documentId,Строка(number)));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		НайденныеСтроки[0].АдресВХ = АдресХранилищаСканаДокумента;
		ПоместитьВоВременноеХранилище(ДанныеПортала,АдресХранилищаДанныхПортала);
	Иначе
		Результат.Успешно = Ложь;
		Результат.ТекстОшибки = "Внутренняя ошибка модуля: не удалось поместить данные скана в таблицу страниц документов";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СканДокумента_Предыдущий(Команда)
	СканДокумента_СменитьСтраницу(-1);
КонецПроцедуры
&НаКлиенте
Процедура СканДокумента_Следующий(Команда)
	СканДокумента_СменитьСтраницу(1);
КонецПроцедуры
&НаКлиенте
Процедура СканДокумента_СменитьСтраницу(Изменение)
	ТекСтрока = Элементы.ЗагружаемыеОбъекты.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		НовыйНомерСтроки = ТекСтрока.СканДокумента_ТекущаяСтраница + Изменение;
		Если НовыйНомерСтроки > 0 И НовыйНомерСтроки <= ТекСтрока.СканДокумента_КоличествоСтраниц Тогда
			ТекСтрока.СканДокумента_ТекущаяСтраница = НовыйНомерСтроки;
			СканДокумента_ПоказатьСканДокумента();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СканДокумента_Увеличить(Команда)
	Элементы.АдресХранилищаСканаДокумента.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
КонецПроцедуры
&НаКлиенте
Процедура СканДокумента_Уменьшить(Команда)
	Элементы.АдресХранилищаСканаДокумента.РазмерКартинки = РазмерКартинки.Пропорционально;
КонецПроцедуры
