
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ДоступноОписаниеОповещения",ДоступноОписаниеОповещения);
	Параметры.Свойство("ДопПараметры",ДополнительныеПараметрыФормы);
	Параметры.Свойство("СтруктураНастроек",СтруктураНастроек);	
	
	Результат = Новый Структура;
	Результат.Вставить("ДопПараметры",ДополнительныеПараметрыФормы);
	
	СписокДубликатов.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресВХ));
	
	//Установим картинку печатной формы для колонки списка документов
	Попытка
		КартинкаПечатнойФормы = БиблиотекаКартинок.ФорматPDF;
	Исключение
		КартинкаПечатнойФормы = БиблиотекаКартинок.Печать;
	КонецПопытки;
	
	Элементы.СписокДубликатовПредставлениеДокумента.КартинкаШапки = КартинкаПечатнойФормы;
	
	//Прикрепление скана к дубликатам
	Если СтруктураНастроек.СозданиеДокумента_ПрисоединятьФайлСканаДокумента = Истина Тогда
		Элементы.ПрикрепитьСкан.Видимость = Истина;
	Иначе
		Элементы.ПрикрепитьСкан.Видимость = Ложь;
		ПрикрепитьСкан = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДубликатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.СписокДубликатов.ТекущиеДанные;
	
	//Во Фреш этот функционал не используется
	Если СтруктураНастроек.ЭтоФреш Тогда
		Возврат;
	КонецЕсли;
		
	Если Поле = Элементы.СписокДубликатовПредставлениеДокумента Тогда
		Если ВладелецФормы.ЭтоВебКлиент Тогда
			//Переходим по навигационной ссылке на pdf
			ЭтаФорма._ЗФ_Команда_ПерейтиПоСсылке("https://app.entera.pro/api/v1/documents/" + ТекСтрока.ДокументИД + "/printForm?view");
		Иначе
			//Получим файл на локальную машину и откроем штатным просмотрщиком pdf
			
			//E1C-13: для типа документа Чек не получаем печатные формы
			Если ТекСтрока.ДокументТип <> "RECEIPT" Тогда
				
				//Получаем печатную форму PDF
				РезультатЗапроса = ВладелецФормы.ПолучитьПечатнуюФормуСканаДокумента(ТекСтрока.ДокументИД,ТекСтрока.ПредставлениеДокумента);
				Если РезультатЗапроса.Успешно Тогда
					АдресХранилищаСканаДокумента = РезультатЗапроса.АдресВХ;
					ИмяФайлаСканаДокумента = РезультатЗапроса.ИмяФайла;
				Иначе
					ВладелецФормы.СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЭтоАдресВременногоХранилища(АдресХранилищаСканаДокумента) Тогда
				//Открываем полученный скан системным просмотрщиком
				ВладелецФормы._ЗФ_Команда_ПоказатьФайлСкана(АдресХранилищаСканаДокумента);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Поле = Элементы.СписокДубликатовДубликатСсылка
		И ЗначениеЗаполнено(ТекСтрока.ДубликатСсылка) Тогда
				
		ПараметрыВызова = Новый Структура("Обработчик,Значение","Заглушка_ОписаниеОповещения",ТекСтрока.ДубликатСсылка);
		ВладелецФормы._ЗФ_ОбработатьАсинхронныйВызов("ПоказатьЗначение",ПараметрыВызова);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СвязатьОтмеченные(Команда)
	
	СписокСвязываемыхДокументов = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из СписокДубликатов Цикл
		Если СтрокаТаблицы.Пометка И ЗначениеЗаполнено(СтрокаТаблицы.ДубликатСсылка) Тогда
			
			Структура = Новый Структура("ДокументИД,ДубликатСсылка,АдресВХ,ИмяФайла");
			ЗаполнитьЗначенияСвойств(Структура,СтрокаТаблицы);
			
			Если ПрикрепитьСкан И СтрокаТаблицы.ДокументТип <> "RECEIPT" Тогда
				//Получаем печатную форму PDF
				РезультатЗапроса = ВладелецФормы.ПолучитьПечатнуюФормуСканаДокумента(СтрокаТаблицы.ДокументИД,СтрокаТаблицы.ПредставлениеДокумента);
				Если РезультатЗапроса.Успешно Тогда
					Структура.АдресВХ = РезультатЗапроса.АдресВХ;
					Структура.ИмяФайла = РезультатЗапроса.ИмяФайла;
				Иначе
					СообщениеПользователю = Новый СообщениеПользователю;
					СообщениеПользователю.Текст = РезультатЗапроса.ТекстОшибки;
					СообщениеПользователю.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
					СообщениеПользователю.Сообщить();					
				КонецЕсли;
			КонецЕсли;
			
			СписокСвязываемыхДокументов.Добавить(Структура);
		КонецЕсли;
	КонецЦикла;
	
	Результат.Вставить("СписокСвязываемыхДокументов",СписокСвязываемыхДокументов);
	
	ЭтаФорма.Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьБезСвязывания(Команда)
	ЭтаФорма.Закрыть(Результат);
КонецПроцедуры
