
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Параметры.Заголовок;
	Список = Параметры.Список;
	ИмяСписка = Параметры.ИмяСписка;
	
	Для Каждого ВыбранноеЗначение Из Параметры.ВыбранныеЗначения Цикл
		СтрокаСписка = Список.НайтиПоЗначению(ВыбранноеЗначение.Значение);
		Если СтрокаСписка <> Неопределено Тогда
			СтрокаСписка.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьТаблицуПоСпискуЗначенийСОтбором();
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТаблицуПоСпискуЗначенийСОтбором(ТекстОтбора = "")
	
	ТаблицаСписка.Очистить();
	
	Для Каждого ЭлементСписка Из Список Цикл
		
		Если ЗначениеЗаполнено(ТекстОтбора) И Найти(Нрег(ЭлементСписка.Представление),Нрег(ТекстОтбора)) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаСписка.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ЭлементСписка);
		
	КонецЦикла;
	
	СтрокаПоиска = ТекстОтбора;
	
КонецПроцедуры
&НаСервереБезКонтекста
Процедура ОбновитьФлажокВСпискеЗначений(СписокЗначений,Значение,Флажок)
	ЭлементСписка = СписокЗначений.НайтиПоЗначению(Значение);
		
	Если ЭлементСписка <> Неопределено Тогда
		ЭлементСписка.Пометка = Флажок;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СтрокаПоискаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗаполнитьТаблицуПоСпискуЗначенийСОтбором(Текст);
КонецПроцедуры
&НаКлиенте
Процедура СтрокаПоискаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗаполнитьТаблицуПоСпискуЗначенийСОтбором(Текст);
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаСпискаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбновитьФлажокВСпискеЗначений(Список,Элементы.ТаблицаСписка.ТекущиеДанные.Значение,Элементы.ТаблицаСписка.ТекущиеДанные.Пометка);
КонецПроцедуры
&НаКлиенте
Процедура ТаблицаСпискаПометкаПриИзменении(Элемент)
	ОбновитьФлажокВСпискеЗначений(Список,Элементы.ТаблицаСписка.ТекущиеДанные.Значение,Элементы.ТаблицаСписка.ТекущиеДанные.Пометка);
КонецПроцедуры


&НаКлиенте
Процедура Команда_Выбрать(Команда)
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Список",Список);
	ДопПараметры.Вставить("ИмяСписка",ИмяСписка);
	
	Оповестить("ЗакрытиеФормы_Мультиселект",ДопПараметры);
	ЭтаФорма.Закрыть();
КонецПроцедуры

