&НаКлиенте
Перем СтруктураПодключения Экспорт;
&НаКлиенте
Перем ОтображаемыйАдрес;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//E1C-506: на 8.3.27 проблема с отображением скана, устраняется повторным назначение адреса
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	СисИнфо = Новый СистемнаяИнформация;
	ВерсияМассив = РеквизитОбъект.Энтера_РазложитьСтрокуВМассивПодстрок(СисИнфо.ВерсияПриложения,".");
	ВтораяЦифра = Число(ВерсияМассив[1]); ТретьяЦифра = Число(ВерсияМассив[2]);
			
	ПоказыватьСканДокумента_ОбновлятьАдрес = (ВтораяЦифра = 3 и ТретьяЦифра >= 27) Или ВтораяЦифра > 3;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АдресСтраницы = "https://" + СтруктураПодключения.АдресСервераАвторизации + "/api/v1/pages/setCookieAndRedirect";
	HTML_СканДокумента = АдресСтраницы;
	Элементы.HTML_СканДокумента.Документ.location.assign(АдресСтраницы);
КонецПроцедуры
&НаКлиенте
Процедура ОтобразитьДокумент(Токен,АдресДокумента) Экспорт
		
	Если ОтображаемыйАдрес = АдресДокумента Тогда
		//пропускаем, мы это уже показываем
		
	Иначе
	
		Попытка
			//При первом отображении выполняем метод этой страницы для авторизации и перехода к требуемому документу
			Элементы.HTML_СканДокумента.Документ.defaultView.setCookieAndRedirect(Токен,АдресДокумента);
			ОтображаемыйАдрес = АдресДокумента;
			
			//документ еще может быть не готов
			Если ПоказыватьСканДокумента_ОбновлятьАдрес Тогда
				ПодключитьОбработчикОжидания("СканДокумента_ПоказатьСканДокумента_ПоГотовностиСтраницы_ОтложенноеОбновление",0.5,Истина);
			КонецЕсли;
			
		Исключение
			ОписаниеСобытия = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			
			//При последующих - только меняем location, так как мы уже авторизованы в этом окне
			Попытка
				Элементы.HTML_СканДокумента.Документ.location.assign(АдресДокумента);
				ОтображаемыйАдрес = АдресДокумента;
				
			Исключение
				ОписаниеСобытия = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				ПоказатьОповещениеПользователя("Ошибка отображения документ",,ОписаниеСобытия);
				
				ВладелецФормы.ЗаписатьСобытиеВПротокол(ВладелецФормы.СтруктураНастроек,0,"ОтображениеСкана",ОписаниеСобытия,"ОтображениеСкана");
			КонецПопытки;
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура СканДокумента_ПоказатьСканДокумента_ПоГотовностиСтраницы_ОтложенноеОбновление() Экспорт
	
	Попытка
		Элементы.HTML_СканДокумента.Документ.location.assign(АдресДокумента);
	Исключение
		ОписаниеСобытия = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ПоказатьОповещениеПользователя("Ошибка отображения документ",,ОписаниеСобытия);
		
		ВладелецФормы.ЗаписатьСобытиеВПротокол(ВладелецФормы.СтруктураНастроек,0,"ОтображениеСкана",ОписаниеСобытия,"ОтображениеСкана");
	КонецПопытки;
	
КонецПроцедуры
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ФормаПросмотра_Закрытие");
КонецПроцедуры
