
&НаСервере
Процедура ЗаполнитьПоказателяНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Показатели.Ссылка КАК Ссылка,
		|	Показатели.СтрокиБаланса КАК СтрокиБаланса
		|ИЗ
		|	Справочник.Показатели КАК Показатели
		|
		|УПОРЯДОЧИТЬ ПО
		|	Показатели.Код";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка  = Объект.Показатели.Добавить(); 
		Строка.Показатель = Выборка.Ссылка;
		Строка.Формула = Выборка.СтрокиБаланса;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказателя(Команда)
	ЗаполнитьПоказателяНаСервере();
КонецПроцедуры
