
&НаКлиенте
Перем
СтруктураПодключения,				// Данные для подключения при выполнении запросов с клиента
МодульМК_Клиент						// Форма модуля кастомизации для обработчиков клиентских событий
;		

&НаКлиенте
Перем
ЭтоВебКлиент                       // HTTP-запросы выполнять с сервера 
Экспорт;				

// ================= Обработчики событий формы ===================

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Предустановленный отбор
	Если Не ЗначениеЗаполнено(Отбор_ПериодЗагрузки) Тогда
		Отбор_ПериодЗагрузки.Вариант = ВариантСтандартногоПериода.Последние7Дней;
	КонецЕсли;
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	//EN-180: версия обработки в интерфейсе и дата релиза
	ВерсияМодуля = РеквизитОбъект.ВерсияМодуля;
	
	//E1C-100: обработка используется в режиме расширения?
	Если Метаданные.Подсистемы.Найти("Entera_ЗагрузкаДокументов") <> Неопределено Тогда
		ЭтоРасширениеКонфигурации = Истина;
	КонецЕсли;
	
	ЭтоФреш = Не РеквизитОбъект.СведенияОВнешнейОбработке().Свойство("НеФреш");
	
	//E1C-168: Покажем в интерфейсе, где вообще работаем
	Если ЭтоРасширениеКонфигурации И ЭтоФреш Тогда
		Постфикс = "E";
	ИначеЕсли ЭтоФреш Тогда
		Постфикс = "F";
	Иначе
		Постфикс = "";
	КонецЕсли;
	
	Элементы.ТехподдержкаВерсия.Заголовок = "Версия 1." + ВерсияМодуля.Версия + Постфикс + " " + Формат(ВерсияМодуля.Дата,"ДФ=[yyyy.MM.dd]") + ".";
	
	Элементы.Команда_ЗарегистрироватьОбработку.Видимость = Ложь;
	_ЗФ_ДоступностьКоманды_ЗарегистрироватьОбработку(РеквизитОбъект);
		
	//Определим возможность использования описания оповещения
	СисИнфо = Новый СистемнаяИнформация;
	ВерсияМассив = РеквизитОбъект.Энтера_РазложитьСтрокуВМассивПодстрок(СисИнфо.ВерсияПриложения,".");
	ВтораяЦифра = Число(ВерсияМассив[1]); ТретьяЦифра = Число(ВерсияМассив[2]);
			
	ДоступноОписаниеОповещения = (ВтораяЦифра = 3 и ТретьяЦифра >= 4) Или ВтораяЦифра > 3;
		
	#Если ВебКлиент Тогда
		
	#Иначе
	
	#КонецЕсли
	
	//Установим картинку АнимацияОжидание
	НаРаспознаванииАнимация = ПоместитьВоВременноеХранилище(РеквизитОбъект.ПолучитьМакет("АнимацияОжидание"),УникальныйИдентификатор);
	
	Попытка
		КартинкаПечатнойФормы = БиблиотекаКартинок.ФорматPDF;
	Исключение
		КартинкаПечатнойФормы = БиблиотекаКартинок.Печать;
	КонецПопытки;
	
	//E1C-14: для Фреш не показываем
	Если Не ЭтоФреш Тогда
		//Установим картинку печатной формы для колонки списка документов	
		Элементы.СписокДокументовПредставлениеДокумента.КартинкаШапки = КартинкаПечатнойФормы;
		Элементы.СписокДокументов_ПрисоединитьФайлСканаКДокументу.Картинка = КартинкаПечатнойФормы;
	КонецЕсли;
	
	//E1C-133: скачивание файлов документов с портала
	Если Элементы.Найти("СписокДокументов_СкачатьPDF") <> Неопределено Тогда
		Элементы.СписокДокументов_СкачатьPDF.Картинка = КартинкаПечатнойФормы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура _УФ_Команда_ЗарегистрироватьОбработку(Команда)
	
	АдресВХ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайлаТекущейОбработки));
	Результат = _УФ_Команда_ЗарегистрироватьОбработкуНаСервере(АдресВХ);
	
	Если Результат.Успешно Тогда
		ПоказатьОповещениеПользователя("Успешно",,"Обработка успешно зарегистрирована в базе 1с"
			+ ?(ЗначениеЗаполнено(Результат.ИменаРазделов)," (" + Результат.ИменаРазделов + ")",""));
	Иначе
		СообщитьСообщение(Результат.ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Функция _УФ_Команда_ЗарегистрироватьОбработкуНаСервере(АдресВХ)
	
	Результат = Новый Структура("Успешно,ТекстОшибки",Ложь);
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	ИмяФайла = РеквизитОбъект.ИспользуемоеИмяФайла;
	
	//Найдем публикацию этой обработки в справочнике внешних обработок
	МодульДополнительныеОтчетыИОбработки = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("ДополнительныеОтчетыИОбработки");
	МодульОбщегоНазначения = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("ОбщегоНазначения");
	
	Если МодульДополнительныеОтчетыИОбработки <> Неопределено
		И МодульОбщегоНазначения <> Неопределено Тогда
		
		Обработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта","Entera_ЗагрузкаДокументов");
		
		Если ЗначениеЗаполнено(Обработка) Тогда
			//обновляем текущую
			ОбработкаОбъект = Обработка.ПолучитьОбъект();
		Иначе
			ОбработкаОбъект = Справочники.ДополнительныеОтчетыИОбработки.СоздатьЭлемент();
		КонецЕсли;		
		
		ПараметрыРегистрации = РеквизитОбъект.СведенияОВнешнейОбработке();
		ПараметрыРегистрации.Вставить("ОтключатьКонфликтующие",Ложь);
		ПараметрыРегистрации.Вставить("ОтключатьПубликацию",Ложь);
		ПараметрыРегистрации.Вставить("Конфликтующие",Новый СписокЗначений);
		ПараметрыРегистрации.Вставить("ИмяФайла","Entera_ЗагрузкаДокументов.epf");
		ПараметрыРегистрации.Вставить("ЭтоОтчет",Ложь);
		ПараметрыРегистрации.Вставить("АдресДанныхОбработки",АдресВХ);
				
		ПодходящиеРазделы = Новый Массив;
		
		ИспользуемыеРазделы = МодульДополнительныеОтчетыИОбработки.РазделыДополнительныхОбработок();
		Для Каждого Раздел Из ИспользуемыеРазделы Цикл
			Если ТипЗнч(Раздел) = Тип("ОбъектМетаданных")
				И (Раздел.Имя = "Покупки"
				Или Раздел.Имя = "Закупки") Тогда
				ПодходящиеРазделы.Добавить(Раздел);
			КонецЕсли;
		КонецЦикла;
		
		//ОбработкаОбъект.БезопасныйРежим	= ПараметрыРегистрации.БезопасныйРежим;
		//ОбработкаОбъект.Версия = ПараметрыРегистрации.Версия;
		//ОбработкаОбъект.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка;
		//ОбработкаОбъект.ИмяОбъекта = ПараметрыРегистрации.Наименование;
		//ОбработкаОбъект.ИмяФайла = "Entera_ЗагрузкаДокументов.epf";
		//ОбработкаОбъект.ИспользоватьДляФормыОбъекта	= Истина;
		//ОбработкаОбъект.ИспользоватьДляФормыСписка = Ложь;
		//ОбработкаОбъект.ИспользуетХранилищеВариантов = Ложь;
		//ОбработкаОбъект.Наименование = ПараметрыРегистрации.Наименование;
		//ОбработкаОбъект.Ответственный = ПараметрыСеанса.АвторизованныйПользователь;

		ОбработкаОбъект.Публикация = Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется;
		ОбработкаОбъект.РежимСовместимостиРазрешений = Перечисления.РежимыСовместимостиРазрешенийДополнительныхОтчетовИОбработок.Версия_2_1_3;
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ);
		ОбработкаОбъект.ХранилищеОбработки = Новый ХранилищеЗначения(ДвоичныеДанные);
		ОбработкаОбъект.ХранилищеНастроек = ОбработкаОбъект.ХранилищеОбработки;
		
		РезультатРегистрации = МодульДополнительныеОтчетыИОбработки.ЗарегистрироватьОбработку(ОбработкаОбъект, ПараметрыРегистрации);
				
		Если РезультатРегистрации.Успех = Истина Тогда
			
			//При записи новой внешней обработки в справочник в вызываемом методе ЗарегистрироватьОбработку() выполняется Объект.Разделы.Очистить()
			//поэтому разделы указываем уже после вызова этого метода
			Если ПодходящиеРазделы.Количество() > 0 И ОбработкаОбъект.Разделы.Количество() = 0 Тогда
				ИменаРазделов = "";
				Для Каждого Раздел Из ПодходящиеРазделы Цикл
					Если ОбработкаОбъект.Разделы.Найти(Раздел,"Раздел") = Неопределено Тогда
						НоваяСтрока = ОбработкаОбъект.Разделы.Добавить();
						НоваяСтрока.Раздел = МодульОбщегоНазначения.ИдентификаторОбъектаМетаданных(Раздел);
						ИменаРазделов = ИменаРазделов + ?(ИменаРазделов = "","","/") + Раздел.Имя;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Попытка
				ОбработкаОбъект.Записать();
							
				Результат.Успешно = Истина;
				Результат.Вставить("ИменаРазделов",ИменаРазделов); 
			Исключение
				Результат.ТекстОшибки = "Ошибка при регистрации внешней обработки: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
		Иначе
			Результат.ТекстОшибки = РезультатРегистрации.ТекстОшибки;
		КонецЕсли;
			
	Иначе
		Результат.ТекстОшибки = "Ошибка при регистрации внешней обработки: в конфигурации не найден справочник ДополнительныеОтчетыИОбработки";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура _ЗФ_Команда_ПерейтиПоСсылке(url) Экспорт
	
	Если ЗначениеЗаполнено(СтруктураНастроек.СистемныеНастройки_ПутьКБраузеру) Тогда
		Попытка
			ЗапуститьПриложение(СтруктураНастроек.СистемныеНастройки_ПутьКБраузеру + " " + url);
		Исключение
			ПерейтиПоНавигационнойСсылке(url);
		КонецПопытки;
	Иначе
		ПерейтиПоНавигационнойСсылке(url);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура _ЗФ_Команда_ПоказатьФайлСкана(АдресВХ,ИмяФайла = Неопределено) Экспорт
	
	#Если ВебКлиент Тогда
		ПолучитьФайл(АдресВХ,ИмяФайла,Истина);
		
	#Иначе
		ФайлСкана = ПолучитьИмяВременногоФайла("pdf");
		
		ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВХ);
		ДанныеФайла.Записать(ФайлСкана);
		
		ЗапуститьПриложение(ФайлСкана);
		
	#КонецЕсли
		
КонецПроцедуры
&НаСервере
Процедура _3Ф_УстановитьРежимЗаписи_ОбменДаннымиЗагрузка(ЗаписываемыйОбъект)
	//Для 1с:Фреш эту процедуру очищаем
	ЗаписываемыйОбъект.ОбменДанными.Загрузка = Истина;
КонецПроцедуры
&НаСервере
Функция _3Ф_ПодключитьВнешнююОбработку(АдресХранилища)
	
	//Комментарий для аудитора: Для Фреш не выполняется подключение дополнительной внешней обработки "Модуль кастомизации",
	//реквизит ЭтоФреш определяется в процедуре ПриСозданииНаСервере этой формы
	Если ЭтоФреш Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ВнешниеОбработки.Подключить(АдресХранилища)
КонецФункции
&НаСервере
Процедура _ЗФ_ДоступностьКоманды_ЗарегистрироватьОбработку(РеквизитОбъект)
	//Для 1с:Фреш эту процедуру очищаем	
	ИмяФайлаТекущейОбработки = РеквизитОбъект.ИспользуемоеИмяФайла;
		
	Если Найти(ИмяФайлаТекущейОбработки,"e1cib") > 0
		И Найти(ИмяФайлаТекущейОбработки,"tempstorage") > 0 Тогда
		//запуск уже подключенной в базе обработки
		Элементы.Команда_ЗарегистрироватьОбработку.Видимость = Ложь;
	Иначе
		Элементы.Команда_ЗарегистрироватьОбработку.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Функция _ЗФ_ОбработатьАсинхронныйВызов(ТипВызова,ПараметрыВызова) Экспорт
	
	//Для реализации возможности открытия этой формы внешней обработке на платформах, не поддерживающих ОписаниеОповещения,
	//(не будет пройден синтаксический контроль), обработчики асинхронных вызовов вынесены в эту процедуру.
	//Для прохождения аудита 1С:Фреш эта функция заменяется на аналогичную, но без методов Вычислить(). Profit!
	
	Если ТипВызова = "Вопрос" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			ПоказатьВопрос(ОписаниеОповещения,ПараметрыВызова.ТекстВопроса,ПараметрыВызова.Кнопки);
		Иначе
			Вопрос(ПараметрыВызова.ТекстВопроса,ПараметрыВызова.Кнопки);
		КонецЕсли;
	
	ИначеЕсли ТипВызова = "ВыборИзМеню" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			
			ЭлементФормы = Неопределено;
			ПараметрыВызова.ДопПараметры.Свойство("ЭлементФормы",ЭлементФормы);
			
			ПоказатьВыборИзМеню(ОписаниеОповещения,ПараметрыВызова.СписокВыбора,ЭлементФормы);
		Иначе
			ВыбратьИзМеню(ПараметрыВызова.СписокВыбора);
		КонецЕсли;
		
	ИначеЕсли ТипВызова = "ВыборИзСписка" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			
			ЭлементФормы = Неопределено;
			ПараметрыВызова.ДопПараметры.Свойство("ЭлементФормы",ЭлементФормы);
						
			ПоказатьВыборИзСписка(ОписаниеОповещения,ПараметрыВызова.СписокВыбора,ЭлементФормы);
		Иначе
			ВыбратьИзСписка(ПараметрыВызова.СписокВыбора);
		КонецЕсли;
		
	ИначеЕсли ТипВызова = "ВводСтроки" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			ПоказатьВводСтроки(ОписаниеОповещения,ПараметрыВызова.Строка,ПараметрыВызова.Подсказка);
		Иначе
			ВвестиСтроку(ПараметрыВызова.Строка,ПараметрыВызова.Подсказка);
		КонецЕсли;
		
	ИначеЕсли ТипВызова = "ПоказатьЗначение" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			ПоказатьЗначение(ОписаниеОповещения,ПараметрыВызова.Значение);
		Иначе
			ОткрытьЗначение(ПараметрыВызова.Значение);
		КонецЕсли;
		
	ИначеЕсли ТипВызова = "ЗапуститьПриложение" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			//Экранируем от синтаксического контроля платформ до 8.3.6
			Выполнить("НачатьЗапускПриложения(ОписаниеОповещения,ПараметрыВызова.СтрокаЗапуска)");
		Иначе
			ЗапуститьПриложение(ПараметрыВызова.СтрокаЗапуска);
		КонецЕсли;
		
	ИначеЕсли ТипВызова = "ВыбратьЭлементИзФормыВыбора" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			ПараметрыВызова.ФормаВыбора.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
			ПараметрыВызова.ФормаВыбора.Открыть();
		Иначе
			Результат = ПараметрыВызова.ФормаВыбора.ОткрытьМодально();
			ПоискСуществующихДокументов_ВыборДокумента(Результат,ПараметрыВызова.ДопПараметры);
		КонецЕсли;
		
	ИначеЕсли ТипВызова = "УдалитьФайлы" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова_1Параметр"",ЭтаФорма,ПараметрыВызова)");
			НачатьУдалениеФайлов(ОписаниеОповещения,ПараметрыВызова.УдаляемыйФайл);
		Иначе
			УдалитьФайлы(ПараметрыВызова.УдаляемыйФайл);
		КонецЕсли;
		
	ИначеЕсли ТипВызова = "ПоместитьФайлы" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещенияНачало = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова_3Параметра"",ЭтаФорма,ПараметрыВызова.ПараметрыВызоваНачало)");
			ОписаниеОповещенияОкончание = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова.ПараметрыВызоваЗавершение)");
			НачатьПомещениеФайлов(ОписаниеОповещенияОкончание,,Истина,УникальныйИдентификатор,ОписаниеОповещенияНачало);
		Иначе
			ПоместитьФайлы(ПараметрыВызова.ПомещаемыеФайлы,Истина,УникальныйИдентификатор);
		КонецЕсли;
		
	ИначеЕсли ТипВызова = "ДиалогВыбораФайла" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			ПараметрыВызова.ДиалогВыбораФайла.Показать(ОписаниеОповещения);
		Иначе
			ПоместитьФайлы(ПараметрыВызова.ПомещаемыеФайлы,Истина,УникальныйИдентификатор);
		КонецЕсли;
		
	ИначеЕсли ТипВызова = "ОткрытьФормуМодально" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			ПараметрыВызова.Форма.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
			ПараметрыВызова.Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
			ПараметрыВызова.Форма.ЗакрыватьПриЗакрытииВладельца = Истина;
			ПараметрыВызова.Форма.Открыть();
		Иначе
			Результат = ПараметрыВызова.Форма.ОткрытьМодально();
			ОбработатьЗакрытиеФормы_СинхронноАсинхронно(Результат,ПараметрыВызова);
		КонецЕсли;
		          
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработатьРезультатАсинхронногоВызова(Результат,ПараметрыВызова) Экспорт
		
	//Сюда в условия переносятся все присутствующие в форме обработчики результатов асинхронных вызовов
	Если ПараметрыВызова.Обработчик = "ОбработатьВыборИзМенюАвторизация" Тогда
		ОбработатьВыборИзМенюАвторизация(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ЗаполнитьСписокДокументов_КонтрольКоличестваДокументов" Тогда
		ЗаполнитьСписокДокументов_КонтрольКоличестваДокументов(Результат,ПараметрыВызова.ДопПараметры);
				
	ИначеЕсли ПараметрыВызова.Обработчик = "ПродолжитьСозданиеДокументов_Тип" Тогда
		ПродолжитьСозданиеДокументов_Тип(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ПродолжитьСозданиеДокументов_ДублиВСписке" Тогда
		ПродолжитьСозданиеДокументов_ДублиВСписке(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ПродолжитьСозданиеДокументов_СнятьОтметкиДублиВСписке" Тогда
		ПродолжитьСозданиеДокументов_СнятьОтметкиДублиВСписке(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ПродолжитьСозданиеДокументов_ОбъединениеДокументов" Тогда
		ПродолжитьСозданиеДокументов_ОбъединениеДокументов(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ПродолжитьСозданиеДокументов_ВсеСканыПолучены" Тогда
		ПродолжитьСозданиеДокументов_ВсеСканыПолучены(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "Продолжить_СписокДокументов_ОчиститьСвязь" Тогда
		Продолжить_СписокДокументов_ОчиститьСвязь(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "Продолжить_УдалениеДокументовНаПортале" Тогда
		Продолжить_УдалениеДокументовНаПортале(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "Продожить_СписокДокументов_РазъединениеКомплекта" Тогда
		Продожить_СписокДокументов_РазъединениеКомплекта(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "Продожить_СписокДокументов_ОбъединениеКомплекта" Тогда
		Продожить_СписокДокументов_ОбъединениеКомплекта(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "Продолжить_ИзменитьСтороныДокумента" Тогда
		Продолжить_ИзменитьСтороныДокумента(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "Продолжить_УстановитьСтатусДокумента" Тогда
		Продолжить_УстановитьСтатусДокумента(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "Продолжить_УстановитьСтатусДокумента_Выгружен" Тогда
		Продолжить_УстановитьСтатусДокумента_Выгружен(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "Продожить_СписокДокументов_ПроверкаСуммы" Тогда
		Продожить_СписокДокументов_ПроверкаСуммы(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ПоискСуществующихДокументов_ВыборДокумента" Тогда
		ПоискСуществующихДокументов_ВыборДокумента(Результат,ПараметрыВызова.ДопПараметры);
	
	ИначеЕсли ПараметрыВызова.Обработчик = "ОбработатьВыборФайлов_ВебКлиент" Тогда
		ОбработатьВыборФайлов_ВебКлиент(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ОбработатьВыборФайлов" Тогда
		ОбработатьВыборФайлов(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ОбработатьВыборКаталога_СкачатьФайлДокументаСПортала" Тогда
		ОбработатьВыборКаталога_СкачатьФайлДокументаСПортала(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "БыстрыйФильтр_ОбработатьВыборТипаДокумента" Тогда
		БыстрыйФильтр_ОбработатьВыборТипаДокумента(Результат,ПараметрыВызова);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "Техподдержка_Помощь_ОбработатьВыборИзМеню" Тогда
		Техподдержка_Помощь_ОбработатьВыборИзМеню(Результат,ПараметрыВызова);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ОбработатьЗакрытиеФормы_СинхронноАсинхронно" Тогда
		ОбработатьЗакрытиеФормы_СинхронноАсинхронно(Результат,ПараметрыВызова);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "Заглушка_ОписаниеОповещения" Тогда
		//Ничего не выполняем
		
	ИначеЕсли ПараметрыВызова.Обработчик = "УведомлениеПорталуОСозданииДокументов_ОбработатьОпределениеНеобходимостиОтправки" Тогда
		УведомлениеПорталуОСозданииДокументов_ОбработатьОпределениеНеобходимостиОтправки(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ОбработатьЗагрузкуДокументаПоПрямойСсылке" Тогда
		ОбработатьЗагрузкуДокументаПоПрямойСсылке(Результат);
			
	КонецЕсли;
КонецФункции
&НаКлиенте
Функция ОбработатьРезультатАсинхронногоВызова_1Параметр(ПараметрыВызова) Экспорт
	Если ПараметрыВызова.Обработчик = "Заглушка_ОписаниеОповещения" Тогда
		//Ничего не выполняем
	КонецЕсли;
КонецФункции
&НаКлиенте
Функция ОбработатьРезультатАсинхронногоВызова_3Параметра(Результат,Отказ,ПараметрыВызова) Экспорт
	Если ПараметрыВызова.Обработчик = "ОбработатьНачалоВыбораФайлов_ВебКлиент" Тогда
		ОбработатьНачалоВыбораФайлов_ВебКлиент(Результат,Отказ,ПараметрыВызова.ДопПараметры);
	КонецЕсли;	
КонецФункции
&НаКлиенте
Функция ОбработатьЗакрытиеФормы_СинхронноАсинхронно(Результат,ПараметрыВызова)
	
	//Сбрасываем значение переменной, хранящей форму
	ПараметрыВызова.Форма = Неопределено;
	ДопПараметры = ПараметрыВызова.ДопПараметры;
	
	Если ДопПараметры.Источник = "УФ_Авторизация" Тогда
		ОбработатьЗакрытиеФормыАвторизации(Результат);
	
	ИначеЕсли ДопПараметры.Источник = "УФ_ОтправляемыеФайлы" Тогда
		
		Если Результат <> Неопределено Тогда
			Если Результат.Свойство("ОтправляемыеФайлы") И Результат.ОтправляемыеФайлы.Количество() > 0 Тогда
				
				//Значение из настроек об уведомлении может быть изменено пользователем
				УведомлятьНаПочтуОВыполненныхЗаданиях = СтруктураНастроек.ОбменДанными_УведомлятьНаПочтуОВыполненныхЗаданиях;
				Результат.Свойство("УведомлятьНаПочтуОВыполненныхЗаданиях",УведомлятьНаПочтуОВыполненныхЗаданиях);
				
				РезультатЗапроса = ОтправитьДокументНаПортал(Результат.ОтправляемыеФайлы,УведомлятьНаПочтуОВыполненныхЗаданиях);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ДопПараметры.Источник = "УФ_Дубликаты" Тогда
		Если Результат = Неопределено Тогда
			//Пользователь просто закрыл форму дубликатов, ничего не делаем
		Иначе
			ПродолжитьСозданиеДокументов_ПослеСопоставленияДубликатов(Результат,Результат.ДопПараметры);
		КонецЕсли;
		
	ИначеЕсли ДопПараметры.Источник = "УФ_ЗагружаемыеОбъекты" Тогда
		
		Если Результат = Неопределено Тогда
			//Пользователь просто закрыл форму сопоставления, ничего не делаем
			
		ИначеЕсли Результат.Успешно Тогда
			
			ОписаниеСобытия = "Все элементы созданы, переход к заполнению документов";
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
	
			РезультатСоздания = СоздатьДокументыНаСервере(Результат.ДопПараметры);
			Если РезультатСоздания.Успешно = Истина Тогда
				
				//Если возникали ошибки их следует сообщить?
				Если ЗначениеЗаполнено(РезультатСоздания.ТекстОшибки) Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.ИдентификаторНазначения = УникальныйИдентификатор;
					Сообщение.Текст = "Документы были успешно созданы, но в процессе возникали ошибочные ситуации: " + Символы.ПС + РезультатСоздания.ТекстОшибки;
					Сообщение.Сообщить();
				КонецЕсли;
				
			Иначе
				Если ЭтоВебКлиент Тогда
					//в веб-клиенте в этом алгоритме может не отображаться СообщениеПользователю
					ПоказатьПредупреждение(,"Ошибка: " + РезультатСоздания.ТекстОшибки);
				Иначе
					Сообщение = Новый СообщениеПользователю;
					Сообщение.ИдентификаторНазначения = УникальныйИдентификатор;
					Сообщение.Текст = РезультатСоздания.ТекстОшибки;
					Сообщение.Сообщить();
				КонецЕсли;
			КонецЕсли;
			
			Если ЗаданияУведомления.Количество() > 0 Тогда
				ПодключитьОбработчикОжидания("УведомлениеПорталуОСозданииДокументов_ОпределитьНеобходимостьОтправки",0.1,Истина);
			КонецЕсли;
		Иначе
			ОписаниеСобытия = "Ошибка при создании элементов справочников: " + Результат.ТекстОшибки;
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
			
			СообщитьСообщение(Результат.ТекстОшибки);
		КонецЕсли;
		
	ИначеЕсли ДопПараметры.Источник = "УФ_ОсновнаяФорма_Мультиселект" Тогда
		Мультиселект_СписокЗакрытиеФормы(Результат);
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//2019.01.28 (EN-185: Перед открытием проверяем, если это окно уже открыто - переключаемся на него
	Окна = ПолучитьОкна();
	Для Каждого ОткрытоеОкно Из Окна Цикл
		Если ОткрытоеОкно.Заголовок = ЭтаФорма.Заголовок Тогда
			
			//2019.02.05 (при запуске НЕ в интерфейсе Такси на этом этапе форма уже присутствует в списке окон
			//но переключиться на нее платформа не дает, проверяем есть ли в содержимом формы ОкноКлиентскогоПриложения
			Если ОткрытоеОкно.Содержимое.Количество() > 0 Тогда
				Если ОткрытоеОкно.Содержимое[0].Окно <> Неопределено Тогда
					
					ОткрытоеОкно.Активизировать();					
					Отказ = Истина;
					
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	// ) 2019.01.28
	
	//2024.11.27 ( Функция перенесена из ПриСозданииНаСервере в ПриОткрытии из-за потенциальной проблемы
	//"Неизвестный идентификатор формы". Предположение: https://infostart.ru/1c/articles/2178185/
	АдресХранилищаДанныхПортала = ПолучитьАдресХранилищаДанныхПортала(УникальныйИдентификатор);
	// ) 2024.11.27
	
	#Если ВебКлиент Тогда
		ЭтоВебКлиент = Истина;
	#Иначе
		ЭтоВебКлиент = Ложь;
		СтруктураПодключения = ЗаполнитьСтруктуруПодключения();
	#КонецЕсли
			
	СимволТочка = ".";
	ПозицияТочки = СтрДлина(ЭтаФорма.ИмяФормы);
	Пока Сред(ЭтаФорма.ИмяФормы, ПозицияТочки, 1) <> СимволТочка Цикл 
		ПозицияТочки = ПозицияТочки - 1; 
	КонецЦикла; 
	ПрефиксИмениФорм = Лев(ЭтаФорма.ИмяФормы, ПозицияТочки);
	
	ЗаполнитьНастройки();
	
	//"Раскрасим" список отбора по статусу
	УстановитьОтборСтрокСпискаДокументов();
	
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	МодульКастомизации_ОбработатьСобытиеФормы_Клиент("ОсновнаяФорма_ПриОткрытии",ПараметрыМК);
				
	//Сперва покажем основную форму, потом окно авторизации
	ПодключитьОбработчикОжидания("ВыполнитьАвторизацию",0.1,Истина);
		
КонецПроцедуры
&НаСервереБезКонтекста
Функция ПолучитьАдресХранилищаДанныхПортала(УникальныйИдентификаторФормы)
	//Заполним адрес хранилища данных портала
	Возврат ПоместитьВоВременноеХранилище(Неопределено,УникальныйИдентификаторФормы);
КонецФункции
	
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗакрытиеФормы_Авторизация" Тогда
		ОбработатьЗакрытиеФормыАвторизации(Параметр);
		
	ИначеЕсли ИмяСобытия = "ЗакрытиеФормы_ПодтверждениеТелефона" Тогда
		Если Параметр.Свойство("Токен") Тогда
			//После успешного выполнения потверждения телефона будет возвращена изменённая кука,
			//с которой нужно продолжать выполнять последующие запросы.
			Токен = Параметр.Токен;
			ДанныеПользователя.phoneConfirm = Истина;
		КонецЕсли;
	
	ИначеЕсли ИмяСобытия = "ЗакрытиеФормы_Настройки" Тогда
		
		Если Параметр.Свойство("СтруктураНастроек",СтруктураНастроек) Тогда
			
			//Стартовать периодический опрос статусов заданий распознавания
			ВыполнитьОбновлениеСтатусовЗаданийРаспознавания();
			
			УстановитьВидимость_КомандыИнтерфейсаПоНастройкам();
			
			//E1C-149: новая команда-подменю контекстного меню списка документов для поиска существующего документа
			ПоискСуществующихДокументов_ЗаполнитьМенюСпискаТиповДокументов();
			
			// Используется модуль кастомизации в этих настройках
			УстановитьВидимость_ИспользуетсяМодульКастомизации();
			
			//Теперь список обрабатываемых типов документов храним в реквизите формы
			ЗаполнитьСписокОбрабатываемыхТиповДокументов();
			
			//токен для выполнения запросов с сервера при работе модуля кастомизации
			СтруктураНастроек.Вставить("Токен",Токен);
						
		КонецЕсли;
		
		//2019.09.09 (
		Если Параметр.Свойство("recognitionSettings")
			И ТипЗнч(СправочникиПортала) = Тип("Структура")
			И СправочникиПортала.Свойство("recognitionSettings") Тогда
				СправочникиПортала.recognitionSettings = Параметр.recognitionSettings;
		КонецЕсли;
		// ) 2019.09.09
		
		//Изменение некоторых настроек предполагает очистку списка документов
		Если Параметр.Свойство("ОчиститьСписокДокументов") И Параметр.ОчиститьСписокДокументов = Истина Тогда
			Объект.СписокДокументов.Очистить();
			ПересчитатьИтогиПоСтатусамДокументов();
		КонецЕсли;
		
		Если Параметр.Успешно Тогда
			УстановитьНаправленияДокументов();
			ВыполнитьПоискСсылокПоДаннымПорталаНаСервере();			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ЗакрытиеФормы_Мультиселект" Тогда
		Мультиселект_СписокЗакрытиеФормы(Параметр);
		
	ИначеЕсли ИмяСобытия = "ЗакрытиеФормы_ВыгрузкаНоменклатуры" Тогда
		
	ИначеЕсли ИмяСобытия = "ЗакрытиеФормы_СопоставлениеДубликатов" Тогда
		//Обработчик закрытия формы перенесен в _ЗФ_ОбработатьАсинхронныйВызов
		
	ИначеЕсли ИмяСобытия = "ЗакрытиеФормы_ОтправляемыеФайлы" Тогда
		//Обработчик закрытия формы перенесен в _ЗФ_ОбработатьАсинхронныйВызов
		
	ИначеЕсли ИмяСобытия = "ЗакрытиеФормы_ЗагружаемыеОбъекты" Тогда
		//Обработчик закрытия формы перенесен в _ЗФ_ОбработатьАсинхронныйВызов
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройки()
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Пространство",Отбор_Пространство);
	ПараметрыОткрытия.Вставить("РегионПространства",РегионПространства);
	ПараметрыОткрытия.Вставить("ИсходнаяСтруктураНастроек",СтруктураНастроек);
	ПараметрыОткрытия.Вставить("ДоступноОписаниеОповещения",ДоступноОписаниеОповещения);
	ПараметрыОткрытия.Вставить("ВладелецФормыУникальныйИдентификатор",ЭтаФорма.УникальныйИдентификатор);
	ПараметрыОткрытия.Вставить("ЭтоРасширениеКонфигурации",ЭтоРасширениеКонфигурации);
	ПараметрыОткрытия.Вставить("ЭтоФреш",ЭтоФреш);
	
	Если ТипЗнч(СправочникиПортала) = Тип("Структура") И СправочникиПортала.Свойство("recognitionSettings") Тогда
		ПараметрыОткрытия.Вставить("recognitionSettings",СправочникиПортала.recognitionSettings);
	КонецЕсли;
	
	ФормаНастроек = ПолучитьФорму(ПрефиксИмениФорм + "УФ_Настройки", ПараметрыОткрытия, ЭтаФорма);
	СтруктураНастроек = ФормаНастроек.ПолучитьСтруктуруНастроекНаСервере();
	ФормаНастроек = Неопределено;
	
	//токен для выполнения запросов с сервера при работе модуля кастомизации
	СтруктураНастроек.Вставить("Токен",Токен);
	
	УстановитьВидимость_ИспользуетсяМодульКастомизации();
	УстановитьВидимость_КомандыИнтерфейсаПоНастройкам();
	
	//E1C-149: новая команда-подменю контекстного меню списка документов для поиска существующего документа
	ПоискСуществующихДокументов_ЗаполнитьМенюСпискаТиповДокументов();
	
	//Теперь список обрабатываемых типов документов храним в реквизите формы
	ЗаполнитьСписокОбрабатываемыхТиповДокументов();
	
	УстановитьНаправленияДокументов();
	
КонецПроцедуры
&НаСервере
Процедура УстановитьНаправленияДокументов()
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РеквизитОбъект.ЗаполнитьНаправленияСоздаваемыхДокументов(АдресХранилищаДанныхПортала,СтруктураНастроек);
	ЗначениеВРеквизитФормы(РеквизитОбъект,"Объект");
	
	ЗаполнитьВСпискеДокументовДополнительныеДанные();
КонецПроцедуры
&НаКлиенте
Процедура УстановитьВидимость_КомандыИнтерфейсаПоНастройкам()
	
	//Кнопка выгрузки протокола видна, если включено его ведение
	Элементы.Команда_ВыгрузитьПротокол.Видимость = Не СтруктураНастроек.СистемныеНастройки_ВестиПротоколРаботы = "Нет";
	
	//Если не используются комплекты - команды контекстного меню для комплектов не отображаем
	//2020.10.01 ( Один из пользователей во Фреш умудрился прибить эту группу в форме,
	//чтобы не было ошибки выполнения - проверим наличие элемента
	Если Элементы.Найти("СписокДокументов_КонтекстноеМеню_Группа5") <> Неопределено Тогда
	// ) 2020.10.01
		Элементы.СписокДокументов_КонтекстноеМеню_Группа5.Видимость = СтруктураНастроек.СозданиеДокумента_ИспользоватьПоискКомплектов = Истина;
	КонецЕсли;
	
	//2021.02.25 ( Отображаем фильтр только при включенной настройке работы с ЭДО
	Если Элементы.Найти("ГруппаОтправленныеЭДО") <> Неопределено Тогда
		Элементы.ГруппаОтправленныеЭДО.Видимость = СтруктураНастроек.ОбменДанными_ИспользуетсяИсходящийЭлектронныйДокументооборот = Истина;
	КонецЕсли;
	// ) 2021.02.25
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСписокОбрабатываемыхТиповДокументов()
	
	ТипыСоздаваемыхДокументов.Очистить();
	
	Для Каждого ТипДокумента Из СтруктураНастроек.СведенияОКонфигурации.ТипыЗаполняемыхДокументов Цикл
		ТипыСоздаваемыхДокументов.Добавить(ТипДокумента.Значение,ТипДокумента.Представление);
	КонецЦикла;
	
	//Можем добавить "несуществующие" в метаданных типы документов, явным образом описав обработку таких значений программно.
	//Попробуем унифицировать описание: элементы значения, разделенные знаком подчеркивания "_"
	// - Префикс "Энтера" - определяем, что это "наш добавленный тип"
	// - Имя метаданных добавляемого документа
	// - Имя предопределенного значения для его получения функцией ПредопределенноеЗначение()
	// - имя метаданных справочника, переопределяющего используемый справочник для обработки товарных позиций документа
	
	Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","ОсновныеСредства") Тогда
		Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
			//Для Казахстана пока не включаем, есть различия в структуре справочников
		Иначе
			ТипыСоздаваемыхДокументов.Добавить("Энтера_ПоступлениеТоваровУслуг_Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ОсновныеСредства_ОсновныеСредства",
				"Поступление товаров и услуг: Основные средства");
		КонецЕсли;
	КонецЕсли;
	
	//E1C-509: аккуратно добавляем счет-фактуру на аванс
	Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат = "БП30" Тогда
		Если РеквизитСуществует("Перечисления","ВидСчетаФактурыПолученного","НаАванс") Тогда
			Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
				//Для Казахстана пока не включаем, есть различия в структуре справочников
			Иначе
				ТипыСоздаваемыхДокументов.Добавить("Энтера_СчетФактураПолученный_Перечисление.ВидСчетаФактурыПолученного.НаАванс",
					"Счет-фактура на аванс");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвторизацию()
	ОткрытьФормуАвторизации(Истина);
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьФормуАвторизации(ВыполнитьАвтоматическийВход)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВыполнитьАвтоматическийВход",ВыполнитьАвтоматическийВход);
	ПараметрыОткрытия.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыОткрытия.Вставить("ЭтоФреш",ЭтоФреш);
		
	ФормаАвторизации = ПолучитьФорму(ПрефиксИмениФорм + "УФ_Авторизация", ПараметрыОткрытия, ЭтаФорма);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Источник","УФ_Авторизация");
	ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,Форма","ОбработатьЗакрытиеФормы_СинхронноАсинхронно",ДопПараметры,ФормаАвторизации);
	
	_ЗФ_ОбработатьАсинхронныйВызов("ОткрытьФормуМодально",ПараметрыВызова);
		
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьЗакрытиеФормыАвторизации(Результат)
	
	Если Результат <> Неопределено И Результат.АвторизацияВыполнена Тогда
		Токен = Результат.Токен;
		Элементы.Авторизация.Заголовок = Результат.Логин;
		
		//E1C-14: Автоматическая авторизация
		Если Результат.Свойство("АвтоматическийВход") Тогда
			
			Попытка
				КартинкаАвторизация = БиблиотекаКартинок.Пользователь;
			Исключение
				//Не обрабатываем исключение
			КонецПопытки;
			
			ПоказатьОповещениеПользователя("Авторизация",,"Выполнен автоматический вход",КартинкаАвторизация);
		КонецЕсли;
				
		ЗаполнитьДанныеПользователя();
		ЗаполнитьСправочникиПортала();
		
		// 2019.08.03 ( Добавлен Стартовый помощник, открываем, если нет флага "Не открывать помощник"
		Если СтруктураНастроек.СистемныеНастройки_ОткрыватьСтартовыйПомощник = Истина Тогда
			ПодключитьОбработчикОжидания("ОткрытьФорму_СтартовыйПомощник",0.1,Истина);
			
		Иначе
		// ) 2019.08.03
		
			// 2019.01.29 (EN-195: Автоматическое обновление сразу после авторизации
			Если СтруктураНастроек.СистемныеНастройки_ЗаполнятьСписокДокументовПриСтарте Тогда
				Обновить(Неопределено);
			КонецЕсли;
			// ) 2019.01.29
			
			ПодключитьОбработчикОжидания("ПроверитьСписокНовыхВерсий",0.1,Истина);
			
		КонецЕсли;
		
		//2021.12.11 ( Покажем новости, пока просто по таймауту
		Если ДанныеПользователя_ТаблицаНовостей.Количество() > 0 Тогда
			ПодключитьОбработчикОжидания("ПоказатьНовости",10,Истина);
		КонецЕсли;
		// ) 2021.12.11
		
		//если потребуется заполнение данных для регламентного задания - поместим в СтруктуруНастроек логин/пароль
		СтруктураНастроек.Вставить("Логин",Результат.Логин);
		СтруктураНастроек.Вставить("Пароль",Результат.Пароль);
		
		//токен для выполнения запросов с сервера при работе модуля кастомизации
		СтруктураНастроек.Вставить("Токен",Токен);
		
	Иначе
		Элементы.Авторизация.Заголовок = "Авторизация";
	КонецЕсли;
	
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыМК.Вставить("Параметр",Результат);
	МодульКастомизации_ОбработатьСобытиеФормы_Клиент("ОсновнаяФорма_ЗакрытиеФормы_Авторизация",ПараметрыМК);
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьДанныеПользователя()
	
	РезультатЗапроса = ВыполнитьЗапрос("ДанныеПользователя","GET","/api/v1/currentUser?format=xml");
		
	Если РезультатЗапроса.Успешно Тогда
		ОбновитьТекстКнопкиБаланс();
	
		//могло измениться пространство, перезаполним настройки
		ЗаполнитьНастройки();
	Иначе
		СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьСправочникиПортала()
	
	РезультатЗапроса = ВыполнитьЗапрос("СправочникиПортала_ТипыДокументов","GET","/api/v1/documentTypes?format=xml");
	
	Если РезультатЗапроса.Успешно Тогда
		БыстрыйФильтр_ЗаполнитьТипыДокументов();
	Иначе
		СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
	КонецЕсли;
	
	РезультатЗапроса = ВыполнитьЗапрос("СправочникиПортала_СтатусыДокументов","GET","/api/v1/documentStates?format=xml");
	
	Если Не РезультатЗапроса.Успешно Тогда
		СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
	КонецЕсли;
	
	//Добавились списки поставщиков и плательщиков
	РезультатЗапроса = ВыполнитьЗапрос("СправочникиПортала_Плательщики","GET","/api/v1/spaces/" + Отбор_Пространство + "/customers?format=xml");
	
	Если РезультатЗапроса.Успешно Тогда
		//В реквизит элемента формы больше не заполняем, используем для выбора значения структуры СправочникиПортала
		Если Ложь Тогда
			Элементы.Отбор_Плательщик.СписокВыбора.Очистить();
			Если СправочникиПортала.Свойство("Плательщики") Тогда
				Для Каждого ЭлементСписка Из СправочникиПортала.Плательщики Цикл
					НовыйЭлемент = Элементы.Отбор_Плательщик.СписокВыбора.Добавить();
					ЗаполнитьЗначенияСвойств(НовыйЭлемент,ЭлементСписка);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	Иначе
		СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
	КонецЕсли;
	
	//Поставщики	
	РезультатЗапроса = ВыполнитьЗапрос("СправочникиПортала_Поставщики","GET","/api/v1/spaces/" + Отбор_Пространство + "/suppliers?format=xml");
	
	Если РезультатЗапроса.Успешно Тогда
		//В реквизит элемента формы больше не заполняем, используем для выбора значения структуры СправочникиПортала
		Если Ложь Тогда
			Элементы.Отбор_Поставщик.СписокВыбора.Очистить();
			Если СправочникиПортала.Свойство("Поставщики") Тогда
				Для Каждого ЭлементСписка Из СправочникиПортала.Поставщики Цикл
					НовыйЭлемент = Элементы.Отбор_Поставщик.СписокВыбора.Добавить();
					ЗаполнитьЗначенияСвойств(НовыйЭлемент,ЭлементСписка);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	Иначе
		СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСписокНовыхВерсий() Экспорт
	ПолучитьСписокНовыхВерсий(Ложь);
КонецПроцедуры
&НаКлиенте
Функция ПолучитьСписокНовыхВерсий(ПринудительнаяПроверка = Ложь)
		
	//При проверке обновлений по запросу пользователя показываем все изменения существующих версий
	Если ПринудительнаяПроверка Тогда
		НачальнаяВерсия = 0;
	Иначе
		НачальнаяВерсия = ВерсияМодуля.Версия;
	КонецЕсли;
	
	//E1C-169: При обновлении расширения следует проверить, есть ли описание новой версии, соответствующей версии расширения,
	//если есть - показываем, если нет - показываем только если это принудительная проверка обновлений
	Если ЭтоРасширениеКонфигурации И ПринудительнаяПроверка = Ложь Тогда
		ПоследняяЗапущеннаяВерсия = ПолучитьПоследнююЗапущеннуюВерсиюМодуля();
		Если ПоследняяЗапущеннаяВерсия = ВерсияМодуля.Версия Тогда
			ПоказатьОповещениеПользователя("Проверка обновлений",,"Используется актуальная версия расширения");
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ТипВерсии = ?(ЭтоФреш,"FRESH","1C");
	СтрокаЗапроса = "/api/v1/moduleVersions?format=xml&type=" + ТипВерсии + "&sinceVersion=" + НачальнаяВерсия;
		
	РезультатЗапроса = ВыполнитьЗапрос("ПолучениеСпискаНовыхВерсий","GET",СтрокаЗапроса);
	
	Если РезультатЗапроса.Успешно Тогда
		
		//Проверяем, это пользователь "руками" запросил список обновлений, или запрос был выполнен автоматически после авторизации
		Если ПринудительнаяПроверка = Истина
			Или РезультатЗапроса.ПоследняяВерсия <> РезультатЗапроса.НеНапоминатьОВерсии Тогда
		
			СписокНовыхВерсий = РезультатЗапроса.СписокНовыхВерсий;
			
			Если СписокНовыхВерсий.Количество() > 0 Тогда
			
				//Открываем форму списка обновлений
				ПараметрыОткрытия = Новый Структура;
				ПараметрыОткрытия.Вставить("СтруктураНастроек",СтруктураНастроек);
				ПараметрыОткрытия.Вставить("ПрефиксИмениФорм",ПрефиксИмениФорм);
				ПараметрыОткрытия.Вставить("СписокНовыхВерсий",СписокНовыхВерсий);
				ПараметрыОткрытия.Вставить("ПринудительнаяПроверка",ПринудительнаяПроверка);
				ПараметрыОткрытия.Вставить("ЭтоФреш",ЭтоФреш);
				ПараметрыОткрытия.Вставить("ЭтоРасширениеКонфигурации",ЭтоРасширениеКонфигурации);
				
				ФормаОбновлений = ПолучитьФорму(ПрефиксИмениФорм + "УФ_ФормаОбновлений",ПараметрыОткрытия,ЭтаФорма);
				ФормаОбновлений.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
				ФормаОбновлений.ЗакрыватьПриЗакрытииВладельца = Истина;
				ФормаОбновлений.Открыть();
				
			Иначе
				//При старте это показывать не обязательно?
				Если Не ПринудительнаяПроверка Тогда
					ПоказатьОповещениеПользователя("Проверка обновлений",,"Используется актуальная версия обработки");
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
	КонецЕсли;
	
КонецФункции
&НаСервереБезКонтекста
Функция СохранитьПоследнююЗапущеннуюВерсиюМодуля(Версия)
	ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","ПоследняяЗапущеннаяВерсия",Версия);
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьПоследнююЗапущеннуюВерсиюМодуля()
	Возврат ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","ПоследняяЗапущеннаяВерсия");
КонецФункции

&НаКлиенте
Процедура ПоказатьНовости() Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	
	ФормаНовостей = ПолучитьФорму(ПрефиксИмениФорм + "УФ_Новости", ПараметрыОткрытия, ЭтаФорма);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Источник","УФ_Новости");
	ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,Форма","ОбработатьЗакрытиеФормы_СинхронноАсинхронно",ДопПараметры,ФормаНовостей);
	
	_ЗФ_ОбработатьАсинхронныйВызов("ОткрытьФормуМодально",ПараметрыВызова);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодтвержденияТелефона()
		
	ПараметрыОткрытия = Новый Структура;
	
	ФормаПодтверждения = ПолучитьФорму(ПрефиксИмениФорм + "УФ_ПодтверждениеТелефона", ПараметрыОткрытия, ЭтаФорма);
	ФормаПодтверждения.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ФормаПодтверждения.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаПодтверждения.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФорму_СтартовыйПомощник() Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыОткрытия.Вставить("Пространство",Отбор_Пространство);
	
	ФормаСтартовыйПомощник = ПолучитьФорму(ПрефиксИмениФорм + "УФ_СтартовыйПомощник",ПараметрыОткрытия,ЭтаФорма);
	ФормаСтартовыйПомощник.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ФормаСтартовыйПомощник.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаСтартовыйПомощник.Открыть();
	
КонецПроцедуры


// ================= Кнопки, команды, интерактивности ===================

&НаКлиенте
Процедура Авторизация(Команда)
	Если Элементы.Авторизация.Заголовок <> "Авторизация" Тогда
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ЭлементФормы",Элементы.Авторизация);
		
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить("Выход","Выйти из учетной записи");
		
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,СписокВыбора","ОбработатьВыборИзМенюАвторизация",ДопПараметры,СписокВыбора);
		
		_ЗФ_ОбработатьАсинхронныйВызов("ВыборИзМеню",ПараметрыВызова);
	Иначе
		ОткрытьФормуАвторизации(Ложь);
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьВыборИзМенюАвторизация(Результат,ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Если Результат.Значение = "Выход" Тогда
		
			//очистить загруженные данные
			Объект.СписокДокументов.Очистить();
			ПоместитьВоВременноеХранилище(Неопределено,АдресХранилищаДанныхПортала);
			
			Токен = "";
			Элементы.Авторизация.Заголовок = "Авторизация";
			
			Отбор_Пространство = "";
			Элементы.Отбор_Пространство.СписокВыбора.Очистить();
			
			ПересчитатьИтогиПоСтатусамДокументов();
			ОбновитьТекстКнопкиБаланс();
			
			ОткрытьФормуАвторизации(Ложь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Пространство",Отбор_Пространство);
	ПараметрыОткрытия.Вставить("РегионПространства",РегионПространства);
	ПараметрыОткрытия.Вставить("ПрефиксИмениФорм",ПрефиксИмениФорм);
	ПараметрыОткрытия.Вставить("ДоступноОписаниеОповещения",ДоступноОписаниеОповещения);
	ПараметрыОткрытия.Вставить("ВладелецФормыУникальныйИдентификатор",ЭтаФорма.УникальныйИдентификатор);
	ПараметрыОткрытия.Вставить("ИсходнаяСтруктураНастроек",СтруктураНастроек);
	ПараметрыОткрытия.Вставить("ЭтоФреш",ЭтоФреш);
	
	Если ТипЗнч(СправочникиПортала) = Тип("Структура") И СправочникиПортала.Свойство("recognitionSettings") Тогда
		ПараметрыОткрытия.Вставить("recognitionSettings",СправочникиПортала.recognitionSettings);
	КонецЕсли;
	
	ФормаНастроек = ПолучитьФорму(ПрефиксИмениФорм + "УФ_Настройки", ПараметрыОткрытия, ЭтаФорма);
	ФормаНастроек.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ФормаНастроек.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Флажки_УстановитьФлаг_ВсемДокументам(Команда)
	УстановитьСнятьФлажкиВТаблице(Истина,Истина);
КонецПроцедуры
&НаКлиенте
Процедура Флажки_УстановитьФлаг_ПустымДокументам(Команда)
	УстановитьСнятьФлажкиВТаблице(Истина,Ложь);
КонецПроцедуры
&НаКлиенте
Процедура Флажки_УстановитьФлаг_ГотоваПФ(Команда)
	УстановитьСнятьФлажкиВТаблице(Истина,Ложь,Истина);
КонецПроцедуры
&НаКлиенте
Процедура Флажки_СнятьФлаг_ВсемДокументам(Команда)
	УстановитьСнятьФлажкиВТаблице(Ложь,Истина);
КонецПроцедуры
&НаКлиенте
Процедура Флажки_СнятьФлаг_ЗаполненнымДокументам(Команда)
	УстановитьСнятьФлажкиВТаблице(Ложь,Ложь);
КонецПроцедуры
&НаКлиенте
Процедура Флажки_СнятьФлаг_НеГотоваПФ(Команда)
	УстановитьСнятьФлажкиВТаблице(Ложь,Ложь,Истина);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьФлажкиВТаблице(Флаг, ВсемДокументам = Истина, ПечатнаяФорма = Ложь, ВключаяСкрытые = Ложь)
	
	Для Каждого Строка Из Объект.СписокДокументов Цикл 
		
		//По новой вводной если флаг снимаем для всех строк - то видимость строк значения не имеет
		Если ВсемДокументам И Не Флаг Тогда
			Строка.Пометка = Ложь;
			Продолжить;
		КонецЕсли;
		
		//Обрабатывать только видимые строки?
		Если Не Элементы.СписокДокументов.ПроверитьСтроку(Строка.ПолучитьИдентификатор()) Тогда
			
			//E1C-179: если флаг снимается не для всех документов, но включая скрытые
			Если ВключаяСкрытые И Не ВсемДокументам И Не Флаг Тогда
				Строка.Пометка = Ложь;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		// 2019.05.14 ( EN-438: теперь задания на распознавание нужно отображать и в списке документов, таким строкам флаг не устанавливаем
		Если ЗначениеЗаполнено(Строка.recognitionTaskId) Тогда
			Строка.Пометка = Ложь;
			Продолжить;
		КонецЕсли;
		// ) 2019.05.14
		
		Если ВсемДокументам Тогда
			Строка.Пометка = Флаг;
			
		ИначеЕсли ПечатнаяФорма Тогда
			Если Флаг Тогда
				Строка.Пометка = Строка.ИндексКартинкиПечатнойФормы = 0;
			Иначе
				Строка.Пометка = Строка.ИндексКартинкиПечатнойФормы = 0 И Строка.Пометка;
			КонецЕсли;
			
		Иначе
			Если Флаг Тогда
				Строка.Пометка = Не ЗначениеЗаполнено(Строка.Документ1с);
			Иначе
				Строка.Пометка = Не ЗначениеЗаполнено(Строка.Документ1с) И Строка.Пометка;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура Команда_Направление_УстановитьВходящий(Команда)
	Направление_ГрупповоеИзменение("Входящий");
КонецПроцедуры
&НаКлиенте
Процедура Команда_Направление_УстановитьИсходящий(Команда)
	Направление_ГрупповоеИзменение("Исходящий");
КонецПроцедуры
&НаКлиенте
Процедура Направление_ГрупповоеИзменение(Значение)
	Для Каждого ВыделеннаяСтрока Из Элементы.СписокДокументов.ВыделенныеСтроки Цикл
		ТекСтрока = Объект.СписокДокументов.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если ТекСтрока.recognitionTaskId = "" Тогда
			ТекСтрока.НаправлениеСоздаваемогоДокумента = Значение;		
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура Команда_ИзменитьСтороныДокумента(Команда)
	
	ВыделенныеСтроки = Элементы.СписокДокументов.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьОповещениеПользователя("Ошибка",,"Не выделены строки с документами для изменения сторон");
	Иначе
		ТекстВопроса = "Для документов в выделенных строках [" + ВыделенныеСтроки.Количество() + "]
			|будут заменены стороны Плательщик-Поставщик, продолжить?";
		Кнопки = РежимДиалогаВопрос.ДаНет;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ВыделенныеСтроки",ВыделенныеСтроки);
		
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","Продолжить_ИзменитьСтороныДокумента",ДопПараметры,ТекстВопроса,Кнопки);
		_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);

	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура Продолжить_ИзменитьСтороныДокумента(Результат,ДопПараметры)
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		МассивИдентификаторов = Новый Массив;
		Для Каждого ИдентификаторСтроки Из ДопПараметры.ВыделенныеСтроки Цикл
			СтрокаДокумента = Объект.СписокДокументов.НайтиПоИдентификатору(ИдентификаторСтроки);
			МассивИдентификаторов.Добавить(СтрокаДокумента.ДокументИД);
		КонецЦикла;
		
		//изменяем данные портала в 1с и данные в форме реестра, формируем запрос с изменениями порталу
		РезультатИзменения = ИзменитьСтороныДокумента_ПодготовитьДанныеДляПортала(МассивИдентификаторов);
		
		Если РезультатИзменения.Успешно Тогда
			Счетчик = 0;
			
			//Формируем запросы порталу, отправляем обновленные данные документов
			Для Каждого ЗапросПорталу Из РезультатИзменения.КоллекцияЗапросов Цикл
		
				ДокументИД = ЗапросПорталу.Ключ;
				ТелоЗапроса = ЗапросПорталу.Значение;
		
				Счетчик = Счетчик + 1;
				Прогресс = Счетчик / РезультатИзменения.КоллекцияЗапросов.Количество() * 100;
				Состояние("Обновление данных документов на портале...",Прогресс);
				
				//отправляем запрос, обновляем данные документа
				МетодAPI = "/api/v1/documents/" + ДокументИД + "/accept?format=xml";
				РезультатЗапроса = ВыполнитьЗапрос("ОбновлениеДанныхДокументов","PUT",МетодAPI,ТелоЗапроса);
				
				Если РезультатЗапроса.Успешно Тогда
					//
				Иначе
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "[" + Строка(ДокументИД) + "]: ошибка при обновлении данных портала" + Символы.ПС + РезультатЗапроса.ТекстОшибки;
					Сообщение.Сообщить();
				КонецЕсли;
				
			КонецЦикла;
		Иначе
			СообщитьСообщение(РезультатИзменения.ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Функция ИзменитьСтороныДокумента_ПодготовитьДанныеДляПортала(МассивИдентификаторов)
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РезультатИзменения = РеквизитОбъект.ИзменитьСтороныДокумента_ПодготовитьДанныеДляПортала(АдресХранилищаДанныхПортала,МассивИдентификаторов);
	ЗначениеВРеквизитФормы(РеквизитОбъект,"Объект");
	Возврат РезультатИзменения;
КонецФункции


&НаКлиенте
Процедура СписокДокументов_УстановитьСтатус_Выгружен(Команда)
	
	//Статус Выгружен не может быть установлен методом акцептации документа,
	//сформируем задание уведомления по выделенным строкам и отправим запрос о создании документов в 1с
	
	ВыделенныеСтроки = Элементы.СписокДокументов.ВыделенныеСтроки;
	ОчищаемыеСтроки = Новый Массив;
	
	//Документам, которые уже в статусе Выгружен - снимаем выделение
	СчетчикСтрок = 0;
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		СтрокаДокумента = Объект.СписокДокументов.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если СтрокаДокумента.ДокументСтатус = "UPLOADED" Тогда
			ОчищаемыеСтроки.Добавить(ИдентификаторСтроки);
			СчетчикСтрок = СчетчикСтрок + 1;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОчищаемаяСтрока Из ОчищаемыеСтроки Цикл
		Элементы.СписокДокументов.ВыделенныеСтроки.Удалить(Элементы.СписокДокументов.ВыделенныеСтроки.Найти(ОчищаемаяСтрока));
	КонецЦикла;
	
	Если СчетчикСтрок > 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Снят выбор документов [" + СчетчикСтрок + "], которые уже в статусе <Выгружен>";
		Сообщение.Сообщить();
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.СписокДокументов.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьОповещениеПользователя("Ошибка",,"Не выделены строки с документами для изменения статуса");
	Иначе
		ТекстВопроса = "Для документов в выделенных строках [" + ВыделенныеСтроки.Количество() + "]
			|будет установлен статус <Выгружен>, продолжить?";
		Кнопки = РежимДиалогаВопрос.ДаНет;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ВыделенныеСтроки",ВыделенныеСтроки);
		
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","Продолжить_УстановитьСтатусДокумента_Выгружен",ДопПараметры,ТекстВопроса,Кнопки);
		_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);

	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура Продолжить_УстановитьСтатусДокумента_Выгружен(Результат,ДопПараметры)
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Для Каждого ИдентификаторСтроки Из ДопПараметры.ВыделенныеСтроки Цикл
			СтрокаДокумента = Объект.СписокДокументов.НайтиПоИдентификатору(ИдентификаторСтроки);
			Если ЗначениеЗаполнено(СтрокаДокумента.Документ1с) Тогда
				ДокументСсылка = СтрокаДокумента.Документ1с;
			Иначе
				ДокументСсылка = Неопределено;
			КонецЕсли;
			ЗаданияУведомления.Добавить(ДокументСсылка,СтрокаДокумента.ДокументИД);
		КонецЦикла;
		
		РезультатЗапроса = УведомлениеПорталуОСозданииДокументов_Отправить();
		
		Если РезультатЗапроса.Успешно Тогда
			//+++ изменить статусы нужно также в данных портала
			Для Каждого ИдентификаторСтроки Из ДопПараметры.ВыделенныеСтроки Цикл
				СтрокаДокумента = Объект.СписокДокументов.НайтиПоИдентификатору(ИдентификаторСтроки);
				СтрокаДокумента.ДокументСтатус = "UPLOADED";
				СтрокаДокумента.ПредставлениеСтатуса = "Выгружен";
				
				СтрокаДокумента.Счетчик_Загружен = 1;
				СтрокаДокумента.Счетчик_Проверен = 0;
				СтрокаДокумента.Счетчик_Распознан = 0;
			КонецЦикла;
			
			ПересчитатьИтогиПоСтатусамДокументов();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура СписокДокументов_УстановитьСтатус_Проверен(Команда)
	
	//Изначально метод планировался как общий для изменения на любой статус, в соответствии с описанием метода в задаче,
	//но описание оказалось некорректным и данным методом может быть установлен только статус VERIFIED
	Статус = Новый Структура("Статус,ПредставлениеСтатуса","VERIFIED","Проверен");
	
	ВыделенныеСтроки = Элементы.СписокДокументов.ВыделенныеСтроки;
	ОчищаемыеСтроки = Новый Массив;
	
	//Дополнительное описание задачи: установить статус VERIFIED можно только для документов в статусе RECOGNIZED
	СчетчикСтрок = 0;
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		СтрокаДокумента = Объект.СписокДокументов.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если СтрокаДокумента.ДокументСтатус <> "RECOGNIZED" Тогда
			ОчищаемыеСтроки.Добавить(ИдентификаторСтроки);
			СчетчикСтрок = СчетчикСтрок + 1;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОчищаемаяСтрока Из ОчищаемыеСтроки Цикл
		Элементы.СписокДокументов.ВыделенныеСтроки.Удалить(Элементы.СписокДокументов.ВыделенныеСтроки.Найти(ОчищаемаяСтрока));
	КонецЦикла;
	
	Если СчетчикСтрок > 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Установить статус <Проверен> можно только для документов в статусе <Распознан>, снят выбор документов [" + СчетчикСтрок + "], не соответствующих данному условию";
		Сообщение.Сообщить();
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.СписокДокументов.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьОповещениеПользователя("Ошибка",,"Не выделены строки с документами для изменения статуса");
	Иначе
		ТекстВопроса = "Для документов в выделенных строках [" + ВыделенныеСтроки.Количество() + "]
			|будет установлен статус <" + Статус.ПредставлениеСтатуса + ">, продолжить?";
		Кнопки = РежимДиалогаВопрос.ДаНет;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Статус",Статус);
		ДопПараметры.Вставить("ВыделенныеСтроки",ВыделенныеСтроки);
		
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","Продолжить_УстановитьСтатусДокумента",ДопПараметры,ТекстВопроса,Кнопки);
		_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);

	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура Продолжить_УстановитьСтатусДокумента(Результат,ДопПараметры)
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		МассивИдентификаторов = Новый Массив;
		Для Каждого ИдентификаторСтроки Из ДопПараметры.ВыделенныеСтроки Цикл
			СтрокаДокумента = Объект.СписокДокументов.НайтиПоИдентификатору(ИдентификаторСтроки);
			МассивИдентификаторов.Добавить(СтрокаДокумента.ДокументИД);
		КонецЦикла;
		
		//изменяем данные портала в 1с и данные в форме реестра, формируем запрос с изменениями порталу
		РезультатИзменения = УстановитьСтатусДокумента_ПодготовитьДанныеДляПортала(МассивИдентификаторов,ДопПараметры.Статус);
		
		Если РезультатИзменения.Успешно Тогда
			Счетчик = 0;
			
			//Формируем запросы порталу, отправляем обновленные данные документов
			Для Каждого ЗапросПорталу Из РезультатИзменения.КоллекцияЗапросов Цикл
		
				ДокументИД = ЗапросПорталу.Ключ;
				ТелоЗапроса = ЗапросПорталу.Значение;
		
				Счетчик = Счетчик + 1;
				Прогресс = Счетчик / РезультатИзменения.КоллекцияЗапросов.Количество() * 100;
				Состояние("Обновление данных документов на портале...",Прогресс);
				
				//отправляем запрос, обновляем данные документа
				МетодAPI = "/api/v1/documents/" + ДокументИД + "/accept?format=xml";
				РезультатЗапроса = ВыполнитьЗапрос("ОбновлениеДанныхДокументов","PUT",МетодAPI,ТелоЗапроса);
				
				Если РезультатЗапроса.Успешно Тогда
					//
				Иначе
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "[" + Строка(ДокументИД) + "]: ошибка при обновлении данных портала" + Символы.ПС + РезультатЗапроса.ТекстОшибки;
					Сообщение.Сообщить();
				КонецЕсли;
				
			КонецЦикла;
			
			ПересчитатьИтогиПоСтатусамДокументов();
			
		Иначе
			СообщитьСообщение(РезультатИзменения.ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Функция УстановитьСтатусДокумента_ПодготовитьДанныеДляПортала(МассивИдентификаторов,Статус)
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РезультатИзменения = РеквизитОбъект.УстановитьСтатусДокумента_ПодготовитьДанныеДляПортала(АдресХранилищаДанныхПортала,МассивИдентификаторов,Статус);
	ЗначениеВРеквизитФормы(РеквизитОбъект,"Объект");
	Возврат РезультатИзменения;
КонецФункции


&НаКлиенте
Процедура Команда_ОбъединитьВКомплект(Команда)
	
	//Объединение комплектов выполняется попарно, должно быть выбрано 2 строки документов
	ВыделенныеСтроки = Элементы.СписокДокументов.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() <> 2 Тогда
		ПоказатьОповещениеПользователя("Ошибка",,"Выделите две строки объединяемых в комплект документов");
		Возврат;
	КонецЕсли;
	
	//E1C-8: Необходимо проверить суммы документов и типы: один из документов должен быть счет-фактура, другой - акт или накладная
	Строка1 = Объект.СписокДокументов.НайтиПоИдентификатору(ВыделенныеСтроки[0]);
	Строка2 = Объект.СписокДокументов.НайтиПоИдентификатору(ВыделенныеСтроки[1]);
			
	Если Строка1.ДокументТип = "UTD" Или Строка2.ДокументТип = "UTD" Тогда
		ПоказатьОповещениеПользователя("Ошибка",,"Документ УПД невозможно объединить в комплект");
		
	ИначеЕсли (Строка1.ДокументТип = "VAT_INVOICE" И Строка2.ДокументТип = "TORG12"
		Или Строка1.ДокументТип = "VAT_INVOICE" И Строка2.ДокументТип = "CERTIFICATE")
		Или (Строка2.ДокументТип = "VAT_INVOICE" И Строка1.ДокументТип = "TORG12"
		Или Строка2.ДокументТип = "VAT_INVOICE" И Строка1.ДокументТип = "CERTIFICATE") Тогда
				
		//Все ок, можно объединять
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ВыделенныеСтроки",ВыделенныеСтроки);
		
		Различия = Новый Массив;
		
		//Если суммы документов различаются - необходимо будет выдать вопрос пользователю
		Если Строка1.СуммаДокумента <> Строка2.СуммаДокумента Тогда
			Различия.Добавить("Суммы");
		КонецЕсли;
		
		Если Строка1.ПредставлениеПлательщика <> Строка2.ПредставлениеПлательщика Тогда
			Различия.Добавить("Плательщики");
		КонецЕсли;
		
		Если Строка1.ПредставлениеПоставщика <> Строка2.ПредставлениеПоставщика Тогда
			Различия.Добавить("Поставщики");
		КонецЕсли;
		
		ДопПараметры.Вставить("Различия",Различия);
		
		ТекстВопроса = "Документы " + Строка1.ПредставлениеДокумента + " и " + Строка2.ПредставлениеДокумента + "
			|будут объединены в комплект, продолжить?";
		Кнопки = РежимДиалогаВопрос.ДаНет;
		
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","Продожить_СписокДокументов_ПроверкаСуммы",ДопПараметры,ТекстВопроса,Кнопки);
		_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
		
	Иначе
		//Не соответствуют типы
		ПоказатьОповещениеПользователя("Ошибка",,"Объединить в комплект можно Накладную/Акт и Счет-фактуру");
		
	КонецЕсли;	
	
КонецПроцедуры
&НаКлиенте
Процедура Продожить_СписокДокументов_ПроверкаСуммы(Результат,ДопПараметры)
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если ДопПараметры.Различия.Количество() > 0 Тогда
			
			ТекстРазличия = "";
			Для Каждого ЭлементМассива Из ДопПараметры.Различия Цикл
				ТекстРазличия = ТекстРазличия + ЭлементМассива;
				ТекстРазличия = ТекстРазличия + ?(ДопПараметры.Различия.Найти(ЭлементМассива) = ДопПараметры.Различия.ВГраница(),"",", ");
			КонецЦикла;
			
			ТекстВопроса = ТекстРазличия + " объединяемых документов различаются, продолжить?";
			Кнопки = РежимДиалогаВопрос.ДаНет;
			
			ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","Продожить_СписокДокументов_ОбъединениеКомплекта",ДопПараметры,ТекстВопроса,Кнопки);
			_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
			
		Иначе
			//Все ок, продолжаем
			Продожить_СписокДокументов_ОбъединениеКомплекта(КодВозвратаДиалога.Да,ДопПараметры);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура Продожить_СписокДокументов_ОбъединениеКомплекта(Результат,ДопПараметры)
	Если Результат = КодВозвратаДиалога.Да Тогда
		Комплекты_ОбъединениеКомплекта(ДопПараметры.ВыделенныеСтроки);
		
		ПоказатьОповещениеПользователя("Успешно",,"Связь комплектов установлена");
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура Комплекты_ОбъединениеКомплекта(МассивИдентификаторовСтрок)
	
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	//связь должна храниться как в children, так и в parent	
	Строка1 = Объект.СписокДокументов.НайтиПоИдентификатору(МассивИдентификаторовСтрок[0]);
	Строка2 = Объект.СписокДокументов.НайтиПоИдентификатору(МассивИдентификаторовСтрок[1]);
		
	Если Строка1.ДокументТип = "VAT_INVOICE" Тогда
		//заполняем для этого документа parent, родительскому документу - children
		
		Строка1.parentId = Строка2.ДокументИД;
		Строка2.childrenId = Строка1.ДокументИД;
		
		ДанныеДокументаПортала = ДанныеПортала.documents.Найти(Строка1.ДокументИД,"id");
		ДанныеДокументаПортала.parent = Строка2.ДокументИД;
		
		ДанныеДокументаПортала = ДанныеПортала.documents.Найти(Строка2.ДокументИД,"id");
		ДанныеДокументаПортала.children = Строка1.ДокументИД;
		
	Иначе
		//заполняем для этого документа children, родительскому документу - parent
		Строка1.childrenId = Строка2.ДокументИД;
		Строка2.parentId = Строка1.ДокументИД;
		
		ДанныеДокументаПортала = ДанныеПортала.documents.Найти(Строка1.ДокументИД,"id");
		ДанныеДокументаПортала.children = Строка2.ДокументИД;
		
		ДанныеДокументаПортала = ДанныеПортала.documents.Найти(Строка2.ДокументИД,"id");
		ДанныеДокументаПортала.parent = Строка1.ДокументИД;
		
	КонецЕсли;
				
	
	ПоместитьВоВременноеХранилище(ДанныеПортала,АдресХранилищаДанныхПортала);
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_РазъединитьКомплект(Команда)
	
	Если Элементы.СписокДокументов.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ВыделенныеСтроки",Элементы.СписокДокументов.ВыделенныеСтроки);
	ТекстВопроса = "Существующая связь комплектов документов (Накладная/акт + Счет-фактура)
				   |в выделенных строках будет очищена, продолжить?";
	Кнопки = РежимДиалогаВопрос.ДаНет;
	
	ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","Продожить_СписокДокументов_РазъединениеКомплекта",ДопПараметры,ТекстВопроса,Кнопки);
	_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);

КонецПроцедуры
&НаКлиенте
Процедура Продожить_СписокДокументов_РазъединениеКомплекта(Результат,ДопПараметры)
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Комплекты_РазъединениеКомплекта(ДопПараметры.ВыделенныеСтроки);
		
		ПоказатьОповещениеПользователя("Успешно",,"Связь комплектов очищена");
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура Комплекты_РазъединениеКомплекта(МассивИдентификаторовСтрок)
	
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	//связь может храниться как в children, так и в parent, необходимо очистить связь в обоих документах
	Для Каждого ИдентификаторСтроки Из МассивИдентификаторовСтрок Цикл
		
		СтрокаТаблицы = Объект.СписокДокументов.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		parentId = СтрокаТаблицы.parentId;
		childrenId = СтрокаТаблицы.childrenId;
		
		Если ЗначениеЗаполнено(parentId) Тогда
			//Очищаем ссылку на parent у документа списка и в данных портала
			СтрокаТаблицы.parentId = "";
			ДанныеДокументаПортала = ДанныеПортала.documents.Найти(СтрокаТаблицы.ДокументИД,"id");
			Если ДанныеДокументаПортала <> Неопределено Тогда
				ДанныеДокументаПортала.parent = "";
			КонецЕсли;
			
			//Очищаем связь комплектов у связанных с текущим документов
			НайденныеСтроки = Объект.СписокДокументов.НайтиСтроки(Новый Структура("ДокументИД",parentId));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.childrenId = "";
			КонецЦикла;
			
			//Очищаем связь комплектов у связанных с текущим документов
			НайденныеСтроки = ДанныеПортала.documents.НайтиСтроки(Новый Структура("id",parentId));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.children = "";
			КонецЦикла;
		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(childrenId) Тогда
			//Очищаем ссылку на children у документа списка и в данных портала
			СтрокаТаблицы.childrenId = "";
			ДанныеДокументаПортала = ДанныеПортала.documents.Найти(СтрокаТаблицы.ДокументИД,"id");
			Если ДанныеДокументаПортала <> Неопределено Тогда
				ДанныеДокументаПортала.children = "";
			КонецЕсли;
			
			//Очищаем связь комплектов у связанных с текущим документов
			НайденныеСтроки = Объект.СписокДокументов.НайтиСтроки(Новый Структура("ДокументИД",childrenId));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.parentId = "";
			КонецЦикла;
			
			//Очищаем связь комплектов у связанных с текущим документов
			НайденныеСтроки = ДанныеПортала.documents.НайтиСтроки(Новый Структура("id",childrenId));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.parent = "";
			КонецЦикла;
		КонецЕсли;
			
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ДанныеПортала,АдресХранилищаДанныхПортала);
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_ПрисоединитьФайлСканаКДокументу(Команда)
	
	ТекСтрока = Элементы.СписокДокументов.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекСтрока.Документ1с) Тогда
			
			//Получаем печатную форму PDF
			РезультатЗапроса = ПолучитьПечатнуюФормуСканаДокумента(ТекСтрока.ДокументИД,ТекСтрока.ПредставлениеДокумента);
			Если РезультатЗапроса.Успешно Тогда
				
				Если РезультатЗапроса.ТребуетсяПовтор Тогда
					СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
				Иначе
					ТекСтрока.АдресХранилищаСканаДокумента = РезультатЗапроса.АдресВХ;
					ТекСтрока.ИмяФайлаСканаДокумента = РезультатЗапроса.ИмяФайла;
					
					Массив = Новый Массив;
					СтруктураФайла = Новый Структура("АдресВХ,ИмяФайла",РезультатЗапроса.АдресВХ,РезультатЗапроса.ИмяФайла);
					Массив.Добавить(СтруктураФайла);
					
					ТекстОшибки = "";
					ПрисоединитьФайлы_СканыДокумента(ТекСтрока.Документ1с,Массив,ТекстОшибки);
					
					Если ЗначениеЗаполнено(ТекстОшибки) Тогда
						СообщитьСообщение(ТекстОшибки);
					Иначе
						Попытка КартинкаУспешно = БиблиотекаКартинок.Успешно32; Исключение; КонецПопытки;
						ПоказатьОповещениеПользователя("Успешно",,"Файл скана прикреплен к документу",КартинкаУспешно);
					КонецЕсли;
				КонецЕсли;
			Иначе
				СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
			КонецЕсли;			
			
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнен документ, к которому будет прикреплен скан";
			Сообщение.Поле = "Объект.СписокДокументов[" + ТекСтрока.ПолучитьИдентификатор() + "].Документ1с";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоискСуществующихДокументов_ЗаполнитьМенюСпискаТиповДокументов()
	
	//E1C-149: новая команда-подменю контекстного меню списка документов для поиска существующего документа
	СписокТиповДокументов = СтруктураНастроек.СведенияОКонфигурации.ТипыЗаполняемыхДокументов.Скопировать();
	
	//E1C-312: также в список тех документов, с которыми могут быть связаны распознанные документы нужно добавить
	//счета-фактуры, они отсутствуют в этом списке, так как не создаются по скану как отдельный документ, а вводятся по основному документу
	ДобавляемыйДокумент = Метаданные.Документы.Найти("СчетФактураПолученный");
	Если ДобавляемыйДокумент <> Неопределено Тогда
		СписокТиповДокументов.Добавить(ДобавляемыйДокумент.Имя,ДобавляемыйДокумент.Синоним);
	КонецЕсли;
	
	ДобавляемыйДокумент = Метаданные.Документы.Найти("СчетФактураВыданный");
	Если ДобавляемыйДокумент <> Неопределено Тогда
		СписокТиповДокументов.Добавить(ДобавляемыйДокумент.Имя,ДобавляемыйДокумент.Синоним);
	КонецЕсли;
	// ) E1C-312
	
	ДобавляемыйДокумент = Метаданные.Документы.Найти("КорректировкаПриобретения");
	Если ДобавляемыйДокумент <> Неопределено Тогда
		СписокТиповДокументов.Добавить(ДобавляемыйДокумент.Имя,ДобавляемыйДокумент.Синоним);
	КонецЕсли;
	
	//E1C-468
	ДобавляемыйДокумент = Метаданные.Документы.Найти("ПоступлениеНМА");
	Если ДобавляемыйДокумент <> Неопределено Тогда
		СписокТиповДокументов.Добавить(ДобавляемыйДокумент.Имя,ДобавляемыйДокумент.Синоним);
	КонецЕсли;
	
	//2025.07.28 (
	ДобавляемыйДокумент = Метаданные.Документы.Найти("_АктСверкиВзаиморасчетов");
	Если ДобавляемыйДокумент <> Неопределено Тогда
		СписокТиповДокументов.Добавить(ДобавляемыйДокумент.Имя,ДобавляемыйДокумент.Синоним);
	КонецЕсли;
	// ) 2025.07.28
	
	//2025.09.25 (
	ДобавляемыйДокумент = Метаданные.Документы.Найти("ПеремещениеТоваров");
	Если ДобавляемыйДокумент <> Неопределено Тогда
		СписокТиповДокументов.Добавить(ДобавляемыйДокумент.Имя,ДобавляемыйДокумент.Синоним);
	КонецЕсли;
	// ) 2025.09.25
	
	//E1C-447: Прикрепление скана документа к Договору с контрагентом
	ДобавляемыйДокумент = Метаданные.Справочники.Найти("ДоговорыКонтрагентов");
	Если ДобавляемыйДокумент <> Неопределено Тогда
		СписокТиповДокументов.Добавить("Справочник_" + ДобавляемыйДокумент.Имя,"Справочник: " + ДобавляемыйДокумент.Синоним);
	КонецЕсли;
	
	Если Элементы.Найти("СписокДокументовКонтекстноеМеню_ПоискСуществующихДокументов") <> Неопределено Тогда
		Элемент_ГруппаПодменю = Элементы.СписокДокументовКонтекстноеМеню_ПоискСуществующихДокументов;
		Для Каждого ЭлементСписка Из СписокТиповДокументов Цикл
			ИмяКоманды = "ИмяТипаДокумента_" + ЭлементСписка.Значение;
			ДобавитьКнопкуНаФорму(ЭтаФорма,ИмяКоманды,ИмяКоманды,ЭлементСписка.Представление,"ПоискСуществующихДокументов_ВыборТипаДокумента",Элемент_ГруппаПодменю);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПоискСуществующихДокументов_ВыборТипаДокумента(Команда)
	
	ТекСтрока = Элементы.СписокДокументов.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекСтрока.Документ1с) Тогда
			Попытка КартинкаОшибка = БиблиотекаКартинок.Остановить; Исключение; КонецПопытки;
			ПоказатьОповещениеПользователя("Ошибка",,"Соответствие уже установлено",КартинкаОшибка);
			
		Иначе
	
			ТипСуществующегоДокумента = СтрЗаменить(Команда.Имя,"ИмяТипаДокумента_","");
			
			Если Найти(ТипСуществующегоДокумента,"Справочник_") > 0 Тогда
				ТипСуществующегоДокумента = СтрЗаменить(ТипСуществующегоДокумента,"Справочник_","");
				РазделМетаданных = "Справочник";
			Иначе
				РазделМетаданных = "Документ";
			КонецЕсли;
			
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("РежимВыбора",Истина);
			ПараметрыОткрытия.Вставить("КлючНазначенияИспользования","Энтера_ВыборСуществующегоДокумента");
			
			Попытка
				ФормаВыбора = ПолучитьФорму(РазделМетаданных + "." + ТипСуществующегоДокумента + ".ФормаВыбора",ПараметрыОткрытия,ЭтаФорма);
				ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
				ФормаВыбора.ЗакрыватьПриЗакрытииВладельца = Истина;
			Исключение
				Попытка КартинкаОшибка = БиблиотекаКартинок.Остановить; Исключение; КонецПопытки;
				ПоказатьОповещениеПользователя("Ошибка",,"Не удалось получить форму выбора документа",КартинкаОшибка);
			КонецПопытки;
			
			Если ФормаВыбора <> Неопределено Тогда
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("ИдентификаторСтроки",ТекСтрока.ПолучитьИдентификатор());
				ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ФормаВыбора","ПоискСуществующихДокументов_ВыборДокумента",ДопПараметры,ФормаВыбора);
				
				_ЗФ_ОбработатьАсинхронныйВызов("ВыбратьЭлементИзФормыВыбора",ПараметрыВызова);
			КонецЕсли;
			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПоискСуществующихДокументов_ВыборДокумента(Результат,ДопПараметры)
	
	Если Результат <> Неопределено Тогда
		ТекСтрока = Объект.СписокДокументов.НайтиПоИдентификатору(ДопПараметры.ИдентификаторСтроки);
		
		Если ТекСтрока <> Неопределено Тогда
			ТекСтрока.Документ1с = Результат;
			ТекстОшибки = "";
			ЗаписатьСвязьСДокументомПортала(ТекСтрока.ДокументИД,ТекСтрока.ПространствоИД,ТекСтрока.Документ1с,Неопределено,ТекстОшибки);
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				СообщитьСообщение(ТекстОшибки);
			КонецЕсли;
			
			//Если включена настройка - прикрепляем скан к документу
			Если СтруктураНастроек.СозданиеДокумента_ПрисоединятьФайлСканаДокумента = Истина Тогда
				
				//Получаем печатную форму PDF
				РезультатЗапроса = ПолучитьПечатнуюФормуСканаДокумента(ТекСтрока.ДокументИД,ТекСтрока.ПредставлениеДокумента);
				Если РезультатЗапроса.Успешно Тогда
					
					Если РезультатЗапроса.ТребуетсяПовтор Тогда
						СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
					Иначе
						ТекСтрока.АдресХранилищаСканаДокумента = РезультатЗапроса.АдресВХ;
						ТекСтрока.ИмяФайлаСканаДокумента = РезультатЗапроса.ИмяФайла;
						
						Массив = Новый Массив;
						СтруктураФайла = Новый Структура("АдресВХ,ИмяФайла",РезультатЗапроса.АдресВХ,РезультатЗапроса.ИмяФайла);
						Массив.Добавить(СтруктураФайла);
						
						ТекстОшибки = "";
						ПрисоединитьФайлы_СканыДокумента(ТекСтрока.Документ1с,Массив,ТекстОшибки);
						
						Если ЗначениеЗаполнено(ТекстОшибки) Тогда
							СообщитьСообщение(ТекстОшибки);
						Иначе
							Попытка КартинкаУспешно = БиблиотекаКартинок.Успешно32; Исключение; КонецПопытки;
							ПоказатьОповещениеПользователя("Успешно",,"Файл скана прикреплен к документу",КартинкаУспешно);
						КонецЕсли;
					КонецЕсли;
				Иначе
					СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
				КонецЕсли;
			КонецЕсли;
			
			//E1C-479: Передача статуса выгрузки документа из 1С на портал при выполнении связывания с существующим документов 1С
			ВыделенныеСтроки = Новый Массив;
			ВыделенныеСтроки.Добавить(ТекСтрока.ПолучитьИдентификатор());
			
			ПараметрыУстановкиСтатуса = Новый Структура;
			ПараметрыУстановкиСтатуса.Вставить("ВыделенныеСтроки",ВыделенныеСтроки);
			Продолжить_УстановитьСтатусДокумента_Выгружен(КодВозвратаДиалога.Да,ПараметрыУстановкиСтатуса);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьТипДокументаПортала_ЗаполнитьМенюСпискаТиповДокументов()
	
	//E1C-149: новая команда-подменю контекстного меню списка документов для поиска существующего документа
	Элемент_ГруппаПодменю = Элементы.СписокДокументов_КонтекстноеМеню_ИзменитьТипДокументаПортала;
	Если Элемент_ГруппаПодменю.ПодчиненныеЭлементы.Количество() = 0 Тогда
		Для Каждого ЭлементСписка Из СправочникиПортала.ТипДокумента Цикл
			ИмяКоманды = "ТипДокументаПортала_" + ЭлементСписка.Ключ;
			ДобавитьКнопкуНаФорму(ЭтаФорма,ИмяКоманды,ИмяКоманды,ЭлементСписка.Значение,"ИзменитьТипДокументаПортала_ВыборТипаДокумента",Элемент_ГруппаПодменю);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ИзменитьТипДокументаПортала_ВыборТипаДокумента(Команда)
	
	МассивИдентификаторов = Элементы.СписокДокументов.ВыделенныеСтроки;			
	
	Если МассивИдентификаторов.Количество() > 0 Тогда
		НовыйТипДокумента = СтрЗаменить(Команда.Имя,"ТипДокументаПортала_","");
		
		ИзменитьТипДокументаПортала_НаСервере(МассивИдентификаторов,НовыйТипДокумента);	
		
		//Обновим отбор строк, может быть установлен отбор по типу документа
		БыстрыйФильтр_УстановитьОтборПоВыбраннымТипам();
		УстановитьОтборСтрокСпискаДокументов();
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ИзменитьТипДокументаПортала_НаСервере(МассивИдентификаторов,НовыйТипДокумента)
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	ПредставлениеТипа = СправочникиПортала.ТипДокумента.Получить(НовыйТипДокумента);
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	Для Каждого ИдентификаторСтроки Из МассивИдентификаторов Цикл
		
		ТекСтрока = Объект.СписокДокументов.НайтиПоИдентификатору(ИдентификаторСтроки);
		ДанныеДокументаПортала = ДанныеПортала.documents.Найти(ТекСтрока.ДокументИД,"id");
		
		Если ДанныеДокументаПортала <> Неопределено Тогда
			
			//Обновим данные, полученные от портала
			ДанныеДокументаПортала.type = НовыйТипДокумента;
			ДанныеДокументаПортала.ПредставлениеТипа = ПредставлениеТипа;
			
			ПредставлениеДокумента = РеквизитОбъект.СформироватьПредставлениеДокументаПортала(ДанныеДокументаПортала);
			ДанныеДокументаПортала.ПредставлениеДокумента = ПредставлениеДокумента;
			
			//Обновляем отображение в данных формы
			ТекСтрока.ДокументТип = НовыйТипДокумента;
			ТекСтрока.ПредставлениеТипа = ПредставлениеТипа;
			ТекСтрока.ПредставлениеДокумента = ПредставлениеДокумента;
		
		КонецЕсли;
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ДанныеПортала,АдресХранилищаДанныхПортала);	
	
КонецПроцедуры


&НаКлиенте
Процедура Отбор_ПространствоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> Отбор_Пространство Тогда
		ПоказатьОповещениеПользователя("Пространство изменено",,"Нажмите кнопку Обновить для актуализации данных");
		
		// 2020.07.14 ( очистим существующие задания распознавания, оставшиеся по старому пространству
		ЗаданияРаспознавания_Таблица.Очистить();
		// ) 2020.07.14
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура Отбор_ПространствоПриИзменении(Элемент)
	
	УстановитьОтборСтрокСпискаДокументов();
	ЗаполнитьНастройки();
	
	//Сохраним выбранное значение пространства
	Отбор_Пространство_СохранитьВыбранноеЗначение(Отбор_Пространство);
	
	//Обновляем баланс страниц
	ОбновитьТекстКнопкиБаланс();
	
	//Определяем регион пространства
	РегионПространства = ДанныеПользователя.spaceCountries.Получить(Отбор_Пространство);
	СтруктураНастроек.Вставить("РегионПространства",РегионПространства);
	
	//Обновляем справочники выбора Плательщика/Поставщика для выбранного пространства
	ЗаполнитьСправочникиПортала();
	
	
	//Очищаем плательщиков и поставщиков, которых нет в новом пространстве
	МассивУдаляемых = Новый Массив;
	Для Каждого ЭлементСписка Из Отбор_Плательщик Цикл
		Если Элементы.Отбор_Плательщик.СписокВыбора.НайтиПоЗначению(ЭлементСписка.Значение) = Неопределено Тогда
			МассивУдаляемых.Добавить(ЭлементСписка);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементМассива Из МассивУдаляемых Цикл
		Отбор_Плательщик.Удалить(ЭлементМассива);
	КонецЦикла;
	
	МассивУдаляемых = Новый Массив;
	Для Каждого ЭлементСписка Из Отбор_Поставщик Цикл
		Если Элементы.Отбор_Поставщик.СписокВыбора.НайтиПоЗначению(ЭлементСписка.Значение) = Неопределено Тогда
			МассивУдаляемых.Добавить(ЭлементСписка);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементМассива Из МассивУдаляемых Цикл
		Отбор_Поставщик.Удалить(ЭлементМассива);
	КонецЦикла;
	
	
	// 2019.08.03 ( Добавлен Стартовый помощник, открываем, если не пустое пространство и для его настроек установлен флаг "Открывать помощник"
	Если ЗначениеЗаполнено(Отбор_Пространство) И СтруктураНастроек.СистемныеНастройки_ОткрыватьСтартовыйПомощник = Истина Тогда
		ПодключитьОбработчикОжидания("ОткрытьФорму_СтартовыйПомощник",0.1,Истина);
	КонецЕсли;
	// ) 2019.08.03
	
КонецПроцедуры
&НаСервереБезКонтекста
Процедура Отбор_Пространство_СохранитьВыбранноеЗначение(Отбор_Пространство)
	ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","ПоследнееРабочееПространство",Отбор_Пространство);
КонецПроцедуры

&НаКлиенте
Процедура ВсеДокументыНажатие(Элемент)
	БыстрыйФильтр_Статус = Неопределено;
	УстановитьОтборСтрокСпискаДокументов();
КонецПроцедуры
&НаКлиенте
Процедура ГотовыеДокументыНажатие(Элемент)
	БыстрыйФильтр_Статус = "VERIFIED";
	УстановитьОтборСтрокСпискаДокументов();
КонецПроцедуры
&НаКлиенте
Процедура РаспознаютсяНажатие(Элемент)
	БыстрыйФильтр_Статус = "RECOGNIZED";
	УстановитьОтборСтрокСпискаДокументов();
КонецПроцедуры
&НаКлиенте
Процедура НаРаспознаванииНажатие(Элемент)
	
	//Запросим от портала выполняющиеся задания распознавания
	Если СтруктураНастроек.Свойство("ОбменДанными_ОтображатьЗаданияРаспознавания")
		И СтруктураНастроек.ОбменДанными_ОтображатьЗаданияРаспознавания = Истина Тогда
		ЗаданияРаспознавания_ПолучитьСписокВыполняющихся();
	КонецЕсли;
	
	БыстрыйФильтр_Статус = "RECOGNIZING";
	УстановитьОтборСтрокСпискаДокументов();
КонецПроцедуры
&НаКлиенте
Процедура ОтправленныеВЭДОНажатие(Элемент)
	БыстрыйФильтр_Статус = "EDI_SEND";
	УстановитьОтборСтрокСпискаДокументов();
КонецПроцедуры
&НаКлиенте
Процедура ЗагруженныеНажатие(Элемент)
	БыстрыйФильтр_Статус = "UPLOADED";
	УстановитьОтборСтрокСпискаДокументов();
КонецПроцедуры
&НаКлиенте
Процедура УстановитьОтборСтрокСпискаДокументов() Экспорт
	
	//E1C-185: В веб-клиенте ОтборСтрок табличной части не выполняется по нескольким ключам, определим для каждой строки ее соответствие отбору
	//и установим флаг Документ_СоответствуетОтбору, по которому уже выполним отбор. Исходный вариант пока оставляю
	НовыйВариант = Истина;
	
	Если НовыйВариант Тогда
		
		Для Каждого СтрокаТаблицы Из Объект.СписокДокументов Цикл
			СтатусСоответствуетОтбору = Не ЗначениеЗаполнено(БыстрыйФильтр_Статус) Или СтрокаТаблицы.ДокументСтатус = БыстрыйФильтр_Статус;
			ПространствоСоответствуетОтбору = Не ЗначениеЗаполнено(Отбор_Пространство) Или СтрокаТаблицы.ПространствоИД = Отбор_Пространство;
			ТипСоответствуетОтбору = СтрокаТаблицы.ДокументТип_СоответствуетОтбору = 1;
			
			СтрокаТаблицы.Документ_СоответствуетОтбору = СтатусСоответствуетОтбору И ПространствоСоответствуетОтбору И ТипСоответствуетОтбору;
			
			//Также показываем задания распознавания
			Если ЗначениеЗаполнено(СтрокаТаблицы.recognitionTaskId) Тогда
				СтрокаТаблицы.Документ_СоответствуетОтбору = Истина;
			КонецЕсли;
		КонецЦикла;
		
		СтруктураОтбора = Новый Структура("Документ_СоответствуетОтбору",Истина);
		
	Иначе
	
		СтруктураОтбора = Новый Структура("ДокументТип_СоответствуетОтбору",1);
		
		Если БыстрыйФильтр_Статус <> Неопределено Тогда
			СтруктураОтбора.Вставить("ДокументСтатус",БыстрыйФильтр_Статус);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Отбор_Пространство) Тогда
			СтруктураОтбора.Вставить("ПространствоИД",Отбор_Пространство);
		КонецЕсли;
		
	КонецЕсли;
	
	//2020.02.21 ( Отобразить в интерфейсе установленный в данный момент фильтр
	Элементы.Загруженные.ЦветТекста = ?(БыстрыйФильтр_Статус = "UPLOADED",WebЦвета.Черный,WebЦвета.СветлоГрифельноСерый);
	Элементы.ГотовыеДокументы.ЦветТекста = ?(БыстрыйФильтр_Статус = "VERIFIED",WebЦвета.Черный,WebЦвета.СветлоГрифельноСерый);
	Элементы.НаРаспознавании.ЦветТекста = ?(БыстрыйФильтр_Статус = "RECOGNIZING",WebЦвета.Черный,WebЦвета.СветлоГрифельноСерый);
	Элементы.Распознанные.ЦветТекста = ?(БыстрыйФильтр_Статус = "RECOGNIZED",WebЦвета.Черный,WebЦвета.СветлоГрифельноСерый);
	Элементы.ОтправленныеВЭДО.ЦветТекста = ?(БыстрыйФильтр_Статус = "EDI_SEND",WebЦвета.Черный,WebЦвета.СветлоГрифельноСерый);
	// ) 2020.02.21
	
	Элементы.СписокДокументов.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура БыстрыйФильтр_ЗаполнитьТипыДокументов()
	
	Если ТипЗнч(СправочникиПортала) = Тип("Структура")
		И СправочникиПортала.Свойство("ТипДокумента") Тогда
		
		Для Каждого ТипДокумента Из СправочникиПортала.ТипДокумента Цикл
			БыстрыйФильтр_ТипыДокументов.Добавить(ТипДокумента.Ключ,ТипДокумента.Значение);
		КонецЦикла;
		
		Попытка КартинкаЗакрыть = БиблиотекаКартинок.Закрыть; Исключение; КартинкаЗакрыть = Новый Картинка; КонецПопытки;
		
		БыстрыйФильтр_ТипыДокументов.Добавить("ОчиститьОтбор","Очистить отбор",,КартинкаЗакрыть);
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура БыстрыйФильтр_ТипыДокументовНажатие(Элемент)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ЭлементФормы",Элементы.БыстрыйФильтр_ТипыДокументов);
	ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,СписокВыбора","БыстрыйФильтр_ОбработатьВыборТипаДокумента",ДопПараметры,БыстрыйФильтр_ТипыДокументов);
	
	_ЗФ_ОбработатьАсинхронныйВызов("ВыборИзМеню",ПараметрыВызова);
	
КонецПроцедуры
&НаКлиенте
Процедура БыстрыйФильтр_ОбработатьВыборТипаДокумента(Результат,ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если Результат.Значение = "ОчиститьОтбор" Тогда
			
			Для Каждого ЭлементСписка Из БыстрыйФильтр_ТипыДокументов Цикл
				ЭлементСписка.Пометка = Ложь;
			КонецЦикла;
			
		Иначе
			Результат.Пометка = Не Результат.Пометка;
			
		КонецЕсли; 
		
		БыстрыйФильтр_УстановитьОтборПоВыбраннымТипам();
		УстановитьОтборСтрокСпискаДокументов();
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура БыстрыйФильтр_УстановитьОтборПоВыбраннымТипам()
	
	ТекстОтбора = "";
	ЕстьОтборПоТипу = Ложь;
	
	Для Каждого ТипДокумента Из БыстрыйФильтр_ТипыДокументов Цикл
		Если ТипДокумента.Пометка Тогда
			ТекстОтбора = ТекстОтбора + ?(ТекстОтбора <> "",", ","") + ТипДокумента.Представление;
			ЕстьОтборПоТипу = Истина;
		КонецЕсли;
	КонецЦикла;
		
	БыстрыйФильтр_УстановленныйОтбор = ТекстОтбора;
	
	//Определим в таблице документов флаг соответствия отмеченным типам документов
	Для Каждого СтрокаДокумента Из Объект.СписокДокументов Цикл
		
		//Строки с заданиями распознавания отображаем всегда
		Если ЗначениеЗаполнено(СтрокаДокумента.recognitionTaskId) Тогда
			СтрокаДокумента.ДокументТип_СоответствуетОтбору = 1;
			Продолжить;
		КонецЕсли;
		
		Если ЕстьОтборПоТипу Тогда
			
			//Проверяем строку на соответствие типу
			СтрокаДокумента.ДокументТип_СоответствуетОтбору = 0;
			СоответствующийТип = БыстрыйФильтр_ТипыДокументов.НайтиПоЗначению(СтрокаДокумента.ДокументТип);
			
			Если СоответствующийТип <> Неопределено И СоответствующийТип.Пометка Тогда
				СтрокаДокумента.ДокументТип_СоответствуетОтбору = 1;
			КонецЕсли;
			
		Иначе
			//Все соответствуют отбору
			СтрокаДокумента.ДокументТип_СоответствуетОтбору = 1;
			
		КонецЕсли;
	КонецЦикла;
	
	Счетчик_ТипыДокументов = Объект.СписокДокументов.Итог("ДокументТип_СоответствуетОтбору");
	
КонецПроцедуры


&НаКлиенте
Процедура СписокДокументовПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.СписокДокументов.ТекущиеДанные;
	
	//По этому идентификатору будет подсвечиваться parent/children документы, связанные с документом в текущей строке
	Если СтруктураНастроек.СозданиеДокумента_ИспользоватьПоискКомплектов = Истина Тогда
		ТекущаяСтрока_ДокументИД = ?(ТекСтрока = Неопределено Или ТекСтрока.ДокументИД = "", Неопределено, ТекСтрока.ДокументИД);
	Иначе
		ТекущаяСтрока_ДокументИД = Неопределено;
	КонецЕсли;
	
	//E1C-133: скачивание файлов документов с портала в формате XML ФНС доступно только для УПД, СФ и ТОРГ12
	Если ТекСтрока <> Неопределено Тогда
		Если ТекСтрока.ДокументТип = "UTD" Или ТекСтрока.ДокументТип = "VAT_INVOICE" Или ТекСтрока.ДокументТип = "TORG12" Тогда
			Элементы.СписокДокументов_СкачатьФНСXML.Доступность = Истина;
		Иначе
			Элементы.СписокДокументов_СкачатьФНСXML.Доступность = Ложь;
		КонецЕсли;
		
		//E1C-450: Очистка связи недоступна для исходящих ЭДО-документов
		Если ТекСтрока.ДокументСтатус = "EDI_SEND" Тогда
			Элементы.СписокДокументов_ОчиститьСвязь.Доступность = Ложь;
		Иначе
			Элементы.СписокДокументов_ОчиститьСвязь.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры
&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.СписокДокументов.ТекущиеДанные;
	
	Если Поле = Элементы.СписокДокументовurl
		И ЗначениеЗаполнено(ТекСтрока.url) Тогда
		
		//2019.04.11 ( бухи с IE по умолчанию тоже хотят смотреть Энтеру в Хроме
		ЭтаФорма._ЗФ_Команда_ПерейтиПоСсылке(ТекСтрока.url);
		// ) 2019.04.11
		
	ИначеЕсли Поле = Элементы.СписокДокументовДиадок_url
		И ЗначениеЗаполнено(ТекСтрока.Диадок_url) Тогда
		
		ЭтаФорма._ЗФ_Команда_ПерейтиПоСсылке(ТекСтрока.Диадок_url);
		
	ИначеЕсли Поле = Элементы.СписокДокументовПредставлениеДокумента Тогда
		
		//Задания распознавания не обрабатываем
		Если ЗначениеЗаполнено(ТекСтрока.recognitionTaskId) Тогда
			Возврат;
		КонецЕсли;
		
		//Во Фреш этот функционал не используется
		Если ЭтоФреш Тогда
			Возврат;
		КонецЕсли;
		
		//Получим файл на локальную машину и откроем штатным просмотрщиком pdf
		Если ЗначениеЗаполнено(ТекСтрока.АдресХранилищаСканаДокумента) Тогда
			//Печатная форма уже получена ранее
			АдресХранилищаСканаДокумента = ТекСтрока.АдресХранилищаСканаДокумента;
		Иначе
			
			//Получаем печатную форму PDF
			РезультатЗапроса = ПолучитьПечатнуюФормуСканаДокумента(ТекСтрока.ДокументИД,ТекСтрока.ПредставлениеДокумента);
			Если РезультатЗапроса.Успешно Тогда
				Если РезультатЗапроса.ТребуетсяПовтор Тогда
					СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
				Иначе
					АдресХранилищаСканаДокумента = РезультатЗапроса.АдресВХ;
					ТекСтрока.АдресХранилищаСканаДокумента = РезультатЗапроса.АдресВХ;
					ТекСтрока.ИмяФайлаСканаДокумента = РезультатЗапроса.ИмяФайла;
				КонецЕсли;
			Иначе
				СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтоАдресВременногоХранилища(АдресХранилищаСканаДокумента) Тогда
			//Открываем полученный скан системным просмотрщиком
			ЭтаФорма._ЗФ_Команда_ПоказатьФайлСкана(АдресХранилищаСканаДокумента,ТекСтрока.ИмяФайлаСканаДокумента);
		КонецЕсли;
		
	ИначеЕсли Поле = Элементы.СписокДокументовДокумент1с
		И ЗначениеЗаполнено(ТекСтрока.Документ1с) Тогда
				
		ПараметрыВызова = Новый Структура("Обработчик,Значение","Заглушка_ОписаниеОповещения",ТекСтрока.Документ1с);
		_ЗФ_ОбработатьАсинхронныйВызов("ПоказатьЗначение",ПараметрыВызова);
		
	ИначеЕсли Поле = Элементы.СписокДокументовЗамечанияРаспознавания Тогда
		Если ЗначениеЗаполнено(ТекСтрока.ТекстЗамечанийРаспознавания) Тогда
			ПоказатьПредупреждение(,ТекСтрока.ТекстЗамечанийРаспознавания);
		Иначе
			ПоказатьОповещениеПользователя("",,"Замечаний не зафиксировано");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура СписокДокументовПередНачаломИзменения(Элемент, Отказ)
	
	// 2019.05.14 ( EN-438: теперь задания на распознавание нужно отображать и в списке документов, таким строкам флаг не устанавливаем
	ТекСтрока = Элементы.СписокДокументов.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекСтрока.recognitionTaskId)
		И (Элемент.ТекущийЭлемент = Элементы.СписокДокументовНаправлениеСоздаваемогоДокумента
		Или Элемент.ТекущийЭлемент = Элементы.СписокДокументовПометка) Тогда
		Отказ = Истина;
	КонецЕсли;
	// ) 2019.05.14
	
	//Странный баг: после установки флажка перестает работать сортировка/изменение порядка строк.
	//На новой внешней обработке проблему удалось полностью воспроизвести, установив программный отбор строк табличного поля.
	//Вызов процедуры установки отбора внутри этого обработчика события результата не дал, в обработчике ожидания срабатывает.
	ПодключитьОбработчикОжидания("УстановитьОтборСтрокСпискаДокументов",0.1,Истина);
	
КонецПроцедуры
&НаКлиенте
Процедура СписокДокументовДокумент1сПриИзменении(Элемент)
		
	ТекСтрока = Элементы.СписокДокументов.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ТекстОшибки = "";
		ЗаписатьСвязьСДокументомПортала(ТекСтрока.ДокументИД,ТекСтрока.ПространствоИД,ТекСтрока.Документ1с,Неопределено,ТекстОшибки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		СообщитьСообщение(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументов_ОчиститьСвязь(Команда)
	
	ДопПараметры = Новый Структура;
	ТекстВопроса = "Ссылки на документы в выбранных строках будут удалены
				   |из столбца <Документ в 1С>, продолжить?";
	Кнопки = РежимДиалогаВопрос.ДаНет;
	
	ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","Продолжить_СписокДокументов_ОчиститьСвязь",ДопПараметры,ТекстВопроса,Кнопки);
	_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);

КонецПроцедуры
&НаКлиенте
Процедура Продолжить_СписокДокументов_ОчиститьСвязь(Результат,ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
	
		Для Каждого ВыделеннаяСтрока Из Элементы.СписокДокументов.ВыделенныеСтроки Цикл
		
			ТекСтрока = Объект.СписокДокументов.НайтиПоИдентификатору(ВыделеннаяСтрока);
				
			Если ЗначениеЗаполнено(ТекСтрока.recognitionTaskId) Тогда
				Продолжить;
				
			ИначеЕсли ЗначениеЗаполнено(ТекСтрока.Документ1с) Тогда
				ТекстОшибки = "";
				ЗаписатьСвязьСДокументомПортала(ТекСтрока.ДокументИД,ТекСтрока.ПространствоИД,Неопределено,ТекСтрока.Документ1с,ТекстОшибки);
				
				Если ЗначениеЗаполнено(ТекстОшибки) Тогда
					СообщитьСообщение(ТекстОшибки);
				Иначе
					ТекСтрока.Документ1с = Неопределено;
					
					ТекСтрока.ДокументСтатус = "RECOGNIZED";
					ТекСтрока.ПредставлениеСтатуса = "Распознан";
					
					ТекСтрока.Счетчик_Загружен = 0;
					ТекСтрока.Счетчик_Проверен = 0;
					ТекСтрока.Счетчик_Распознан = 1;
				КонецЕсли;
				
				ПересчитатьИтогиПоСтатусамДокументов();
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура КнопкаБалансНажатие(Команда)
	
	ДанныеБаланса = ОбновитьТекстКнопкиБаланс(Истина);
	
	//Используем форму списка обновлений, там в принципе есть все, что нужно: поле HTML-документа
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыОткрытия.Вставить("ПрефиксИмениФорм",ПрефиксИмениФорм);
	ПараметрыОткрытия.Вставить("ЭтоФреш",ЭтоФреш);
	ПараметрыОткрытия.Вставить("ЭтоРасширениеКонфигурации",ЭтоРасширениеКонфигурации);
	ПараметрыОткрытия.Вставить("ДанныеБаланса",ДанныеБаланса);
	ПараметрыОткрытия.Вставить("ДанныеПользователя",ДанныеПользователя);
	
	ФормаОбновлений = ПолучитьФорму(ПрефиксИмениФорм + "УФ_ФормаОбновлений",ПараметрыОткрытия,ЭтаФорма);
	ФормаОбновлений.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ФормаОбновлений.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаОбновлений.Открыть();
	
КонецПроцедуры
&НаКлиенте
Функция ОбновитьТекстКнопкиБаланс(ЗапрашиватьКоличество = Ложь)
	
	//EN-353: Отображение Безлимитного тарифа в ui пользователя
	//Для пользователя с безлимитным тарифом отображать “Безлимитно до ДД.ММ.ГГГГ”
	//Для пользователей без безлимитного тарифа отображаться: “N страниц до ДД.ММ.ГГГГ”
	
	КоличествоСтраниц = 0;
	
	Если ДанныеПользователя.unlimited = Истина Тогда
		//E1C-385: теперь - не показываем
		Если Истина Тогда
			ТекстБаланс = "Подписка";
		Иначе
			ТекстБаланс = "Подписка: Безлимитно";
		КонецЕсли;
	Иначе
		Если ЗапрашиватьКоличество И ЗначениеЗаполнено(Отбор_Пространство) Тогда
			// /api/v1/spaces/:spaceId/balance
			РезультатЗапроса = ВыполнитьЗапрос("БалансСтраниц","GET","/api/v1/spaces/" + Отбор_Пространство + "/balance?format=xml");
			
			Если РезультатЗапроса.Успешно Тогда
				КоличествоСтраниц = РезультатЗапроса.balance;
			КонецЕсли;
			
		КонецЕсли;
		ТекстБаланс = "Подписка";
	КонецЕсли;
	
	//и дополняем датой завешения
	Если ЗначениеЗаполнено(ДанныеПользователя.transactionExpirationDate) Тогда
		ТекстБаланс = ТекстБаланс + " до " + Формат(ДанныеПользователя.transactionExpirationDate,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Элементы.КнопкаБаланс.Заголовок = ТекстБаланс;
	
	Результат = Новый Структура("Количество,ДатаОкончания,Безлимитно",КоличествоСтраниц,ДанныеПользователя.transactionExpirationDate,ДанныеПользователя.unlimited = Истина);
	Возврат Результат;
	
КонецФункции


// ================= Обработка множественного выбора списков значений ===================

&НаКлиенте
Процедура Мультиселект_СписокНачалоВыбора(Элемент, СписокВыбора, ДанныеВыбора, СтандартнаяОбработка, Заголовок)
	
	//Передаем в форму для мультивыбора список выбранных элементов (хранится в реквизите формы)
	//и полный список элементов (хранится в списке выбора элемента).
	//После окончания выбора присвоим реквизиту выбранные пользователем значения
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Заголовок",Заголовок);
	ПараметрыОткрытия.Вставить("Список",СписокВыбора);
	ПараметрыОткрытия.Вставить("ВыбранныеЗначения",ЭтаФорма[Элемент.Имя]);
	ПараметрыОткрытия.Вставить("ИмяСписка",Элемент.Имя);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Источник","УФ_ОсновнаяФорма_Мультиселект");
	
	Мультиселект_ОткрытьФормуСписка(ПараметрыОткрытия,ДопПараметры);
	
КонецПроцедуры
&НаКлиенте
Процедура Мультиселект_ОткрытьФормуСписка(ПараметрыОткрытия,ДопПараметры) Экспорт
	
	ФормаСписка = ПолучитьФорму(ПрефиксИмениФорм + "УФ_ФормаСписка", ПараметрыОткрытия, ЭтаФорма);
	ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,Форма","ОбработатьЗакрытиеФормы_СинхронноАсинхронно",ДопПараметры,ФормаСписка);
	_ЗФ_ОбработатьАсинхронныйВызов("ОткрытьФормуМодально",ПараметрыВызова);
	
КонецПроцедуры
&НаКлиенте
Процедура Мультиселект_СписокЗакрытиеФормы(Параметр)
	
	Если ТипЗнч(Параметр) = Тип("Структура") Тогда
		
		ЭтаФорма[Параметр.ИмяСписка].Очистить();

		Для Каждого ЭлементСписка Из Параметр.Список Цикл
			Если ЭлементСписка.Пометка Тогда
				НовыйЭлемент = ЭтаФорма[Параметр.ИмяСписка].Добавить();
				ЗаполнитьЗначенияСвойств(НовыйЭлемент,ЭлементСписка);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура Отбор_ПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если СправочникиПортала.Свойство("Поставщики") Тогда
		СписокВыбора = СправочникиПортала.Поставщики;
		Мультиселект_СписокНачалоВыбора(Элемент, СписокВыбора, ДанныеВыбора, СтандартнаяОбработка, "Выбор поставщиков");
	Иначе
		Попытка Картинка = БиблиотекаКартинок.Ошибка32; Исключение; КонецПопытки;
		ПоказатьОповещениеПользователя("Список недоступен",,"Справочник поставщиков не был получен от портала",Картинка);
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура Отбор_ПлательщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если СправочникиПортала.Свойство("Плательщики") Тогда
		СписокВыбора = СправочникиПортала.Плательщики;
		Мультиселект_СписокНачалоВыбора(Элемент, СписокВыбора, ДанныеВыбора, СтандартнаяОбработка, "Выбор плательщиков");
	Иначе
		Попытка Картинка = БиблиотекаКартинок.Ошибка32; Исключение; КонецПопытки;
		ПоказатьОповещениеПользователя("Список недоступен",,"Справочник плательщиков не был получен от портала",Картинка);
	КонецЕсли;
КонецПроцедуры


// ================= Техническая поддержка ===================

&НаКлиенте
Процедура ТехподдержкаТелефонНажатие(Элемент)
	ПараметрыВызова = Новый Структура("Обработчик,СтрокаЗапуска","Заглушка_ОписаниеОповещения","callto:+78005003351");
	_ЗФ_ОбработатьАсинхронныйВызов("ЗапуститьПриложение",ПараметрыВызова);
КонецПроцедуры
&НаКлиенте
Процедура ТехподдержкаЭлектроннаяПочтаНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Токен) Тогда
		Попытка КартинкаОшибка = БиблиотекаКартинок.Остановить; Исключение; КонецПопытки;
		ПоказатьОповещениеПользователя("Ошибка",,"Перед отправкой сообщения необходимо выполнить авторизацию",КартинкаОшибка);
		
		ОткрытьФормуАвторизации(Ложь);
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;	
	ФормаСообщения = ПолучитьФорму(ПрефиксИмениФорм + "УФ_Обращение_Техподдержка", ПараметрыОткрытия, ЭтаФорма);
	
	ФормаСообщения.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаСообщения.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаСообщения.Открыть();
	
КонецПроцедуры
&НаКлиенте
Процедура Техподдержка_Помощь(Команда)
	
	ДопПараметры = Новый Структура;
	
	Попытка КартинкаПочта = БиблиотекаКартинок.Обсуждения; Исключение КонецПопытки;
	Попытка КартинкаБазаЗнаний = БиблиотекаКартинок.Справка; Исключение КонецПопытки;
	Попытка КартинкаКупить = БиблиотекаКартинок.РегистрНакопления; Исключение КонецПопытки;
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("СоздатьОбращение","Создать обращение",,КартинкаПочта);
	СписокВыбора.Добавить("БазаЗнаний","База знаний",,КартинкаБазаЗнаний);
	СписокВыбора.Добавить("Купить","Купить",,КартинкаКупить);
		
	ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,СписокВыбора,ЭлементФормы","Техподдержка_Помощь_ОбработатьВыборИзМеню",ДопПараметры,СписокВыбора,Элементы.Техподдержка_Помощь);
	
	_ЗФ_ОбработатьАсинхронныйВызов("ВыборИзМеню",ПараметрыВызова);
	
КонецПроцедуры
&НаКлиенте
Процедура Техподдержка_Помощь_ОбработатьВыборИзМеню(Результат,ДопПараметры)
	
	Если Результат = Неопределено Тогда
	
	ИначеЕсли Результат.Значение = "СоздатьОбращение" Тогда
		ТехподдержкаЭлектроннаяПочтаНажатие(Неопределено);
		
	ИначеЕсли Результат.Значение = "БазаЗнаний" Тогда
		_ЗФ_Команда_ПерейтиПоСсылке("https://entera.pro/knowledge_base");
		
	ИначеЕсли Результат.Значение = "Купить" Тогда
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ЗаявкаНаПокупку");
		
		Если ДанныеПользователя <> Неопределено Тогда
			ПараметрыОткрытия.Вставить("НомерТелефона",ДанныеПользователя.phone);
		КонецЕсли;
		
		ФормаПодтверждения = ПолучитьФорму(ПрефиксИмениФорм + "УФ_ПодтверждениеТелефона", ПараметрыОткрытия, ЭтаФорма);
		ФормаПодтверждения.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		ФормаПодтверждения.ЗакрыватьПриЗакрытииВладельца = Истина;
		ФормаПодтверждения.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТехподдержкаВерсияНажатие(Элемент)
	ПолучитьСписокНовыхВерсий(Истина);
КонецПроцедуры


// ================= Модуль кастомизации ===================

&НаКлиенте
Процедура УстановитьВидимость_ИспользуетсяМодульКастомизации()
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		ИспользуетсяМК = СтруктураНастроек.Свойство("АдресХранилищаДвоичныхДанныхМодуляКастомизации") И ЭтоАдресВременногоХранилища(СтруктураНастроек.АдресХранилищаДвоичныхДанныхМодуляКастомизации);
		Элементы.ДекорацияМодульКастомизации.Видимость = ИспользуетсяМК;
	КонецЕсли;
	
	//2019.11.11 ( обработка клиентских событий в МК
	Если ИспользуетсяМК Тогда
		МодульМК = _3Ф_ПодключитьВнешнююОбработку(СтруктураНастроек.АдресХранилищаДвоичныхДанныхМодуляКастомизации);
		Если МодульМК <> Неопределено Тогда
			ПараметрыОткрытияФормыМК = Новый Структура;
			Попытка
				МодульМК_Клиент = ПолучитьФорму("ВнешняяОбработка.Entera_МК.Форма.УФ_Форма",ПараметрыОткрытияФормыМК,ЭтаФорма);
			Исключение
				МодульМК_Клиент = Неопределено;
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
				ОписаниеОбработчика = "Ошибка при подключении формы-обработчика клиентских событий" + Символы.ПС + ТекстОшибки;
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Модуль",ОписаниеОбработчика,"Ошибка");
			КонецПопытки;
		КонецЕсли;
	Иначе
		//Сбрасываем клиентский МК
		МодульМК_Клиент = Неопределено;
	КонецЕсли;
	// ) 2019.11.11
	
	
	//E1C-149: Обработчик события МК: ОсновнаяФорма_ПослеПодключенияМК
	Если МодульМК_Клиент <> Неопределено Тогда
		ПараметрыМК = Новый Структура;
		ПараметрыМК.Вставить("АдресХранилищаДанныхПортала",АдресХранилищаДанныхПортала);
		ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
		ПараметрыМК.Вставить("ОсновнаяФорма",ЭтаФорма);
		ПараметрыМК.Вставить("ТекстОшибки","");
		
		МодульКастомизации_ОбработатьСобытиеФормы_Клиент("ОсновнаяФорма_ПослеПодключенияМК_НаКлиенте",ПараметрыМК);
		ТекстОшибки = ПараметрыМК.ТекстОшибки;
		
		МодульКастомизации_ОбработатьСобытиеФормы_Сервер("ОсновнаяФорма_ПослеПодключенияМК_НаСервере",ТекстОшибки);
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			СообщитьСообщение(ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МодульКастомизации_ОбработатьСобытиеФормы_Клиент(ИмяСобытия,ПараметрыМК) Экспорт
	
	//Комментарий для аудитора: Для Фреш не выполняется подключение дополнительной внешней обработки "Модуль кастомизации",
	//реквизит ЭтоФреш определяется в процедуре ПриСозданииНаСервере этой формы
	Если ЭтоФреш Тогда
		Возврат;
	КонецЕсли;
	
	Если МодульМК_Клиент <> Неопределено Тогда
		
		//До 5 версии МК могут возникать ошибки при вызове клиентской процедуры обработчика,
		//проверим наличие реквизита Версия у формы МК, если там значение 5 и старше - продолжаем
		СтруктураВерсии = Новый Структура("ВерсияМодуля");
		ЗаполнитьЗначенияСвойств(СтруктураВерсии,МодульМК_Клиент);
		Если СтруктураВерсии.ВерсияМодуля = Неопределено
			Или СтруктураВерсии.ВерсияМодуля.Версия < 5 Тогда
			Возврат;
		КонецЕсли;
		
		ОписаниеОбработчика = ИмяСобытия + ": передача клиентского события для обработки в МК";
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Модуль",ОписаниеОбработчика,"ВыполнениеМК_Клиент");
		
		Попытка
			МодульМК_Клиент.ОбработатьКлиентскоеСобытиеОсновногоМодуля(ИмяСобытия,ПараметрыМК);
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			Если ПараметрыМК.Свойство("ТекстОшибки") Тогда
				ПараметрыМК.ТекстОшибки = ТекстОшибки;
			КонецЕсли;
			
			ОписаниеОбработчика = ИмяСобытия + ": при обработке клиентского события в МК возникла ошибка" + Символы.ПС + ТекстОшибки;
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Модуль",ОписаниеОбработчика,"Ошибка");
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура МодульКастомизации_ОбработатьСобытиеФормы_Сервер(ИмяСобытия,ТекстОшибки) Экспорт
	
	//Комментарий для аудитора: Для Фреш не выполняется подключение дополнительной внешней обработки "Модуль кастомизации",
	//реквизит ЭтоФреш определяется в процедуре ПриСозданииНаСервере этой формы
	Если ЭтоФреш Тогда
		Возврат;
	КонецЕсли;
		
	//Чтобы не было ошибки передачи недопустимого значения ФормаКлиентскогоПриложения между Клиентом и Сервером,
	//серверные и клиентские обработчики событий основной формы в МК передаются раздельно в серверной и клиентской процедурах
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("АдресХранилищаДанныхПортала",АдресХранилищаДанныхПортала);
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыМК.Вставить("ОсновнаяФорма",ЭтаФорма);
	ПараметрыМК.Вставить("ТекстОшибки",ТекстОшибки);
	
	ОписаниеОбработчика = ИмяСобытия + ": передача серверного события основной формы для обработки в МК";
	ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Модуль",ОписаниеОбработчика,"ВыполнениеМК_Сервер");
	
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	Попытка
		РеквизитОбъект.МодульКастомизации_ОбработатьСобытие(ИмяСобытия,ПараметрыМК);
	Исключение
		ПараметрыМК.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	ЗначениеВРеквизитФормы(РеквизитОбъект,"Объект");
	
	ЗаполнитьВСпискеДокументовДополнительныеДанные();
	
	Если ЗначениеЗаполнено(ПараметрыМК.ТекстОшибки) Тогда
		ОписаниеОбработчика = ИмяСобытия + ": при обработке серверного события формы в МК возникла ошибка" + Символы.ПС + ПараметрыМК.ТекстОшибки;
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Модуль",ОписаниеОбработчика,"Ошибка");
		
		ТекстОшибки = ПараметрыМК.ТекстОшибки;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура МодульКастомизации_ОбработатьСобытиеЭлемента(Элемент)
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("АдресХранилищаДанныхПортала",АдресХранилищаДанныхПортала);
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыМК.Вставить("ОсновнаяФорма",ЭтаФорма);
	ПараметрыМК.Вставить("ТекСтрока",Элементы.СписокДокументов.ТекущиеДанные);	
	ПараметрыМК.Вставить("Элемент",Элемент);
	ПараметрыМК.Вставить("ТекстОшибки","");
	
	МодульКастомизации_ОбработатьСобытиеФормы_Клиент("ОсновнаяФорма_ОбработатьСобытиеЭлемента",ПараметрыМК);
КонецПроцедуры


// ================= Меню: Сервис ===================

&НаКлиенте
Процедура ВыгрузкаНоменклатуры(Команда)
	ОткрытьФорму(ПрефиксИмениФорм + "УФ_ВыгрузкаНоменклатуры", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСопоставления(Команда)
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДоступноОписаниеОповещения",ДоступноОписаниеОповещения);
	ПараметрыОткрытия.Вставить("ПрефиксИмениФорм",ПрефиксИмениФорм);
	ПараметрыОткрытия.Вставить("СтруктураНастроек",СтруктураНастроек);
	
	ФормаРедактирования = ПолучитьФорму(ПрефиксИмениФорм + "УФ_РедактированиеСопоставлений", ПараметрыОткрытия, ЭтаФорма);
	ФормаРедактирования.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ФормаРедактирования.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаРедактирования.Открыть();
КонецПроцедуры


// ================= Обмен данными с порталом ===================

&НаКлиенте
Функция ВыполнитьЗапрос(Назначение,ТипЗапроса,МетодAPI,ТелоЗапроса = Неопределено,ПараметрыЗапроса = Неопределено) Экспорт
		
	Если ПараметрыЗапроса = Неопределено Тогда
		ПараметрыЗапроса = Новый Структура;
	КонецЕсли;
	
	ПараметрыЗапроса.Вставить("Токен",Токен);
	ПараметрыЗапроса.Вставить("Назначение",Назначение);
	ПараметрыЗапроса.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыЗапроса.Вставить("ТестовыйРежим",Отладка_ТестовыйРежим);
		
	//Для аудитора Fresh: в процедуре ПриСозданииНаСервере определяется работа обработки в режиме расширения, в этом случае
	//используется выполнение HTTP-запросов на сервере с применением разрешений использования внешних ресурсов,
	//установленных при подключении данного расширения к базе 1с: флаг ЭтоРасширениеКонфигурации. Таким образом разрешения
	//для использования внешних ресурсов были запрошены и установлены на этапе подключения расширения к базе 1с, с клиента
	//соединения с внешними ресурсами не устанавливаются.
	
	Если ЭтоРасширениеКонфигурации Или ЭтоВебКлиент Или СтруктураНастроек.СистемныеНастройки_УстанавливатьСоединениеССервера = Истина Тогда
		РезультатЗапроса = ВыполнитьЗапросНаСервере(Назначение,ТипЗапроса,МетодAPI,ТелоЗапроса,ПараметрыЗапроса);
	Иначе
		РезультатЗапроса = ВыполнитьЗапросНаКлиенте(Назначение,ТипЗапроса,МетодAPI,ТелоЗапроса,ПараметрыЗапроса);
	КонецЕсли;
	
	Если РезультатЗапроса.Успешно Тогда
		РезультатЗапроса = ОбработатьРезультатЗапроса(Назначение,ПараметрыЗапроса,РезультатЗапроса.ПараметрыОтвета);
	КонецЕсли;
	
	Возврат РезультатЗапроса;
	
КонецФункции
&НаКлиенте
Функция ВыполнитьЗапросНаКлиенте(Назначение,ТипЗапроса,МетодAPI,ТелоЗапроса,ПараметрыЗапроса)
	
#Если Не ВебКлиент Тогда
	
	РезультатЗапроса = Новый Структура("Успешно,ТекстОшибки");
	Успешно = Ложь;
	
	Если ПараметрыЗапроса.Свойство("АдресСервера") Тогда
		АдресСервера = ПараметрыЗапроса.АдресСервера;
		
	ИначеЕсли Назначение = "Авторизация"
		Или Назначение = "ПодтверждениеТелефона"
		Или Назначение = "ПодтверждениеТелефонаКод" Тогда
		АдресСервера = СтруктураПодключения.АдресСервераАвторизации;
		
	Иначе
		АдресСервера = СтруктураПодключения.Адрес;
		
	КонецЕсли;
	
	МетодAPI = СтрЗаменить(МетодAPI,Символы.НПП,"");
	
	//Аутентификация при установке соединения
	Если ПараметрыЗапроса.Свойство("АутентификацияИмяПользователя") Тогда
		АутентификацияИмяПользователя = ПараметрыЗапроса.АутентификацияИмяПользователя;
	КонецЕсли;
	
	Если ПараметрыЗапроса.Свойство("АутентификацияПароль") Тогда
		АутентификацияПароль = ПараметрыЗапроса.АутентификацияПароль;
	КонецЕсли;
	
	Таймаут = 120;
	
	Если СтруктураНастроек.Свойство("СистемныеНастройки_СоединениеАутентификацияОС")
		И СтруктураНастроек.СистемныеНастройки_СоединениеАутентификацияОС = Истина Тогда
		//доступно начиная с 8.3.7
		Соединение = Новый HTTPСоединение(АдресСервера, СтруктураПодключения.Порт,АутентификацияИмяПользователя ,АутентификацияПароль , , Таймаут, СтруктураПодключения.SSL, Истина);
	Иначе
		Соединение = Новый HTTPСоединение(АдресСервера, СтруктураПодключения.Порт,АутентификацияИмяПользователя ,АутентификацияПароль , , Таймаут, СтруктураПодключения.SSL);
	КонецЕсли;
				
	//Заголовки запроса
	ЗаголовкиHTTP = Новый Соответствие();
	
	//Авторизация по токену
	ЗаголовкиHTTP.Вставить("Cookie", СтруктураПодключения.Токен_Cookie + ПараметрыЗапроса.Токен);
	
	Если ТипЗапроса = "POST" Или ТипЗапроса = "PUT" Или ТипЗапроса = "PATCH" Тогда
		ЗаголовкиHTTP.Вставить("Content-Type", "application/json");
	КонецЕсли;
	
	Если ПараметрыЗапроса.Свойство("ДопЗаголовки") Тогда
		Для Каждого Элемент Из ПараметрыЗапроса.ДопЗаголовки Цикл
			ЗаголовкиHTTP.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если ПараметрыЗапроса.Свойство("ФайлыДляПередачи") Тогда //отправка будет выполняться методом multiple
		
		Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
		
		ИмяФайлаОтправки = ПолучитьИмяВременногоФайла("txt");
		
		МассивВременныхФайлов = Новый Массив;
		
		ИмяФайла_Начало = ПолучитьИмяВременногоФайла("txt"); 
		ЗаписьТекста_Начало = Новый ЗаписьТекста(ИмяФайла_Начало, "CESU-8", Символы.ПС, Ложь); 
		ЗаписьТекста_Начало.ЗаписатьСтроку("");
		ЗаписьТекста_Начало.Закрыть();
		МассивВременныхФайлов.Добавить(ИмяФайла_Начало);
		
		СтрокаИменОтправляемыхФайлов = "";
		
		Для Каждого ЭлементМассиваФайлов Из ПараметрыЗапроса.ФайлыДляПередачи Цикл
			
			Индекс = "file" + (ПараметрыЗапроса.ФайлыДляПередачи.Найти(ЭлементМассиваФайлов) + 1);
			
			ФайлДляПередачи = ЭлементМассиваФайлов.ПолноеИмяФайлаНаКлиенте;
			
			Файл = Новый Файл(ФайлДляПередачи);		
															
			ИмяФайла_НачалоФайла = ПолучитьИмяВременногоФайла("txt"); 
					
			ФайлОтправкиНачало = Новый ЗаписьТекста(ИмяФайла_НачалоФайла, "CESU-8", Символы.ПС, Ложь); 
			
			//Определяем раздел двоичных данных
			ФайлОтправкиНачало.ЗаписатьСтроку("");
			ФайлОтправкиНачало.ЗаписатьСтроку("--" + Boundary); 
			ФайлОтправкиНачало.ЗаписатьСтроку("Content-Disposition: form-data; name=""" + Индекс + """; filename=""" + ЭлементМассиваФайлов.ИмяФайла + """"); 
			ФайлОтправкиНачало.ЗаписатьСтроку(""); 
			ФайлОтправкиНачало.Закрыть(); 

			МассивВременныхФайлов.Добавить(ИмяФайла_НачалоФайла); 
			МассивВременныхФайлов.Добавить(ФайлДляПередачи); 
			
			СтрокаИменОтправляемыхФайлов = СтрокаИменОтправляемыхФайлов + ?(СтрокаИменОтправляемыхФайлов <> "",", ","") + ЭлементМассиваФайлов.ИмяФайла;
			
		КонецЦикла;
		
		//Формируем конечный фрагмент файла POST-запроса 
		ИмяФайлаОтправкиКонец = ПолучитьИмяВременногоФайла("txt"); 
		ФайлОтправкиКонец = Новый ЗаписьТекста(ИмяФайлаОтправкиКонец, "CESU-8", Символы.ПС, Ложь); 
		
		//Завершение раздела двоичных данных
		ФайлОтправкиКонец.ЗаписатьСтроку(Символы.ПС + "--" + Boundary + "--");
		ФайлОтправкиКонец.Закрыть(); 

		МассивВременныхФайлов.Добавить(ИмяФайлаОтправкиКонец); 

		//Теперь сформированные фрагменты сообщения для сервера объединяем в один файл POST-запроса 
		ОбъединитьФайлы(МассивВременныхФайлов, ИмяФайлаОтправки); 
		
		//После выполнения запроса файлы массива будут удалены
		МассивВременныхФайлов.Добавить(ИмяФайлаОтправки);
		//Поэтому сами отправляемые файлы теперь удаляем из массива
		Для Каждого ЭлементМассиваФайлов Из ПараметрыЗапроса.ФайлыДляПередачи Цикл
			МассивВременныхФайлов.Удалить(МассивВременныхФайлов.Найти(ЭлементМассиваФайлов.ПолноеИмяФайлаНаКлиенте));
		КонецЦикла;

		ЗаголовкиHTTP.Вставить("Content-Type", "multipart/form-data; boundary=" + Boundary); 
		
		Запрос = Новый HTTPЗапрос(МетодAPI,ЗаголовкиHTTP);
		Запрос.УстановитьИмяФайлаТела(ИмяФайлаОтправки);
		
		ОписаниеЗапроса = ТипЗапроса + " " + МетодAPI + " " + СтрокаИменОтправляемыхФайлов;
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ОписаниеЗапроса,"Запрос");
					
		Попытка
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);
			Успешно = Истина;
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ТекстОшибки,"Ошибка");
		КонецПопытки;
		
		Для Каждого Файл ИЗ МассивВременныхФайлов Цикл
			ПараметрыВызова = Новый Структура("Обработчик,УдаляемыйФайл","Заглушка_ОписаниеОповещения",Файл);
			_ЗФ_ОбработатьАсинхронныйВызов("УдалитьФайлы",ПараметрыВызова);
		КонецЦикла;
		
	ИначеЕсли ПараметрыЗапроса.Свойство("ФайлДляПередачи") Тогда
		
		МассивВременныхФайлов = Новый Массив;
		
		ФайлДляОтправки = ПараметрыЗапроса.ФайлДляПередачи.ПолноеИмяФайлаНаКлиенте;
		
		Файл = Новый Файл(ФайлДляОтправки);		
											
		Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
		
		ИмяФайлаОтправки = ПолучитьИмяВременногоФайла("txt");
		ИмяФайлаОтправкиНачало = ПолучитьИмяВременногоФайла("txt"); 
				
		ФайлОтправкиНачало = Новый ЗаписьТекста(ИмяФайлаОтправкиНачало, КодировкаТекста.UTF8, Символы.ПС, Ложь); 
		
		//Определяем раздел двоичных данных
		ФайлОтправкиНачало.ЗаписатьСтроку("");
		ФайлОтправкиНачало.ЗаписатьСтроку("");
		ФайлОтправкиНачало.ЗаписатьСтроку("--" + Boundary); 
		ФайлОтправкиНачало.ЗаписатьСтроку("Content-Disposition: form-data; name=""file""; filename=""" + ПараметрыЗапроса.ФайлДляПередачи.ИмяФайла + """"); 
		ФайлОтправкиНачало.ЗаписатьСтроку(""); 
		ФайлОтправкиНачало.Закрыть(); 

		МассивВременныхФайлов.Добавить(ИмяФайлаОтправкиНачало); 
		МассивВременныхФайлов.Добавить(ФайлДляОтправки); 

		//Формируем конечный фрагмент файла POST-запроса 
		ИмяФайлаОтправкиКонец = ПолучитьИмяВременногоФайла("txt"); 
		ФайлОтправкиКонец = Новый ЗаписьТекста(ИмяФайлаОтправкиКонец, КодировкаТекста.UTF8, Символы.ПС, Ложь); 

		//Завершение раздела двоичных данных 
		ФайлОтправкиКонец.ЗаписатьСтроку(Символы.ПС + "--" + Boundary + "--");
		ФайлОтправкиКонец.Закрыть(); 

		МассивВременныхФайлов.Добавить(ИмяФайлаОтправкиКонец); 

		//Теперь сформированные фрагменты сообщения для сервера объединяем в один файл POST-запроса 
		ОбъединитьФайлы(МассивВременныхФайлов, ИмяФайлаОтправки); 
		
		//После выполнения запроса файлы массива будут удалены
		МассивВременныхФайлов.Добавить(ИмяФайлаОтправки);
		//Поэтому сам отправляемый файл теперь удаляем из массива
		МассивВременныхФайлов.Удалить(МассивВременныхФайлов.Найти(ФайлДляОтправки));

		ЗаголовкиHTTP.Вставить("Content-Type", "multipart/form-data; boundary=" + Boundary); 
		
		Запрос = Новый HTTPЗапрос(МетодAPI,ЗаголовкиHTTP);
		Запрос.УстановитьИмяФайлаТела(ИмяФайлаОтправки);
		
		ОписаниеЗапроса = ТипЗапроса + " " + МетодAPI + " " + ПараметрыЗапроса.ФайлДляПередачи.ИмяФайла;
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ОписаниеЗапроса,"Запрос");
		
		Попытка
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);
			Успешно = Истина;
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ТекстОшибки,"Ошибка");
		КонецПопытки;
		
		Для Каждого Файл ИЗ МассивВременныхФайлов Цикл
			ПараметрыВызова = Новый Структура("Обработчик,УдаляемыйФайл","Заглушка_ОписаниеОповещения",Файл);
			_ЗФ_ОбработатьАсинхронныйВызов("УдалитьФайлы",ПараметрыВызова);
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый HTTPЗапрос(МетодAPI, ЗаголовкиHTTP);
		
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		
		ОписаниеЗапроса = ТипЗапроса + " " + МетодAPI + " " + ?(Назначение = "Авторизация","{*** данные скрыты ***}",ТелоЗапроса);
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ОписаниеЗапроса,"Запрос");
		
		Если ТипЗапроса = "GET" Тогда
			
			Попытка				
				Ответ = Соединение.Получить(Запрос);
				Успешно = Истина;
			Исключение
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ТекстОшибки,"Ошибка");
			КонецПопытки;
			
		ИначеЕсли ТипЗапроса = "PUT" Тогда
			
			Попытка
				Ответ = Соединение.Записать(Запрос);
				Успешно = Истина;
			Исключение
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ТекстОшибки,"Ошибка");
			КонецПопытки;
			
		ИначеЕсли ТипЗапроса = "PATCH" Тогда
			
			Попытка
				Ответ = Соединение.Изменить(Запрос);
				Успешно = Истина;
			Исключение
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ТекстОшибки,"Ошибка");
			КонецПопытки;
			
		ИначеЕсли ТипЗапроса = "DELETE" Тогда
			
			Попытка
				Ответ = Соединение.Удалить(Запрос);
				Успешно = Истина;
			Исключение
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ТекстОшибки,"Ошибка");
			КонецПопытки;
			
		Иначе //POST
			Попытка
				Ответ = Соединение.ОтправитьДляОбработки(Запрос);
				Успешно = Истина;
			Исключение
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ТекстОшибки,"Ошибка");
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
		
	Если Успешно Тогда
				
		ПараметрыОтвета = Новый Структура("МетодAPI,КодСостояния,ТипСодержимого,ContentDisposition,Cookie,ТелоОтветаСтрока,ТелоОтветаДвоичныеДанные");
		ПараметрыОтвета.МетодAPI = МетодAPI;
		ПараметрыОтвета.КодСостояния = Ответ.КодСостояния;
		ПараметрыОтвета.ТипСодержимого = Ответ.Заголовки.Получить("Content-Type");
		ПараметрыОтвета.ContentDisposition = Ответ.Заголовки.Получить("Content-Disposition");
		ПараметрыОтвета.Cookie = Ответ.Заголовки.Получить("Set-Cookie");
				
		Если ПараметрыЗапроса.Свойство("ЗапросФайла") Тогда 
			
			//разберем xml, возможно, там текст ошибки
			Если ПараметрыОтвета.ТипСодержимого = "text/xml" Тогда
				ПараметрыОтвета.ТелоОтветаСтрока = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			КонецЕсли;
			
			ПараметрыОтвета.ТелоОтветаДвоичныеДанные = ПоместитьВоВременноеХранилище(Ответ.ПолучитьТелоКакДвоичныеДанные(),УникальныйИдентификатор);
			
		Иначе
			ПараметрыОтвета.ТелоОтветаСтрока = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			
		КонецЕсли;
		
		ОписаниеЗапроса = "[" + ПараметрыОтвета.КодСостояния + "]: " + ПараметрыОтвета.ТипСодержимого
			+ ?(ЗначениеЗаполнено(ПараметрыОтвета.ТелоОтветаСтрока),Символы.ПС + ПараметрыОтвета.ТелоОтветаСтрока,"")
			+ ?(ЗначениеЗаполнено(ПараметрыОтвета.ТелоОтветаДвоичныеДанные),Символы.ПС + ПараметрыОтвета.ТелоОтветаДвоичныеДанные,"");
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ОписаниеЗапроса,"Запрос");
		
		ОбработатьОтветПортала(ПараметрыЗапроса,ПараметрыОтвета,РезультатЗапроса);
		РезультатЗапроса.Вставить("ПараметрыОтвета",ПараметрыОтвета);
		
	Иначе
		РезультатЗапроса.Вставить("Успешно",Ложь);
		РезультатЗапроса.Вставить("ТекстОшибки",ТекстОшибки);
		
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Запрос",ТекстОшибки,"Ошибка");
	КонецЕсли;
		
	Возврат РезультатЗапроса;
	
#КонецЕсли

КонецФункции
&НаСервере
Функция ВыполнитьЗапросНаСервере(Назначение,ТипЗапроса,МетодAPI,ТелоЗапроса,ПараметрыЗапроса)
		
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РезультатЗапроса = РеквизитОбъект.ВыполнитьЗапрос(Назначение,ТипЗапроса,МетодAPI,ТелоЗапроса,ПараметрыЗапроса);
	
	Возврат РезультатЗапроса;
КонецФункции

&НаСервере
Функция ОбработатьОтветПортала(ПараметрыЗапроса,ПараметрыОтвета,РезультатЗапроса)
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РеквизитОбъект.ОбработатьОтветПортала(ПараметрыЗапроса,ПараметрыОтвета,РезультатЗапроса);
КонецФункции
&НаСервере
Функция ОбработатьРезультатЗапроса(Назначение,ПараметрыЗапроса,ПараметрыОтвета)
	
	РезультатОбработки = Новый Структура("Успешно,ТекстОшибки",Истина);	
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РезультатЧтения = РеквизитОбъект.ПрочитатьОтветПортала(Назначение,ПараметрыЗапроса,ПараметрыОтвета);
	
	Если РезультатЧтения.Успешно Тогда
	
		Если Назначение = "Авторизация" Тогда //Не требуется обработка ответа
			РезультатОбработки.Вставить("Токен",РезультатЧтения.Токен);
						
			СохранитьПоследнююЗапущеннуюВерсиюМодуля(РеквизитОбъект.ВерсияМодуля.Версия);
			
		ИначеЕсли Назначение = "ПодтверждениеТелефонаКод" Тогда //Не требуется обработка ответа
			Если РезультатЧтения.Свойство("Токен") Тогда
				//Успешно получили новую куку для выполнения дальнейших запросов
				РезультатОбработки.Вставить("Токен",РезультатЧтения.Токен);
			Иначе
				РезультатОбработки.Успешно = Ложь;
				РезультатОбработки.ТекстОшибки = "Не удалось подтвердить номер телефона";
			КонецЕсли;
						
		ИначеЕсли Назначение = "ДанныеПользователя" Тогда
			ДанныеПользователя = РеквизитОбъект.ПрочитатьДанныеПользователя(РезультатЧтения.Дерево);
			
			Элементы.Отбор_Пространство.СписокВыбора.Очистить();
			Для Каждого Пространство Из ДанныеПользователя.spaces Цикл
				Элементы.Отбор_Пространство.СписокВыбора.Добавить(Пространство.Значение,Пространство.Представление);
			КонецЦикла;
						
			//В случае наличия пространств - установим сразу одно из значений
			Если Элементы.Отбор_Пространство.СписокВыбора.Количество() > 0 Тогда
				
				ПоследнееРабочееПространство = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","ПоследнееРабочееПространство");
				Если Элементы.Отбор_Пространство.СписокВыбора.НайтиПоЗначению(ПоследнееРабочееПространство) <> Неопределено Тогда
					 Отбор_Пространство = ПоследнееРабочееПространство;
				Иначе
					Отбор_Пространство = Элементы.Отбор_Пространство.СписокВыбора[0].Значение;
				КонецЕсли;
				
				//Определяем регион пространства
				РегионПространства = ДанныеПользователя.spaceCountries.Получить(Отбор_Пространство);
				СтруктураНастроек.Вставить("РегионПространства",РегионПространства);
				
			Иначе				
				Отбор_Пространство = "";
				
			КонецЕсли;
			
			//2019.09.09 ( Поместим в структуру справочников портала настройки распознавания для доступных пространств
			Если СправочникиПортала = Неопределено Тогда
				СправочникиПортала = Новый Структура;
			КонецЕсли;
			
			СправочникиПортала.Вставить("recognitionSettings",ДанныеПользователя.recognitionSettings);
			// ) 2019.09.09
			
			//E1C-294: Теперь в этом методе прилетает "сториз" broadcastMessages для интерактивного взаимодействия с пользователями
			ДанныеПользователя_ТаблицаНовостей.Очистить();
			Для Каждого broadcastMessage Из ДанныеПользователя.broadcastMessages Цикл
				НоваяСтрока = ДанныеПользователя_ТаблицаНовостей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,broadcastMessage);
			КонецЦикла;
			
		ИначеЕсли Назначение = "СправочникиПортала_ТипыДокументов"
			Или Назначение = "СправочникиПортала_СтатусыДокументов" Тогда
			ЧтениеСправочника = РеквизитОбъект.ПрочитатьСправочникПортала(РезультатЧтения.Дерево,Назначение);
			
			Если ЧтениеСправочника.Успешно Тогда
				Если СправочникиПортала = Неопределено Тогда
					СправочникиПортала = Новый Структура;
				КонецЕсли;
				
				СправочникиПортала.Вставить(ЧтениеСправочника.ИмяСправочника,ЧтениеСправочника.Справочник);
			КонецЕсли;
			
			//2021.04.02 ( Заполним список команд доступными типами портала
			Если Назначение = "СправочникиПортала_ТипыДокументов" Тогда
				ИзменитьТипДокументаПортала_ЗаполнитьМенюСпискаТиповДокументов();
			КонецЕсли;
			// ) 2021.04.02
			
		ИначеЕсли Назначение = "СправочникиПортала_Плательщики"
			Или Назначение = "СправочникиПортала_Поставщики" Тогда
			ЧтениеСправочника = РеквизитОбъект.ПрочитатьСправочникПортала_Компании(РезультатЧтения.Дерево,Назначение);
			
			Если ЧтениеСправочника.Успешно Тогда
				Если СправочникиПортала = Неопределено Тогда
					СправочникиПортала = Новый Структура;
				КонецЕсли;
				
				СправочникиПортала.Вставить(ЧтениеСправочника.ИмяСправочника,ЧтениеСправочника.Справочник);
			КонецЕсли;
			
		ИначеЕсли Назначение = "БалансСтраниц" Тогда
			
			РезультатОбработки.Вставить("balance",РезультатЧтения.Дерево.balance);			
			
		ИначеЕсли Назначение = "Обновить" Тогда
			ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
			РезультатОбработки = РеквизитОбъект.ПрочитатьДанныеДокументов(РезультатЧтения.Дерево,ДанныеПортала,СправочникиПортала,СтруктураНастроек,ПараметрыЗапроса);
			ПоместитьВоВременноеХранилище(ДанныеПортала,АдресХранилищаДанныхПортала);
			
		ИначеЕсли Назначение = "КоличествоДокументовСоответствующихОтбору" Тогда
			Попытка
				КоличествоДокументов = Число(РезультатЧтения.Дерево.documentsCount);
			Исключение
				КоличествоДокументов = 0;
			КонецПопытки;
			
			РезультатОбработки.Вставить("КоличествоДокументов",КоличествоДокументов);
			
		ИначеЕсли Назначение = "ПроверитьДубликатыФайловПоХэш" Тогда
			
			fileMetaDataList = РеквизитОбъект.ПолучитьКоллекциюXDTO(РезультатЧтения.Дерево.fileMetaDataList.fileMetaData);
			
			//Сейчас файлы передаются для проверки по одному
			Если fileMetaDataList.Количество() > 0
				И fileMetaDataList[0].fileId <> Неопределено Тогда
				КонтрольДубликата = "Дубликат";
			Иначе
				КонтрольДубликата = "Новый";
			КонецЕсли;
			
			РезультатОбработки.Вставить("КонтрольДубликата",КонтрольДубликата);
			
		ИначеЕсли Назначение = "ОтправкаНаРаспознавание" Тогда
			
			МассивЗаданий = Новый Массив;
			
			recognitionTasks = РеквизитОбъект.ПолучитьКоллекциюXDTO(РезультатЧтения.Дерево.recognitionTasks.recognitionTask);
			Для Каждого recognitionTask Из recognitionTasks Цикл
				
				ИмяФайла = "";
				Если РеквизитОбъект.ЗначениеЗаполненоXDTO(recognitionTask.files) Тогда
					files = РеквизитОбъект.ПолучитьКоллекциюXDTO(recognitionTask.files.file);
					Для Каждого file Из files Цикл
						ИмяФайла = ИмяФайла + ?(ИмяФайла <> "",", ","") + РаскодироватьСтрокуПараметровНаСервере(file.name);
					КонецЦикла;
					
					Задание = Новый Структура("recognitionTaskId,ИмяФайла,КоличествоФайлов",recognitionTask.id,ИмяФайла,files.Количество());
				
					МассивЗаданий.Добавить(Задание);
				КонецЕсли;
			КонецЦикла;
			
			РезультатОбработки.Вставить("МассивЗаданий",МассивЗаданий);
			
		ИначеЕсли Назначение = "СписокВыполняющихсяЗаданийРаспознавания" Тогда
			
			МассивЗаданий = Новый Массив;
			
			Если РеквизитОбъект.ЗначениеЗаполненоXDTO(РезультатЧтения.Дерево.runningRecognitionTasks) Тогда
				runningRecognitionTasks = РеквизитОбъект.ПолучитьКоллекциюXDTO(РезультатЧтения.Дерево.runningRecognitionTasks.runningRecognitionTask);
				Для Каждого recognitionTask Из runningRecognitionTasks Цикл
					
					ИмяФайла = "";
					Если РеквизитОбъект.ЗначениеЗаполненоXDTO(recognitionTask.files) Тогда
						files = РеквизитОбъект.ПолучитьКоллекциюXDTO(recognitionTask.files.file);
						Для Каждого file Из files Цикл
							ИмяФайла = ИмяФайла + ?(ИмяФайла <> "",", ","") + РаскодироватьСтрокуПараметровНаСервере(file.name);
						КонецЦикла;
						
						Задание = Новый Структура("recognitionTaskId,ИмяФайла,КоличествоФайлов",recognitionTask.id,ИмяФайла,files.Количество());
					
						МассивЗаданий.Добавить(Задание);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			РезультатОбработки.Вставить("МассивЗаданий",МассивЗаданий);
		
		ИначеЕсли Назначение = "СтатусЗаданияРаспознавания" Тогда
			
			recognitionTask = РезультатЧтения.Дерево.recognitionTask;
			
			state = recognitionTask.state;
			РезультатОбработки.Вставить("state",state);
			
			Если state = "RECOGNIZED"
				//2019.08.30 (
				Или state = "RECOGNIZING" Тогда
				// ) 2019.08.30
				
				Если РеквизитОбъект.ЗначениеЗаполненоXDTO(recognitionTask.documents) Тогда
					
					recognitionDocuments = РеквизитОбъект.ПолучитьКоллекциюXDTO(recognitionTask.documents.document);
					
					//прочитаем данные документов, дополним таблицу данных портала
					ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
					РезультатЧтения = РеквизитОбъект.ПрочитатьДанныеДокументов(recognitionTask,ДанныеПортала,СправочникиПортала,СтруктураНастроек,ПараметрыЗапроса);
					
					Если РезультатЧтения.Успешно Тогда
						
						РеквизитОбъект.ВыполнитьПоискСсылокПоДаннымПортала(СтруктураНастроек,ДанныеПортала);
						ПоместитьВоВременноеХранилище(ДанныеПортала,АдресХранилищаДанныхПортала);
					
						Для Каждого document Из recognitionDocuments Цикл
													
							//и выведем его в СписокДокументов						
							ВывестиДокументВСписокДокументов(ДанныеПортала,document.id,Истина);
						
						КонецЦикла;
											
					КонецЕсли;
				КонецЕсли;
								
			ИначеЕсли state = "ERROR" Тогда
				РезультатОбработки.Вставить("errorDescription",РезультатЧтения.Дерево.recognitionTask.errorDescription);			
				
			КонецЕсли;
			
			ПересчитатьИтогиПоСтатусамДокументов();
			
		ИначеЕсли Назначение = "ПолучениеСпискаНовыхВерсий" Тогда
			
			//проверить номер версии, о которой пользователь попросил не напоминать
			НеНапоминатьОВерсии = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","НеНапоминатьОВерсии");
			
			СписокНовыхВерсий = Новый Массив;
			
			Если РеквизитОбъект.СвойствоXDTOСуществует(РезультатЧтения.Дерево,"moduleVersions")
				И РеквизитОбъект.ЗначениеЗаполненоXDTO(РезультатЧтения.Дерево.moduleVersions) Тогда
				
				moduleVersions = РеквизитОбъект.ПолучитьКоллекциюXDTO(РезультатЧтения.Дерево.moduleVersions.moduleVersion);
				
				Если moduleVersions.Количество() > 0 Тогда
				
					Для Каждого version Из moduleVersions Цикл
						Структура = Новый Структура("id,version,description,critical");
						ЗаполнитьЗначенияСвойств(Структура,version);
						СписокНовыхВерсий.Добавить(Структура);
					КонецЦикла;
					
					//Последняя версия в массиве - самая актуальная, сверим ее с сохраненным значением НеНапоминатьОВерсии
					ПоследняяВерсия = Структура.version;
					
				КонецЕсли;
				
			КонецЕсли;
			
			РезультатОбработки.Вставить("СписокНовыхВерсий",СписокНовыхВерсий);
			РезультатОбработки.Вставить("ПоследняяВерсия",ПоследняяВерсия);
			РезультатОбработки.Вставить("НеНапоминатьОВерсии",Строка(НеНапоминатьОВерсии));
			
		ИначеЕсли Назначение = "УведомлениеОСозданииДокументов" Тогда
			//Очищаем список заданий уведомления
			ЗаданияУведомления.Очистить();
			
		ИначеЕсли Назначение = "ПолучениеФайлаСкана" Тогда
			//Портал может вернуть вместо печатной формы код ошибки, уведомляющий, что она еще не готова
			Если РезультатЧтения.Свойство("ПредложитьПовторитьЗапрос") Тогда
				РезультатОбработки.Вставить("ПредложитьПовторитьЗапрос",Истина);
				РезультатОбработки.ТекстОшибки = РезультатЧтения.ТекстОшибки;
			Иначе
				РезультатОбработки.Вставить("АдресВХ",РезультатЧтения.АдресВХ);
				
				//2020.12.01 ( Имя файла у нас теперь формируется по заданному шаблону
				ИмяФайла = РеквизитОбъект.СформироватьИмяФайлаСканаПоШаблону(АдресХранилищаДанныхПортала,,ПараметрыЗапроса.ДокументИД,РезультатЧтения.ИмяФайла,СтруктураНастроек);
				// ) 2020.12.01
				
				РезультатОбработки.Вставить("ИмяФайла",ИмяФайла);
			КонецЕсли;
			
		ИначеЕсли Назначение = "ПолучениеФайлаВнешнейОбработки" Тогда
			РезультатОбработки.Вставить("АдресВХ",РезультатЧтения.АдресВХ);
			РезультатОбработки.Вставить("ИмяФайла",РезультатЧтения.ИмяФайла);
			
		ИначеЕсли Назначение = "ПолучениеРеестраАрхиваДокументов" Тогда
			РезультатОбработки.Вставить("АдресВХ",РезультатЧтения.АдресВХ);
			ИмяФайла = РезультатЧтения.ИмяФайла;
			
			//E1C-209: формировать имя файла по шаблону для скачиваемых оригиналов и печатных форм
			Если ПараметрыЗапроса.Свойство("ДокументИД") И ЗначениеЗаполнено(ПараметрыЗапроса.ДокументИД) Тогда
				ИмяФайла = РеквизитОбъект.СформироватьИмяФайлаСканаПоШаблону(АдресХранилищаДанныхПортала,,ПараметрыЗапроса.ДокументИД,ИмяФайла,СтруктураНастроек);
			КонецЕсли;
			
			РезультатОбработки.Вставить("ИмяФайла",ИмяФайла);
			
		ИначеЕсли Назначение = "ВыполнениеЗапросИзМК" Тогда
			//Обработка ответа выполняется в МК

		КонецЕсли;
		
	Иначе
		ЗаполнитьЗначенияСвойств(РезультатОбработки,РезультатЧтения);
	КонецЕсли;
	
	Возврат РезультатОбработки;
	
КонецФункции


// ================= Заполнение списка документов ===================

&НаКлиенте
Процедура Обновить(Команда)
	
	Если Не ЗначениеЗаполнено(Токен) Тогда
		ОткрытьФормуАвторизации(Ложь);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отбор_Пространство) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Пространство не может быть пустым";
		Сообщение.Поле = "Отбор_Пространство";		
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Не ДанныеПользователя.phoneConfirm Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для начала работы с сервисом необходимо подтвердить телефон пользователя.";
		Сообщение.Поле = "Авторизация";
		Сообщение.Сообщить();
		
		ОткрытьФормуПодтвержденияТелефона();
		
		Возврат;
	КонецЕсли;
	
	//2019.11.12 ( В случае использования свернутой ТЧ помещаем необходимо убедиться, что номенклатура, которая будет указана в свернутой ТЧ выбрана в настройках
	Если СтруктураНастроек.ЗаполнениеТЧ_СворачиватьТЧВОднуСтроку <> "Нет" Тогда
		Если Не ЗначениеЗаполнено(СтруктураНастроек.ЗаполнениеТЧ_СворачиватьТЧНоменклатура) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "Настройки";
			Сообщение.Текст = "При включенной настройке <Сворачивать данные табличной части в одну строку> необходимо выбрать номенклатуру";
			Сообщение.Сообщить();
			
			Настройки(Неопределено);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// ) 2019.11.12
		
	//очистить загруженные данные
	Объект.СписокДокументов.Очистить();
	ПоместитьВоВременноеХранилище(Неопределено,АдресХранилищаДанныхПортала);
	
	ЗаполнитьСписокДокументов();
	
КонецПроцедуры
&НаКлиенте
Функция СформироватьСтрокуПараметровОтбора()
	
	СтрокаОтбора = "";
	
	Если ЗначениеЗаполнено(Отбор_Пространство) Тогда
		СтрокаОтбора = СтрокаОтбора + "&spaceId=" + Отбор_Пространство;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор_ПериодЗагрузки.ДатаНачала) Тогда
		СтрокаОтбора = СтрокаОтбора + "&createdDateFrom=" + Формат(Отбор_ПериодЗагрузки.ДатаНачала,"ДФ=yyyy-MM-ddTHH:mm:ss");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор_ПериодЗагрузки.ДатаОкончания) Тогда
		СтрокаОтбора = СтрокаОтбора + "&createdDateTo=" + Формат(Отбор_ПериодЗагрузки.ДатаОкончания,"ДФ=yyyy-MM-ddTHH:mm:ss");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор_ПериодДокументов.ДатаНачала) Тогда
		СтрокаОтбора = СтрокаОтбора + "&documentDateFrom=" + Формат(Отбор_ПериодДокументов.ДатаНачала,"ДФ=yyyy-MM-dd");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор_ПериодДокументов.ДатаОкончания) Тогда
		СтрокаОтбора = СтрокаОтбора + "&documentDateTo=" + Формат(Отбор_ПериодДокументов.ДатаОкончания,"ДФ=yyyy-MM-dd");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор_Плательщик) Тогда
		Для Каждого ЭлементСписка Из Отбор_Плательщик Цикл
			СтрокаОтбора = СтрокаОтбора + "&customer=" + ЭлементСписка.Значение;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор_Поставщик) Тогда
		Для Каждого ЭлементСписка Из Отбор_Поставщик Цикл
			СтрокаОтбора = СтрокаОтбора + "&supplier=" + ЭлементСписка.Значение;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор_ПоискПоКлючевымСловам) Тогда
		СтрокаПоиска = СокрЛП(Отбор_ПоискПоКлючевымСловам);
		СтрокаОтбора = СтрокаОтбора + "&search=" + КодироватьСтрокуПараметровНаСервере(Отбор_ПоискПоКлючевымСловам);
	КонецЕсли;
	
	Возврат СтрокаОтбора;
	
КонецФункции
&НаКлиенте
Функция ЗаполнитьСписокДокументов() Экспорт
	
	//2020.04.21 ( может возникнуть ситуация, когда при входе в систему по каким-то причинам не были получены справочники портала,
	Если ТипЗнч(СправочникиПортала) = Тип("Структура")
		И СправочникиПортала.Свойство("ТипДокумента")
		И СправочникиПортала.Свойство("СтатусДокумента") Тогда
		//Все ОК!
	Иначе
		Попытка КартинкаОшибка = БиблиотекаКартинок.Ошибка32; Исключение КонецПопытки;
		ПоказатьОповещениеПользователя("Ошибка",,"Не были получены все необходимые справочники портала, попробуйте выполнить повторную авторизацию",КартинкаОшибка);
		Возврат Неопределено;
	КонецЕсли;
	// ) 2020.04.21
	
	СтрокаОтбора = СформироватьСтрокуПараметровОтбора();
	
	//Проверяем, не получится ли слишком много документов по отбору
	ПорогПредупреждения = 200;
	РезультатЗапроса = ВыполнитьЗапрос("КоличествоДокументовСоответствующихОтбору","GET","/api/v1/documents/count?format=xml" + СтрокаОтбора);
	
	Если РезультатЗапроса.Успешно Тогда
		КоличествоДокументовСоответствующихОтбору = РезультатЗапроса.КоличествоДокументов;
	Иначе
		//Проверка не удалась, продолжаем
		КоличествоДокументовСоответствующихОтбору = 0;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("СтрокаОтбора",СтрокаОтбора);
	
	Если КоличествоДокументовСоответствующихОтбору > ПорогПредупреждения Тогда
		ТекстВопроса = "В результате запроса будет получено большое количество документов (" + КоличествоДокументовСоответствующихОтбору + "),
					   |это может занять продолжительное время, продолжить?";
		Кнопки = РежимДиалогаВопрос.ДаНет;
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","ЗаполнитьСписокДокументов_КонтрольКоличестваДокументов",ДопПараметры,ТекстВопроса,Кнопки);
			
		_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
	Иначе
		ЗаполнитьСписокДокументов_КонтрольКоличестваДокументов(КодВозвратаДиалога.Да,ДопПараметры);
		
	КонецЕсли;
		
КонецФункции
&НаКлиенте
Функция ЗаполнитьСписокДокументов_КонтрольКоличестваДокументов(Результат,ДопПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Страница = 1;
	
	Состояние("Получение данных портала...",25,"Для прерывания нажмите Ctrl + Break");
	
	ПродолжитьЗагрузку = Истина;
	Пока ПродолжитьЗагрузку = Истина Цикл
				
		ОбработкаПрерыванияПользователя();
		
		//Первым запросом помимо документов выполняем получение общего количества страниц, соответствующих отбору
		СтрокаПараметров = "?format=xml&include=full&pageSize=100&page=" + Страница + ДопПараметры.СтрокаОтбора;
		
		//E1C-206, EN-1090: новый  фильтр documentsForSendingToEdi в постраничный запрос документов,
		//который может принимать значения INCLUDED, EXCLUDED, ONLY
		Если СтруктураНастроек.ОбменДанными_ИспользуетсяИсходящийЭлектронныйДокументооборот = Истина Тогда
			СтрокаПараметров = СтрокаПараметров + "&documentsForSendingToEdi=INCLUDED";
		Иначе
			СтрокаПараметров = СтрокаПараметров + "&documentsForSendingToEdi=EXCLUDED";
		КонецЕсли;
		// ) 2021.02.25
		
		РезультатЗапроса = ВыполнитьЗапрос("Обновить","GET","/api/v1/documents" + СтрокаПараметров);
		
		Если РезультатЗапроса.Успешно Тогда
			Если РезультатЗапроса.ОтветПустой Тогда
				СообщитьСообщение("За указанный период нет загруженных документов, измените настройки отбора");
			Иначе
				Страница = Страница + 1;
			КонецЕсли;
		Иначе
			СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
			Возврат Неопределено;
		КонецЕсли;
		
		ПродолжитьЗагрузку = Не РезультатЗапроса.ЗагрузкаДанныхЗавершена;
		
	КонецЦикла;
	
	//2019.10.11 ( Если требуются связанные документы и их нет в полученном списке - получаем их дополнительными запросами
	Если СтруктураНастроек.СозданиеДокумента_ИспользоватьПоискКомплектов = Истина Тогда
		СписокСвязанныхДокументов = ПолучитьСписокСвязанныхДокументовДляЗаполнения(АдресХранилищаДанныхПортала);
		
		Если СписокСвязанныхДокументов.Количество() > 0 Тогда
			ОписаниеСобытия = "Получение списка связанных документов [" + СписокСвязанныхДокументов.Количество() + "]";
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"Запрос",ОписаниеСобытия,"СвязанныеДокументы");
			
			Состояние("Получение данных связанных документов...",50);
			
			Для Каждого СвязанныйДокумент Из СписокСвязанныхДокументов Цикл
				
				ОбработкаПрерыванияПользователя();
				
				ПараметрыЗапроса = Новый Структура("ПолучениеСвязанныхДокументов",Истина);
			
				СтрокаПараметров = "?format=xml&include=full";
				РезультатЗапроса = ВыполнитьЗапрос("Обновить","GET","/api/v1/documents/" + СвязанныйДокумент.Значение + СтрокаПараметров,,ПараметрыЗапроса);
				
				Если РезультатЗапроса.Успешно Тогда
					ОписаниеСобытия = "Связанный документ получен [" + СвязанныйДокумент.Значение + "]";
					ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"Запрос",ОписаниеСобытия,"СвязанныеДокументы");
				Иначе
					ОписаниеСобытия = "Ошибка при получении связанного документа [" + СвязанныйДокумент.Значение + "]: " + РезультатЗапроса.ТекстОшибки;
					ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"Запрос",ОписаниеСобытия,"СвязанныеДокументы");
					СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
					Возврат Неопределено;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	// ) 2019.10.11
	
	Состояние("Обработка данных портала...",60);
	
	ВыполнитьПоискСсылокПоДаннымПорталаНаСервере();
	
	Состояние("Заполнение списка документов...",70);
	
	ЗаполнитьСписокДокументовНаСервере();
	УстановитьНаправленияДокументов();
	
	БыстрыйФильтр_УстановитьОтборПоВыбраннымТипам();
	
	УстановитьОтборСтрокСпискаДокументов();
	
	ЗаполнитьВСпискеДокументовДополнительныеДанные();
	
	Если СтруктураНастроек.Свойство("ОбменДанными_ОтображатьЗаданияРаспознавания")
		И СтруктураНастроек.ОбменДанными_ОтображатьЗаданияРаспознавания = Истина Тогда
		Состояние("Получение текущих заданий распознавания...",90);
		ЗаданияРаспознавания_ПолучитьСписокВыполняющихся();
	КонецЕсли;
	
	ОбновитьТекстКнопкиБаланс();
	Состояние("Завершено",100);
	
	//2019.05.14 (EN-438: теперь задания на распознавание нужно отображать и в списке документов
	//чтобы пользователь мог увидеть какие файлы загрузил а какие нет.
	СписокДокументов_ОтобразитьЗаданияНаРаспознавание();
	// ) 2019.05.14
	
	ВыполнитьОбновлениеСтатусовЗаданийРаспознавания();
	
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьСписокСвязанныхДокументовДляЗаполнения(АдресХранилищаДанныхПортала)
	
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	СписокСвязанныхДокументов = Новый СписокЗначений;
	
	Если ДанныеПортала <> Неопределено Тогда
	
		Для Каждого СтрокаТаблицы Из ДанныеПортала.documents Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы.parent) И ДанныеПортала.documents.Найти(СтрокаТаблицы.parent,"id") = Неопределено Тогда
				СписокСвязанныхДокументов.Добавить(СтрокаТаблицы.parent);
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.children) И ДанныеПортала.documents.Найти(СтрокаТаблицы.children,"id") = Неопределено Тогда
				СписокСвязанныхДокументов.Добавить(СтрокаТаблицы.children);
			КонецЕсли; 
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СписокСвязанныхДокументов;
	
КонецФункции
&НаСервере
Процедура ВыполнитьПоискСсылокПоДаннымПорталаНаСервере()
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	Если ДанныеПортала <> Неопределено Тогда
		РеквизитОбъект = РеквизитФормыВЗначение("Объект");
		
		ПараметрыПоиска = Новый Структура;
		
		РеквизитОбъект.ВыполнитьПоискСсылок_Документы(СтруктураНастроек,ДанныеПортала,ПараметрыПоиска);
		
		ПоместитьВоВременноеХранилище(ДанныеПортала,АдресХранилищаДанныхПортала);
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Функция ЗаполнитьСписокДокументовНаСервере()
	
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	// 2022.12.20 ( Возникают странные кейсы, когда получение данных от портала было прервано, но ошибок не возникало
	Если ДанныеПортала = Неопределено Или НЕ ДанныеПортала.Свойство("documents") Тогда
		СообщитьСообщение("Данные не были получены от портала, попробуйте перезапустить модуль интеграции");
		Возврат Неопределено;
	КонецЕсли;
	// ) 2022.12.20
	
	Для Каждого ДокументПортала Из ДанныеПортала.documents Цикл
				
		ВывестиДокументВСписокДокументов(ДанныеПортала,ДокументПортала.id,Ложь);
				
	КонецЦикла;
	
	ПересчитатьИтогиПоСтатусамДокументов();
	
КонецФункции
&НаСервере
Процедура ВывестиДокументВСписокДокументов(ДанныеПортала,ДокументИД,ВставитьСтроку)
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	ДокументПортала = ДанныеПортала.documents.Найти(ДокументИД,"id");
	Если ДокументПортала <> Неопределено
		И Объект.СписокДокументов.НайтиСтроки(Новый Структура("ДокументИД",ДокументПортала.id)).Количество() = 0 Тогда
				
		Если ВставитьСтроку Тогда
			//проверим отображаемые в списке документов задания распознавания и расчитаем индекс строки сразу после них, достаточно вычислить их количество
			СтрокиЗаданий = Объект.СписокДокументов.НайтиСтроки(Новый Структура("ДокументСтатус","RECOGNIZING"));
			Индекс = СтрокиЗаданий.Количество();
			
			НоваяСтрокаДокумент = Объект.СписокДокументов.Вставить(Индекс);
		Иначе
			НоваяСтрокаДокумент = Объект.СписокДокументов.Добавить();
		КонецЕсли;
		
		НоваяСтрокаДокумент.ДокументИД = ДокументПортала.id;
		НоваяСтрокаДокумент.ПространствоИД = ДокументПортала.spaceId;
		НоваяСтрокаДокумент.ДокументТип = ДокументПортала.type;
		НоваяСтрокаДокумент.НаправлениеСоздаваемогоДокумента = РеквизитОбъект.ОпределитьНаправлениеСоздаваемогоДокумента(ДокументПортала,СтруктураНастроек);
		НоваяСтрокаДокумент.ДокументСтатус = ДокументПортала.state;
		НоваяСтрокаДокумент.ДокументСтатусЧека = ДокументПортала.receiptState;
		НоваяСтрокаДокумент.СуммаДокумента = ДокументПортала.amount;
		НоваяСтрокаДокумент.url = ДокументПортала.url;
		
		НоваяСтрокаДокумент.parentId = ДокументПортала.parent;
		НоваяСтрокаДокумент.childrenId = ДокументПортала.children;
		
		НоваяСтрокаДокумент.Документ1с = ДокументПортала.ДокументСсылка;
		НоваяСтрокаДокумент.ПредставлениеДокумента = ДокументПортала.ПредставлениеДокумента;
		НоваяСтрокаДокумент.ПредставлениеТипа = ДокументПортала.ПредставлениеТипа;
		НоваяСтрокаДокумент.ПредставлениеСтатуса = ДокументПортала.ПредставлениеСтатуса;
		
		Если ЗначениеЗаполнено(ДокументПортала.printFormId) Тогда
			НоваяСтрокаДокумент.ИндексКартинкиПечатнойФормы = 0;
		Иначе
			НоваяСтрокаДокумент.ИндексКартинкиПечатнойФормы = 1;
		КонецЕсли;
		
		//E1C-466: Отображение в реестре документов замечаний по распознаванию документа
		НоваяСтрокаДокумент.ИндексКартинкиЗамечанийРаспознавания = ДокументПортала.validationNotificationSeverity;
		НоваяСтрокаДокумент.ТекстЗамечанийРаспознавания = ДокументПортала.validationNotificationTextFull;
		
		НоваяСтрокаДокумент.ДокументКомментарий = ДокументПортала.comment;
		
		//E1C-48: для чеков в столбце статус писать не статусы документа, а статус чека который отображается в карточке документа
		Если ДокументПортала.type = "RECEIPT" Тогда
			НоваяСтрокаДокумент.ПредставлениеСтатуса = ДокументПортала.ПредставлениеСтатусаЧека;
		КонецЕсли; 
		
		НоваяСтрокаДокумент.Диадок_Статус = ДокументПортала.Диадок_Статус;
		НоваяСтрокаДокумент.Диадок_url = ДокументПортала.Диадок_url;
		
		НоваяСтрокаДокумент.ПредставлениеПлательщика = ДокументПортала.ПредставлениеПлательщика;
		НоваяСтрокаДокумент.ПредставлениеПоставщика = ДокументПортала.ПредставлениеПоставщика;
		НоваяСтрокаДокумент.ДокументЗагрузил = ДокументПортала.creatorEmail;
		НоваяСтрокаДокумент.Источник = ДокументПортала.ПредставлениеИсточника;
		
		НоваяСтрокаДокумент.ДатаЗагрузки = ДокументПортала.createdDate;
		НоваяСтрокаДокумент.ЗагруженСПортала = Истина;
		
		НоваяСтрокаДокумент.ЭтоДокументЭДО = ДокументПортала.forSendingToEdi = Истина;
		
		Если ЗначениеЗаполнено(ДокументПортала.СтруктураДополнительныхДанных) Тогда
			НоваяСтрокаДокумент.СтруктураДополнительныхДанных = ЗначениеВСтрокуВнутр(ДокументПортала.СтруктураДополнительныхДанных);
		КонецЕсли;
		
		//Подсчет статусов
		Если ДокументПортала.state = "UPLOADED" Тогда
			НоваяСтрокаДокумент.Счетчик_Загружен = 1;
		ИначеЕсли ДокументПортала.state = "VERIFIED" Тогда
			НоваяСтрокаДокумент.Счетчик_Проверен = 1;
		ИначеЕсли ДокументПортала.state = "RECOGNIZED" Тогда
			НоваяСтрокаДокумент.Счетчик_Распознан = 1;
		ИначеЕсли ДокументПортала.state = "EDI_SEND" Тогда
			НоваяСтрокаДокумент.Счетчик_ОтправленныеВЭДО = 1;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВСпискеДокументовДополнительныеДанные()
	
	//Для строки таблицы документа структура дополнительных данных содержит набор ключей,
	//соответствующих реквизитам таблицы формы для их отображения
	
	Для Каждого СтрокаТаблицы Из Объект.СписокДокументов Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.СтруктураДополнительныхДанных) Тогда
			СтруктураДополнительныхДанных = ЗначениеИзСтрокиВнутр(СтрокаТаблицы.СтруктураДополнительныхДанных);
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы,СтруктураДополнительныхДанных);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ПересчитатьИтогиПоСтатусамДокументов()
	Счетчик_ВсеДокументы = Объект.СписокДокументов.Количество();
	Счетчик_Загружен = Объект.СписокДокументов.Итог("Счетчик_Загружен");
	Счетчик_Проверен = Объект.СписокДокументов.Итог("Счетчик_Проверен");
	Счетчик_Распознан = Объект.СписокДокументов.Итог("Счетчик_Распознан");
	Счетчик_ОтправленныеВЭДО = Объект.СписокДокументов.Итог("Счетчик_ОтправленныеВЭДО");
	Счетчик_ТипыДокументов = Объект.СписокДокументов.Итог("ДокументТип_СоответствуетОтбору");
	
	Счетчик_НаРаспознавании = ЗаданияРаспознавания_Таблица.Итог("КоличествоФайлов");	
КонецПроцедуры


// ================= Создание документов по данным портала ===================

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	СтрокиДокументов = Объект.СписокДокументов.НайтиСтроки(Новый Структура("Пометка",Истина));
	
	Если СтрокиДокументов.Количество() = 0 Тогда
		ПоказатьОповещениеПользователя("Выберите документы",,"Не выбрано ни одной строки для создания документов");
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДокумента Из СтрокиДокументов Цикл
		Если ЗначениеЗаполнено(СтрокаДокумента.Документ1с) Тогда
			ОтмеченыСтрокиСДокументами = Истина;
		КонецЕсли;
		
		//теперь проверяем, что везде определено направление документа в табличной части
		Если Не ЗначениеЗаполнено(СтрокаДокумента.НаправлениеСоздаваемогоДокумента) Тогда
			ИдентификаторСтрокиБезНаправления = СтрокаДокумента.ПолучитьИдентификатор();
		КонецЕсли;
		
		//E1C-160: Статус чека "Ожидание ОФД" - "IN_PROCESSING"
		//По Вашему чеку ещё не поступили данные из ОФД. Пожалуйста, дождитесь, когда его статус изменится на "Распознан", обычно на это уходит около 15 минут.
		Если СтрокаДокумента.ДокументСтатусЧека = "IN_PROCESSING" Тогда
			СтрокаДокумента.Пометка = Ложь;
			СообщитьСообщение("<" + СтрокаДокумента.ПредставлениеДокумента + ">: по Вашему чеку ещё не поступили данные из ОФД. Пожалуйста, дождитесь, когда его статус изменится на <Распознан>, обычно на это уходит около 15 минут.");
			
		ИначеЕсли СтрокаДокумента.ДокументСтатусЧека = "NOT_CHECKED" Тогда
			СтрокаДокумента.Пометка = Ложь;
			СообщитьСообщение("<" + СтрокаДокумента.ПредставлениеДокумента + ">: Чек проверяется. Пожалуйста, дождитесь, когда его статус изменится на <Распознан>, обычно на это уходит около 15 минут.");
			
		ИначеЕсли СтрокаДокумента.ДокументСтатусЧека = "WITHOUT_DATA" Тогда
			СтрокаДокумента.Пометка = Ложь;
			СообщитьСообщение("<" + СтрокаДокумента.ПредставлениеДокумента + ">: по чеку отсутствуют данные в ОФД. Документ в 1С создать невозможно.");
			
		КонецЕсли;
	КонецЦикла;
	
	Если ИдентификаторСтрокиБезНаправления <> Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо заполнить направление для всех строк создаваемых документов";
		Сообщение.Поле = "Объект.СписокДокументов[" + ИдентификаторСтрокиБезНаправления + "].НаправлениеСоздаваемогоДокумента";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ОтмеченыСтрокиСДокументами",ОтмеченыСтрокиСДокументами);
	ДопПараметры.Вставить("АвтоопределениеТипа",Истина);
	
	Если СтруктураНастроек.ТипДокумента_ВыбиратьПередСозданием Тогда
		ДопПараметры.Вставить("АвтоопределениеТипа",Ложь);
		
		//Предлагаем пользователю выбрать тип документа		
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,СписокВыбора","ПродолжитьСозданиеДокументов_Тип",ДопПараметры,ТипыСоздаваемыхДокументов);
		
		_ЗФ_ОбработатьАсинхронныйВызов("ВыборИзМеню",ПараметрыВызова);
		
	Иначе
		//+++ нужно определить тип уже на этом этапе?
		ТипДокумента = Новый Структура("Представление");
		ПродолжитьСозданиеДокументов_Тип(ТипДокумента,ДопПараметры);
		
	КонецЕсли;
			
КонецПроцедуры
&НаКлиенте
Процедура ПродолжитьСозданиеДокументов_Тип(Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
		
	Иначе
		ДопПараметры = Новый Структура();
		ДопПараметры.Вставить("АвтоопределениеТипа",ДополнительныеПараметры.АвтоопределениеТипа);
		ДопПараметры.Вставить("СправочникТоварныхПозиций","Номенклатура");
		
		//+++ Тип документа определять на этом этапе, чтобы исключить создание номенклатуры при заполнении документа без ТЧ с товарами?
		//Как быть, если отмечено несколько документов с разными "конечными" типами?
		
		Если ДополнительныеПараметры.АвтоопределениеТипа <> Истина Тогда
			
			ВыбранныйТип = Результат.Значение;
			Если Лев(ВыбранныйТип,7) = "Энтера_" Тогда
				//Разбираем "несуществующий" тип на "реальный" тип документа и его вид операции
				МассивПолей = Энтера_РазложитьСтрокуВМассивПодстрок(ВыбранныйТип,"_");
				
				ДопПараметры.Вставить("ТипСоздаваемогоДокумента",МассивПолей[1]);
				
				ВидОперацииПринудительно = ПредопределенноеЗначение(МассивПолей[2]);
				ДопПараметры.Вставить("ВидОперацииПринудительно",ВидОперацииПринудительно);
				
				//Если передали имя справочника, переопределяющего метаданные для обработки товарных позиций - используем его,
				//в противном случае используем исходный справочник Номенклатура
				Если МассивПолей.Количество() = 4 Тогда
					ДопПараметры.Вставить("СправочникТоварныхПозиций",МассивПолей[3]);
				КонецЕсли;
			Иначе
				ДопПараметры.Вставить("ТипСоздаваемогоДокумента",Результат.Значение);
			КонецЕсли;
		КонецЕсли;
		
		ДопПараметры.Вставить("ПредставлениеСоздаваемогоДокумента",Результат.Представление);
		
		Если ДополнительныеПараметры.ОтмеченыСтрокиСДокументами = Истина Тогда
			
			ТекстВопроса = "Отмечены строки (возможно скрытые установленным фильтром)
				|с ранее созданными в 1С документами, создать документы заново?
				|
				|Да - будут созданы новые документы для всех выбранных строк 
				|Нет - будут созданы новые документы только для строк без созданных документов
				|Отмена - отменить создание документов";
			Кнопки = РежимДиалогаВопрос.ДаНетОтмена;
			ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","ПродолжитьСозданиеДокументов_ДублиВСписке",ДопПараметры,ТекстВопроса,Кнопки);
			
			_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
		Иначе
			ПродолжитьСозданиеДокументов_ДублиВСписке(КодВозвратаДиалога.Да,ДопПараметры);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПродолжитьСозданиеДокументов_ДублиВСписке(Результат,ДопПараметры) Экспорт
		
	ДопПараметры.Вставить("Результат_СуществующиеДокументы",Результат);
	
	//Описание задачи: Если одновременно загрузить одинаковые документы, то при создании сразу всех будут созданы дубликаты. 
	//Нужно на стадии создания вести контроль дубликатов, если были выделены документы одного типа с одинаковыми номерами,
	//датами и суммами то выдавать сообщение о возможном дубликате с указанием документов и предложением снять галочки с дубликатов
	
	Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов <> "Нет" Тогда
		РезультатПроверки = ПроверитьЗагружаемыеДокументы_ДублиВСпискеДокументов();
	
		Если Не РезультатПроверки.Успешно Тогда
			
			СообщитьСообщение(РезультатПроверки.ТекстОшибки);
			ДопПараметры.Вставить("ИдентификаторыСтрок",РезультатПроверки.ИдентификаторыСтрок);
			
			//В ответе есть идентификаторы строк, можно снять с них флажки или вывести сообщение к одной из них
			ТекстВопроса = "Снять отметку у строк одинаковых документов?";
			Кнопки = РежимДиалогаВопрос.ДаНет;
			ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","ПродолжитьСозданиеДокументов_СнятьОтметкиДублиВСписке",ДопПараметры,ТекстВопроса,Кнопки);
			
			_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
			
			Возврат;
			
		ИначеЕсли ЗначениеЗаполнено(РезультатПроверки.ТекстОшибки) Тогда
			СообщитьСообщение(РезультатПроверки.ТекстОшибки);
			
		КонецЕсли;
	КонецЕсли;
	
	//продолжаем выполнение, пробрасываем результат ответа пользователя дальше
	ПродолжитьСозданиеДокументов_СуществующиеДокументы(ДопПараметры);
	
КонецПроцедуры
&НаКлиенте
Процедура ПродолжитьСозданиеДокументов_СнятьОтметкиДублиВСписке(Результат,ДопПараметры)
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Для Каждого ИдентификаторСтроки Из ДопПараметры.ИдентификаторыСтрок Цикл
			СтрокаТаблицы = Объект.СписокДокументов.НайтиПоИдентификатору(ИдентификаторСтроки.Значение);
			СтрокаТаблицы.Пометка = Ложь;
		КонецЦикла;
		
		ПродолжитьСозданиеДокументов_СуществующиеДокументы(ДопПараметры);
	КонецЕсли;
		
КонецПроцедуры
&НаКлиенте
Процедура ПродолжитьСозданиеДокументов_СуществующиеДокументы(ДопПараметры) Экспорт
	
	Результат = ДопПараметры.Результат_СуществующиеДокументы;
	
	//На сервер это значение передавать нельзя
	ДопПараметры.Удалить("Результат_СуществующиеДокументы");
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		УстановитьСнятьФлажкиВТаблице(Ложь,Ложь,,Истина);
	Иначе
		ДопПараметры.Вставить("УдалитьСвязьСуществующихДокументов",Истина);
	КонецЕсли;
	
	//2019.01.28 (EN-187: Контроль дубликатов документов
	Если СтруктураНастроек.СозданиеДокумента_КонтрольДубликатовДокументов <> "Нет" Тогда
		РезультатПроверки = ПроверитьЗагружаемыеДокументыНаДубли(ДопПараметры);
	
		Если Не РезультатПроверки.Успешно Тогда
			//Покажем в отдельной форме найденные дубликаты для подтверждения пользователем и установки связи с документами портала
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("АдресВХ",РезультатПроверки.АдресВХ);
			ПараметрыОткрытия.Вставить("ДопПараметры",ДопПараметры);
			ПараметрыОткрытия.Вставить("СтруктураНастроек",СтруктураНастроек);
			
			ФормаКонтроляДубликатов = ПолучитьФорму(ПрефиксИмениФорм + "УФ_Дубликаты", ПараметрыОткрытия, ЭтаФорма);

			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Источник","УФ_Дубликаты");
			ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,Форма","ОбработатьЗакрытиеФормы_СинхронноАсинхронно",ДопПараметры,ФормаКонтроляДубликатов);
			
			_ЗФ_ОбработатьАсинхронныйВызов("ОткрытьФормуМодально",ПараметрыВызова);
			
		ИначеЕсли ЗначениеЗаполнено(РезультатПроверки.ТекстОшибки) Тогда
			СообщитьСообщение(РезультатПроверки.ТекстОшибки);
			ПродолжитьСозданиеДокументов_ПослеСопоставленияДубликатов(Неопределено,ДопПараметры);
			
		Иначе
			ПродолжитьСозданиеДокументов_ПослеСопоставленияДубликатов(Неопределено,ДопПараметры);
			
		КонецЕсли;
	Иначе
		ПродолжитьСозданиеДокументов_ПослеСопоставленияДубликатов(Неопределено,ДопПараметры);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьСозданиеДокументов_ПослеСопоставленияДубликатов(Результат,ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("СписокСвязываемыхДокументов") Тогда
		
		//Передали список документов, которые необходимо связать и показать связанные в списке
		Если Результат.СписокСвязываемыхДокументов.Количество() > 0 Тогда
			РезультатУстановкиСсылок = УстановитьСсылкиДубликатов(Результат.СписокСвязываемыхДокументов);
			Если Не РезультатУстановкиСсылок.Успешно Тогда
				СообщитьСообщение(РезультатУстановкиСсылок.ТекстОшибки);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	//В результате проверки на дубли может оказаться, что все пометки в строках сняты, если так - не продолжаем
	ОтмеченныеСтроки = Объект.СписокДокументов.НайтиСтроки(Новый Структура("Пометка",Истина));
	Если ОтмеченныеСтроки.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	// ) 2019.01.28
	
	//Снимаем флажки у связанных документов: из комплекта должен быть выбран только один
	Если СтруктураНастроек.СозданиеДокумента_ИспользоватьПоискКомплектов = Истина Тогда
		РезультатОбработкиСвязанныхДокументов = СнятьФлагСозданияУСвязанныхДокументов();
		Если РезультатОбработкиСвязанныхДокументов.Успешно Тогда
			ПоказатьОповещениеПользователя("Поиск комплектов",,"у основных связанных документов снята пометка создания");
		КонецЕсли;
	КонецЕсли;
	
	//Типы создаваемых документов на этом этапе уже известны, заполним их в ДанныхПортала
	ЗаполнитьТипыСоздаваемыхДокументовВДанныхПортала(ДопПараметры);
	
	//Кейс для чека/авансового отчета: создавать один документ из нескольких сканов чеков.
	//Настройка удалена, всегда предлагаем объединять авансовые отчеты
				
	// 2019.10.31 ( Исходная логика предполагает, что объединяются только документы с типом RECEIPT. Теперь принято решение
	//объединять документы с любыми типами. Старый механизм на всякий случай оставляю, чтобы не переделывать
	ОбъединятьЛюбыеТипы = Истина;
	
	Если ОбъединятьЛюбыеТипы
		И СтруктураНастроек.ТипДокумента_ВыбиратьПередСозданием
		И ДопПараметры.ТипСоздаваемогоДокумента = "АвансовыйОтчет" Тогда
		СтрокиДокументов = Объект.СписокДокументов.НайтиСтроки(Новый Структура("Пометка",Истина));	
		ТекстВопроса = "Объединить выделенные документы в один документ Авансовый отчет?";
	Иначе
	// ) 2019.10.31
		
		СтрокиДокументов = Объект.СписокДокументов.НайтиСтроки(Новый Структура("Пометка,ДокументТип",Истина,"RECEIPT"));	
		ТекстВопроса = "Объединить создаваемые документы с типом Чек в один документ?";
	КонецЕсли;

	Если СтрокиДокументов.Количество() > 1 Тогда
		Кнопки = РежимДиалогаВопрос.ДаНетОтмена;
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","ПродолжитьСозданиеДокументов_ОбъединениеДокументов",ДопПараметры,ТекстВопроса,Кнопки);
		
		_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
		
	Иначе
		ПродолжитьСозданиеДокументов_ОбъединениеДокументов(КодВозвратаДиалога.Нет,ДопПараметры);
		
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Функция УстановитьСсылкиДубликатов(СписокСвязываемыхДокументов)
	
	Результат = Новый Структура("Успешно,ТекстОшибки",Истина);
	ТекстОшибки = "";
		
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
	
	Для Каждого ЭлементСписка Из СписокСвязываемыхДокументов Цикл
		
		УстановитьСсылкуДокументаПоИдентификатору(ЭлементСписка.ДубликатСсылка,ЭлементСписка.ДокументИД);
			
		//Записываем установленное сопоставление
		ЗаписатьСвязьСДокументомПортала(ЭлементСписка.ДокументИД,Отбор_Пространство,ЭлементСписка.ДубликатСсылка,,ТекстОшибки);
		
		//Установим ссылку на существующие документы в данных с портала	
		ДанныеДокументаПортала = ДанныеПортала.documents.Найти(ЭлементСписка.ДокументИД,"id");
		
		Если ДанныеДокументаПортала <> Неопределено Тогда
			ДанныеДокументаПортала.ДокументСсылка = ЭлементСписка.ДубликатСсылка;
		КонецЕсли;
		
		//Данные для обработки событий в МК
		ПараметрыМК = Новый Структура;
		ПараметрыМК.Вставить("АдресХранилищаДанныхПортала",АдресХранилищаДанныхПортала);
		ПараметрыМК.Вставить("ДокументИД",ЭлементСписка.ДокументИД);
		ПараметрыМК.Вставить("ДокументСсылка",ЭлементСписка.ДубликатСсылка);
		ПараметрыМК.Вставить("ДанныеДокумента",ДанныеДокументаПортала);
		ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
		ПараметрыМК.Вставить("ТекстОшибки","");
		
		//Прикрепим скан с портала к найденному дубликату
		Если ЭтоАдресВременногоХранилища(ЭлементСписка.АдресВХ) Тогда
			
			ОписаниеСобытия = "Прикрепление файла " + ЭлементСписка.ИмяФайла + " к найденному дубликату " + ЭлементСписка.ДубликатСсылка;
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"Дубликаты",ОписаниеСобытия,"Дубликаты");
			
			ДанныеСкана = Новый Структура("АдресВХ,ИмяФайла,ДокументТип",ЭлементСписка.АдресВХ,ЭлементСписка.ИмяФайла,ДанныеДокументаПортала.type);
			
			//Функция принимает на вход массив сканов
			МассивФайлов = Новый Массив;
			МассивФайлов.Добавить(ДанныеСкана);
			
			ПараметрыМК.Вставить("МассивФайлов",МассивФайлов);
			ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
			
			РеквизитОбъект = РеквизитФормыВЗначение("Объект");
			РезультатОбработки = РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Дубликаты_ПередПрисоединениемФайлов",ПараметрыМК);
			ЗначениеВРеквизитФормы(РеквизитОбъект,"Объект");
			
			ЗаполнитьВСпискеДокументовДополнительныеДанные();
			
			Если ЗначениеЗаполнено(РезультатОбработки.ТекстОшибки) Тогда
				ДополнитьТекстОшибки(ТекстОшибки,РезультатОбработки.ТекстОшибки);
			КонецЕсли;
			
			Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
				
				ПрисоединитьФайлы_СканыДокумента(ЭлементСписка.ДубликатСсылка,МассивФайлов,ТекстОшибки);
				
			КонецЕсли;
		КонецЕсли;
		
		РеквизитОбъект = РеквизитФормыВЗначение("Объект");
		РезультатОбработки = РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Дубликаты_УстановкаСсылки",ПараметрыМК);
		РеквизитОбъект = РеквизитФормыВЗначение("Объект");
		
		Если ЗначениеЗаполнено(ПараметрыМК.ТекстОшибки) Тогда
			ДополнитьТекстОшибки(ТекстОшибки,ПараметрыМК.ТекстОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ДанныеПортала,АдресХранилищаДанныхПортала);
	
	Результат.ТекстОшибки = ТекстОшибки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПродолжитьСозданиеДокументов_ОбъединениеДокументов(Результат,ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	Иначе 
		//установить/очистить признак объединения загружаемых документов
		ОбъединятьДокументы = Результат = КодВозвратаДиалога.Да;
	КонецЕсли;
	
	ДопПараметры.Вставить("ОбъединятьДокументы",ОбъединятьДокументы);
	
	//Пока это последний клиентский метод перед уходом на сервер для создания документов
	//если это необходимо - получим сканы документов и поместим в хранилище
	Если СтруктураНастроек.СозданиеДокумента_ПрисоединятьФайлСканаДокумента = Истина Тогда
		
		РезультатЗаполненияСкана = ЗаполнитьАдресХранилищаСканаДокумента();
		
		Если ЗначениеЗаполнено(РезультатЗаполненияСкана.ТекстОшибки) Тогда
			СообщитьСообщение(РезультатЗаполненияСкана.ТекстОшибки);
		КонецЕсли;
		
		Если РезультатЗаполненияСкана.ТребуетсяПовтор Тогда
			ТекстВопроса =  "Для некоторых документов еще не готова скан копия. Обычно требуется до 3 минут для ее создания.
							|Продолжить создание документов без прикрепления скана?";
			Кнопки = РежимДиалогаВопрос.ДаНет;
			ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","ПродолжитьСозданиеДокументов_ВсеСканыПолучены",ДопПараметры,ТекстВопроса,Кнопки);
			
			_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
			
		Иначе
			ПродолжитьСозданиеДокументов_ВсеСканыПолучены(КодВозвратаДиалога.Да,ДопПараметры);
			
		КонецЕсли;
		
	Иначе
		ПродолжитьСозданиеДокументов_ВсеСканыПолучены(КодВозвратаДиалога.Да,ДопПараметры);
		
	КонецЕсли;
		
КонецПроцедуры
&НаКлиенте
Процедура ПродолжитьСозданиеДокументов_ВсеСканыПолучены(Результат,ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗаполнения = ЗаполнитьНеНайденныеЭлементыСправочниковНаСервере(ДопПараметры);
		
	Если РезультатЗаполнения.Успешно Тогда
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ДоступноОписаниеОповещения",ДоступноОписаниеОповещения);
		ПараметрыОткрытия.Вставить("ПрефиксИмениФорм",ПрефиксИмениФорм);
		ПараметрыОткрытия.Вставить("ДопПараметры",ДопПараметры);
		ПараметрыОткрытия.Вставить("СтруктураНастроек",СтруктураНастроек);
		ПараметрыОткрытия.Вставить("ИспользуетсяМК",ИспользуетсяМК);
		
		//Форму больше не открываем, исключаем создание объектов по оповещению между формами
		//переносим в обработчик ОбработатьЗакрытиеФормы_СинхронноАсинхронно
		ФормаСопоставления = ПолучитьФорму(ПрефиксИмениФорм + "УФ_ЗагружаемыеОбъекты", ПараметрыОткрытия, ЭтаФорма);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Источник","УФ_ЗагружаемыеОбъекты");
		ДополнительныеПараметры.Вставить("ДопПараметры",ДопПараметры);
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,Форма","ОбработатьЗакрытиеФормы_СинхронноАсинхронно",ДополнительныеПараметры,ФормаСопоставления);
		
		_ЗФ_ОбработатьАсинхронныйВызов("ОткрытьФормуМодально",ПараметрыВызова);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗагружаемыеДокументы_ДублиВСпискеДокументов()
	
	РезультатПроверки = Новый Структура("Успешно,ТекстОшибки,ИдентификаторыСтрок",Истина,,Новый СписокЗначений);
	
	//Поскольку представление документа у нас формируется из Тип + Номер + Дата, то для одинаковых документов они будут одинаковые
	ВнешняяТаблица = Объект.СписокДокументов.Выгрузить(,"Пометка,ПредставлениеДокумента,СуммаДокумента,НомерСтроки");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВнешняяТаблица.ПредставлениеДокумента КАК ПредставлениеДокумента,
	               |	ВнешняяТаблица.СуммаДокумента КАК СуммаДокумента,
	               |	ВнешняяТаблица.Пометка КАК Пометка,
	               |	ВнешняяТаблица.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ВТ_Таблица
	               |ИЗ
	               |	&ВнешняяТаблица КАК ВнешняяТаблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(ВТ_Таблица.ПредставлениеДокумента КАК СТРОКА(100)) КАК ПредставлениеДокумента,
	               |	ВТ_Таблица.СуммаДокумента КАК СуммаДокумента,
	               |	ВТ_Таблица.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ВТ_ТаблицаСОтбором
	               |ИЗ
	               |	ВТ_Таблица КАК ВТ_Таблица
	               |ГДЕ
	               |	ВТ_Таблица.Пометка = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаСОтбором.ПредставлениеДокумента КАК ПредставлениеДокумента,
	               |	ВТ_ТаблицаСОтбором.СуммаДокумента КАК СуммаДокумента,
	               |	МИНИМУМ(ВТ_ТаблицаСОтбором.НомерСтроки) КАК НомерСтроки,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ТаблицаСОтбором.НомерСтроки) КАК Счетчик
	               |ИЗ
	               |	ВТ_ТаблицаСОтбором КАК ВТ_ТаблицаСОтбором
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ТаблицаСОтбором.СуммаДокумента,
	               |	ВТ_ТаблицаСОтбором.ПредставлениеДокумента
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ТаблицаСОтбором.НомерСтроки) > 1";
	Запрос.УстановитьПараметр("ВнешняяТаблица",ВнешняяТаблица);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		РезультатПроверки.Успешно = Ложь;
		ТекстОшибки = "";
		СтрокиДублей = Новый Массив;
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтрокиДублей = Объект.СписокДокументов.НайтиСтроки(Новый Структура("Пометка,ПредставлениеДокумента",Истина,Выборка.ПредставлениеДокумента));
			
			Для Каждого СтрокаДубля Из СтрокиДублей Цикл
				Если СтрокаДубля.НомерСтроки <> Выборка.НомерСтроки Тогда
					РезультатПроверки.ИдентификаторыСтрок.Добавить(СтрокаДубля.ПолучитьИдентификатор(),СтрокаДубля.ПредставлениеДокумента);
				КонецЕсли;
			КонецЦикла;
			
			ДополнитьТекстОшибки(ТекстОшибки,СтрокаДубля.ПредставлениеДокумента);
		КонецЦикла;
		
		РезультатПроверки.ТекстОшибки = "В списке отмечены одинаковые документы: " + Символы.ПС + ТекстОшибки;
	КонецЕсли;
	
	Возврат РезультатПроверки;
КонецФункции
&НаСервере
Функция ПроверитьЗагружаемыеДокументыНаДубли(ДопПараметры)
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	Результат = РеквизитОбъект.ПроверитьЗагружаемыеДокументыНаДубли(АдресХранилищаДанныхПортала,СтруктураНастроек,ДопПараметры);
	ЗначениеВРеквизитФормы(РеквизитОбъект,"Объект");
	
	ЗаполнитьВСпискеДокументовДополнительныеДанные();
	
	Возврат Результат;
КонецФункции
&НаСервере
Функция СнятьФлагСозданияУСвязанныхДокументов()
	
	//Снимаем флажки у связанных документов: из комплекта должен быть выбран только один
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	Результат = РеквизитОбъект.СнятьФлагСозданияУСвязанныхДокументов();
	ЗначениеВРеквизитФормы(РеквизитОбъект,"Объект");
	
	ЗаполнитьВСпискеДокументовДополнительныеДанные();
	
	Возврат Результат;
	
КонецФункции
&НаСервере
Функция ЗаполнитьТипыСоздаваемыхДокументовВДанныхПортала(ДопПараметры)
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РезультатЗаполнения = РеквизитОбъект.ЗаполнитьТипыСоздаваемыхДокументовВДанныхПортала(АдресХранилищаДанныхПортала,ДопПараметры,СтруктураНастроек);
	
КонецФункции
&НаСервере
Функция ЗаполнитьНеНайденныеЭлементыСправочниковНаСервере(ДопПараметры)
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РезультатЗаполнения = РеквизитОбъект.ЗаполнитьТаблицуЗагружаемыхОбъектов(СтруктураНастроек,АдресХранилищаДанныхПортала,ДопПараметры);	
	ЗначениеВРеквизитФормы(РеквизитОбъект,"Объект");
	
	ЗаполнитьВСпискеДокументовДополнительныеДанные();
	
	Возврат РезультатЗаполнения;
КонецФункции

&НаСервере
Функция СоздатьДокументыНаСервере(ДопПараметры)
	
	РезультатСоздания = Новый Структура("Успешно,ТекстОшибки",Истина);
	
	ОбщийТекстОшибки = "";
	
	//Устанавливаем строкам списка документов и в данных портала идентификатор объединения,
	//по которым будут потом заполняться сгруппированные документы
	ЗаполнитьИдентификаторыОбъединенияДокументов(ДопПараметры);
	
	//Формируем массив идентификаторов объединения документов
	ТаблицаИдентификаторов = Объект.СписокДокументов.Выгрузить(,"ИдентификаторОбъединения");
	ТаблицаИдентификаторов.Свернуть("ИдентификаторОбъединения");
	
	//Удаляем строку с пустым идентификатором
	ПустаяСтрока = ТаблицаИдентификаторов.Найти("","ИдентификаторОбъединения");
	Если ПустаяСтрока <> Неопределено Тогда
		ТаблицаИдентификаторов.Удалить(ПустаяСтрока);
	КонецЕсли;
	
	СозданоДокументов = 0;
	
	//Заполняем по полученной структуре новый документ по исходной схеме
	ОписаниеСобытия = "Начало обхода идентификаторов объединенных документов [" + ТаблицаИдентификаторов.Количество() + "]";
	ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
	
	Для Каждого СтрокаТаблицыИдентификаторов Из ТаблицаИдентификаторов Цикл
		
		ДокументСсылка = Неопределено;
		
		ИдентификаторОбъединения = СтрокаТаблицыИдентификаторов.ИдентификаторОбъединения;
		
		ТекстОшибки = "";
				
		СтрокиДокументов = Объект.СписокДокументов.НайтиСтроки(Новый Структура("ИдентификаторОбъединения",ИдентификаторОбъединения));
		
		//Пользователь выбрал удаление связи существующих документов?
		МассивОтвязываемыхДокументов = Новый Массив;
		Для Каждого СтрокаДокумента Из СтрокиДокументов Цикл		
			
			Если ДопПараметры.Свойство("УдалитьСвязьСуществующихДокументов")
				И ДопПараметры.УдалитьСвязьСуществующихДокументов = Истина
				И ЗначениеЗаполнено(СтрокаДокумента.Документ1с) Тогда
				МассивОтвязываемыхДокументов.Добавить(СтрокаДокумента.Документ1с);
			КонецЕсли;
			
		КонецЦикла;
		
		СтруктураЗаполненияДокумента = ПолучитьСтруктуруОбъединенныхДанныхЗаполненияДокумента(ИдентификаторОбъединения,ДопПараметры);
		
		//Заполняем по полученной структуре новый документ по исходной схеме
		ОписаниеСобытия = "Начало заполнения документов [" + СтрокиДокументов.Количество() + "], Автоопределение типа [" + ДопПараметры.АвтоопределениеТипа + "]"
			+ ?(ДопПараметры.АвтоопределениеТипа,"",", выбран тип [" + ДопПараметры.ТипСоздаваемогоДокумента + "]");
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
						
		//2019.10.11 ( При использовании поиска комплектов документ-основание мог быть создан ранее, проверим
		Если СтруктураНастроек.СозданиеДокумента_ИспользоватьПоискКомплектов = Истина Тогда
			
			//В таком случае ищем только документ-основание для полученного документа счет-фактура, если найден - используем его
			Если СтруктураЗаполненияДокумента.document.type = "VAT_INVOICE" Тогда
				СтрокиДокументаРодителя = Объект.СписокДокументов.НайтиСтроки(Новый Структура("ДокументИД",СтруктураЗаполненияДокумента.document.parent));
				Если СтрокиДокументаРодителя.Количество() > 0
					И ЗначениеЗаполнено(СтрокиДокументаРодителя[0].Документ1с) Тогда
					
					ДокументСсылка = СтрокиДокументаРодителя[0].Документ1с;
					
					ОписаниеСобытия = "Найден существующий родитель документа [" + СтруктураЗаполненияДокумента.document.ДокументСсылка + "] - " + Строка(ДокументСсылка);
					ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		// ) 2019.10.11
		
			ДокументСсылка = ПолучитьСсылку_ЗаполнениеДокумент(СтруктураЗаполненияДокумента,ДопПараметры,ТекстОшибки);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументСсылка) Тогда
						
			//В зависимости от типа документа (+++ или статуса УПД) создать документ счет-фактура полученный
			ДанныеДокумента = СтруктураЗаполненияДокумента.document;
			
			Если ДанныеДокумента.ТипСоздаваемогоДокумента = "АвансовыйОтчет" Тогда
				// 2020.07.30 Кейс: на основании УПД может быть введен документ Авансовый отчет, не вводим СФ автоматически
				
			Иначе
				
				Если ДанныеДокумента.type = "VAT_INVOICE" Или ДанныеДокумента.type = "E_VAT_INVOICE"
					Или (СтруктураНастроек.СозданиеДокумента_СоздаватьСчетФактуруПоУПД = Истина И ДанныеДокумента.type = "UTD")
					Или (СтруктураНастроек.СозданиеДокумента_СоздаватьСчетФактуруПоТОРГ12 = Истина И ДанныеДокумента.type = "TORG12")
					Или (СтруктураНастроек.СозданиеДокумента_СоздаватьСчетФактуруПоАкту = Истина И ДанныеДокумента.type = "CERTIFICATE") Тогда
					
					//раньше счета-фактуры создавались только по входящим документам,
					//чтобы принудительно не устанавливать нумерацию из скана выданным счетам-фактурам,
					//теперь условие убрали, создаем по настройке, нумерацию при необходимости устанавливаем в МК
					
					//2021.10.18 ( Временно отключим это условие, требуется создание СФ даже при установленном флаге УПД в документе-поступлении
					СоздаватьСчетФактуруПриПризнакеВДокументеУПД = Истина;
					
					// 2020.10.07 (
					Если Не СоздаватьСчетФактуруПриПризнакеВДокументеУПД
						И СчетФактура_ДанныеСчетаФактурыУказываютсяВДокументеОсновании(ДокументСсылка) И ДанныеДокумента.НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
						//Данные СФ уже есть в документе
						ОписаниеСобытия = "В документе <" + ДокументСсылка + "> установлен флаг <УПД>, создание счета-фактуры пропущено";
						ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
					Иначе
					// ) 2020.10.07
					
						Попытка
							СчетФактураСсылка = ПолучитьСсылку_ЗаполнениеСчетФактура(СтруктураЗаполненияДокумента,ДокументСсылка,ДанныеДокумента,ТекстОшибки);
						Исключение
							ОписаниеСобытия = "- ошибка при заполнении счета-фактуры на основании созданного документа: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
							ДополнитьТекстОшибки(ТекстОшибки,ОписаниеСобытия);
							ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ОшибкаЗаписи");
						КонецПопытки;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	
		Если ЗначениеЗаполнено(ДокументСсылка) Тогда
			
			СозданоДокументов = СозданоДокументов + 1;
			
			Если МассивОтвязываемыхДокументов.Количество() > 0 Тогда
				Для Каждого ОтвязываемыйДокумент Из МассивОтвязываемыхДокументов Цикл
					ЗаписатьСвязьСДокументомПортала(СтрокаДокумента.ДокументИД,СтрокаДокумента.ПространствоИД,,ОтвязываемыйДокумент,ТекстОшибки);
					
					ОписаниеСобытия = "Удаление связи существующего документа <" + ОтвязываемыйДокумент + "> (" + СтрокаДокумента.ДокументИД + ")";
					ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"УдалениеСвязиДокументов");
				КонецЦикла;
			КонецЕсли;
			
			//E1C-50: Заполним ссылку на объединенные документы, при условии, что было объединение нескольких в один
			Если СтрокиДокументов.Количество() > 1 Тогда
				Для Каждого СтрокаОбъединяемогоДокумента Из СтрокиДокументов Цикл
					УстановитьСсылкуДокументаПоИдентификатору(ДокументСсылка,СтрокаОбъединяемогоДокумента.ДокументИД);
				КонецЦикла;
			КонецЕсли;
			
		Иначе
			//Один или несколько из документов не были созданы
			РезультатСоздания.Успешно = Ложь;
			
		КонецЕсли;
		
		Если ТекстОшибки <> "" Тогда
			ДополнитьТекстОшибки(ОбщийТекстОшибки,ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	
	ОписаниеСобытия = "Завершение создания документов, успешно [" + СозданоДокументов + "]";
	ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
	
	Если ЗначениеЗаполнено(ОбщийТекстОшибки) Тогда
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,2,"СозданиеДокументов",ОбщийТекстОшибки,"Ошибка");
	КонецЕсли;
	
	ПересчитатьИтогиПоСтатусамДокументов();
	
	РезультатСоздания.ТекстОшибки = ОбщийТекстОшибки;
	
	Возврат РезультатСоздания;
	
КонецФункции
&НаСервере
Функция ПолучитьСсылку_ЗаполнениеДокумент(СтруктураЗаполненияДокумента,ДопПараметры,ТекстОшибки)
	
	КэшированныеЗначения = Новый Структура();
	КэшированныеЗначения.Вставить("КоэффициентыУпаковок",Новый Соответствие);
	КэшированныеЗначения.Вставить("ОбъемУпаковок",Новый Соответствие);
	КэшированныеЗначения.Вставить("ВесУпаковок",Новый Соответствие);
	
	ИдентификаторОбъединения = СтруктураЗаполненияДокумента.ИдентификаторОбъединения;
	
	ДанныеДокумента = СтруктураЗаполненияДокумента.document;
	ДанныеНоменклатуры = СтруктураЗаполненияДокумента.documentItems;
	
	ДокументИД = ДанныеДокумента.id;
	НаправлениеСоздаваемогоДокумента = ДанныеДокумента.НаправлениеСоздаваемогоДокумента;
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект"); //Для вызова функций модуля объекта
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	
	ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
		
	Если НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
		ОрганизацияСсылка = ДанныеДокумента.ПлательщикСсылка;
		КонтрагентСсылка = ДанныеДокумента.ПоставщикСсылка;
	Иначе
		ОрганизацияСсылка = ДанныеДокумента.ПоставщикСсылка;
		КонтрагентСсылка = ДанныеДокумента.ПлательщикСсылка;
	КонецЕсли;
	
	ТипСоздаваемогоДокумента = ДанныеДокумента.ТипСоздаваемогоДокумента;
	
	//2021.06.23 ( возникает кейс, когда ТипСоздаваемогоДокумента не заполнен или заполнен некорректно,
	//чтобы отловить эту ситуацию - выведем сообщение и зафиксируем в протоколе
	Попытка
		МенеджерОбъекта = Документы[ТипСоздаваемогоДокумента];
	Исключение
		ОписаниеСобытия = "- ошибка определения менеджера объекта типа [" + ТипСоздаваемогоДокумента
			+ "] создаваемого документа " + ДанныеДокумента.ПредставлениеДокумента + " [" + ДанныеДокумента.id + "], "
			+ "направление [" + ДанныеДокумента.Направление + "]: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
		ДополнитьТекстОшибки(ТекстОшибки,ОписаниеСобытия);
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ОшибкаЗаписи");
		
		Возврат Неопределено;
	КонецПопытки;
	// ) 2021.06.23
	
	МодульБухгалтерскийУчетПереопределяемый = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("БухгалтерскийУчетПереопределяемый");
	МодульОбработкаТабличнойЧастиКлиентСервер = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("ОбработкаТабличнойЧастиКлиентСервер");
	
	ДокументОбъект = МенеджерОбъекта.СоздатьДокумент();
		
	//2019.03.25 ( модуль кастомизации
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("АдресХранилищаДанныхПортала",АдресХранилищаДанныхПортала);
	ПараметрыМК.Вставить("ДокументИД",ДокументИД);
	ПараметрыМК.Вставить("ДанныеДокумента",ДанныеДокумента);
	ПараметрыМК.Вставить("ДанныеНоменклатуры",ДанныеНоменклатуры);
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыМК.Вставить("НаправлениеСоздаваемогоДокумента",НаправлениеСоздаваемогоДокумента);
	ПараметрыМК.Вставить("ТипСоздаваемогоДокумента",ТипСоздаваемогоДокумента);
	ПараметрыМК.Вставить("ДопПараметры",ДопПараметры);
	ПараметрыМК.Вставить("ДокументОбъект",ДокументОбъект);
	ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
	
	//Теперь данные документа есть в структуре заполнения документа, но оставляем их для обратной совместимости МК
	ПараметрыМК.Вставить("СтруктураЗаполненияДокумента",СтруктураЗаполненияДокумента);
	
	РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Документ_ПередЗаполнениемШапки",ПараметрыМК);
	
	Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
	// ) 2019.03.25
			
		//Поиск связанных документов комплекта
		Если СтруктураНастроек.СозданиеДокумента_ИспользоватьПоискКомплектов = Истина
			И ЗначениеЗаполнено(СтруктураЗаполненияДокумента.document.parent) Тогда
			
			//Если у текущего документа есть parent, то используем его номер и дату
			ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
			СвязанныйДокумент = ДанныеПортала.documents.Найти(СтруктураЗаполненияДокумента.document.parent,"id");
						
			Если СвязанныйДокумент <> Неопределено Тогда
				
				//Связанный документ уже создали ранее
				Если ЗначениеЗаполнено(СвязанныйДокумент.ДокументСсылка) Тогда
					Возврат СвязанныйДокумент.ДокументСсылка;
				КонецЕсли;
				
				date = СвязанныйДокумент.date;
				number = СвязанныйДокумент.number;
				СвязанныйДокументИД = СвязанныйДокумент.id;
			Иначе
				date = ДанныеДокумента.date;
				number = ДанныеДокумента.number;
			КонецЕсли;
		Иначе
			date = ДанныеДокумента.date;
			number = ДанныеДокумента.number;
		КонецЕсли;
		
		//2019.12.10 ( Попробуем получить номер и дату дочернего документа текущего, в старых УТ11 номер и дату счета-фактуры можно указать
		// в реквизитах НомерСчетаФактуры и ДатаСчетаФактуры документа ПоступлениеТоваровУслуг
		childDate = ДанныеДокумента.date;
		childNumber = ДанныеДокумента.number;
		
		Если ЗначениеЗаполнено(СтруктураЗаполненияДокумента.document.children) Тогда
			ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
			СвязанныйДочернийДокумент = ДанныеПортала.documents.Найти(СтруктураЗаполненияДокумента.document.children,"id");
			
			Если СвязанныйДочернийДокумент <> Неопределено Тогда
				childDate = СвязанныйДочернийДокумент.date;
				childNumber = СвязанныйДочернийДокумент.number;
			КонецЕсли;
		КонецЕсли;
		// ) 2019.12.10
		
		СтруктураЗаполненияДокумента.Вставить("childNumber",childNumber);
		СтруктураЗаполненияДокумента.Вставить("childDate",childDate);
		
		//E1C-503, 2025.08.11: Для распознанного типа документа ЭСФ для заполнения в ПТиУ "Вх номер" = значение берется из deliveryDocNum,
		//Вх. дата = значение берется из deliveryDocDate.
		Если ЗначениеЗаполнено(ДанныеДокумента.esfKzDeliveryDocNum)
			И ЗначениеЗаполнено(ДанныеДокумента.esfKzDeliveryDocDate) Тогда
			number = ДанныеДокумента.esfKzDeliveryDocNum;
			date = ДанныеДокумента.esfKzDeliveryDocDate;
		КонецЕсли;
		
		СтруктураЗаполнения = Новый Структура;
		
		//Общие данные структуры шапки документа
		
		//E1C-208: при работе с комплектами для заполнения обоих документов используется только счет-фактура,
		//берем для основного документа дату, установленную пользователем в форме сопоставления
		ДатаДокумента = ДанныеДокумента.ДатаДокумента;		
		СтруктураЗаполнения.Вставить("Дата",?(ЗначениеЗаполнено(ДатаДокумента),ДатаДокумента,ТекущаяДата()));
		
		СтруктураЗаполнения.Вставить("ДатаВходящегоДокумента",date);
		СтруктураЗаполнения.Вставить("НомерВходящегоДокумента",number);
		
		//НомерВходящегоДокумента
		
		СтруктураЗаполнения.Вставить("НомерПоДаннымПоставщика",number);
		СтруктураЗаполнения.Вставить("ДатаПоДаннымПоставщика",date);
		
		// Добавлено для старых УТ11.1
		Если Конф = "УТ11" Тогда
			СтруктураЗаполнения.Вставить("ПредъявленСчетФактура",Истина);
			СтруктураЗаполнения.Вставить("НомерСчетаФактуры",childNumber);
			СтруктураЗаполнения.Вставить("ДатаСчетаФактуры",childDate);
		КонецЕсли;
				
		СтруктураЗаполнения.Вставить("НомерЭД",number);
		
		//БИТ.Строительство
		СтруктураЗаполнения.Вставить("ВходящийНомер",number);
		СтруктураЗаполнения.Вставить("ВходящаяДата",date);
				
		//БГУ2
		СтруктураЗаполнения.Вставить("ДатаПервичногоДокумента",date);
		СтруктураЗаполнения.Вставить("НомерПервичногоДокумента",number);
		СтруктураЗаполнения.Вставить("ВидПервичногоДокумента",ДанныеДокумента.ПредставлениеТипа);
		Если РеквизитСуществует("Перечисления","ВидыПоступленийМЗ","ПоступлениеОтПоставщика") Тогда
			СтруктураЗаполнения.Вставить("ВидПоступленияМЗ",Перечисления.ВидыПоступленийМЗ.ПоступлениеОтПоставщика);
		КонецЕсли;
		
		СтруктураЗаполнения.Вставить("Организация",ОрганизацияСсылка);
		СтруктураЗаполнения.Вставить("Контрагент",КонтрагентСсылка);
		СтруктураЗаполнения.Вставить("Партнер",ДанныеДокумента.ПартнерСсылка);
		СтруктураЗаполнения.Вставить("Договор",ДанныеДокумента.ДоговорСсылка);
		СтруктураЗаполнения.Вставить("ДоговорКонтрагента",ДанныеДокумента.ДоговорСсылка);
		
		//в УТ11 в некоторых документах Партнер изменен на реквизит Клиент с определяемым типом ПартнерБЭД
		Если ТипСоздаваемогоДокумента = "КоммерческоеПредложениеКлиенту" Тогда
			СтруктураЗаполнения.Вставить("Клиент",ДанныеДокумента.ПартнерСсылка);
		КонецЕсли;
		
		СтруктураЗаполнения.Вставить("БанковскийСчетКонтрагента",ДанныеДокумента.БанковскийСчетКонтрагентаСсылка);
		СтруктураЗаполнения.Вставить("БанковскийСчетПолучателя",ДанныеДокумента.БанковскийСчетКонтрагентаСсылка);
		СтруктураЗаполнения.Вставить("СчетКонтрагента",ДанныеДокумента.БанковскийСчетКонтрагентаСсылка);
		
		Если ЗначениеЗаполнено(СтруктураНастроек.ЗаполнениеШапки_БанковскийСчетОрганизацииПоУмолчанию) Тогда
			СтруктураЗаполнения.Вставить("БанковскийСчет",СтруктураНастроек.ЗаполнениеШапки_БанковскийСчетОрганизацииПоУмолчанию);
			СтруктураЗаполнения.Вставить("БанковскийСчетОрганизации",СтруктураНастроек.ЗаполнениеШапки_БанковскийСчетОрганизацииПоУмолчанию);
		КонецЕсли;
			
		СтруктураЗаполнения.Вставить("Склад",ДанныеДокумента.СкладСсылка);
		СтруктураЗаполнения.Вставить("СкладОрдер",ДанныеДокумента.СкладСсылка);
		СтруктураЗаполнения.Вставить("СкладОтправитель",ДанныеДокумента.СкладСсылка);
		СтруктураЗаполнения.Вставить("СкладПолучатель",ДанныеДокумента.СкладСсылка);
		
		//E1C-387: Перемещение ТМЗ (БП KAZ), Поступление от структурного подразделения
		Если Конф = "БП30" И СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
			СтруктураЗаполнения.Вставить("СтруктурноеПодразделениеОтправитель",ДанныеДокумента.ПодразделениеОрганизацииСсылка);
			СтруктураЗаполнения.Вставить("СтруктурноеПодразделениеПолучатель",ДанныеДокумента.ПодразделениеОрганизацииСсылка);
			
			Если ЗначениеЗаполнено(СтруктураЗаполненияДокумента.document.ВидОперацииСсылка)
				И СтруктураЗаполненияДокумента.document.ВидОперацииСсылка = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОтСтруктурногоПодразделения Тогда
				СтруктураЗаполнения.Вставить("СтруктурноеПодразделение",ДанныеДокумента.ПодразделениеОрганизацииСсылка);
			КонецЕсли;
		КонецЕсли;
		
		
		//E1C-266: УНФ: при заполнении документа получать пользовательское значение для заполнения склада "Шапка/табличная часть"
		Если Конф = "УНФ" Тогда
			
			Если РеквизитСуществует("Перечисления","ПоложениеРеквизитаНаФорме","ВТабличнойЧасти") Тогда
				МодульУправлениеНебольшойФирмойПовтИсп = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("УправлениеНебольшойФирмойПовтИсп");
				Если МодульУправлениеНебольшойФирмойПовтИсп <> Неопределено Тогда
					Попытка
						ПоложениеСклада_УНФ = МодульУправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ПоложениеСкладаВДокументахПоступления");
					Исключение
						//Не обрабатываем
					КонецПопытки;
				КонецЕсли;
				
				Если ПоложениеСклада_УНФ = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти Тогда
					СтруктураЗаполнения.Вставить("ПоложениеСклада",ПоложениеСклада_УНФ);
				КонецЕсли;
			КонецЕсли;
			
			СтруктураЗаполнения.Вставить("СтруктурнаяЕдиница",ДанныеДокумента.СкладСсылка);
			
		КонецЕсли;
		
		//БГУ2
		СтруктураЗаполнения.Вставить("ЦМО",ДанныеДокумента.СкладСсылка);
				
		Если Конф = "БГУ2" Тогда
			Если ТипСоздаваемогоДокумента = "СчетНаОплату" Тогда
				СтруктураЗаполнения.Вставить("Плательщик",КонтрагентСсылка);
				СтруктураЗаполнения.Вставить("СчетПлательщика",ДанныеДокумента.БанковскийСчетКонтрагентаСсылка);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеДокумента.ИФОСсылка) Тогда
				СтруктураЗаполнения.Вставить("ИФО",ДанныеДокумента.ИФОСсылка);
			КонецЕсли;
			
			Если ТипСоздаваемогоДокумента = "РегистрацияОбязательствИСведенийПоДоговорам" Тогда
				Если ЗначениеЗаполнено(ДанныеДокумента.ДоговорСсылка)
					И ДанныеДокумента.ДоговорСсылка.УчетПредметаДоговора Тогда
					СтруктураЗаполнения.Вставить("ВидОбязательства",Перечисления.ВидыПринятыхОбязательств.ПринятоеОбязательствоУчетПредмета);
				Иначе
					СтруктураЗаполнения.Вставить("ВидОбязательства",Перечисления.ВидыПринятыхОбязательств.ПринятоеОбязательство);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		

		СтруктураЗаполнения.Вставить("Подразделение",ДанныеДокумента.ПодразделениеСсылка);
		СтруктураЗаполнения.Вставить("ПодразделениеОрганизации",ДанныеДокумента.ПодразделениеОрганизацииСсылка);
		
		Если ТипСоздаваемогоДокумента = "ОтчетПроизводстваЗаСмену" Тогда
			СтруктураЗаполнения.Вставить("ПодразделениеЗатрат",ДанныеДокумента.ПодразделениеОрганизацииСсылка);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеДокумента.НоменклатурнаяГруппаСсылка) Тогда
			СтруктураЗаполнения.Вставить("НоменклатурнаяГруппа",ДанныеДокумента.НоменклатурнаяГруппаСсылка);
		КонецЕсли;
		
		//E1C-363: Направление деятельности для КА2
		Если ЗначениеЗаполнено(ДанныеДокумента.НаправлениеДеятельностиСсылка) Тогда
			НаправлениеДеятельностиСсылка = ДанныеДокумента.НаправлениеДеятельностиСсылка;
		Иначе
			//E1C-539: КА2 Заполнять реквизит "Направление деятельности" значением из Договора/Соглашение	
			Если Конф = "КА2" Тогда
				Если ЗначениеЗаполнено(ДанныеДокумента.СоглашениеСсылка) Тогда
					НаправлениеДеятельностиСсылка = ДанныеДокумента.СоглашениеСсылка.НаправлениеДеятельности;
				ИначеЕсли ЗначениеЗаполнено(ДанныеДокумента.ДоговорСсылка) Тогда
					НаправлениеДеятельностиСсылка = ДанныеДокумента.ДоговорСсылка.НаправлениеДеятельности;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		СтруктураЗаполнения.Вставить("НаправлениеДеятельности",НаправлениеДеятельностиСсылка);
		
		//Статью заполняем/подменяем только если заполнена в настройках
		Если ЗначениеЗаполнено(СтруктураНастроек.ЗаполнениеШапки_СтатьяДДСПоУмолчанию) Тогда
			СтруктураЗаполнения.Вставить("СтатьяДвиженияДенежныхСредств",СтруктураНастроек.ЗаполнениеШапки_СтатьяДДСПоУмолчанию);
		КонецЕсли;
				
		//E1C-427: Объект расчетов для КА2
		Если ЗначениеЗаполнено(ДанныеДокумента.ОбъектРасчетовСсылка) Тогда
			СтруктураЗаполнения.Вставить("ОбъектРасчетов",ДанныеДокумента.ОбъектРасчетовСсылка);
			
			//E1C-440: Заполним статью ДДС значением из выбранного для документа "объекта расчетов"
			Если РеквизитСуществует("Перечисления","ТипыОбъектовРасчетов","Договор")
				И ДанныеДокумента.ОбъектРасчетовСсылка.ТипОбъектаРасчетов = Перечисления.ТипыОбъектовРасчетов.Договор Тогда
				СтруктураЗаполнения.Вставить("СтатьяДвиженияДенежныхСредств",ДанныеДокумента.ОбъектРасчетовСсылка.Договор.СтатьяДвиженияДенежныхСредств);
			КонецЕсли;
			
		КонецЕсли;
		
		ВалютаРегламентированногоУчета = СтруктураНастроек.СведенияОКонфигурации.ВалютаУчета;
		КратностьВзаиморасчетов = 1;
		КурсВзаиморасчетов = 1;
		
		СтруктураЗаполнения.Вставить("Соглашение",ДанныеДокумента.СоглашениеСсылка);
				
		Если ЗначениеЗаполнено(ДанныеДокумента.ДоговорСсылка) Тогда
			
			//Если валюта есть в договоре - берем ее из него, если нет - валюта по умолчанию
			Если ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.Договор_ИмяРеквизитаВалюта)
				И ЗначениеЗаполнено(ДанныеДокумента.ДоговорСсылка[СтруктураНастроек.СведенияОКонфигурации.Договор_ИмяРеквизитаВалюта]) Тогда
			
				Валюта = ДанныеДокумента.ДоговорСсылка[СтруктураНастроек.СведенияОКонфигурации.Договор_ИмяРеквизитаВалюта];
					
				Если Валюта <> ВалютаРегламентированногоУчета Тогда
					
					//2023.07.10 ( Бухгалтерия для Казахстана
					Если Конф = "БП30" И СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
						МодульОбщегоНазначенияБК = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("ОбщегоНазначенияБК");
						Если МодульОбщегоНазначенияБК <> Неопределено Тогда
							СтруктураКурсаДокумента = МодульОбщегоНазначенияБК.ПолучитьКурсВалюты(Валюта,СтруктураЗаполнения.Дата);
							КратностьВзаиморасчетов = СтруктураКурсаДокумента.Кратность;
							КурсВзаиморасчетов = СтруктураКурсаДокумента.Курс;
						КонецЕсли;
						
					Иначе
					// ) 2023.07.10
					
						МодульРаботаСКурсамиВалют = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("РаботаСКурсамиВалют");
						Если МодульРаботаСКурсамиВалют <> Неопределено Тогда
							СтруктураКурсаДокумента = МодульРаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта,СтруктураЗаполнения.Дата);
							КратностьВзаиморасчетов = СтруктураКурсаДокумента.Кратность;
							КурсВзаиморасчетов = СтруктураКурсаДокумента.Курс;
							
						ИначеЕсли Метаданные.РегистрыСведений.Найти("КурсыВалют") <> Неопределено Тогда
							КурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(СтруктураЗаполнения.Дата, Новый Структура("Валюта",Валюта));
							Если КурсКратность <> Неопределено Тогда
								КратностьВзаиморасчетов = КурсКратность.Кратность;
								КурсВзаиморасчетов = КурсКратность.Курс;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
		
				КонецЕсли;
				
			Иначе
				Валюта = ВалютаРегламентированногоУчета;
			КонецЕсли;
			
			// 2020.10.07 ( начиная с релиза БП 3.0.83 данные СФ могут быть указаны в самом документе ПТиУ, в этом случае не требуется создание счета-фактуры
			// а реквизиты НомерВходящегоДокумента и ДатаВходящегоДокумента являются обязательными. Определим установку этого флага по реквизиту выбранного договора
			Если ДанныеДокумента.type = "UTD" И СтруктураНастроек.СведенияОКонфигурации.Договор_ИспользуютсяДанныеУПДВДокументе = Истина
				И ДанныеДокумента.ДоговорСсылка.СпособВыставленияДокументов = Перечисления.СпособыВыставленияДокументов.УниверсальныйДокумент Тогда
				СтруктураЗаполнения.Вставить("ЭтоУниверсальныйДокумент",Истина);
			КонецЕсли;
			// ) 2020.10.07
			
			//ГруппаФинансовогоУчета,СпособЗачетаПредоплатыПоУмолчанию
			СтруктураДляПереноса = Новый Структура("ГруппаФинансовогоУчета,СпособЗачетаПредоплатыПоУмолчанию");
			ЗаполнитьЗначенияСвойств(СтруктураДляПереноса,ДанныеДокумента.ДоговорСсылка);
			
			Если ЗначениеЗаполнено(СтруктураДляПереноса.ГруппаФинансовогоУчета) Тогда
				СтруктураЗаполнения.Вставить("ГруппаФинансовогоУчета",СтруктураДляПереноса.ГруппаФинансовогоУчета);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктураДляПереноса.СпособЗачетаПредоплатыПоУмолчанию) Тогда
				СтруктураЗаполнения.Вставить("СпособЗачетаПредоплаты",СтруктураДляПереноса.СпособЗачетаПредоплатыПоУмолчанию);
			КонецЕсли;
			
		Иначе
			Валюта = ВалютаРегламентированногоУчета;
		КонецЕсли;
		
		СтруктураЗаполнения.Вставить("Валюта",Валюта);
		СтруктураЗаполнения.Вставить("ВалютаДокумента",Валюта);
		СтруктураЗаполнения.Вставить("ВалютаВзаиморасчетов",Валюта);
		СтруктураЗаполнения.Вставить("КратностьВзаиморасчетов", КратностьВзаиморасчетов);
		СтруктураЗаполнения.Вставить("КурсВзаиморасчетов", КурсВзаиморасчетов);
		
		СтруктураЗаполнения.Вставить("ОтражатьВУправленческомУчете", Истина);
		СтруктураЗаполнения.Вставить("ОтражатьВБухгалтерскомУчете", Истина);
		СтруктураЗаполнения.Вставить("ОтражатьВНалоговомУчете", Истина);
			
		УчитыватьНДС = ДанныеДокумента.УчитыватьНДС = Истина;
		СтруктураЗаполнения.Вставить("УчитыватьНДС",УчитыватьНДС);
		
		//2022.04.20 (
		СтруктураЗаполнения.Вставить("НДСНеВыделять",НЕ СтруктураНастроек.ЗаполнениеШапки_УчитыватьНДС);
		// ) 2022.04.20
		
		//2022.05.25 ( Для УНФ отображение НДС в документе определяем реквизитом НалогообложениеНДС
		Если Конф = "УНФ" Или Конф = "РОЗН3" Тогда
			Если СтруктураНастроек.ЗаполнениеШапки_УчитыватьНДС Тогда
				Если РеквизитСуществует("Перечисления","ТипыНалогообложенияНДС") Тогда
					СтруктураЗаполнения.Вставить("НалогообложениеНДС",Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// ) 2022.05.25
		
		//E1C-246: для RECEIPT считать, что документ, полученный от ОФД с данными чека всегда с СуммаВключаетНДС = Истина
		СуммаВключаетНДС = СтруктураНастроек.ЗаполнениеШапки_СуммаВключаетНДС = Истина Или ДанныеДокумента.type = "RECEIPT";
		
		СтруктураЗаполнения.Вставить("СуммаВключаетНДС",СуммаВключаетНДС);
		СтруктураЗаполнения.Вставить("ЦенаВключаетНДС",СуммаВключаетНДС);
		
		//E1C-218: по настройке устанавливаем значение флага НДСВключенВСтоимость
		Если СтруктураНастроек.Свойство("ЗаполнениеШапки_НДСВключенВСтоимость") Тогда
			Если СтруктураНастроек.ЗаполнениеШапки_НДСВключенВСтоимость = "Да" Тогда
				СтруктураЗаполнения.Вставить("НДСВключенВСтоимость",Истина);
			ИначеЕсли СтруктураНастроек.ЗаполнениеШапки_НДСВключенВСтоимость = "Нет" Тогда
				СтруктураЗаполнения.Вставить("НДСВключенВСтоимость",Ложь);
			КонецЕсли;
		КонецЕсли;
		
		//2023.09.07 ( для документа Поступление доп. расходов реквизит документа Сумма заполняется с/без НДС.
		//заполнение реквизита СуммаДокумента оставляем исходное. Возможно, следует дополнительно анализировать тип заполняемого документа.
		Если Не СуммаВключаетНДС Тогда
			СтруктураЗаполнения.Вставить("Сумма",ДанныеДокумента.amountWithoutVat);
		Иначе
		// ) 2023.09.07
			СтруктураЗаполнения.Вставить("Сумма",ДанныеДокумента.amount);
		КонецЕсли;
		
		СтруктураЗаполнения.Вставить("СуммаДокумента",ДанныеДокумента.amount);
		
		Если УчитыватьНДС Тогда
			СтруктураЗаполнения.Вставить("СуммаНДС",ДанныеДокумента.vat);
			СтруктураЗаполнения.Вставить("НДС",ДанныеДокумента.vat);
		КонецЕсли;
		
		//2019.12.10 ( Комментарий может содержать предопределенные параметры
		Комментарий = РеквизитОбъект.ЗаполнениеДокумента_СформироватьКомментарийСПараметрами(АдресХранилищаДанныхПортала,СтруктураЗаполненияДокумента,СтруктураНастроек);
		СтруктураЗаполнения.Вставить("Комментарий",Комментарий);
		// ) 2019.12.10
		
		//2019.12.14 ( заполняем реквизит документа Диадок_url
		СтруктураЗаполнения.Вставить("Энтера_Диадок_url",ДанныеДокумента.Диадок_url);
		// ) 2019.12.14
		
		Если РеквизитСуществует("Перечисления","ВидыПоступленияТоваров","НаСклад") Тогда
			СтруктураЗаполнения.Вставить("ВидПоступления",Перечисления.ВидыПоступленияТоваров.НаСклад);
		КонецЕсли;
		
		//E1C-196: Способ зачета авансов
		Если ЗначениеЗаполнено(СтруктураНастроек.ЗаполнениеТЧ_СпособЗачетаАвансовПоУмолчанию) Тогда
			СтруктураЗаполнения.Вставить("СпособЗачетаАвансов",СтруктураНастроек.ЗаполнениеТЧ_СпособЗачетаАвансовПоУмолчанию);
		КонецЕсли;
							
		//E1C-178: Вид операции документа теперь может быть выбран пользователем для ряда документов в форме сопоставления
		ПользовательскийВидОперации = СтруктураЗаполненияДокумента.document.ВидОперацииСсылка;
		
		Если ЗначениеЗаполнено(ПользовательскийВидОперации) Тогда
			СтруктураЗаполнения.Вставить("ВидОперации",ПользовательскийВидОперации);
			СтруктураЗаполнения.Вставить("ХозяйственнаяОперация",ПользовательскийВидОперации);
			
		Иначе
			//Оставляем исходную логику
		
		//БП30: Сперва определим для документа общую форму
			Если НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
				Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","ПокупкаКомиссия") Тогда
					СтруктураЗаполнения.Вставить("ВидОперации",Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия);
				КонецЕсли;
			Иначе
				Если РеквизитСуществует("Перечисления","ВидыОперацийРеализацияТоваров","ПродажаКомиссия") Тогда
					СтруктураЗаполнения.Вставить("ВидОперации",Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		
		Если ТипСоздаваемогоДокумента = "ПоступлениеТоваровУслуг" Тогда
			//E1C-375: Услуги аренды
			Если ЗначениеЗаполнено(ПользовательскийВидОперации)
				И РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","УслугиАренды")
				И ПользовательскийВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.УслугиАренды Тогда
				//Реквизит - булево, но выбор значения выполнен по аналогии с выбором его в форме документа 
				СтруктураЗаполнения.Вставить("ВедетсяУчетПредметовАренды",ДанныеДокумента.ВедетсяУчетПредметовАренды = 1);
			КонецЕсли;
		
		//E1C-234: Подотчетное лицо в АвансовыйОтчет, прочие реквизиты
		ИначеЕсли ТипСоздаваемогоДокумента = "АвансовыйОтчет" Тогда
			СтруктураЗаполнения.Вставить("ФизЛицо",ДанныеДокумента.ПодотчетноеЛицоСсылка);
			СтруктураЗаполнения.Вставить("Сотрудник",ДанныеДокумента.ПодотчетноеЛицоСсылка);
			СтруктураЗаполнения.Вставить("ПодотчетноеЛицо",ДанныеДокумента.ПодотчетноеЛицоСсылка);
			
			//E1C-394: Назначение аванса Командировка
			СтруктураЗаполнения.Вставить("НазначениеАванса",ДанныеДокумента.НазначениеАванса);
			
		//E1C-378: Физ лицо в Доверенность
		ИначеЕсли ТипСоздаваемогоДокумента = "Доверенность" Тогда
			СтруктураЗаполнения.Вставить("ФизЛицо",ДанныеДокумента.ПодотчетноеЛицоСсылка);
			
			//E1C-379: Формируем строку для реквизита ПоДокументу в формате:
			//"счету" *номер распознанного документа* от *дата распознанного документа*
			ПоДокументу = "счету " + number + " от " + Формат(date,"ДФ=dd.MM.yyyy");
			СтруктураЗаполнения.Вставить("ПоДокументу",ПоДокументу);
			
		ИначеЕсли ТипСоздаваемогоДокумента = "СчетФактураПолученный" Тогда
			
			Если Конф = "БП30" Тогда
				//E1C-477: Казахстан: 1С. БП 3.0 для КЗ. Работа с ЭСФ и Источником происхождения
				Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
					СтруктураЗаполнения.Вставить("Покупатель",ОрганизацияСсылка);
					СтруктураЗаполнения.Вставить("Поставщик",КонтрагентСсылка);
				Иначе				
					//E1C-509:
					//Заполнение документа в 1С: Поля номер, дата, контрагент, организация, табличная часть заполняются данными из распознанного документа.
					//Поле "Вид счет-фактуры" -  предзаполнено значением "На аванс"
					//Поле "Документ основание" - ручной выбор на этапе сопоставлении в дополнительном описании по полю Документ.
					//Основанием может быть "Списание с расчетного счета" или "выдача наличных".
					//Код вида операции - предзаполнено значением "02".
					СтруктураЗаполнения.Вставить("СтавкаНДС",ДанныеДокумента.СтавкаНДССсылка);
					СтруктураЗаполнения.Вставить("ДокументОснование",ДанныеДокумента.ДокументОснованиеСсылка);
					СтруктураЗаполнения.Вставить("ВидСчетаФактуры",Перечисления.ВидСчетаФактурыПолученного.НаАванс);
					СтруктураЗаполнения.Вставить("КодВидаОперации","02");
					
					СтрокаАвансы = ДокументОбъект.Авансы.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаАвансы,СтруктураЗаполнения);
					
					СтрокаДокументыОснования = ДокументОбъект.ДокументыОснования.Добавить();
					СтрокаДокументыОснования.ДокументОснование = ДанныеДокумента.ДокументОснованиеСсылка;
				КонецЕсли;
			КонецЕсли;
			
		//E1C-327: Для документа ОтчетКомиссионераОПродажах заполняем ТЧ Покупатели
		ИначеЕсли ТипСоздаваемогоДокумента = "ОтчетКомиссионераОПродажах"
			//2024.04.23 ( УНФ
			Или ТипСоздаваемогоДокумента = "ОтчетКомиссионера" Тогда
			// ) 2024.04.23
			
			Если ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("Покупатели") <> Неопределено Тогда
				ДокументОбъект.Покупатели.Очистить();
				НоваяСтрокаПокупатели = ДокументОбъект.Покупатели.Добавить();
				НоваяСтрокаПокупатели.Покупатель = КонтрагентСсылка;
			КонецЕсли;
			
		//E1C-310: УТ, КА, ERP
		ИначеЕсли ТипСоздаваемогоДокумента = "ПриобретениеТоваровУслуг"
			И ПользовательскийВидОперации = Перечисления.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо Тогда
			СтруктураЗаполнения.Вставить("ПодотчетноеЛицо",ДанныеДокумента.ПодотчетноеЛицоСсылка);
			
		ИначеЕсли ТипСоздаваемогоДокумента = "ОтчетОРозничныхПродажах" Тогда
			Если РеквизитСуществует("Перечисления","ВидыОперацийОтчетОРозничныхПродажах","ОтчетККМОПродажах") Тогда
				СтруктураЗаполнения.Вставить("ВидОперации",Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетККМОПродажах);
			КонецЕсли;
			
			КассаККМ = Неопределено;
			
			Если Конф = "УТ11" Тогда					
				//Настройка ЗаполнениеШапки_КассаККМПоУмолчанию была удалена
				Если Не ЗначениеЗаполнено(КассаККМ) Тогда
					Попытка КассаККМ = Справочники.КассыККМ.АвтономнаяКассаККМПоУмолчанию(); Исключение; КонецПопытки;
				КонецЕсли;
				
				Если КассаККМ <> Неопределено Тогда
					СтруктураЗаполнения.Вставить("КассаККМ",КассаККМ);
				КонецЕсли;
				
			ИначеЕсли Конф = "УНФ" Тогда
				Если Не ЗначениеЗаполнено(КассаККМ) Тогда
					Попытка КассаККМ = Справочники.КассыККМ.ПолучитьКассуККМПоУмолчанию(); Исключение; КонецПопытки;
				КонецЕсли;
				
				Если КассаККМ <> Неопределено Тогда
					СтруктураЗаполнения.Вставить("КассаККМ",КассаККМ);
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТипСоздаваемогоДокумента = "ВозвратТоваровОтПокупателя" Тогда
			СтруктураЗаполнения.Вставить("ПокупателюВыставляетсяКорректировочныйСчетФактура",Ложь);
			СтруктураЗаполнения.Вставить("ПокупателемВыставляетсяСчетФактураНаВозврат",Истина);
			
		ИначеЕсли ТипСоздаваемогоДокумента = "ПлатежноеПоручение"
						
			//2021.02.25 ( Добавили ЗаявкаНаРасходованиеДенежныхСредств, заполняем по аналогии с ППИ
			Или ТипСоздаваемогоДокумента = "ЗаявкаНаРасходованиеДенежныхСредств"
			// ) 2021.02.25
			
			//2021.06.22 (E1C-248: СписаниеБезналичныхДенежныхСредств, заполняем по аналогии с ППИ
			Или ТипСоздаваемогоДокумента = "СписаниеБезналичныхДенежныхСредств"
			// ) 2021.06.22
			
			//2022.04.20 ( ПриходныйКассовыйОрдер
			Или ТипСоздаваемогоДокумента = "ПриходныйКассовыйОрдер"
			// ) 2022.04.20
			
			//2024.09.15 ( ПлатежноеПоручениеИсходящее Далион
			Или ТипСоздаваемогоДокумента = "ПлатежноеПоручениеИсходящее" Тогда
			// ) 2024.09.15
			
			//E1C-527: Теперь ставку НДС берем определяем для шапки документа в модуле объекта при поиске ссылок
			СтавкаНДС = ДанныеДокумента.СтавкаНДССсылка;
							
			Если Не ЗначениеЗаполнено(СтавкаНДС) Тогда
				//Исходный вариант
				Попытка СуммаНДС = Число(ДанныеДокумента.vat); Исключение СуммаНДС = 0; КонецПопытки;
				Если СуммаНДС = 0 Тогда
					//Если сумма НДС документа 0 - значит СтавкаНДС = 0
					СтавкаНДС = СтруктураНастроек.СведенияОКонфигурации.СтавкиНДС.БезНДС;
				Иначе
					//Берем из произвольной позиции документа
					Если СтруктураЗаполненияДокумента.documentItems.Количество() > 0 Тогда
						СтавкаНДС = СтруктураЗаполненияДокумента.documentItems[0].СтавкаНДССсылка;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			СтруктураЗаполнения.Вставить("СтавкаНДС",СтавкаНДС);
			
			СтруктураЗаполнения.Вставить("ВидПлатежа","Электронно");
			СтруктураЗаполнения.Вставить("ФормаОплатыБезналичная",Истина);
			
			//Теперь назначение платежа мог отредактировать пользователь в форме сопоставления
			СтруктураЗаполнения.Вставить("НазначениеПлатежа",ДанныеДокумента.НазначениеПлатежа);
			
			Если Конф = "Далион" Тогда
				СтруктураЗаполнения.Вставить("НазначениеПлатежаРучноеИзменение",Истина);
			КонецЕсли;
			
			//2022.02.01 ( Кроме УНФ пока никто не жаловался, заполним только для УНФ,
			//пока упрощенно, без перетаскивания из формы документа всех алгоритмов заполнения этих реквизитов
			Если Конф = "УНФ" Тогда
				СтруктураИННКПП = Новый Структура("ИНН,КПП");
				ЗаполнитьЗначенияСвойств(СтруктураИННКПП,КонтрагентСсылка);
				СтруктураЗаполнения.Вставить("ИННПолучателя",СтруктураИННКПП.ИНН);
				Если ЗначениеЗаполнено(СтруктураЗаполнения.СчетКонтрагента)
					И СтруктураЗаполнения.СчетКонтрагента.ВариантУказанияКПП = Перечисления.ВариантыУказанияКПП.ВоВсехПлатежныхПоручениях Тогда
					СтруктураЗаполнения.Вставить("КПППолучателя",СтруктураИННКПП.КПП);
				КонецЕсли;				
				СтруктураЗаполнения.Вставить("ТекстПолучателя",КонтрагентСсылка.НаименованиеПолное);				
				
				СтруктураИННКПП = Новый Структура("ИНН,КПП");
				ЗаполнитьЗначенияСвойств(СтруктураИННКПП,ОрганизацияСсылка);
				СтруктураЗаполнения.Вставить("ИННПлательщика",СтруктураИННКПП.ИНН);
				СтруктураЗаполнения.Вставить("КПППлательщика",СтруктураИННКПП.КПП);
				СтруктураЗаполнения.Вставить("ТекстПлательщика",ОрганизацияСсылка.НаименованиеПолное);
			КонецЕсли;
			// ) 2022.02.01
			
			//2020.10.23 ( УправлениеХолдингом при записи формирует сумму по итогу Суммы ТЧ РасшифровкаПлатежа
			Если ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("РасшифровкаПлатежа") <> Неопределено Тогда
				
				СтруктураЗаполнения.Вставить("СуммаПлатежа",ДанныеДокумента.amount);
				
				Если ТипСоздаваемогоДокумента = "ЗаявкаНаРасходованиеДенежныхСредств"
					Или ТипСоздаваемогоДокумента = "СписаниеБезналичныхДенежныхСредств"
					Или ТипСоздаваемогоДокумента = "ПриходныйКассовыйОрдер"
					// Задача 344476: БП30.KAZ
					Или ТипСоздаваемогоДокумента = "ПлатежноеПоручениеИсходящее" Тогда
					
					СтруктураЗаполнения.Вставить("СуммаВзаиморасчетов",ДанныеДокумента.amount);
				КонецЕсли;
				
				НоваяСтрокаТЧРасшифровкаПлатежа = ДокументОбъект.РасшифровкаПлатежа.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧРасшифровкаПлатежа,СтруктураЗаполнения);
			КонецЕсли;
			// ) 2020.10.23
			
			//Для списания БДС номер и дата входящего документа будут заполнены при загрузке банковской выписки
			Если ТипСоздаваемогоДокумента = "СписаниеБезналичныхДенежныхСредств" Тогда
				СтруктураЗаполнения.Вставить("НомерВходящегоДокумента",Неопределено);
				СтруктураЗаполнения.Вставить("ДатаВходящегоДокумента",Неопределено);
			КонецЕсли;
			
			//2022.02.19 ( ИдентификаторПлатежа
			СтруктураЗаполнения.Вставить("ИдентификаторПлатежа",ДанныеДокумента.paymentOrderId);
			// ) 2022.02.19
			
			//2022.04.20 ( СпособПогашенияЗадолженности для ПКО
			Если РеквизитСуществует("Перечисления","СпособыПогашенияЗадолженности","Автоматически") Тогда
				СтруктураЗаполнения.Вставить("СпособПогашенияЗадолженности",Перечисления.СпособыПогашенияЗадолженности.Автоматически);
			КонецЕсли;
			// ) 2022.04.20
			
		КонецЕсли;
		
		
		//2019.08.26 ( Отраслевые БИТ-решения на базе типовых
		Если ТипСоздаваемогоДокумента = "бит_ЗаявкаНаРасходованиеСредств"
			Или ТипСоздаваемогоДокумента = "бит_кзн_ЗаявкаНаРасходованиеСредств" Тогда
			
			СтруктураЗаполнения.Вставить("КурсДокумента",1);
			СтруктураЗаполнения.Вставить("КратностьДокумента",1);
			
			//Ставку НДС определим по первой строке товаров
			Если ДанныеНоменклатуры.Количество() > 0 Тогда
				СтавкаНДССсылка = ДанныеНоменклатуры[0].СтавкаНДССсылка;
				СтруктураЗаполнения.Вставить("СтавкаНДС",СтавкаНДССсылка);
			КонецЕсли;
			
			//Назначение платежа - "Оплата по счёту № {распознанный номер} от {распознанная дата}. В т.ч. НДС {распознанные данные}"
			НазначениеПлатежа = "Оплата по счёту №" + number + " от " + Формат(date,"ДФ=dd.MM.yyyy") + ". ";
			Если ЗначениеЗаполнено(СтавкаНДССсылка) Тогда
				НазначениеПлатежа = НазначениеПлатежа + "В т.ч. НДС (" + СтавкаНДССсылка + ") " + ДанныеДокумента.vat;
			Иначе
				НазначениеПлатежа = НазначениеПлатежа + "Без НДС";
			КонецЕсли;
			
			СтруктураЗаполнения.Вставить("НазначениеПлатежа",НазначениеПлатежа);
			СтруктураЗаполнения.Вставить("НазначениеПлатежаУпр",НазначениеПлатежа);
			
			//Хозяйственная операция 
			Если РеквизитСуществует("Справочники","бит_ХозяйственныеОперации") Тогда
				СтруктураЗаполнения.Вставить("ХозяйственнаяОперация",Справочники.бит_ХозяйственныеОперации.НайтиПоНаименованию("Оплата поставщику",Истина));
			КонецЕсли;
			
			//Форма оплаты
			Если РеквизитСуществует("Перечисления","бит_ВидыДенежныхСредств","Безналичные") Тогда
				СтруктураЗаполнения.Вставить("ФормаОплаты",Перечисления.бит_ВидыДенежныхСредств.Безналичные);
			КонецЕсли;
			
			//Вид плана
			Если РеквизитСуществует("Перечисления","бит_кзн_ВидыПланов","План") Тогда
				СтруктураЗаполнения.Вставить("ВидПлана",Перечисления.бит_кзн_ВидыПланов.План);
			КонецЕсли;
			
			//Важность
			Если РеквизитСуществует("Перечисления","бит_Важность","Средняя") Тогда
				СтруктураЗаполнения.Вставить("Важность",Перечисления.бит_Важность.Средняя);
			КонецЕсли;
			
		ИначеЕсли ТипСоздаваемогоДокумента = "бит_стр_ЗаказПоставщику" Тогда
			
			//Условие поставки
			Если РеквизитСуществует("Перечисления","бит_стр_ВидыУсловийДоставки","Самовывоз") Тогда
				СтруктураЗаполнения.Вставить("УсловиеДоставки",Перечисления.бит_стр_ВидыУсловийДоставки.Самовывоз);
			КонецЕсли;			
			
		ИначеЕсли ТипСоздаваемогоДокумента = "бит_стр_ЗаявкаНаМПЗ" Тогда
			
			//Вид операции
			Если РеквизитСуществует("Перечисления","бит_стр_ВидыОперацийЗаявкаНаМПЗ","НаСклад") Тогда
				СтруктураЗаполнения.Вставить("ВидОперации",Перечисления.бит_стр_ВидыОперацийЗаявкаНаМПЗ.НаСклад);
			КонецЕсли;			
			
		ИначеЕсли ТипСоздаваемогоДокумента = "бит_стр_ПриходныйОрдер" Тогда
			
			//Вид операции
			Если РеквизитСуществует("Перечисления","бит_стр_ВидыОперацииПриходныйОрдер","ОтПоставщика") Тогда
				СтруктураЗаполнения.Вставить("ВидОперации",Перечисления.бит_стр_ВидыОперацииПриходныйОрдер.ОтПоставщика);
			КонецЕсли;
			
		КонецЕсли;
		// ) 2019.08.26
		
		//E1C-193: настройка Виды/Типы цен по умолчанию
		Если НаправлениеСоздаваемогоДокумента = "Входящий"
			И ЗначениеЗаполнено(СтруктураНастроек.ЗаполнениеШапки_ВидТипЦеныВходящихДокументов) Тогда
			СтруктураЗаполнения.Вставить("ВидЦен",СтруктураНастроек.ЗаполнениеШапки_ВидТипЦеныВходящихДокументов);
			СтруктураЗаполнения.Вставить("ТипЦен",СтруктураНастроек.ЗаполнениеШапки_ВидТипЦеныВходящихДокументов);
		ИначеЕсли НаправлениеСоздаваемогоДокумента = "Исходящий"
			И ЗначениеЗаполнено(СтруктураНастроек.ЗаполнениеШапки_ВидТипЦеныИсходящихДокументов) Тогда
			СтруктураЗаполнения.Вставить("ВидЦен",СтруктураНастроек.ЗаполнениеШапки_ВидТипЦеныИсходящихДокументов);
			СтруктураЗаполнения.Вставить("ТипЦен",СтруктураНастроек.ЗаполнениеШапки_ВидТипЦеныИсходящихДокументов);
		Иначе
			СтруктураЗаполнения.Вставить("ВидЦен");
			СтруктураЗаполнения.Вставить("ТипЦен");
		КонецЕсли;
		
		//E1C-228: УТ11: в некоторых случаях при заполнении не инициализируется значение ВариантПриемкиТоваров
		МодульЗакупкиСервер = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("ЗакупкиСервер");
		Если МодульЗакупкиСервер <> Неопределено Тогда
			Попытка
				ВариантПриемкиТоваров = МодульЗакупкиСервер.ПолучитьВариантПриемкиТоваров(,ДанныеДокумента.ДоговорСсылка);
				Если ЗначениеЗаполнено(ВариантПриемкиТоваров) Тогда
					СтруктураЗаполнения.Вставить("ВариантПриемкиТоваров",ВариантПриемкиТоваров);
				КонецЕсли;
			Исключение
				// не обрабатываем это исключение
			КонецПопытки;
		КонецЕсли;
		
		//То же самое у одного клиента касается реквизита СпособДоставки, заполняется пустым значением
		//попробуем принудительно заполнить значением из Значения заполнения реквизита документа
		Если ДокументОбъект.Метаданные().Реквизиты.Найти("СпособДоставки") <> Неопределено
			И ЗначениеЗаполнено(ДокументОбъект.Метаданные().Реквизиты.СпособДоставки.ЗначениеЗаполнения) Тогда
			СтруктураЗаполнения.Вставить("СпособДоставки",ДокументОбъект.Метаданные().Реквизиты.СпособДоставки.ЗначениеЗаполнения);
		КонецЕсли;
		// ) E1C-228
		
		//E1C-308: Для типа документа ПоступлениеДопРасходов из формы сопоставления
		//может быть передан список документов Поступления для заполнения ПоступленияДопРасходов
		Если ТипСоздаваемогоДокумента = "ПоступлениеДопРасходов"
			И ЗначениеЗаполнено(ДанныеДокумента.ДокументыПоступленияДляДопРасходов) Тогда
			СписокДокументовПоступления = ЗначениеИзСтрокиВнутр(ДанныеДокумента.ДокументыПоступленияДляДопРасходов);
			
			СодержаниеУслуги = Новый Структура("Содержание,СтавкаНДС");
			СодержаниеУслуги.Содержание = ДанныеДокумента.СодержаниеУслугиДляДопРасходов;
			Если ДанныеНоменклатуры.Количество() > 0 Тогда
				СодержаниеУслуги.СтавкаНДС = ДанныеНоменклатуры[0].СтавкаНДССсылка;
			КонецЕсли;
			
			ДокументОбъект = ДопРасходы_ЗаполнитьДокументПоСпискуОснований(СписокДокументовПоступления,СодержаниеУслуги,СтруктураЗаполнения,ПараметрыМК,ТекстОшибки);
			
		Иначе
			ЗаполнитьЗначенияСвойств(ДокументОбъект,СтруктураЗаполнения);
			
			//При заполнении может возникнуть исключение
			Попытка	ДокументОбъект.Заполнить(СтруктураЗаполнения); Исключение; КонецПопытки;
			
			ЗаполнитьЗначенияСвойств(ДокументОбъект,СтруктураЗаполнения);
			
		КонецЕсли;
		
		//Комплексная автоматизация, ERP
		Если Конф = "КА2" Или Конф = "ERP" Тогда
			
			Если НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
				МодульУчетНДСУП = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("УчетНДСУП");
		
				Если МодульУчетНДСУП <> Неопределено Тогда
					Попытка
						ПараметрыЗаполнения = Документы[ТипСоздаваемогоДокумента].ПараметрыЗаполненияВидаДеятельностиНДС(ДокументОбъект);
						МодульУчетНДСУП.ЗаполнитьВидДеятельностиНДС(ДокументОбъект.ЗакупкаПодДеятельность, ПараметрыЗаполнения);
					Исключение
						// не обрабатываем это исключение
					КонецПопытки;
				КонецЕсли;
				
				Если ТипСоздаваемогоДокумента = "ОтчетОРозничныхПродажах" Тогда
					Попытка	ПартнерРозничныйПокупатель = Справочники.Партнеры.РозничныйПокупатель; Исключение; КонецПопытки;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		//Управление торговлей 11
		Если Конф = "УТ11"
			//Добавим КА2 и ERP
			Или Конф = "КА2" Или Конф = "ERP" Тогда
			
			МодульУчетНДСУП = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("УчетНДСУП");
			
			//Обрабатываем заполнение условий продаж/закупок в зависимости от типа документа
			Если ТипСоздаваемогоДокумента = "ЗаказКлиента" Тогда
				
				Если Не ЗначениеЗаполнено(ДокументОбъект.ХозяйственнаяОперация)
					И РеквизитСуществует("Перечисления","ХозяйственныеОперации","РеализацияКлиенту") Тогда
						ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
				КонецЕсли;
								
				Попытка
					ПараметрыЗаполнения = Документы.ЗаказКлиента.ПараметрыЗаполненияНалогообложенияНДСПродажи(ДокументОбъект);
					
					Если МодульУчетНДСУП <> Неопределено Тогда
						МодульУчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(ДокументОбъект.НалогообложениеНДС, ПараметрыЗаполнения);
					КонецЕсли;
				Исключение
					// не обрабатываем это исключение
				КонецПопытки;
				
			ИначеЕсли ТипСоздаваемогоДокумента = "РеализацияТоваровУслуг" Тогда
				
				Если Не ЗначениеЗаполнено(ДокументОбъект.ХозяйственнаяОперация)
					И РеквизитСуществует("Перечисления","ХозяйственныеОперации","РеализацияКлиенту") Тогда
						ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
				КонецЕсли;
								
				Попытка
					ПараметрыЗаполнения = Документы.РеализацияТоваровУслуг.ПараметрыЗаполненияНалогообложенияНДСПродажи(ДокументОбъект);
					
					Если МодульУчетНДСУП <> Неопределено Тогда
						МодульУчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(ДокументОбъект.НалогообложениеНДС, ПараметрыЗаполнения);
					КонецЕсли;
				Исключение
					// не обрабатываем это исключение
				КонецПопытки;
				
			//E1C-337: ( Для документа ОтчетКомиссионера создаем договор с видом СКомиссионером
			ИначеЕсли ТипСоздаваемогоДокумента = "ОтчетКомиссионера" Тогда
				
				Попытка
					Если ЗначениеЗаполнено(ДанныеДокумента.СоглашениеСсылка) Тогда
						ДокументОбъект.ЗаполнитьУсловияПродажПоСоглашению();
					Иначе
						ДокументОбъект.ЗаполнитьУсловияПродажПоУмолчанию();
					КонецЕсли;
				Исключение
					//Не обрабатываем
				КонецПопытки;	
								
				Попытка
					ПараметрыЗаполнения = Документы.ОтчетКомиссионера.ПараметрыЗаполненияНалогообложенияНДСПродажи(ДокументОбъект);
					
					Если МодульУчетНДСУП <> Неопределено Тогда
						МодульУчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(ДокументОбъект.НалогообложениеНДС, ПараметрыЗаполнения);
					КонецЕсли;
				Исключение
					// не обрабатываем это исключение
				КонецПопытки;
				
			ИначеЕсли ТипСоздаваемогоДокумента = "ЗаказПоставщику" Тогда
				
				Если Не ЗначениеЗаполнено(ДокументОбъект.ХозяйственнаяОперация)
					И РеквизитСуществует("Перечисления","ХозяйственныеОперации","ЗакупкаУПоставщика") Тогда
						ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
				КонецЕсли;
								
				Попытка
					ПараметрыЗаполнения = Документы.ЗаказПоставщику.ПараметрыЗаполненияНалогообложенияНДСЗакупки(ДокументОбъект);
					
					Если МодульУчетНДСУП <> Неопределено Тогда
						МодульУчетНДСУП.ЗаполнитьНалогообложениеНДСЗакупки(ДокументОбъект.НалогообложениеНДС, ПараметрыЗаполнения);
						МодульУчетНДСУП.ЗаполнитьВидДеятельностиНДС(ДокументОбъект.ЗакупкаПодДеятельность, ПараметрыЗаполнения);
					КонецЕсли;
				Исключение
					// не обрабатываем это исключение
				КонецПопытки;
				
			ИначеЕсли ТипСоздаваемогоДокумента = "ПриобретениеУслугПрочихАктивов" Тогда
				
				Если Не ЗначениеЗаполнено(ДокументОбъект.ХозяйственнаяОперация)
					И РеквизитСуществует("Перечисления","ХозяйственныеОперации","ЗакупкаУПоставщика") Тогда
						ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
				КонецЕсли;
								
				Попытка
					ПараметрыЗаполненияНалогообложения = Документы.ПриобретениеУслугПрочихАктивов.ПараметрыЗаполненияНалогообложенияНДСЗакупки(ДокументОбъект);
					ПараметрыЗаполненияВидаДеятельности = Документы.ПриобретениеУслугПрочихАктивов.ПараметрыЗаполненияВидаДеятельностиНДС(ДокументОбъект);
					
					Если МодульУчетНДСУП <> Неопределено Тогда
						МодульУчетНДСУП.ЗаполнитьНалогообложениеНДСЗакупки(ДокументОбъект.НалогообложениеНДС, ПараметрыЗаполненияНалогообложения);
						МодульУчетНДСУП.ЗаполнитьВидДеятельностиНДС(ДокументОбъект.ЗакупкаПодДеятельность, ПараметрыЗаполненияВидаДеятельности);
					КонецЕсли;
				Исключение
					// не обрабатываем это исключение
				КонецПопытки;
				
			//E1C-248: 	
			ИначеЕсли ТипСоздаваемогоДокумента = "СписаниеБезналичныхДенежныхСредств" Тогда
				
				Если Не ЗначениеЗаполнено(ДокументОбъект.ХозяйственнаяОперация)
					И РеквизитСуществует("Перечисления","ХозяйственныеОперации","ОплатаПоставщику") Тогда
					ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику;
				КонецЕсли;
								
				Попытка
					ПараметрыЗаполненияНалогообложения = Документы.СписаниеБезналичныхДенежныхСредств.ПараметрыЗаполненияНалогообложенияНДСЗакупки(ДокументОбъект);
					
					Если МодульУчетНДСУП <> Неопределено Тогда
						МодульУчетНДСУП.ЗаполнитьНалогообложениеНДСЗакупки(ДокументОбъект.НалогообложениеНДС, ПараметрыЗаполненияНалогообложения);
					КонецЕсли;
				Исключение
					// не обрабатываем это исключение
				КонецПопытки;
				
			//2021.11.14 (	
			ИначеЕсли ТипСоздаваемогоДокумента = "ЗаявкаНаРасходованиеДенежныхСредств" Тогда
				
				Если Не ЗначениеЗаполнено(ДокументОбъект.ХозяйственнаяОперация)
					И РеквизитСуществует("Перечисления","ХозяйственныеОперации","ОплатаПоставщику") Тогда
					ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику;
				КонецЕсли;
								
				Попытка
					ПараметрыЗаполненияНалогообложения = Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПараметрыЗаполненияНалогообложенияНДСЗакупки(ДокументОбъект);
					
					Если МодульУчетНДСУП <> Неопределено Тогда
						МодульУчетНДСУП.ЗаполнитьНалогообложениеНДСЗакупки(ДокументОбъект.НалогообложениеНДС, ПараметрыЗаполненияНалогообложения);
					КонецЕсли;
				Исключение
					// не обрабатываем это исключение
				КонецПопытки;
				
			ИначеЕсли ТипСоздаваемогоДокумента = "ЗаказНаВнутреннееПотребление" Тогда
				Если Не ЗначениеЗаполнено(ДокументОбъект.ХозяйственнаяОперация) Тогда
					СтруктураЗаполнения.Вставить("ХозяйственнаяОперация",ДокументОбъект.Метаданные().Реквизиты.ХозяйственнаяОперация.ЗначениеЗаполнения);
				КонецЕсли;
				
			ИначеЕсли ТипСоздаваемогоДокумента = "ЗаказНаПеремещение" Тогда
				Если Не ЗначениеЗаполнено(ДокументОбъект.ХозяйственнаяОперация) Тогда
					СтруктураЗаполнения.Вставить("ХозяйственнаяОперация",ДокументОбъект.Метаданные().Реквизиты.ХозяйственнаяОперация.ЗначениеЗаполнения);
				КонецЕсли;
			// ) 2021.11.14
			
			Иначе
				//Общий исходный вариант обработки
				Попытка
					Если НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
						
						Если РеквизитСуществует("Документы",ТипСоздаваемогоДокумента,"ХозяйственнаяОперация") Тогда
							Если Не ЗначениеЗаполнено(ДокументОбъект.ХозяйственнаяОперация)
								И РеквизитСуществует("Перечисления","ХозяйственныеОперации","ЗакупкаУПоставщика") Тогда
								ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
							КонецЕсли;
						КонецЕсли;
						
						Попытка
							Если ЗначениеЗаполнено(ДанныеДокумента.СоглашениеСсылка) Тогда
								ДокументОбъект.ЗаполнитьУсловияЗакупокПоСоглашению(Ложь);
							Иначе
								ДокументОбъект.ЗаполнитьУсловияЗакупокПоУмолчанию(Ложь);
							КонецЕсли;
						Исключение
							//Не обрабатываем
						КонецПопытки;
						
					Иначе
						
						Если РеквизитСуществует("Документы",ТипСоздаваемогоДокумента,"ХозяйственнаяОперация") Тогда
							Если Не ЗначениеЗаполнено(ДокументОбъект.ХозяйственнаяОперация)
								И РеквизитСуществует("Перечисления","ХозяйственныеОперации","РеализацияКлиенту") Тогда
								ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
							КонецЕсли;
						КонецЕсли;
						
						Попытка
							Если ЗначениеЗаполнено(ДанныеДокумента.СоглашениеСсылка) Тогда
								ДокументОбъект.ЗаполнитьУсловияПродажПоСоглашению();
							Иначе
								ДокументОбъект.ЗаполнитьУсловияПродажПоУмолчанию();
							КонецЕсли;
						Исключение
							//Не обрабатываем
						КонецПопытки;
						
					КонецЕсли;
				Исключение
					// не обрабатываем это исключение
				КонецПопытки;
				
			КонецЕсли;
			
			//Авансовый отчет по данным чека оформляем как ПТиУ с видом операции ЗакупкаЧерезПодотчетноеЛицо
			Если ДанныеДокумента.type = "RECEIPT" Тогда
				Если РеквизитСуществует("Документы",ТипСоздаваемогоДокумента,"ХозяйственнаяОперация") Тогда
					Если Не ЗначениеЗаполнено(ДокументОбъект.ХозяйственнаяОперация)
						И РеквизитСуществует("Перечисления","ХозяйственныеОперации","ЗакупкаЧерезПодотчетноеЛицо") Тогда
						СтруктураЗаполнения.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ТипСоздаваемогоДокумента = "ОтчетОРозничныхПродажах" Тогда
				Попытка	ПартнерРозничныйПокупатель = Справочники.Партнеры.РозничныйПокупатель; Исключение; КонецПопытки;
			КонецЕсли;
			
			ВидЦеныПоставщика = УТ11_ПолучитьВидЦеныПоставщика(СтруктураЗаполнения.ТипЦен,ДокументОбъект);
		КонецЕсли;
				
		//2019.03.25 ( модуль кастомизации
		РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Документ_ПослеЗаполненияШапки",ПараметрыМК);
		// ) 2019.03.25

		//2022.04.04 ( Для некоторых документов заполнение табличной части не требуется, не выводим сообщение об ошибке
		ТребуетсяЗаполнениеТЧ = Истина;
		// ) 2022.04.04
		
		//2022.10.26 ( При заполнении Требования-накладной если в табличной части пользователь  определил различные статьи затрат,
		//установим флаг СчетаУчетаЗатратВТаблице для документа
		ТребованиеНакладная_СтатьяЗатратТЧ = Неопределено;
		ТребованиеНакладная_СчетаУчетаЗатратВТаблице = Ложь;
		// ) 2022.10.26
		
		//Формируем ссылку на новый присоединенный файл для табличной части, который передаем в функционал присоединения файлов.
		//Не имея возможности определить, какой файл относится к каждой из строк, ссылку указываем для всех строк табличной части.
		НоваяСсылкаПервыйПрисоединенныйФайл = Неопределено;
		
		СтрокиДопРасходов = Новый Массив;
		
		// 2020.09.01 (  добавлены документы без таблицы номенклатуры
		ИспользуетсяНоменклатура = РеквизитОбъект.ЗаполняемыйДокумент_ИспользуетсяНоменклатура(ТипСоздаваемогоДокумента,СтруктураНастроек);
		
		Если ИспользуетсяНоменклатура Тогда
		// ) 2020.09.01
		
			//Табличная часть для товаров/запасов
			Если ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено Тогда
				ИмяТЧТовары = "Товары";		
			ИначеЕсли ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("Запасы") <> Неопределено Тогда
				ИмяТЧТовары = "Запасы";
			ИначеЕсли ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("РаботыИУслуги") <> Неопределено Тогда
				ИмяТЧТовары = "РаботыИУслуги";
			//2024.07.17 (БГУ
			ИначеЕсли Конф = "УНФ" И ТипСоздаваемогоДокумента = "СборкаЗапасов" Тогда
				ИмяТЧТовары = "Материалы";
			// ) 2024.07.17
			//2019.08.05 (БГУ
			ИначеЕсли Конф = "БГУ2" И ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("Материалы") <> Неопределено Тогда
				ИмяТЧТовары = "Материалы";
			// ) 2019.08.05
			// 2021.03.16 ( предположительно, Управление IT-отделом
			ИначеЕсли ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("Номенклатура") <> Неопределено Тогда
				ИмяТЧТовары = "Номенклатура";
			// ) 2021.03.16
			// 2021.11.25 ( а можно анализировать и сам тип создаваемого документа
			ИначеЕсли ТипСоздаваемогоДокумента = "ТребованиеНакладная" И ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("Материалы") <> Неопределено Тогда
				ИмяТЧТовары = "Материалы";
			// ) 2021.11.25
			Иначе
				ИмяТЧТовары = Неопределено;
			КонецЕсли;
			
			//Табличная часть для услуг/работ
			Если ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("Услуги") <> Неопределено Тогда
				ИмяТЧУслуги = "Услуги";		
			ИначеЕсли ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("Расходы") <> Неопределено Тогда
				ИмяТЧУслуги = "Расходы";
			ИначеЕсли ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("РаботыИУслуги") <> Неопределено Тогда
				ИмяТЧУслуги = "РаботыИУслуги";
				ИначеЕсли ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("УслугиИРаботы") <> Неопределено Тогда
				ИмяТЧУслуги = "УслугиИРаботы";
			ИначеЕсли ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("Прочее") <> Неопределено Тогда
				ИмяТЧУслуги = "Прочее";
			Иначе
				ИмяТЧУслуги = Неопределено;
			КонецЕсли;
			
			//E1C-257: Табличная часть Агентские услуги
			Если ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("АгентскиеУслуги") <> Неопределено Тогда
				ИмяТЧАгентскиеУслуги = "АгентскиеУслуги";
			Иначе
				ИмяТЧАгентскиеУслуги = ИмяТЧУслуги;
			КонецЕсли;
			
			// 2019.11.28 ( ERP, КА: Авансовый отчет
			Если ТипСоздаваемогоДокумента = "АвансовыйОтчет" Тогда
				Если (Конф = "УТ11" Или Конф = "ERP" Или Конф = "КА2") Тогда
					ИмяТЧТовары = "ПрочиеРасходы";
					ИмяТЧУслуги = "ПрочиеРасходы";
					
				ИначеЕсли Конф = "БП30" Тогда
					ИмяТЧУслуги = "Прочее";
					
					//2023.05.04 ( Если заполняем Авансовый отчет с видом операции Командировка - используется табличная часть Прочее
					Если РеквизитСуществует("Перечисления","ВидыОперацийАвансовыйОтчет","Командировка")
						И СтруктураЗаполнения.ВидОперации = Перечисления.ВидыОперацийАвансовыйОтчет.Командировка Тогда
						ИмяТЧТовары = "Прочее";
					КонецЕсли;				
					
				КонецЕсли;
			// ) 2019.11.28
			
			//2023.08.01 (	
			ИначеЕсли ТипСоздаваемогоДокумента = "ПоступлениеТоваровУслуг"
				И РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","Оборудование")
				И СтруктураЗаполнения.Свойство("ВидОперации") И СтруктураЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
				ИмяТЧТовары = "Оборудование";
				ИмяТЧУслуги = "Услуги";
			// ) 2023.08.01
			
			ИначеЕсли ТипСоздаваемогоДокумента = "ПоступлениеТоваровУслуг"
				И РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","ОсновныеСредства")
				И СтруктураЗаполнения.Свойство("ВидОперации") И СтруктураЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОсновныеСредства Тогда
				
				Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
					ИмяТЧТовары = "ОС";
				Иначе
					ИмяТЧТовары = "ОсновныеСредства";
				КонецЕсли;
				
				ИмяТЧУслуги = "Услуги";
				
				//Склад в этом случае не заполняем?
				ДокументОбъект.Склад = Неопределено;
			
			//2020.01.31 (БП30: Поступление в лизинг
			ИначеЕсли ТипСоздаваемогоДокумента = "ПоступлениеВЛизинг"
				Или ТипСоздаваемогоДокумента = "ПоступлениеВАренду" Тогда
				ИмяТЧТовары = "ПредметыЛизинга";
				ИмяТЧУслуги = "ПредметыЛизинга";
			// ) 2020.01.31
			
			// 2023.06.06 (
			ИначеЕсли ТипСоздаваемогоДокумента = "ПоступлениеУслугПоАренде" Тогда
				ИмяТЧТовары = "Начисления";
				ИмяТЧУслуги = "Начисления";
			// ) 2023.06.06
			
			// 2024.08.30 (
			ИначеЕсли ТипСоздаваемогоДокумента = "РеализацияУслугПоПереработке" Тогда
				ИмяТЧТовары = "МатериалыЗаказчика";
				ИмяТЧУслуги = "МатериалыЗаказчика";
			// ) 2024.08.30
			
			//2021.10.07 (БП30: Выпуск продукции (Отчет производства)
			ИначеЕсли ТипСоздаваемогоДокумента = "ОтчетПроизводстваЗаСмену" Тогда
				//E1C-524: Табличной части Материалы может не быть
				Если РеквизитСуществует("Документы","ОтчетПроизводстваЗаСмену",,"Материалы") Тогда
					ИмяТЧТовары = "Материалы";
				Иначе
					ИмяТЧТовары = "Продукция";
				КонецЕсли;
				ИмяТЧУслуги = "Услуги";
			// ) 2021.10.07
			
			//2024.12.03 (БП30: ВыплатыСамозанятым
			ИначеЕсли ТипСоздаваемогоДокумента = "ВыплатыСамозанятым" Тогда
				ИмяТЧТовары = "Выплаты";
				ИмяТЧУслуги = "Выплаты";
			// ) 2021.10.07
			
			//2023.07.06 ( БГУ2
			ИначеЕсли ТипСоздаваемогоДокумента = "РегистрацияОбязательствИСведенийПоДоговорам" Тогда
				ИмяТЧТовары = "РасшифровкаОбязательстваБюджет";
				ИмяТЧУслуги = "РасшифровкаОбязательстваБюджет";
			// ) 2023.07.06
			
			//2023.02.02 ( БСО
			ИначеЕсли ТипСоздаваемогоДокумента = "ИмпПриемкаСтроительныхРаботУслуг"
				Или ТипСоздаваемогоДокумента = "ИмпРеализацияСтроительныхРаботУслуг" Тогда
				ИмяТЧТовары = "Услуги";
				ИмяТЧУслуги = "Услуги";
			// ) 2023.02.02
			
			//2022.04.04
			ИначеЕсли ТипСоздаваемогоДокумента = "бит_ЗаявкаНаРасходованиеСредств" Тогда
				ТребуетсяЗаполнениеТЧ = Ложь;
			// ) 2022.04.04
			
			//2023.04.12 (Уже заполнили РасшифровкуПлатежа ранее при проверке типа документа
			ИначеЕсли ТипСоздаваемогоДокумента = "ПриходныйКассовыйОрдер" Тогда
				ТребуетсяЗаполнениеТЧ = Ложь;
			// ) 2023.04.12
			
			КонецЕсли;
			
			
			//2022.03.01 ( Пользователю теперь доступно изменение заполняемой табличной части
			Если ЗначениеЗаполнено(ДанныеДокумента.ИмяТабличнойЧасти) Тогда
				ИмяТЧТовары = ДанныеДокумента.ИмяТабличнойЧасти;
				ИмяТЧУслуги = ДанныеДокумента.ИмяТабличнойЧасти;
				ОписаниеСобытия = ?(ДанныеДокумента.ВидОперацииПринудительно = Истина,"Установлено Видом операции","Выбрано пользовательское")
					+ " значение ТЧ <" + ДанныеДокумента.ИмяТабличнойЧасти
					+ "> для документа <" + ТипСоздаваемогоДокумента + "> (" + ДокументИД + "): " + ОписаниеОшибки();
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
			КонецЕсли;
			// ) 2022.03.01
						
			//Самопроверка: сообщим, если номенклатуру некуда заполнять
			Если ИмяТЧТовары = Неопределено И ИмяТЧУслуги = Неопределено И ТребуетсяЗаполнениеТЧ Тогда
				СообщитьСообщение("Внутренняя ошибка модуля: при заполнении документа с типом " + МенеджерОбъекта + " не удалось определить табличную часть для заполнения.");
			КонецЕсли;
			
			Если ДокументОбъект.Метаданные().Реквизиты.Найти("Склад") <> Неопределено Тогда
				СкладДляТабличнойЧасти = ДокументОбъект.Склад;
			ИначеЕсли ДокументОбъект.Метаданные().Реквизиты.Найти("СтруктурнаяЕдиница") <> Неопределено Тогда 
				СтруктурнаяЕдиницаДляТабличнойЧасти = ДокументОбъект.СтруктурнаяЕдиница;
			
			//E1C-347: Склад для табличной части заполняем независимо от наличия реквизита в шапке
			Иначе
				СкладДляТабличнойЧасти = ДанныеДокумента.СкладСсылка;
				СтруктурнаяЕдиницаДляТабличнойЧасти = ДанныеДокумента.СкладСсылка;
				
			КонецЕсли;
			
			//заполнение счетов учета в документах
			СчетаУчетаВДокументах_ЗаполнениеВыполнено = Ложь;
			МодульСчетаУчетаВДокументах = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("СчетаУчетаВДокументах");
			
			Для Каждого СтрокаНоменклатуры Из ДанныеНоменклатуры Цикл
				
				//2019.03.25 ( модуль кастомизации
				ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
				ПараметрыМК.Вставить("СтрокаНоменклатуры",СтрокаНоменклатуры);
				
				РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Документ_ПередЗаполнениемСтрокиТЧ",ПараметрыМК);
				
				Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
				// ) 2019.03.25
				
				    //Номенклатура, которую пользователь пометил как доп. расход, не попадает в основной документ
					Если СтрокаНоменклатуры.ПеренестиНаДопРасходы = Истина Тогда
						СтрокиДопРасходов.Добавить(СтрокаНоменклатуры);
						Продолжить;
					КонецЕсли;
					
					//Определяем услуга/товар
					ЭтоУслуга = Ложь;
					Если ЗначениеЗаполнено(СтрокаНоменклатуры.НоменклатураСсылка) Тогда
						Если Метаданные.Справочники.Номенклатура.Реквизиты.Найти("Услуга") <> Неопределено Тогда
							ЭтоУслуга = СтрокаНоменклатуры.НоменклатураСсылка.Услуга;
						ИначеЕсли Метаданные.Справочники.Номенклатура.Реквизиты.Найти("ТипНоменклатуры") <> Неопределено Тогда
							Если РеквизитСуществует("Перечисления","ТипыНоменклатуры","Услуга") Тогда
								ЭтоУслуга = СтрокаНоменклатуры.НоменклатураСсылка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
									
					НоменклатураУслуга = ИмяТЧУслуги <> Неопределено И ЭтоУслуга = Истина;
					
					//E1C-257: Табличная часть Агентские услуги
					Если СтрокаНоменклатуры.ЭтоАгентскаяУслуга = Истина И ИмяТЧАгентскиеУслуги <> Неопределено Тогда
						НоваяСтрока = ДокументОбъект[ИмяТЧАгентскиеУслуги].Добавить();
					
					ИначеЕсли НоменклатураУслуга Или ИмяТЧТовары = Неопределено Тогда
						
						//2019.08.26 ( пропускаем заполнение табличной части, если не определили табличных частей
						Если ИмяТЧУслуги = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						// ) 2019.08.26
						
						НоваяСтрока = ДокументОбъект[ИмяТЧУслуги].Добавить();
					Иначе
						НоваяСтрока = ДокументОбъект[ИмяТЧТовары].Добавить();
					КонецЕсли;
								
					СтруктураТовар = Новый Структура;
					СтруктураТовар.Вставить("Номенклатура",СтрокаНоменклатуры.НоменклатураСсылка);
					СтруктураТовар.Вставить("ЕдиницаИзмерения",СтрокаНоменклатуры.ЕдиницаИзмеренияСсылка);
					СтруктураТовар.Вставить("Коэффициент",1);
					
					//E1C-407: Теперь у нас может заполняться поступление Основных средств
					СтруктураТовар.Вставить("ОсновноеСредство",СтрокаНоменклатуры.ОсновноеСредствоСсылка);
					СтруктураТовар.Вставить("ИнвентарныйНомер",СтрокаНоменклатуры.ИнвентарныйНомер);
					СтруктураТовар.Вставить("СрокПолезногоИспользования",СтрокаНоменклатуры.СрокСлужбы);
					
					Если ЗначениеЗаполнено(СтрокаНоменклатуры.ОсновноеСредствоСсылка) Тогда
						Если Не ЗначениеЗаполнено(СтрокаНоменклатуры.ИнвентарныйНомер) Тогда
							СтруктураТовар.Вставить("ИнвентарныйНомер", 
							?(СтрокаНоменклатуры.ОсновноеСредствоСсылка.ЕдиницаУчета = Перечисления.ЕдиницыУчетаОС.ГрупповойОбъект,
								"", СтрокаНоменклатуры.ОсновноеСредствоСсылка.Код));
						КонецЕсли;
					КонецЕсли;
					
					//2023.09.22 ( Доверенность БП30 для Казахстана
					Если ТипСоздаваемогоДокумента = "Доверенность" Тогда
						СтруктураТовар.Вставить("НаименованиеТовара",СтрокаНоменклатуры.НоменклатураСсылка);
						СтруктураТовар.Вставить("ЕдиницаПоКлассификатору",СтрокаНоменклатуры.ЕдиницаИзмеренияСсылка);
					КонецЕсли;
					// ) 2023.09.22
					
					//2023.03.10 ( Упаковка единиц измерения для УТ11-подобных конфигураций заполняется в табличной части
					//только в том случае, когда она отличается от единицы хранения Номенклатуры
					//Ниже выполняется пересчет количества из количества упаковок в зависимости от наличия ключа "Упаковка" в СтруктураТовар!
					Если Конф = "УТ11" Или Конф = "КА2" Или Конф = "ERP" Тогда
						Если ЗначениеЗаполнено(СтрокаНоменклатуры.НоменклатураСсылка)
							И СтрокаНоменклатуры.НоменклатураСсылка.ЕдиницаИзмерения <> СтрокаНоменклатуры.ЕдиницаИзмеренияСсылка Тогда
							СтруктураТовар.Вставить("Упаковка",СтрокаНоменклатуры.ЕдиницаИзмеренияСсылка);
						КонецЕсли;
					КонецЕсли;
					// ) 2023.03.10
					
					//2020.01.13 ( добавлены характеристики
					СтруктураТовар.Вставить("Характеристика",СтрокаНоменклатуры.ХарактеристикаСсылка);
					СтруктураТовар.Вставить("ХарактеристикаНоменклатуры",СтрокаНоменклатуры.ХарактеристикаСсылка);
					// ) 2020.01.13
					
					//2020.05.26 ( добавлена Номенклатура поставщика
					СтруктураТовар.Вставить("НоменклатураПоставщика",СтрокаНоменклатуры.НоменклатураПоставщикаСсылка);
					СтруктураТовар.Вставить("НоменклатураПартнера",СтрокаНоменклатуры.НоменклатураПоставщикаСсылка);
					// ) 2020.05.26
					
					//E1C-291: Объект для строки Номенклатуры
					Если ЗначениеЗаполнено(СтрокаНоменклатуры.ОбъектСсылка) Тогда
						СтруктураТовар.Вставить("Объект",СтрокаНоменклатуры.ОбъектСсылка);
					КонецЕсли;
					
					//2019.08.01 ( Используем КоэффициентПересчета если включен флаг в настройках
					ИспользоватьКоэффициентПересчета = СтруктураНастроек.ЗаполнениеТЧ_ИспользоватьКоэффициентПересчета = Истина;
					КоэффициентПересчета = ?(ТипЗнч(СтрокаНоменклатуры.КоэффициентПересчета) = Тип("Число"),СтрокаНоменклатуры.КоэффициентПересчета,1);
					
					Если ИспользоватьКоэффициентПересчета Тогда
						quantity = СтрокаНоменклатуры.quantity * КоэффициентПересчета;
					Иначе
						quantity = СтрокаНоменклатуры.quantity;
					КонецЕсли;
					
					СтруктураТовар.Вставить("Количество",quantity);
					СтруктураТовар.Вставить("КоличествоУпаковок",quantity);
					СтруктураТовар.Вставить("КоличествоЕдиницИзмерения",quantity);
					// ) 2019.08.01
					
					//2025.10.15 ( При выбранной упаковке количество единиц может отличаться и расчитывается
					//в зависимости от коэффициента упаковки, вызовем стандартный пересчет.
					Если МодульОбработкаТабличнойЧастиКлиентСервер <> Неопределено Тогда
						Если СтруктураТовар.Свойство("Упаковка") Тогда
							СтруктураДействий = Новый Структура("ПересчитатьКоличествоЕдиниц");
							Попытка
								МодульОбработкаТабличнойЧастиКлиентСервер.ПересчитатьКоличествоЕдиницВСтрокеТЧ(СтруктураТовар,СтруктураДействий,КэшированныеЗначения);
							Исключение
								//Не обрабатываем
							КонецПопытки;
						КонецЕсли;
					КонецЕсли;
					// ) 2025.10.15
					
					Если УчитыватьНДС Тогда
						СтруктураТовар.Вставить("СуммаНДС",СтрокаНоменклатуры.vat);
						СтруктураТовар.Вставить("СтавкаНДС",СтрокаНоменклатуры.СтавкаНДССсылка);
					Иначе
						СтруктураТовар.Вставить("СуммаНДС",0);
						СтруктураТовар.Вставить("СтавкаНДС",СтруктураНастроек.СведенияОКонфигурации.СтавкиНДС.БезНДС);
					КонецЕсли;
					
					Если СуммаВключаетНДС
						// 2019.05.30 ( для НЕ-плательщиков НДС сразу ставим общую сумму и расчетную цену 
						Или УчитыватьНДС = Ложь Тогда
						// ) 2019.05.30
						
						Если quantity = 0 Тогда
							Цена = 0;
						Иначе
							Попытка Цена = СтрокаНоменклатуры.amount / quantity; Исключение Цена = 0; КонецПопытки;
						КонецЕсли;
						
						СтруктураТовар.Вставить("Цена",Цена);
						СтруктураТовар.Вставить("Сумма",СтрокаНоменклатуры.amount);
						
					Иначе
						
						Если ИспользоватьКоэффициентПересчета Тогда
							
							Если quantity = 0 Тогда
								Цена = 0;
							Иначе
								Цена = СтрокаНоменклатуры.price / КоэффициентПересчета;
							КонецЕсли;
							
						Иначе
							Цена = СтрокаНоменклатуры.price;
							
						КонецЕсли;
						
						СтруктураТовар.Вставить("Цена",Цена);
						СтруктураТовар.Вставить("Сумма",СтрокаНоменклатуры.amountWithoutVat);
						
					КонецЕсли;
							
					СтруктураТовар.Вставить("СуммаСНДС",СтрокаНоменклатуры.amount);
					СтруктураТовар.Вставить("Всего",СтрокаНоменклатуры.amount);
					
					СтруктураТовар.Вставить("СуммаТовара",СтрокаНоменклатуры.amount);
					
					//2019.09.30 ( БИТ:Строительство. Приходный ордер
					СтруктураТовар.Вставить("ЦенаБух",СтруктураТовар.Цена);
					СтруктураТовар.Вставить("СуммаБух",СтруктураТовар.Сумма);
					СтруктураТовар.Вставить("СуммаНДСБух",СтруктураТовар.СуммаНДС);
					// ) 2019.09.30
					
					СтруктураТовар.Вставить("Склад",СкладДляТабличнойЧасти);
					СтруктураТовар.Вставить("СтруктурнаяЕдиница",СтруктурнаяЕдиницаДляТабличнойЧасти); //УНФ
					
					СтруктураТовар.Вставить("СпособУчетаНДС",СтрокаНоменклатуры.СпособУчетаНДС);
					СтруктураТовар.Вставить("ПодразделениеЗатрат",СтрокаНоменклатуры.ПодразделениеЗатратСсылка);
					
					СтруктураТовар.Вставить("Подразделение",ДанныеДокумента.ПодразделениеСсылка);
					СтруктураТовар.Вставить("ПодразделениеОрганизации",ДанныеДокумента.ПодразделениеОрганизацииСсылка);
					
					//E1C-363: Направление деятельности для КА2
					Если ЗначениеЗаполнено(НаправлениеДеятельностиСсылка) Тогда
						СтруктураТовар.Вставить("НаправлениеДеятельности",НаправлениеДеятельностиСсылка);
					КонецЕсли;
					
					Если СтруктураНастроек.ЗаполнениеТЧ_ЗаполнятьДанныеГТД Тогда
						СтруктураТовар.Вставить("НомерГТД",СтрокаНоменклатуры.НомерГТДСсылка);
						Если ЗначениеЗаполнено(СтрокаНоменклатуры.НомерГТДСсылка) Тогда
							СтруктураТовар.Вставить("СтранаПроисхождения",СтрокаНоменклатуры.СтранаПроисхожденияСсылка);
						КонецЕсли;
					КонецЕсли;
					
					//E1C-477: Казахстан: 1С. БП 3.0 для КЗ. Работа с ЭСФ и Источником происхождения
					Если СтруктураНастроек.ЗаполнениеТЧ_ЗаполнятьДанныеИсточникПроисхождения = Истина Тогда
						СтруктураТовар.Вставить("НомерГТД",СтрокаНоменклатуры.ИсточникПроисхожденияСсылка);
					КонецЕсли;
					
					//расшифровка услуги из документа оказанных услуг
					Если СтруктураНастроек.ЗаполнениеТЧ_ОписаниеУслугиИзРаспознанногоДокумента = Истина Тогда
						СодержаниеУслуги = СтрокаНоменклатуры.name;
					ИначеЕсли ЗначениеЗаполнено(СтрокаНоменклатуры.НоменклатураСсылка) Тогда
						СодержаниеУслуги = СтрокаНоменклатуры.НоменклатураСсылка.НаименованиеПолное;
					Иначе
						СодержаниеУслуги = СтрокаНоменклатуры.name;
					КонецЕсли;
					
					Если ЭтоУслуга Тогда
						//расшифровка услуги из документа оказанных услуг
						СтруктураТовар.Вставить("Содержание",СодержаниеУслуги);
					КонецЕсли;
					
					Если НоменклатураУслуга Тогда
						Если ЗначениеЗаполнено(СтрокаНоменклатуры.СчетУчетаСсылка) Тогда
							СтруктураТовар.Вставить("СчетЗатрат",СтрокаНоменклатуры.СчетУчетаСсылка);
						КонецЕсли;
						
					Иначе
						Если ЗначениеЗаполнено(СтрокаНоменклатуры.СчетУчетаСсылка) Тогда
							СтруктураТовар.Вставить("СчетУчета",СтрокаНоменклатуры.СчетУчетаСсылка);
							//2021.12.09 ( Требование-накладная
							СтруктураТовар.Вставить("Счет",СтрокаНоменклатуры.СчетУчетаСсылка);
							// ) 2021.12.09
						КонецЕсли;
						
					КонецЕсли;
					
					//2020.10.07 ( 
					Если ТипСоздаваемогоДокумента = "ПриобретениеУслугПрочихАктивов" Тогда
						СтруктураТовар.Вставить("Содержание",СодержаниеУслуги);
					КонецЕсли;
					// ) 2020.10.07
					
					//2023.06.06 (
					Если ТипСоздаваемогоДокумента = "ПоступлениеУслугПоАренде" Тогда
						СтруктураТовар.Вставить("Содержание",СодержаниеУслуги);
						Если РеквизитСуществует("Перечисления","ТипыПлатежейПоАренде","УслугаПоАренде") Тогда
							СтруктураТовар.Вставить("ТипНачисления",Перечисления.ТипыПлатежейПоАренде.УслугаПоАренде);
						КонецЕсли;
					КонецЕсли;
					// ) 2023.06.06
					
					//2020.11.26 ( у документа СчетНаОплатуПоставщика убрали табличную часть Услуги, теперь услуги указываем в Товарах
					Если ТипСоздаваемогоДокумента = "СчетНаОплатуПоставщика" И ЭтоУслуга
						И ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("Услуги") = Неопределено Тогда
						СтруктураТовар.Вставить("Содержание",СодержаниеУслуги);
					КонецЕсли;
					// ) 2020.11.26
					
					Если ЗначениеЗаполнено(СтрокаНоменклатуры.СчетУчетаНДССсылка) Тогда
						СтруктураТовар.Вставить("СчетУчетаНДС",СтрокаНоменклатуры.СчетУчетаНДССсылка);
					КонецЕсли;
					
					//УТ11: доступность поля Списать на расходы
					Если ЭтоУслуга Тогда
						СтруктураТовар.Вставить("СписатьНаРасходы",Истина);
					КонецЕсли;
									
					//2019.09.16 ( ОтражениеВУСН
					Если ЗначениеЗаполнено(СтруктураНастроек.ЗаполнениеТЧ_ОтражениеВУСН) Тогда
						СтруктураТовар.Вставить("ОтражениеВУСН",СтруктураНастроек.ЗаполнениеТЧ_ОтражениеВУСН);
					КонецЕсли;
					// ) 2019.09.16
							
					//Статью заполняем/подменяем только если заполнена в настройках
					Если ЗначениеЗаполнено(СтруктураНастроек.ЗаполнениеШапки_СтатьяДДСПоУмолчанию) Тогда
						СтруктураТовар.Вставить("СтатьяДвиженияДенежныхСредств",СтруктураНастроек.ЗаполнениеШапки_СтатьяДДСПоУмолчанию);
					КонецЕсли;
					
					//УТ, КА, ERP: Статьи расходов
					Если ЗначениеЗаполнено(СтрокаНоменклатуры.СтатьяРасходовСсылка) Тогда
						СтруктураТовар.Вставить("СтатьяРасходов",СтрокаНоменклатуры.СтатьяРасходовСсылка);
						
						Если Конф = "УТ11" Или Конф = "КА2" Или Конф = "ERP" Тогда
							
							Если ЗначениеЗаполнено(СтрокаНоменклатуры.АналитикаРасходовСсылка) Тогда
								СтруктураТовар.Вставить("АналитикаРасходов",СтрокаНоменклатуры.АналитикаРасходовСсылка);
								
							Иначе
								//Заполняем аналитику статей расходов
								АналитикаРасходов = Неопределено;
								
								//В типовую функцию передается Форма документа, у нас формы нет, сформируем структуру из реквизитов объекта документа
								СтруктураОбъектаДокумента = Новый Структура;
								Для Каждого РеквизитДокумента Из ДокументОбъект.Метаданные().Реквизиты Цикл
									ИмяРеквизита = РеквизитДокумента.Имя;
									СтруктураОбъектаДокумента.Вставить(ИмяРеквизита,ДокументОбъект[ИмяРеквизита]);
								КонецЦикла;
								
								Если ЗначениеЗаполнено(СтруктураТовар.ПодразделениеЗатрат) Тогда
									СтруктураТовар.Вставить("Подразделение",СтруктураТовар.ПодразделениеЗатрат);
									СтруктураОбъектаДокумента.Вставить("Подразделение",СтруктураТовар.ПодразделениеЗатрат);
								КонецЕсли;
								
								Попытка							
									АналитикаРасходов = ПланыВидовХарактеристик.СтатьиРасходов.ПолучитьАналитикуРасходовПоУмолчанию(СтрокаНоменклатуры.СтатьяРасходовСсылка,СтруктураОбъектаДокумента);
								Исключение;
									
									//Вызываемая экспортная функция ПланыВидовХарактеристик.СтатьиРасходов может присутствовать не во всех релизах конфигураций,
									//попробуем вызвать еще общий модуль ДоходыИРасходыКлиентСервер
									МодульДоходыИРасходыКлиентСервер = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("ДоходыИРасходыКлиентСервер");
									МодульДоходыИРасходыВызовСервераПовтИсп = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("ДоходыИРасходыВызовСервераПовтИсп");
									
									Если МодульДоходыИРасходыКлиентСервер <> Неопределено
										И МодульДоходыИРасходыВызовСервераПовтИсп <> Неопределено Тогда
										
										Попытка
											РеквизитыСтатьи = МодульДоходыИРасходыВызовСервераПовтИсп.ЗначенияРеквизитовСтатьи(СтрокаНоменклатуры.СтатьяРасходовСсылка);
											АналитикаРасходов = МодульДоходыИРасходыКлиентСервер.ПолучитьАналитикуПоУмолчанию(РеквизитыСтатьи,СтруктураОбъектаДокумента);
										Исключение
											//Не обрабатываем
										КонецПопытки;
									КонецЕсли;
									
								КонецПопытки;
								
								Если ЗначениеЗаполнено(АналитикаРасходов) Тогда
									СтруктураТовар.Вставить("АналитикаРасходов",АналитикаРасходов);
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
					//2021.11.14 (ERP: Заполняем реквизиты табличной части
					Если ТипСоздаваемогоДокумента = "ЗаказНаВнутреннееПотребление"
						Или ТипСоздаваемогоДокумента = "ЗаказНаПеремещение"
						
						//2024.08.15 ( Задача 268448: ЗаказКлиента
						Или ТипСоздаваемогоДокумента = "ЗаказКлиента" Тогда
						// ) 2024.08.15
						
						//вариант обеспечения
						Если РеквизитСуществует("Перечисления","ВариантыОбеспечения","Требуется") Тогда
							СтруктураТовар.Вставить("ВариантОбеспечения",Перечисления.ВариантыОбеспечения.Требуется);
							
						//2024.08.15 ( Задача 268448: ЗаказКлиента	
						ИначеЕсли РеквизитСуществует("Перечисления","ВариантыОбеспечения","Отгрузить") Тогда
							СтруктураТовар.Вставить("ВариантОбеспечения",Перечисления.ВариантыОбеспечения.Отгрузить);
						// ) 2024.08.15
						
						КонецЕсли;
					КонецЕсли;
					// ) 2021.11.14
					
					Если ЗначениеЗаполнено(ВидЦеныПоставщика) Тогда
						СтруктураТовар.Вставить("ВидЦеныПоставщика",ВидЦеныПоставщика);
					КонецЕсли;
					
					//Авансовый отчет
					НаименованиеВходящегоДокумента = СправочникиПортала.ТипДокумента.Получить(СтрокаНоменклатуры.type);
					СтруктураТовар.Вставить("ВидДокВходящий",НаименованиеВходящегоДокумента);
					СтруктураТовар.Вставить("НаименованиеВходящегоДокумента",НаименованиеВходящегоДокумента);
					СтруктураТовар.Вставить("НомерВходящегоДокумента",СтрокаНоменклатуры.number);
					СтруктураТовар.Вставить("ДатаВходящегоДокумента",СтрокаНоменклатуры.date);
					СтруктураТовар.Вставить("Поставщик",СтрокаНоменклатуры.Контрагент);
					
					//E1C-111: Если Авансовый отчет заполняется по счету-фактуре или УПД, устанавливаем признак ПредъявленСФ и его дату/номер
					Если СтрокаНоменклатуры.type = "UTD" Или СтрокаНоменклатуры.type = "VAT_INVOICE" Тогда
						СтруктураТовар.Вставить("ПредъявленСФ",Истина);
						СтруктураТовар.Вставить("ДатаСФ",СтрокаНоменклатуры.date);
						СтруктураТовар.Вставить("НомерСФ",СтрокаНоменклатуры.number);
					КонецЕсли;
					
					//2021.04.01 (
					Если ТипСоздаваемогоДокумента = "АвансовыйОтчет" Тогда
						
						СтруктураТовар.Вставить("Содержание",СодержаниеУслуги);
						СтруктураТовар.Вставить("Контрагент",СтрокаНоменклатуры.Контрагент);
						
						// Пользователь может выбрать табличную часть, содержащую Договор, например, ОплатаПоставщикам
						СтруктураТовар.Вставить("ДоговорКонтрагента",СтрокаНоменклатуры.ДоговорКонтрагента);
						СтруктураТовар.Вставить("Договор",СтрокаНоменклатуры.ДоговорКонтрагента);
						СтруктураТовар.Вставить("СуммаПлатежа",СтрокаНоменклатуры.amount);
						СтруктураТовар.Вставить("СуммаРасчетов",СтрокаНоменклатуры.amount);
						СтруктураТовар.Вставить("СуммаВзаиморасчетов",СтрокаНоменклатуры.amount);
						
						//2023.05.04 (
						Если Конф = "БП30"
							И РеквизитСуществует("Перечисления","ВидыОперацийАвансовыйОтчет","Командировка")
							И СтруктураЗаполнения.ВидОперации = Перечисления.ВидыОперацийАвансовыйОтчет.Командировка Тогда
														
							Если ДанныеДокумента.type = "RECEIPT" Тогда
								СтруктураТовар.Вставить("ВидДокументаРасхода",Перечисления.ВидыДокументовПодтверждающихКомандировочныеРасходы.Чек);
								
								//Дата и номер чека
								СтруктураТовар.Вставить("НомерДокументаОплаты",СтрокаНоменклатуры.number);
								СтруктураТовар.Вставить("ДатаДокументаОплаты",СтрокаНоменклатуры.date);
							Иначе
								СтруктураТовар.Вставить("ВидДокументаРасхода",Перечисления.ВидыДокументовПодтверждающихКомандировочныеРасходы.ДругойДокумент);
							КонецЕсли;
							
							//Содержимое документа помещаем в строковый реквизит ВидДокВходящий
							СтруктураТовар.Вставить("ВидДокВходящий",СодержаниеУслуги);
							
						КонецЕсли;
						// ) 2023.05.04
						
						//2025.07.27 ( Пользователь может выбрать произвольную табличную часть, содержащую скрытые реквизиты
						Если ИмяТЧТовары = "ОплатаПоставщикам" Или ИмяТЧУслуги = "ОплатаПоставщикам" Тогда
							СтруктураТовар.Вставить("КратностьВзаиморасчетов", КратностьВзаиморасчетов);
							СтруктураТовар.Вставить("КурсВзаиморасчетов", КурсВзаиморасчетов);
							
							Если РеквизитСуществует("Перечисления","СпособыПогашенияЗадолженности","Автоматически") Тогда
								СтруктураТовар.Вставить("СпособПогашенияЗадолженности",Перечисления.СпособыПогашенияЗадолженности.Автоматически);
							КонецЕсли;
						КонецЕсли;
						// ) 2025.07.27 
						
					КонецЕсли;
					// ) 2021.04.01
					
					
					//2022.01.21 ( для ВозвратТоваровОтПокупателя заполним себестоимость суммой
					Если ТипСоздаваемогоДокумента = "ВозвратТоваровОтПокупателя" Тогда
						//СтруктураТовар.Вставить("Себестоимость",СтруктураТовар.Сумма);
					КонецЕсли;
					// ) 2022.01.21
					
					//E1C-257: Табличная часть Агентские услуги
					Если СтрокаНоменклатуры.ЭтоАгентскаяУслуга = Истина И ИмяТЧАгентскиеУслуги <> Неопределено Тогда
						СтруктураТовар.Вставить("Контрагент",СтрокаНоменклатуры.КомитентСсылка);
						СтруктураТовар.Вставить("ДоговорКонтрагента",СтрокаНоменклатуры.ДоговорКомитентаСсылка);
						СтруктураТовар.Вставить("СчетРасчетов",СтрокаНоменклатуры.СчетУчетаСсылка);
					//2024.04.03 ( 995-874734:
					ИначеЕсли ЗначениеЗаполнено(СтрокаНоменклатуры.КомитентСсылка) И ЗначениеЗаполнено(СтрокаНоменклатуры.ДоговорКомитентаСсылка) Тогда
						СтруктураТовар.Вставить("Контрагент",СтрокаНоменклатуры.КомитентСсылка);
						СтруктураТовар.Вставить("ДоговорКонтрагента",СтрокаНоменклатуры.ДоговорКомитентаСсылка);
					// ) 2024.04.03 995-874734
					КонецЕсли;
					
					//2021.10.07 (
					Если ТипСоздаваемогоДокумента = "ОтчетПроизводстваЗаСмену"
						//2022.10.26 (
						Или ТипСоздаваемогоДокумента = "ТребованиеНакладная"
						// ) 2022.10.26
						//2023.04.23 (
						Или ТипСоздаваемогоДокумента = "ПоступлениеИзПереработки" Тогда
						// ) 2023.04.23
						
						СтруктураТовар.Вставить("НоменклатурнаяГруппа",СтрокаНоменклатуры.НоменклатурнаяГруппаСсылка);
						
						//Статья затрат
						СтруктураТовар.Вставить("СтатьяЗатрат");
						Если ЗначениеЗаполнено(СтрокаНоменклатуры.СтатьяЗатратСсылка) Тогда
						    СтруктураТовар.СтатьяЗатрат = СтрокаНоменклатуры.СтатьяЗатратСсылка;
							
						ИначеЕсли ЗначениеЗаполнено(СтрокаНоменклатуры.НоменклатураСсылка) Тогда
							Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
								//
							Иначе
								Если ЗначениеЗаполнено(СтрокаНоменклатуры.НоменклатураСсылка.СтатьяЗатрат) Тогда
									СтруктураТовар.СтатьяЗатрат = СтрокаНоменклатуры.НоменклатураСсылка.СтатьяЗатрат;
								КонецЕсли;
							КонецЕсли;							
						КонецЕсли;
						
						//2022.10.26 ( проверим наличие различных статей затрат в табличной части Материалы
						Если ЗначениеЗаполнено(ТребованиеНакладная_СтатьяЗатратТЧ) Тогда
							Если ЗначениеЗаполнено(СтруктураТовар.СтатьяЗатрат)
								И ТребованиеНакладная_СтатьяЗатратТЧ <> СтруктураТовар.СтатьяЗатрат Тогда
								ТребованиеНакладная_СчетаУчетаЗатратВТаблице = Истина;
							КонецЕсли;
						Иначе
							Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
								//
							Иначе
								ТребованиеНакладная_СтатьяЗатратТЧ = СтруктураТовар.СтатьяЗатрат;
							КонецЕсли;
						КонецЕсли;
						// ) 2022.10.26
						
						//2022.11.28 ( Счет затрат устанавливаем определенный конфигурацией, счет учета оставляем заданный пользователем
						Если ТипСоздаваемогоДокумента = "ТребованиеНакладная" Тогда
							Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
								//
							Иначе
								СтруктураТовар.Вставить("СчетЗатрат",ДокументОбъект.СчетЗатрат);
							КонецЕсли;
						КонецЕсли;
						// ) 2022.11.28
						
						//E1C-360: в Продукции заполняем Спецификацию из Номенклатуры
						Если ТипСоздаваемогоДокумента = "ОтчетПроизводстваЗаСмену"
							И (ИмяТЧТовары = "Продукция" Или ИмяТЧУслуги = "Продукция") Тогда
							
							Если ЗначениеЗаполнено(СтрокаНоменклатуры.НоменклатураСсылка)
								И РеквизитСуществует("Справочники","Номенклатура","ОсновнаяСпецификацияНоменклатуры") Тогда
								СтруктураТовар.Вставить("Спецификация",СтрокаНоменклатуры.НоменклатураСсылка.ОсновнаяСпецификацияНоменклатуры);
							КонецЕсли;
							
							//2024.02.09 (
							СтруктураТовар.Вставить("ПлановаяСтоимость",СтруктураТовар.Цена);
							СтруктураТовар.Вставить("СуммаПлановая",СтруктураТовар.Сумма);
							// ) 2024.02.09
						КонецЕсли;
												
					КонецЕсли;
					// ) 2021.10.07
					
					//E1C-327: Для документа ОтчетКомиссионераОПродажах заполняем ЦенаПередачи и СуммаПередачи
					Если ТипСоздаваемогоДокумента = "ОтчетКомиссионераОПродажах" Тогда
						СтруктураТовар.Вставить("ЦенаПередачи",СтруктураТовар.Цена);
						СтруктураТовар.Вставить("СуммаПередачи",СтруктураТовар.Сумма);
						
					//E1C-337: Для документа ОтчетКомиссионера заполняем ЦенаПередачи и СуммаПередачи
					ИначеЕсли ТипСоздаваемогоДокумента = "ОтчетКомиссионера" Тогда
						
						//2024.04.23 ( УНФ
						Если Конф = "УНФ" Тогда
							СтруктураТовар.Вставить("ЦенаПередачи",СтруктураТовар.Цена);
							СтруктураТовар.Вставить("СуммаПередачи",СтруктураТовар.Сумма);
						Иначе
						// ) 2024.04.23
						
							//E1C-355: 1С.КА: не заполнять значения колонок "Цена комитента, Сумма комитента, Сумма НДС Комитента, заполнять столбец "Сумма НДС".
							СтруктураТовар.Вставить("ЦенаПродажи",СтруктураТовар.Цена);
							СтруктураТовар.Вставить("СуммаПродажи",СтруктураТовар.Сумма);
							СтруктураТовар.Вставить("СуммаПродажиНДС",СтруктураТовар.СуммаНДС);
							
							СтруктураТовар.Вставить("Цена",0);
							СтруктураТовар.Вставить("Сумма",0);
							СтруктураТовар.Вставить("СуммаНДС",0);
							СтруктураТовар.Вставить("СуммаСНДС",0);
							
						КонецЕсли;
						
					КонецЕсли;
					
					
					//Расходы предпринимателя
					ДокументРасходаСтрокой = СтруктураТовар.ВидДокВходящий + " №" + СтруктураТовар.НомерВходящегоДокумента + " " + Формат(СтруктураТовар.ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy");
					СтруктураТовар.Вставить("ДокументРасхода",ДокументРасходаСтрокой);
					
					//E1C-457: Выплаты самозанятым
					Если ТипСоздаваемогоДокумента = "ВыплатыСамозанятым" Тогда
						
						//Документ не содержит данных о банковском счете, заполним его по данным 1с
						Если Не ЗначениеЗаполнено(СтруктураЗаполнения.БанковскийСчетКонтрагента) И ЗначениеЗаполнено(СтруктураЗаполнения.Контрагент) Тогда
							СтруктураЗаполнения.БанковскийСчетКонтрагента = СтруктураЗаполнения.Контрагент.ОсновнойБанковскийСчет;
						КонецЕсли;
						
						ДокументОбъект.УслугаВТаблице = Истина;						
						СтруктураТовар.Вставить("Содержание",СодержаниеУслуги);
						СтруктураТовар.Вставить("Контрагент",СтруктураЗаполнения.Контрагент);
						СтруктураТовар.Вставить("БанковскийСчет",СтруктураЗаполнения.БанковскийСчетКонтрагента);
												
						СтрокаСсылкаНаЧек = "https://lknpd.nalog.ru/api/v1/receipt/" + ДанныеДокумента.supplierInn
							+ "/" + ДанныеДокумента.number + "/print";
						СтруктураТовар.Вставить("СсылкаНаЧек",СтрокаСсылкаНаЧек);
						СтруктураТовар.Вставить("НомерЧека",ДанныеДокумента.number);
						
						//Формируем ссылку на новый присоединенный файл, который передаем в функционал присоединения файлов.
						//Не имея возможности определить, какой файл относится к каждой из строк, ссылку указываем для всех строк табличной части.
						Если СтруктураНастроек.СозданиеДокумента_ПрисоединятьФайлСканаДокумента = Истина Тогда
							Если Не ЗначениеЗаполнено(НоваяСсылкаПервыйПрисоединенныйФайл) Тогда
								НоваяСсылкаПервыйПрисоединенныйФайл = Справочники.ВыплатыСамозанятымПрисоединенныеФайлы.ПолучитьСсылку(Новый УникальныйИдентификатор);
							КонецЕсли;
							СтруктураТовар.Вставить("ЧекСамозанятого",НоваяСсылкаПервыйПрисоединенныйФайл);
						КонецЕсли;						
						
					КонецЕсли;
					
					//Отчет о розничных продажах
					Если ТипСоздаваемогоДокумента = "ОтчетОРозничныхПродажах" И ЗначениеЗаполнено(ПартнерРозничныйПокупатель) Тогда
						СтруктураТовар.Вставить("Партнер",ПартнерРозничныйПокупатель);
					КонецЕсли;
					
					//E1C-119: БГУ2: КПС, КФО, КЭК вынесены в форму сопоставления
					СтруктураТовар.Вставить("КПС",СтрокаНоменклатуры.КПССсылка);
					СтруктураТовар.Вставить("КФО",СтрокаНоменклатуры.КФОСсылка);
					СтруктураТовар.Вставить("КЭК",СтрокаНоменклатуры.КЭКСсылка);
					
					//E1C-383: только БП30 для Казахстана
					Если ЗначениеЗаполнено(СтрокаНоменклатуры.НДСВидПоступленияСсылка) Тогда
						СтруктураТовар.Вставить("НДСВидПоступления",СтрокаНоменклатуры.НДСВидПоступленияСсылка);
					КонецЕсли;
					
										
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураТовар);
					
					//E1C-327: Для документа ОтчетКомиссионераОПродажах своя схема заполнения счетов учета
					Если ТипСоздаваемогоДокумента = "ОтчетКомиссионераОПродажах" Тогда
						Если МодульБухгалтерскийУчетПереопределяемый <> Неопределено Тогда
							ДанныеОбъекта = Новый Структура(
								"Дата, Организация, СуммаВключаетНДС,
								|СпособРасчетаКомиссионногоВознаграждения, ПроцентКомиссионногоВознаграждения, СтавкаНДСВознаграждения,
								|ТипЦен, ВалютаДокумента, КурсВзаиморасчетов, КратностьВзаиморасчетов,РеализацияВЕАЭС, ВедетсяУчетНДСПоФЗ150,
								|Реализация, ПрименяютсяСтавки4и2, ДокументБезНДС, ВедетсяУчетПрослеживаемыхТоваров");
							ЗаполнитьЗначенияСвойств(ДанныеОбъекта, ДокументОбъект);
							
							//Дозаполним реквизиты, которые в конфигурации определяются в форме документа
							ДанныеОбъекта.Реализация = Истина;
							Если ЗначениеЗаполнено(СтруктураЗаполнения.ДоговорКонтрагента) Тогда
								РеквизитыДоговора = МодульБухгалтерскийУчетПереопределяемый.ПолучитьРеквизитыДоговораКонтрагента(СтруктураЗаполнения.ДоговорКонтрагента);
								ДанныеОбъекта.ПрименяютсяСтавки4и2 = РеквизитыДоговора.НДСПоСтавкам4и2;							
							Иначе
								ДанныеОбъекта.ПрименяютсяСтавки4и2 = Ложь;
							КонецЕсли;
														
							СведенияОНоменклатуре = МодульБухгалтерскийУчетПереопределяемый.ПолучитьСведенияОНоменклатуре(НоваяСтрока.Номенклатура, ДанныеОбъекта);
							Если СведенияОНоменклатуре <> Неопределено Тогда
								Документы.ОтчетКомиссионераОПродажах.ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(
									ДанныеОбъекта, НоваяСтрока, "Товары", СведенияОНоменклатуре);
							КонецЕсли;
						КонецЕсли;
					// ) E1C-327
					
					//E1C-524 (
					ИначеЕсли ТипСоздаваемогоДокумента = "ОтчетПроизводстваЗаСмену" 
						И Конф = "БП30" И СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
						Документы.ОтчетПроизводстваЗаСмену.ЗаполнитьСчетаУчетаВТабличнойЧасти(ДокументОбъект,"Продукция");
					// ) E1C-524
					Иначе
					
					
						//2020.08.20 ( построчное заполнение счетов учета в табличной части
						Если МодульСчетаУчетаВДокументах <> Неопределено Тогда
							ИмяТЧ = ?(НоменклатураУслуга,ИмяТЧУслуги,ИмяТЧТовары);
							Попытка
								МассивСтрок = Новый Массив;
								МассивСтрок.Добавить(НоваяСтрока);
								МодульСчетаУчетаВДокументах.ЗаполнитьСтроки(МассивСтрок, ИмяТЧ, ДокументОбъект, МенеджерОбъекта, Истина);
								//СчетаУчетаВДокументах_ЗаполнениеВыполнено = Истина;
							Исключение;
								ОписаниеСобытия = "Заполнение счетов учета <" + ТипСоздаваемогоДокумента + "> (" + ДокументИД + "): " + ОписаниеОшибки();
								ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"ЗаполнениеДокумента",ОписаниеСобытия,"Ошибка");
							КонецПопытки;
							
							//E1C-87: заполняем аналитику счета учета в структуре для заполнения строки табличной части
							Если ИмяТЧТовары = "ОсновныеСредства" Тогда
								//Для Основных средств ограничимся стандартным заполнением
							Иначе
								ЗаполнитьАналитикуСчетовУчета(НоваяСтрока,СтрокаНоменклатуры,ТипСоздаваемогоДокумента);				
							КонецЕсли;
							
						КонецЕсли;
						// ) 2020.08.20
					КонецЕсли;
					
				КонецЕсли;
				
				//2019.03.25 ( модуль кастомизации
				ПараметрыМК.Вставить("СтрокаТЧ",НоваяСтрока);
				ПараметрыМК.Вставить("СтруктураТовар",СтруктураТовар);
				РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Документ_ПослеЗаполненияСтрокиТЧ",ПараметрыМК);
				// ) 2019.03.25			
			КонецЦикла;
			
		КонецЕсли; //ИспользуетсяНоменклатура = Истина
		
		//2022.01.17 ( ЭтапыГрафикаОплаты заполняются исходя из суммы товаров табличной части,
		//на текущем этапе табличная часть Товары уже заполнена
		Если Конф = "УТ11" Или Конф = "КА2" Или Конф = "ERP" Тогда
			Попытка
				ДокументОбъект.ЗаполнитьЭтапыГрафикаОплаты();
			Исключение
				//Не обрабатываем
			КонецПопытки;
		КонецЕсли;
		// ) 2022.01.17
		
		//2022.10.26 ( Для требования-накладной установим признак счетов учета затрат в табличной части
		Если ТипСоздаваемогоДокумента = "ТребованиеНакладная"
			И ТребованиеНакладная_СчетаУчетаЗатратВТаблице = Истина Тогда
			ДокументОбъект.СчетаУчетаЗатратВТаблице = Истина;
		КонецЕсли;
		// ) 2022.10.26
		
		//БП30: Если в документе присутствуют услуги, то определим документу ВидОперации, соответствующий форме со вкладкой Услуги
		Операция = Новый Структура;
		ЕстьТовары = ИмяТЧТовары <> Неопределено И ДокументОбъект[ИмяТЧТовары].Количество() > 0;
		ЕстьУслуги = ИмяТЧУслуги <> Неопределено И ДокументОбъект[ИмяТЧУслуги].Количество() > 0;
		//E1C-545: добавил проверку на агентские услуги <> "Услуги", чтобы не срабатывало определение Вида операции Комиссия для обычных Услуг
		ЕстьАгентскиеУслуги = ИмяТЧАгентскиеУслуги <> Неопределено И ИмяТЧАгентскиеУслуги <> "Услуги" И ДокументОбъект[ИмяТЧАгентскиеУслуги].Количество() > 0;
		
		// 2020.12.07 ( Пользователь мог выбрать вид операции для документа самостоятельно, устанавливаем его значение
		Если ЗначениеЗаполнено(ПользовательскийВидОперации) Тогда
			СтруктураЗаполнения.Вставить("ВидОперации",ПользовательскийВидОперации);
		// ) 2020.12.07
			
		ИначеЕсли ТипСоздаваемогоДокумента = "ПоступлениеТоваровУслуг"
			Или ТипСоздаваемогоДокумента = "РеализацияТоваровУслуг" Тогда
			
			Если (ЕстьТовары И ЕстьУслуги) Или ЕстьАгентскиеУслуги Тогда
				Если НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
					Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","ПокупкаКомиссия") Тогда
						Операция.Вставить("ВидОперации",Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия);
					//E1C-545: в БП30.KAZ реквизит написан с опечаткой
					ИначеЕсли РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","ПокупкаКомисия") Тогда
						Операция.Вставить("ВидОперации",Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомисия);
					КонецЕсли;
				Иначе
					Если РеквизитСуществует("Перечисления","ВидыОперацийРеализацияТоваров","ПродажаКомиссия") Тогда
						Операция.Вставить("ВидОперации",Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия);
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли ЕстьУслуги Тогда
				//Только услуги
				Если НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
					Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","Услуги") Тогда
						Операция.Вставить("ВидОперации",Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Услуги);
					КонецЕсли;
				Иначе
					Если РеквизитСуществует("Перечисления","ВидыОперацийРеализацияТоваров","Услуги") Тогда
						Операция.Вставить("ВидОперации",Перечисления.ВидыОперацийРеализацияТоваров.Услуги);
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли ЕстьТовары Тогда
				//Только товары
				Если НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
					Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","Товары") Тогда
						Операция.Вставить("ВидОперации",Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Товары);
					КонецЕсли;
				Иначе
					Если РеквизитСуществует("Перечисления","ВидыОперацийРеализацияТоваров","Товары") Тогда
						Операция.Вставить("ВидОперации",Перечисления.ВидыОперацийРеализацияТоваров.Товары);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТипСоздаваемогоДокумента = "АвансовыйОтчет" Тогда
			Если РеквизитСуществует("Перечисления","ВидыОперацийАвансовыйОтчет","ПокупкаОплатаПрочее") Тогда
				Операция.Вставить("ВидОперации",Перечисления.ВидыОперацийАвансовыйОтчет.ПокупкаОплатаПрочее);
			КонецЕсли;
			
		ИначеЕсли ТипСоздаваемогоДокумента = "ПриходныйКассовыйОрдер" Тогда
			Если РеквизитСуществует("Перечисления","ВидыОперацийПКО","ОплатаПокупателя") Тогда
				Операция.Вставить("ВидОперации",Перечисления.ВидыОперацийПКО.ОплатаПокупателя);
			КонецЕсли;
			
		ИначеЕсли ТипСоздаваемогоДокумента = "ПлатежноеПоручение" Тогда
			Если РеквизитСуществует("Перечисления","ВидыОперацийСписаниеДенежныхСредств","ОплатаПоставщику") Тогда
				Операция.Вставить("ВидОперации",Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику);
			КонецЕсли;
			
		ИначеЕсли ТипСоздаваемогоДокумента = "ВозвратТоваровОтПокупателя" Тогда
			Если РеквизитСуществует("Перечисления","ВидыОперацийВозвратТоваровОтПокупателя","ПродажаКомиссия") Тогда
				Операция.Вставить("ВидОперации",Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.ПродажаКомиссия);
			ИначеЕсли РеквизитСуществует("Перечисления","ВидыОперацийВозвратТоваровОтПокупателя","Товары") Тогда
				Операция.Вставить("ВидОперации",Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.Товары);
			КонецЕсли;
			
		ИначеЕсли ТипСоздаваемогоДокумента = "ВозвратТоваровПоставщику" Тогда
			Если РеквизитСуществует("Перечисления","ВидыОперацийВозвратТоваровПоставщику","ПокупкаКомиссия") Тогда
				Операция.Вставить("ВидОперации",Перечисления.ВидыОперацийВозвратТоваровПоставщику.ПокупкаКомиссия);
			КонецЕсли;
			
		ИначеЕсли ТипСоздаваемогоДокумента = "ПередачаТоваров" Тогда
			Если РеквизитСуществует("Перечисления","ВидыОперацийПередачаТоваров","ВПереработку") Тогда
				Операция.Вставить("ВидОперации",Перечисления.ВидыОперацийПередачаТоваров.ВПереработку);
			КонецЕсли;
			
		ИначеЕсли ТипСоздаваемогоДокумента = "ПоступлениеВАренду" Тогда
			Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеВАренду","ПоступлениеВЛизинг") Тогда
				Операция.Вставить("ВидОперации",Перечисления.ВидыОперацийПоступлениеВАренду.ПоступлениеВЛизинг);
			КонецЕсли;
			
		// 2022.09.28 ( в БП30.КОРП есть вид операции у этого типа документа	
		ИначеЕсли ТипСоздаваемогоДокумента = "ОтчетКомиссионераОПродажах" Тогда
			Если РеквизитСуществует("Перечисления","ВидыОперацийОтчетКомиссионера","ОтчетОПродажах") Тогда
				Операция.Вставить("ВидОперации",Перечисления.ВидыОперацийОтчетКомиссионера.ОтчетОПродажах);
			КонецЕсли;
		// ) 2022.09.28
			
		ИначеЕсли ТипСоздаваемогоДокумента = "бит_ЗаявкаНаРасходованиеСредств"
			Или ТипСоздаваемогоДокумента = "бит_кзн_ЗаявкаНаРасходованиеСредств" Тогда
			Если РеквизитСуществует("Перечисления","бит_ВидыОперацийЗаявкаНаРасходование","ОплатаПоставщику") Тогда
				Операция.Вставить("ВидОперации",Перечисления.бит_ВидыОперацийЗаявкаНаРасходование.ОплатаПоставщику);
			КонецЕсли;
			
		//2023.02.02 ( БСО
		ИначеЕсли ТипСоздаваемогоДокумента = "ИмпПриемкаСтроительныхРаботУслуг" Тогда
			Если РеквизитСуществует("Перечисления","ИмпВидыОперацийПриемкаСтроительныхРаботУслуг","ПриемкаСубподрядныхРабот") Тогда
				Операция.Вставить("ВидОперации",Перечисления.ИмпВидыОперацийПриемкаСтроительныхРаботУслуг.ПриемкаСубподрядныхРабот);
			КонецЕсли;
			
		ИначеЕсли ТипСоздаваемогоДокумента = "ИмпРеализацияСтроительныхРаботУслуг" Тогда
			Если РеквизитСуществует("Перечисления","ИмпВидыОперацийРеализацияСтроительныхРаботУслуг","ПередачаЗаконченныхСМР") Тогда
				Операция.Вставить("ВидОперации",Перечисления.ИмпВидыОперацийРеализацияСтроительныхРаботУслуг.ПередачаЗаконченныхСМР);
			КонецЕсли;
		// ) 2023.02.02
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект,Операция);
		
		
		//E1C-503: Заполняем Реквизит ВидВходящегоДокумента документа ПоступлениеТоваровУслуг.
		//Тип - строковый, поэтому даже для предопределенных данных можем заполнить строку наименования
		Если Конф = "БП30" И СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ"
			И ТипСоздаваемогоДокумента = "ПоступлениеТоваровУслуг" Тогда
						
			Если ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Услуги Тогда
				ВидВходящегоДокумента = "Акт выполненных работ";
			ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Импорт Тогда
				ВидВходящегоДокумента = "Грузовая таможенная декларация";
			Иначе
				ВидВходящегоДокумента = "Накладная/Товарный чек";
			КонецЕсли;
			
			СтруктураВидВходящегоДокумента = Новый Структура("ВидВходящегоДокумента",ВидВходящегоДокумента);
			ЗаполнитьЗначенияСвойств(ДокументОбъект,СтруктураВидВходящегоДокумента);
		КонецЕсли;
		
		
		//+++ Пока оставлено, как было раньше, потом удалить
		Если Ложь Тогда
			//заполняем счета учета в документах
			СчетаУчетаВДокументах_ЗаполнениеВыполнено = Ложь;
			
			МодульСчетаУчетаВДокументах = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("СчетаУчетаВДокументах");
			Если МодульСчетаУчетаВДокументах <> Неопределено Тогда
				Попытка
					МодульСчетаУчетаВДокументах.ЗаполнитьСтроки(ДокументОбъект[ИмяТЧТовары], ИмяТЧТовары, ДокументОбъект, МенеджерОбъекта, Ложь);
					СчетаУчетаВДокументах_ЗаполнениеВыполнено = Истина;
				Исключение;
					
				КонецПопытки;
				
				Если ИмяТЧУслуги <> Неопределено Тогда
					Попытка
						МодульСчетаУчетаВДокументах.ЗаполнитьСтроки(ДокументОбъект[ИмяТЧУслуги], ИмяТЧУслуги, ДокументОбъект, МенеджерОбъекта, Ложь);
						СчетаУчетаВДокументах_ЗаполнениеВыполнено = Истина;
					Исключение;
						
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Если не отработало стандартное заполнение счетов учета в документе
		Если Не СчетаУчетаВДокументах_ЗаполнениеВыполнено = Истина Тогда
			
			Если Конф = "БП30" Тогда
				
				//E1C-375: Услуги аренды. Обрабатывается строго кейс ВедетсяУчетПредметовАренды = 1 для ПТиУ
				Если ТипСоздаваемогоДокумента = "ПоступлениеТоваровУслуг"
					И СтруктураЗаполнения.Свойство("ВедетсяУчетПредметовАренды")
					И СтруктураЗаполнения.ВедетсяУчетПредметовАренды = Истина Тогда
					
					ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.АрендныеПлатежи;
				КонецЕсли;
				// ) E1C-375
				
				Если ТипСоздаваемогоДокумента = "ПоступлениеВЛизинг"
					Или ТипСоздаваемогоДокумента = "ПоступлениеВАренду" Тогда
					
					//Из формы документа типового документа "Поступление в лизинг"
					РасчетыВУЕ = ДокументОбъект.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах;
					
					Если РасчетыВУЕ Тогда
						ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.АрендныеОбязательстваУЕ;
					ИначеЕсли ДокументОбъект.ВалютаДокумента <> СтруктураНастроек.СведенияОКонфигурации.ВалютаУчета Тогда
						ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.АрендныеОбязательстваВал;
					Иначе
						ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.АрендныеОбязательства;
					КонецЕсли;
					
					ДанныеОбъекта = Новый Структура("Дата, Организация, Склад, СуммаВключаетНДС,
						|ВалютаДокумента, КурсВзаиморасчетов, КратностьВзаиморасчетов, ДоговорКонтрагента");
					ЗаполнитьЗначенияСвойств(ДанныеОбъекта, ДокументОбъект);
	                ДанныеОбъекта.Вставить("РасчетыВУЕ", РасчетыВУЕ);
					
					Для Каждого СтрокаТаблицы Из ДокументОбъект.ПредметыЛизинга Цикл
						Если Не ЗначениеЗаполнено(СтрокаТаблицы.СчетУчета) Тогда
							Документы[ТипСоздаваемогоДокумента].ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(ДанныеОбъекта, СтрокаТаблицы, "ПредметыЛизинга");
						КонецЕсли;
					КонецЦикла;
					
				Иначе
					
					//2023.04.12 ( Бухгалтерия для Казахстана
					Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
						ДокументОбъект.ДополнительныеСвойства.Вставить("ЗаполнитьСчетаУчетаПередЗаписью",Истина);
					КонецЕсли;
					// ) 2023.04.12
					
					//Шапка документа
					// 2022.03.06 ( Замена устаревшей функции конфигурации
					//Попытка МенеджерОбъекта.ЗаполнитьСчетаУчетаРасчетов(ДокументОбъект); Исключение; КонецПопытки;
					Если МодульСчетаУчетаВДокументах <> Неопределено Тогда
						Попытка МодульСчетаУчетаВДокументах.ЗаполнитьПередЗаписью(ДокументОбъект,РежимЗаписиДокумента.Запись); Исключение; КонецПопытки;
					КонецЕсли;
					// ) 2022.03.06
					
				КонецЕсли;
			
			ИначеЕсли Конф = "БГУ2" Тогда
				//
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	//E1C-512: Не всех устраивает автоматическая установка времени
	Если СтруктураНастроек.ЗаполнениеШапки_УстанавливатьВремяДокументаАвтоматически = Истина Тогда
		//2021.03.22 ( Установим время документа
		ДокументОбъект.УстановитьВремя();
		// ) 2021.03.22
	КонецЕсли;
	
	//2019.05.21 ( модуль кастомизации	
	ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
	ПараметрыМК.Вставить("СтруктураЗаполнения",СтруктураЗаполнения);
	РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Документ_ПередЗаписьюДокумента",ПараметрыМК);
	
		
	Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
	// ) 2019.05.21	
	
		ОписаниеСобытия = "Выполняется стандартная обработка записи документа <" + ТипСоздаваемогоДокумента + "> (" + ДокументИД + ")";
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
	
		//Проверяем наличие установленной даты запрета
		ОтказЗаписи = Ложь;
		МодульДатыЗапретаИзменения = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("ДатыЗапретаИзменения");
		Если МодульДатыЗапретаИзменения <> Неопределено Тогда
			Попытка
				МодульДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ДокументОбъект,ОтказЗаписи,РежимЗаписиДокумента.Запись,РежимПроведенияДокумента.Неоперативный);
			Исключение
				ОписаниеСобытия = "Не удалось выполнить штатный механизм определения даты запрета <" + ТипСоздаваемогоДокумента + "> (" + ДокументИД + ")";
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
			КонецПопытки;
		КонецЕсли;
		
		Если ОтказЗаписи = Истина Тогда
			ТекстОшибки = ТекстОшибки + "запись документа в закрытом для редактирования периоде [" + Формат(ДокументОбъект.Дата,"ДФ=dd.MM.yyyy") + "] невозможна.";
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ТекстОшибки,"ОтказЗаписи");
			
		Иначе
						
			Попытка
				ДокументОбъект.Записать();
				ДокументСсылка = ДокументОбъект.Ссылка;
				
				ОписаниеСобытия = "<" + ДокументСсылка + ">: документ успешно записан";
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
				
				ЗаписатьСвязьСДокументомПортала(СтруктураЗаполненияДокумента.МассивИдентификаторовДокументов,ДанныеДокумента.spaceId,ДокументСсылка,Неопределено,ТекстОшибки);
				
				//+++ записать ДанныеПортала со ссылками на документы?
				ДанныеДокумента.ДокументСсылка = ДокументСсылка;
			Исключение
				ОписаниеСобытия = "- ошибка при записи документа: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ДополнитьТекстОшибки(ТекстОшибки,ОписаниеСобытия);
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ОшибкаЗаписи");
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		//2020.04.07 (
		ПараметрыМК.Вставить("ДокументСсылка",ДокументСсылка);
		РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Документ_ПослеЗаписиДокумента",ПараметрыМК);
		// ) 2020.04.07
		
		//EN-370: По настройке устанавливать флаг Оригинал получен: Если СтруктураНастроек.СозданиеДокумента_УстанавливатьФлагОригиналПолучен = Истина Тогда
		//E1C-230: Теперь этот флаг получаем из формы сопоставления
		Если ДанныеДокумента.ОригиналПолучен = Истина Тогда
			ОшибкаУстановкиФлага = УстановитьСтатусДокумента_ОригиналПолучен(ДокументСсылка);
			
			Если ЗначениеЗаполнено(ОшибкаУстановкиФлага) Тогда
				ОписаниеСобытия = "Ошибка при установке флага Оригинал получен для <" + ДокументСсылка + ">: " + КраткоеОписаниеОшибки(ОшибкаУстановкиФлага);
			Иначе
				ОписаниеСобытия = "Флаг Оригинал получен для <" + ДокументСсылка + "> установлен";
			КонецЕсли;
			
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
			
		КонецЕсли;
		// ) EN-370
		
		//Платежное поручение
		Если ТипСоздаваемогоДокумента = "ПлатежноеПоручение" Тогда
			Если РеквизитСуществует("РегистрыСведений","СостоянияБанковскихДокументов") Тогда
				Попытка
					РегистрыСведений.СостоянияБанковскихДокументов.УстановитьСостояниеДокумента(ДокументСсылка,"Подготовлено");
				Исключение
					//Не обрабатываем
				КонецПопытки;
			КонецЕсли;
			
		//E1C-457: Выплаты самозанятым
		ИначеЕсли ТипСоздаваемогоДокумента = "ВыплатыСамозанятым" Тогда
			НовыеСтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
			Если ЗначениеЗаполнено(НоваяСсылкаПервыйПрисоединенныйФайл) Тогда
				НовыеСтатусыДокумента.Статус = Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧекиЗагружены;
			Иначе
				НовыеСтатусыДокумента.Статус = Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧекиЧастичноЗагружены;
			КонецЕсли;
			РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокумента(ДокументСсылка,НовыеСтатусыДокумента);
		КонецЕсли;
		
		
		//2021.10.18 ( Временно отключим это условие, требуется создание СФ даже при установленном флаге УПД в документе-поступлении
		СтандартноеЗаполнениеСФПриФлагеДокументаУПД = Истина;
		
		Если Не СтандартноеЗаполнениеСФПриФлагеДокументаУПД Тогда
		// ) 2021.10.18
		
			//E1C-268: Если это поступление и у документа флаг ЭтоУниверсальныйДокумент, то в самой конфигурации ПОСЛЕ записи в ФОРМЕ
			//заполняется счет-фактура. Вызовем тот же алгоритм после записи тут
			Если ТипСоздаваемогоДокумента = "ПоступлениеТоваровУслуг"
				И СтруктураЗаполнения.Свойство("ЭтоУниверсальныйДокумент")
				И СтруктураЗаполнения.ЭтоУниверсальныйДокумент = Истина Тогда
				
				МодульУчетНДСКлиентСервер = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("УчетНДСКлиентСервер");
				МодульУчетНДСВызовСервера = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("УчетНДСВызовСервера");
				
				Если МодульУчетНДСКлиентСервер <> Неопределено
					И МодульУчетНДСВызовСервера <> Неопределено Тогда
					
					ПараметрыСчетаФактуры = МодульУчетНДСКлиентСервер.НовыеПараметрыСозданияПолученногоСчетаФактуры();
					ПараметрыСчетаФактуры.Основание = ДокументСсылка;
					ПараметрыСчетаФактуры.НомерСчетаФактурыПолученного = ДокументОбъект.НомерВходящегоДокумента;
					ПараметрыСчетаФактуры.ДатаСчетаФактурыПолученного  = ДокументОбъект.ДатаВходящегоДокумента;
					
					ПараметрыСчетаФактуры.ЭтоУниверсальныйДокумент = Истина;
					
					МодульУчетНДСВызовСервера.СоздатьСчетФактуруПолученныйНаОсновании(
						ПараметрыСчетаФактуры,,
						Истина,
						ДанныеДокумента.ОригиналПолучен);
						
					КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//БГУ: получим и запишем типовую операцию для данного документа
		Если Конф = "БГУ2" Тогда
			МодульБухгалтерскиеОперацииСервер = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("БухгалтерскиеОперацииСервер");
			Если МодульБухгалтерскиеОперацииСервер <> Неопределено Тогда
				
				Если ТипСоздаваемогоДокумента = "ПоступлениеМЗ" Тогда
					ТиповаяОперация = Справочники.ТиповыеОперации.ПоступлениеМЗ_Покупка1;
				КонецЕсли;
				
				Попытка
					МодульБухгалтерскиеОперацииСервер.ЗаписатьДанныеТиповойОперацииОбъекта(ДокументОбъект,ТиповаяОперация);
					ОписаниеСобытия = "БГУ2: бухгалтерская операция <" + ТиповаяОперация + "> для документа <" + ДокументСсылка + "> установлена";
				Исключение
					ОписаниеСобытия = "БГУ2: ошибка при установке бухгалтерской операции для документа <" + ДокументСсылка + ":" + Символы.ПС + ОписаниеОшибки();
				КонецПопытки;
				
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
			КонецЕсли;
		КонецЕсли;
		
		
		Если СтруктураНастроек.СозданиеДокумента_ПроводитьЗаполненныеДокументы = Истина Тогда
			
			Если ДокументСсылка.Проведен Тогда
				ОписаниеСобытия = "- проведение документа <" + ДокументОбъект + "> пропущено: документ уже проведен";
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ОшибкаЗаписи");
				
			Иначе
				Попытка					
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
					ОписаниеСобытия = "<" + ДокументСсылка + ">: документ успешно проведен";
					ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
				Исключение
					ОписаниеСобытия = "- ошибка при проведении документа: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ДополнитьТекстОшибки(ТекстОшибки,ОписаниеСобытия);
					ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ОшибкаЗаписи");
				КонецПопытки;
				
			КонецЕсли;
		КонецЕсли;
		
		//По флагу в настройках прикрепляем файла как ПрисоединенныйФайл
		Если СтруктураНастроек.СозданиеДокумента_ПрисоединятьФайлСканаДокумента = Истина Тогда
			
			//2019.10.22 ( обработка события модуля кастомизации
			ПараметрыМК.Вставить("НоваяСсылкаПервыйПрисоединенныйФайл",НоваяСсылкаПервыйПрисоединенныйФайл);
			ПараметрыМК.Вставить("МассивФайлов",СтруктураЗаполненияДокумента.МассивФайлов);
			ПараметрыМК.Вставить("ТекстОшибки",ТекстОшибки);
			ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
			
			РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Документ_ПередПрисоединениемФайлов",ПараметрыМК);
			ТекстОшибки = ПараметрыМК.ТекстОшибки;
			
			Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
			// ) 2019.10.22
			
				ПрисоединитьФайлы_СканыДокумента(ДокументСсылка,СтруктураЗаполненияДокумента.МассивФайлов,ТекстОшибки,НоваяСсылкаПервыйПрисоединенныйФайл);
			КонецЕсли;
		КонецЕсли;
				
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		//2020.10.18 ( Заполняем документ Доп. расходов
		Если СтрокиДопРасходов.Количество() > 0 Тогда
			ПараметрыМК.Вставить("ТекстОшибки",ТекстОшибки);
			ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
		
			РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Документ_ПередСозданиемПоступлениеДопРасходов",ПараметрыМК);
			ТекстОшибки = ПараметрыМК.ТекстОшибки;
			
			Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
				ДопРасходыСсылка = ДопРасходы_ЗаполнитьДокументПоОснованию(ДокументСсылка,СтрокиДопРасходов,СтруктураЗаполненияДокумента,ПараметрыМК,ТекстОшибки);
				Если ЗначениеЗаполнено(ДопРасходыСсылка) Тогда
					СтруктураЗаполненияДокумента.Вставить("ПоступлениеДопРасходовСсылка",ДопРасходыСсылка);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// ) 2020.10.18
		
		Если ЗначениеЗаполнено(СвязанныйДокументИД) Тогда
			//Запишем связь с дочерним документом
			ЗаписатьСвязьСДокументомПортала(СвязанныйДокументИД,ДанныеДокумента.spaceId,ДокументСсылка,Неопределено,ТекстОшибки);
			СвязанныйДокумент.ДокументСсылка = ДокументСсылка;
			
			УстановитьСсылкуДокументаПоИдентификатору(ДокументСсылка,СвязанныйДокументИД);
		
		Иначе
			//Запишем связь с основным документом
			ЗаписатьСвязьСДокументомПортала(ДокументИД,ДанныеДокумента.spaceId,ДокументСсылка,Неопределено,ТекстОшибки);
			ДанныеДокумента.ДокументСсылка = ДокументСсылка;
			
			УстановитьСсылкуДокументаПоИдентификатору(ДокументСсылка,ДокументИД);
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДокументСсылка;
КонецФункции
&НаСервере
Функция ПолучитьСсылку_ЗаполнениеСчетФактура(СтруктураЗаполненияДокумента,ДокументРодитель,ДанныеДокумента,ТекстОшибки)
	
	ДокументИД = СтруктураЗаполненияДокумента.document.id;
	НаправлениеСоздаваемогоДокумента = СтруктураЗаполненияДокумента.НаправлениеСоздаваемогоДокумента;
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект"); //Для вызова функций модуля объекта
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	
	//Теперь ВидОперации для создаваемого основного документа может быть выбран пользователем,
	//для некоторых видов операции счет-фактура не создается, независимо от настроек
	Если РеквизитСуществует("Перечисления","ВидыОперацийПоступлениеТоваровУслуг","ВПереработку")
		И ДокументРодитель.Метаданные().Реквизиты.Найти("ВидОперации") <> Неопределено
		И ДокументРодитель.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//E1C-327: Для документа ОтчетКомиссионераОПродажах счет-фактуру автоматически не заполняем
	Если ДанныеДокумента.ТипСоздаваемогоДокумента = "ОтчетКомиссионераОПродажах"
		Или ДанныеДокумента.ТипСоздаваемогоДокумента = "ОтчетКомиссионера" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НаправлениеСоздаваемогоДокумента = "Входящий"
		И ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.СчетФактураПолученный) Тогда
		ДокументОбъект = Документы[СтруктураНастроек.СведенияОКонфигурации.СчетФактураПолученный].СоздатьДокумент();
	Иначе
		//E1C-153: отдельный пункт настройки "Создавать счета-фактуры к ИСХОДЯЩИМ документам"
		Если СтруктураНастроек.СозданиеДокумента_СчетФактура_СоздаватьИсходящимДокументам = Истина
			И ЗначениеЗаполнено(СтруктураНастроек.СведенияОКонфигурации.СчетФактураВыданный) Тогда
			ДокументОбъект = Документы[СтруктураНастроек.СведенияОКонфигурации.СчетФактураВыданный].СоздатьДокумент();
		Иначе
		// ) E1C-153
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	// 2022.02.01 ( Следует проверить, а вводится ли в этой конфигурации счет-фактура на основании этого документа
	//2022.05.11: ОТМЕНЕНО
	Если Ложь Тогда
		МетаданныеСчетаФактуры = ДокументОбъект.Метаданные();
		МетаданныеРодителя = ДокументРодитель.Метаданные();
		Если Не МетаданныеСчетаФактуры.ВводитсяНаОсновании.Содержит(МетаданныеРодителя) Тогда
			ОписаниеСобытия = "Ввод <" + МетаданныеСчетаФактуры.Имя + "> не предполагает ввода на основании <"
				+ МетаданныеРодителя.Имя + ">, создание счета-фактуры пропущено";
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	// ) 2022.02.01
	
	// модуль кастомизации
	ПараметрыМК = Новый Структура;
	ПараметрыМК.Вставить("АдресХранилищаДанныхПортала",АдресХранилищаДанныхПортала);
	ПараметрыМК.Вставить("ДокументИД",ДокументИД);
	ПараметрыМК.Вставить("ДанныеДокумента",ДанныеДокумента);
	ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
	ПараметрыМК.Вставить("НаправлениеСоздаваемогоДокумента",НаправлениеСоздаваемогоДокумента);
	ПараметрыМК.Вставить("ТипСоздаваемогоДокумента",ДанныеДокумента.type);
	ПараметрыМК.Вставить("ДопПараметры",Новый Структура);
	ПараметрыМК.Вставить("ДокументОбъект",ДокументОбъект);
	ПараметрыМК.Вставить("ДокументРодитель",ДокументРодитель);
	ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
	
	//Теперь данные документа есть в структуре заполнения документа, но оставляем их для обратной совместимости МК
	ПараметрыМК.Вставить("СтруктураЗаполненияДокумента",СтруктураЗаполненияДокумента);
	
	РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("СчетФактура_ПередЗаполнениемШапки",ПараметрыМК);
	
	Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
		// ) модуль кастомизации
		
		//Поиск связанных документов комплекта
		Если СтруктураНастроек.СозданиеДокумента_ИспользоватьПоискКомплектов = Истина
			И ЗначениеЗаполнено(СтруктураЗаполненияДокумента.document.children) Тогда
			
			//Если у текущего документа есть children, то используем его номер и дату
			ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
			СвязанныйДокумент = ДанныеПортала.documents.Найти(СтруктураЗаполненияДокумента.document.children,"id");
			
			Если СвязанныйДокумент <> Неопределено Тогда
				
				//Связанный документ уже создали ранее
				Если ЗначениеЗаполнено(СвязанныйДокумент.ДокументСсылка) Тогда
					Возврат СвязанныйДокумент.ДокументСсылка;
				КонецЕсли;

				ДатаДокумента = СвязанныйДокумент.ДатаДокумента;
				date = СвязанныйДокумент.date;
				number = СвязанныйДокумент.number;
				СвязанныйДокументИД = СвязанныйДокумент.id;
			Иначе
				ДатаДокумента = ДанныеДокумента.ДатаДокумента;
				date = ДанныеДокумента.date;
				number = ДанныеДокумента.number;
			КонецЕсли;
		Иначе
			ДатаДокумента = ДанныеДокумента.ДатаДокумента;
			date = ДанныеДокумента.date;
			number = ДанныеДокумента.number;
		КонецЕсли;
		
		
		//Выбор дальнейшего заполнения в зависимости от конфигурации
		Если Конф = "БП30" Тогда
			ДокументОбъект.Заполнить(ДокументРодитель);
			
			//E1C-197: Добавим в список документов-оснований поступление доп. расходов, если он есть
			Если СтруктураЗаполненияДокумента.Свойство("ПоступлениеДопРасходовСсылка")
				И ЗначениеЗаполнено(СтруктураЗаполненияДокумента.ПоступлениеДопРасходовСсылка) Тогда
				НоваяСтрокаОснований = ДокументОбъект.ДокументыОснования.Добавить();
				НоваяСтрокаОснований.ДокументОснование = СтруктураЗаполненияДокумента.ПоступлениеДопРасходовСсылка;
			КонецЕсли;
			
		ИначеЕсли Конф = "БГУ2" Тогда
			Если НаправлениеСоздаваемогоДокумента = "Входящий" Тогда
				ДокументОбъект.Заполнить(ДокументРодитель);
			Иначе
				ДанныеЗаполнения = Новый Структура;
				ДанныеЗаполнения.Вставить("ОснованиеСсылка",ДокументРодитель);
			КонецЕсли;
			
		ИначеЕсли Конф = "ERP"
			//Проверено на 2.4.7.150: выполняется заполнение СФ только по проведенному документу-основанию,
			//можно заполнить документ СФ непроведенным для его проверки и проведения пользователем
			//эту часть в дальнейшем следует вынести в модуль кастомизации для этого клиента (
			Или Конф = "КА2" Тогда
			
			Если ДокументРодитель.Проведен Тогда
				ДанныеЗаполнения = Новый Структура;
				ДанныеЗаполнения.Вставить("ДокументОснование",ДокументРодитель);
				ДокументОбъект.Заполнить(ДанныеЗаполнения);
			Иначе
				ЗаполнитьЗначенияСвойств(ДокументОбъект,ДокументРодитель);
							
				НоваяСтрокаОснование = ДокументОбъект.ДокументыОснования.Добавить();
				СтруктураЗаполненияСтрокиОснования = Новый Структура;
				СтруктураЗаполненияСтрокиОснования.Вставить("ДокументОснование",ДокументРодитель);
				СтруктураЗаполненияСтрокиОснования.Вставить("Сумма",СтруктураЗаполненияДокумента.document.amount);
				СтруктураЗаполненияСтрокиОснования.Вставить("СуммаНДС",СтруктураЗаполненияДокумента.document.vat);
				
				ЗаполнитьЗначенияСвойств(НоваяСтрокаОснование,СтруктураЗаполненияСтрокиОснования);
				
				СтруктураЗаполнения = Новый Структура;
				СтруктураЗаполнения.Вставить("ИННКонтрагента",ДокументРодитель.Контрагент.ИНН);
				СтруктураЗаполнения.Вставить("КППКонтрагента",ДокументРодитель.Контрагент.КПП);
				СтруктураЗаполнения.Вставить("КодВидаОперации","01");
				
				ЗаполнитьЗначенияСвойств(ДокументОбъект,СтруктураЗаполнения);
			КонецЕсли;
			// )
		ИначеЕсли СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Полн = "УНФ1618" Тогда
			//Вероятно, временный костыль: в конфигурации уже убрали реквизит ДокументОснование, но обработчик заполнения на его основании остался.
			//При этом полноценно он больше не работает, сделаем отдельную ветку условия заполнения в данной конфе
			ДокументОбъект.Заполнить(ДокументРодитель);
			
		Иначе
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("ДокументОснование",ДокументРодитель); // УТ11
			ДанныеЗаполнения.Вставить("Ссылка",ДокументРодитель); //УНФ
			ДокументОбъект.Заполнить(ДанныеЗаполнения);
		КонецЕсли;
				
						
		СтруктураЗаполнения = Новый Структура;
		СтруктураЗаполнения.Вставить("Дата",ДокументРодитель.Дата);
		
		СтруктураЗаполнения.Вставить("ДатаВходящегоДокумента",date);
		СтруктураЗаполнения.Вставить("НомерВходящегоДокумента",number);
		
		СтруктураЗаполнения.Вставить("ДатаПервичногоДокумента",date);
		СтруктураЗаполнения.Вставить("НомерПервичногоДокумента",number);
		
		СтруктураЗаполнения.Вставить("НомерЭД",number);
		
		//E1C-487: Казахстан: дата оборота для типа документа ЭСФ
		//2) В связанном СФ поле Дата оборота заполняется значением "turnoverDate".
		//2.1) Дату в Поступлении ТМЦ берем из turnoverDate, а дату СФ на его основании - из даты распознанного документа
		Если ЗначениеЗаполнено(ДанныеДокумента.esfKzTurnoverDate) Тогда
			СтруктураЗаполнения.Вставить("ДатаСовершенияОборотаПоРеализации",ДанныеДокумента.esfKzTurnoverDate);
			СтруктураЗаполнения.Вставить("Дата",ДанныеДокумента.sourceDate);
			СтруктураЗаполнения.Вставить("ДатаВходящегоДокумента",ДанныеДокумента.sourceDate);
		КонецЕсли;
		
		Если Конф = "УТ11" Тогда
			СтруктураЗаполнения.Вставить("Номер",number);
			СтруктураЗаполнения.Вставить("ДатаСоставления",date);
			СтруктураЗаполнения.Вставить("Контрагент",ДокументРодитель.Контрагент);
			
		ИначеЕсли Конф = "КА2" Тогда
			СтруктураЗаполнения.Вставить("Номер",number);
			СтруктураЗаполнения.Вставить("ДатаСоставления",date);
			СтруктураЗаполнения.Вставить("Контрагент",ДокументРодитель.Контрагент);
			
		ИначеЕсли Конф = "ERP" Тогда
			СтруктураЗаполнения.Вставить("Номер",number);
			СтруктураЗаполнения.Вставить("ДатаСоставления",date);
			СтруктураЗаполнения.Вставить("Контрагент",ДокументРодитель.Контрагент);
			
		КонецЕсли;
		
		СтруктураЗаполнения.Вставить("НДСПредъявленКВычету",СтруктураНастроек.СозданиеДокумента_СчетФактура_ОтразитьВычетВКнигеПокупок = Истина);
				
		//E1C-88: Если документ прилетел из Диадок - у него будет заполнен статус, указываем код способа получения = 2
		Если ЗначениеЗаполнено(СтруктураЗаполненияДокумента.document.Диадок_Статус) Тогда
			СтруктураЗаполнения.Вставить("КодСпособаПолучения",2);
		Иначе
			СтруктураЗаполнения.Вставить("КодСпособаПолучения",1);
		КонецЕсли;
		
		Комментарий = РеквизитОбъект.ЗаполнениеДокумента_СформироватьКомментарийСПараметрами(АдресХранилищаДанныхПортала,СтруктураЗаполненияДокумента,СтруктураНастроек);
		СтруктураЗаполнения.Вставить("Комментарий",Комментарий);
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект,СтруктураЗаполнения);

	КонецЕсли;
	
	// модуль кастомизации	
	ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
	ПараметрыМК.Вставить("СтруктураЗаполнения",СтруктураЗаполнения);
	РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("СчетФактура_ПередЗаписьюДокумента",ПараметрыМК);
	
	Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
		// ) модуль кастомизации
		
		//E1C-126: Добавлена настройка проверки наличия НДС в заполняемом счете-фактуре
		Если СтруктураНастроек.СозданиеДокумента_СчетФактура_СоздаватьБезНДС <> Истина Тогда
			
			//Определяем по распознанной сумме из документа
			Если СтруктураЗаполненияДокумента.document.vat = Неопределено Тогда
				СуммаНДС = 0;
			Иначе
				Попытка
					СуммаНДС = Число(СтруктураЗаполненияДокумента.document.vat);
				Исключение
					//продолжаем создавать
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СуммаНДС = 0 Тогда
			//Реквизит суммы НДС определили и он равен нулю
			ОписаниеСобытия = "Сумма НДС счета-фактуры к документу <" + ДокументРодитель + "> равна 0, создание счета-фактуры пропущено";
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
		Иначе
		// ) 2019.11.27
		
			ОписаниеСобытия = "Выполняется стандартная обработка записи счета-фактуры";
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
			
			//E1C-512: Не всех устраивает автоматическая установка времени
			Если СтруктураНастроек.ЗаполнениеШапки_УстанавливатьВремяДокументаАвтоматически = Истина Тогда
				//2021.03.22 ( Установим время документа
				ДокументОбъект.УстановитьВремя();
				// ) 2021.03.22
			КонецЕсли;
			
			Попытка
				ДокументОбъект.Записать();
				ДокументСсылка = ДокументОбъект.Ссылка;
				
				ОписаниеСобытия = "<" + ДокументСсылка + ">: документ успешно записан";
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
			Исключение
				ОписаниеСобытия = "- ошибка при записи счета-фактуры: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ДополнитьТекстОшибки(ТекстОшибки,ОписаниеСобытия);
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ОшибкаЗаписи");
			КонецПопытки;
			
			Если ЗначениеЗаполнено(ДокументСсылка) И ДокументРодитель.Проведен Тогда
				
				Если ДокументСсылка.Проведен Тогда
					ОписаниеСобытия = "- проведение документа <" + ДокументОбъект + "> пропущено: документ уже проведен";
					ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ОшибкаЗаписи");
					
				Иначе
					Попытка
						ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
						
						ОписаниеСобытия = "<" + ДокументСсылка + ">: документ успешно проведен";
						ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
					Исключение
						ОписаниеСобытия = "- ошибка при проведении счета-фактуры: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						ДополнитьТекстОшибки(ТекстОшибки,ОписаниеСобытия);
						ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ОшибкаЗаписи");
					КонецПопытки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		//2020.04.07 (
		ПараметрыМК.Вставить("ДокументСсылка",ДокументСсылка);
		РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("СчетФактура_ПослеЗаписиДокумента",ПараметрыМК);
		// ) 2020.04.07
		
		//EN-370: По настройке устанавливать флаг Оригинал получен
		Если СтруктураНастроек.СозданиеДокумента_УстанавливатьФлагОригиналПолучен = Истина Тогда
			
			ОшибкаУстановкиФлага = УстановитьСтатусДокумента_ОригиналПолучен(ДокументСсылка);
			
			Если ЗначениеЗаполнено(ОшибкаУстановкиФлага) Тогда
				ОписаниеСобытия = "Ошибка при установке флага Оригинал получен для <" + ДокументСсылка + ">: " + КраткоеОписаниеОшибки(ОшибкаУстановкиФлага);
			Иначе
				ОписаниеСобытия = "Флаг Оригинал получен для <" + ДокументСсылка + "> установлен";
			КонецЕсли;
			
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
			
		КонецЕсли;
		// ) EN-370
		
		Если СтруктураНастроек.СозданиеДокумента_ИспользоватьПоискКомплектов = Истина Тогда
			
			Если ЗначениеЗаполнено(СвязанныйДокументИД) Тогда
				//Запишем связь с дочерним документом
				ЗаписатьСвязьСДокументомПортала(СвязанныйДокументИД,ДанныеДокумента.spaceId,ДокументСсылка,Неопределено,ТекстОшибки);
				СвязанныйДокумент.ДокументСсылка = ДокументСсылка;
				
				УстановитьСсылкуДокументаПоИдентификатору(ДокументСсылка,СвязанныйДокументИД);
			
			Иначе
				//Запишем связь с основным документом, только если этот документ Счет-фактура
				Если СтруктураЗаполненияДокумента.document.type = "VAT_INVOICE" Тогда
					ЗаписатьСвязьСДокументомПортала(ДокументИД,ДанныеДокумента.spaceId,ДокументСсылка,Неопределено,ТекстОшибки);
					ДанныеДокумента.ДокументСсылка = ДокументСсылка;
					
					УстановитьСсылкуДокументаПоИдентификатору(ДокументСсылка,ДокументИД);
				КонецЕсли;
			
			КонецЕсли;
			
		Иначе
			//Исходный вариант, оставляем отображение связи с основным документом
			
		КонецЕсли;		
		
		//По флагу в настройках прикрепляем файла как ПрисоединенныйФайл
		Если СтруктураНастроек.СозданиеДокумента_ПрисоединятьФайлСканаДокумента = Истина Тогда
			
			//2019.10.22 ( обработка события модуля кастомизации
			ПараметрыМК.Вставить("ДокументСсылка",ДокументСсылка);
			ПараметрыМК.Вставить("МассивФайлов",СтруктураЗаполненияДокумента.МассивФайлов);
			ПараметрыМК.Вставить("ТекстОшибки",ТекстОшибки);
			ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
			
			РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("СчетФактура_ПередПрисоединениемФайлов",ПараметрыМК);
			ТекстОшибки = ПараметрыМК.ТекстОшибки;
			
			Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
			// ) 2019.10.22
			
				ПрисоединитьФайлы_СканыДокумента(ДокументСсылка,СтруктураЗаполненияДокумента.МассивФайлов,ТекстОшибки);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДокументСсылка;
КонецФункции

&НаСервере
Процедура УстановитьСсылкуДокументаПоИдентификатору(ДокументСсылка,ДокументИД)
	
	НайденныеСтроки = Объект.СписокДокументов.НайтиСтроки(Новый Структура("ДокументИД",ДокументИД));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		СтрокаДокумента = НайденныеСтроки[0];
		
		СтрокаДокумента.Документ1с = ДокументСсылка;
		
		УведомлениеПорталуОСозданииДокументов_ДобавитьДокумент(ДокументСсылка,ДокументИД);
		
		Если СтрокаДокумента.ДокументСтатус = "EDI_SEND" Тогда
			//E1C-450: Это не касается исходящих ЭДО-документов				
		Иначе
			СтрокаДокумента.ДокументСтатус = "UPLOADED";
			СтрокаДокумента.ПредставлениеСтатуса = "Выгружен";
			СтрокаДокумента.Счетчик_Загружен = 1;
		КонецЕсли;
		
		СтрокаДокумента.Счетчик_Проверен = 0;
		СтрокаДокумента.Счетчик_Распознан = 0;
		
		ОписаниеСобытия = "<" + ДокументСсылка + ">: ссылка для документа (" + ДокументИД + ") успешно установлена";
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
	Иначе
		ОписаниеСобытия = "<" + ДокументСсылка + ">: строка для установки связи с документом (" + ДокументИД + ") не найдена";
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"Ошибка");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАналитикуСчетовУчета(НоваяСтрока,СтрокаНоменклатуры,ТипСоздаваемогоДокумента)
	
	Конф = СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Крат;
	
	СтруктураТовар = Новый Структура;
	
	//Пока ограничимся только для БП30
	Если Конф = "БП30" Тогда	
		//В зависимости от счета учета размещаем данные об аналитике счета учета в структуре заполнения строки табличной части
		
		Если ЗначениеЗаполнено(СтрокаНоменклатуры.СчетУчетаСсылка) Тогда
			СчетУчетаСсылка = СтрокаНоменклатуры.СчетУчетаСсылка;
			
		Иначе
			//E1C-253: Проверяем, заполнен ли самой конфигурацией счет учета в строке табличной части документа,
			//поскольку мы не знаем, какую табличную часть заполняем - проверим заполнение ключей заданной структуры
			СчетУчетаСтрокиДокумента = Новый Структура("СчетУчета,СчетЗатрат,СчетЗатратБУ");
			ЗаполнитьЗначенияСвойств(СчетУчетаСтрокиДокумента,НоваяСтрока);
			Если ЗначениеЗаполнено(СчетУчетаСтрокиДокумента.СчетУчета) Тогда
				СчетУчетаСсылка = СчетУчетаСтрокиДокумента.СчетУчета;
			ИначеЕсли ЗначениеЗаполнено(СчетУчетаСтрокиДокумента.СчетЗатрат) Тогда
				СчетУчетаСсылка = СчетУчетаСтрокиДокумента.СчетЗатрат;
			ИначеЕсли ЗначениеЗаполнено(СчетУчетаСтрокиДокумента.СчетЗатратБУ) Тогда
				СчетУчетаСсылка = СчетУчетаСтрокиДокумента.СчетЗатратБУ;
			КонецЕсли;
			
		КонецЕсли;
			
		Если ЗначениеЗаполнено(СчетУчетаСсылка) Тогда
		
			//перезаполняем счет учета на выбранный пользователем, так как до этого мы вызывали принудительное заполнение счетов учета и субконто
			СтруктураТовар.Вставить("СчетУчета",СчетУчетаСсылка);
			СтруктураТовар.Вставить("СчетЗатратНУ",СчетУчетаСсылка);
			СтруктураТовар.Вставить("СчетУчетаНДС",СтрокаНоменклатуры.СчетУчетаНДССсылка);

			//2021.12.09 ( Требование-накладная
			Если ТипСоздаваемогоДокумента = "ТребованиеНакладная" Тогда
				СтруктураТовар.Вставить("Счет",СчетУчетаСсылка);
			Иначе
				СтруктураТовар.Вставить("СчетЗатрат",СчетУчетаСсылка);
			КонецЕсли;
			// ) 2021.12.09
			
			//обходим субконто табличной части и заполняем выбранные в форме сопоставления значения 
			//в отраслевых решениях на базе БП30 тип счета учета в конфигурации может быть определен другой, не обрабатываем
			Если (Метаданные.ПланыСчетов.Найти("Хозрасчетный") <> Неопределено И ТипЗнч(СчетУчетаСсылка) = Тип("ПланСчетовСсылка.Хозрасчетный"))
				Или (Метаданные.ПланыСчетов.Найти("Типовой") <> Неопределено И ТипЗнч(СчетУчетаСсылка) = Тип("ПланСчетовСсылка.Типовой")) Тогда
				ИндексСубконто = 0;
				Для Каждого ЭлементВидаСубконто Из СчетУчетаСсылка.ВидыСубконто Цикл
					ИндексСубконто = ИндексСубконто + 1;
					Если Метаданные.Справочники.Найти("СтатьиЗатрат") <> Неопределено
						И ЭлементВидаСубконто.ВидСубконто.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат")
						И ЗначениеЗаполнено(СтрокаНоменклатуры.СтатьяЗатратСсылка) Тогда
						СтруктураТовар.Вставить("Субконто" + ИндексСубконто,СтрокаНоменклатуры.СтатьяЗатратСсылка);
						СтруктураТовар.Вставить("СубконтоНУ" + ИндексСубконто,СтрокаНоменклатуры.СтатьяЗатратСсылка);
						СтруктураТовар.Вставить("СубконтоЗатратБУ" + ИндексСубконто,СтрокаНоменклатуры.СтатьяЗатратСсылка);
						
					//2023.03.15 (
					ИначеЕсли Метаданные.Справочники.Найти("Доходы") <> Неопределено
						И ЭлементВидаСубконто.ВидСубконто.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Доходы")
						И ЗначениеЗаполнено(СтрокаНоменклатуры.СтатьяДоходовСсылка) Тогда
						СтруктураТовар.Вставить("СубконтоДоходовБУ" + ИндексСубконто,СтрокаНоменклатуры.СтатьяДоходовСсылка);
						СтруктураТовар.Вставить("СубконтоДоходовНУ" + ИндексСубконто,СтрокаНоменклатуры.СтатьяДоходовСсылка);
					// ) 2023.03.15
						
					ИначеЕсли Метаданные.Справочники.Найти("НоменклатурныеГруппы") <> Неопределено
						И ЭлементВидаСубконто.ВидСубконто.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы")
						И ЗначениеЗаполнено(СтрокаНоменклатуры.НоменклатурнаяГруппаСсылка) Тогда
						СтруктураТовар.Вставить("Субконто" + ИндексСубконто,СтрокаНоменклатуры.НоменклатурнаяГруппаСсылка);
						СтруктураТовар.Вставить("СубконтоНУ" + ИндексСубконто,СтрокаНоменклатуры.НоменклатурнаяГруппаСсылка);
						СтруктураТовар.Вставить("СубконтоЗатратБУ" + ИндексСубконто,СтрокаНоменклатуры.НоменклатурнаяГруппаСсылка);
						
					ИначеЕсли Метаданные.Перечисления.Найти("СпособыУчетаНДС") <> Неопределено
						И ЭлементВидаСубконто.ВидСубконто.ТипЗначения = Новый ОписаниеТипов("ПеречислениеСсылка.СпособыУчетаНДС")
						И ЗначениеЗаполнено(СтрокаНоменклатуры.СпособУчетаНДС) Тогда
						СтруктураТовар.Вставить("Субконто" + ИндексСубконто,СтрокаНоменклатуры.СпособУчетаНДС);
						СтруктураТовар.Вставить("СубконтоНУ" + ИндексСубконто,СтрокаНоменклатуры.СпособУчетаНДС);
						
					ИначеЕсли Метаданные.Справочники.Найти("ПодразделенияОрганизаций") <> Неопределено
						И ЭлементВидаСубконто.ВидСубконто.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций")
						И ЗначениеЗаполнено(СтрокаНоменклатуры.ПодразделениеЗатратСсылка) Тогда
						СтруктураТовар.Вставить("Субконто" + ИндексСубконто,СтрокаНоменклатуры.ПодразделениеЗатратСсылка);
						СтруктураТовар.Вставить("СубконтоНУ" + ИндексСубконто,СтрокаНоменклатуры.ПодразделениеЗатратСсылка);
						СтруктураТовар.Вставить("СубконтоЗатратБУ" + ИндексСубконто,СтрокаНоменклатуры.ПодразделениеЗатратСсылка);
						
					//2024.08.07 ( Задача 266190: Склады в субконто
					ИначеЕсли Метаданные.Справочники.Найти("Склады") <> Неопределено
						И ЭлементВидаСубконто.ВидСубконто.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Склады")
						И ЗначениеЗаполнено(СтрокаНоменклатуры.СкладСсылка) Тогда
						СтруктураТовар.Вставить("Субконто" + ИндексСубконто,СтрокаНоменклатуры.СкладСсылка);
						СтруктураТовар.Вставить("СубконтоНУ" + ИндексСубконто,СтрокаНоменклатуры.СкладСсылка);
						СтруктураТовар.Вставить("СубконтоЗатратБУ" + ИндексСубконто,СтрокаНоменклатуры.СкладСсылка);
					// ) 2024.08.07
					
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	
		Если ЗначениеЗаполнено(СтрокаНоменклатуры.СчетУчетаНДССсылка) Тогда
			СтруктураТовар.Вставить("СчетУчетаНДС",СтрокаНоменклатуры.СчетУчетаНДССсылка);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаНоменклатуры.СпособУчетаНДС) Тогда
			СтруктураТовар.Вставить("СпособУчетаНДС",СтрокаНоменклатуры.СпособУчетаНДС);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаНоменклатуры.ПодразделениеЗатратСсылка) Тогда
			СтруктураТовар.Вставить("ПодразделениеЗатрат",СтрокаНоменклатуры.ПодразделениеЗатратСсылка);
		КонецЕсли;
				
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураТовар);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УТ11_ПолучитьВидЦеныПоставщика(ТипЦен,ДокументОбъект)
	
	Если ЗначениеЗаполнено(ТипЦен) Тогда
		ВидЦеныПоставщика = ТипЦен;
	Иначе
		//Вид цены из соглашения
		Если ДокументОбъект.Метаданные().Реквизиты.Найти("Соглашение") <> Неопределено И ЗначениеЗаполнено(ДокументОбъект.Соглашение) Тогда
			Попытка ВидЦеныПоставщика = ДокументОбъект.Соглашение.ВидЦеныПоставщика; Исключение; КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	//Новая вводная: если не определили вид цены поставщика - используем существующую, если она единственная у этого Партнера
	Если Не ЗначениеЗаполнено(ВидЦеныПоставщика) Тогда
		Если Метаданные.Справочники.Найти("ВидыЦенПоставщиков") <> Неопределено Тогда
			Если ДокументОбъект.Метаданные().Реквизиты.Найти("Партнер") <> Неопределено И ЗначениеЗаполнено(ДокументОбъект.Партнер) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				               |	ВидыЦенПоставщиков.Ссылка КАК Ссылка
				               |ИЗ
				               |	Справочник.ВидыЦенПоставщиков КАК ВидыЦенПоставщиков
				               |ГДЕ
				               |	НЕ ВидыЦенПоставщиков.ПометкаУдаления
				               |	И ВидыЦенПоставщиков.ДоступноДляЗакупки
				               |	И ВидыЦенПоставщиков.Владелец = &Владелец";
				
				Запрос.УстановитьПараметр("Владелец",ДокументОбъект.Партнер);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Количество() = 1 Тогда
					Выборка.Следующий();
					ВидЦеныПоставщика = Выборка.Ссылка;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВидЦеныПоставщика;
	
КонецФункции


// ================= Объединение документов ===================

&НаСервере
Процедура ЗаполнитьИдентификаторыОбъединенияДокументов(ДопПараметры)
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РеквизитОбъект.ЗаполнитьИдентификаторыОбъединенияДокументов(АдресХранилищаДанныхПортала,ДопПараметры);
	ЗначениеВРеквизитФормы(РеквизитОбъект,"Объект");
	
	ЗаполнитьВСпискеДокументовДополнительныеДанные();
КонецПроцедуры
&НаСервере
Функция ПолучитьСтруктуруОбъединенныхДанныхЗаполненияДокумента(ИдентификаторОбъединения,ДопПараметры)
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	Возврат РеквизитОбъект.ПолучитьСтруктуруОбъединенныхДанныхЗаполненияДокумента(АдресХранилищаДанныхПортала,ИдентификаторОбъединения,СтруктураНастроек,ДопПараметры);
КонецФункции

&НаСервере
Процедура ЗаписатьСвязьСДокументомПортала(Идентификаторы,spaceId,ДокументСсылка,ИсходнаяСсылка,ТекстОшибки = Неопределено)
	
	//в параметре Идентификаторы теперь будет прилетать строка с идентификатором, или массив.
	//Если строка или в массиве один элемент - пишем как раньше в свойство документа, если несколько - в таблицу объединенных документов
	Если ТипЗнч(Идентификаторы) = Тип("Строка") Тогда
		id = Идентификаторы;
	Иначе //Массив
		Если Идентификаторы.Количество() = 1 Тогда
			id = Идентификаторы[0];
		Иначе
			//обработать сохранение в таблицу, запись идентификатора выполняется там же
			ЗаписатьСвязь_ОбъединениеДокументовПортала(Идентификаторы,spaceId,ДокументСсылка,ИсходнаяСсылка,ТекстОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// если ДокументСсылка очистили - надо найти в данных портала запись с требуемым id и очистить в регистре установленное соответствие этого документа
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
		
		Если ДанныеПортала = Неопределено Тогда
			//+++ очистить связь и без данных портала?
			
		Иначе
			
			ДанныеДокумента = ДанныеПортала.documents.НайтиСтроки(Новый Структура("id,ДокументСсылка",id,ИсходнаяСсылка));
			
			Если ДанныеДокумента.Количество() > 0 Тогда
				ДанныеДокумента[0].ДокументСсылка = Неопределено;
				ПоместитьВоВременноеХранилище(ДанныеПортала,АдресХранилищаДанныхПортала);
			КонецЕсли;
		КонецЕсли;
		
		//Связь может также храниться в дополнительной таблице объединенных документов
		РеквизитОбъект = РеквизитФормыВЗначение("Объект");
		ТаблицаОбъединенныхДокументов = РеквизитОбъект.ПолучитьДанныеИзОбщегоХранилища("ОбъединенныеДокументы");
		
		Если ТипЗнч(ТаблицаОбъединенныхДокументов) = Тип("ТаблицаЗначений") Тогда
			//Удаляем существующие, если есть, эта связь нам больше не нужна
			СтрокиДокументов = ТаблицаОбъединенныхДокументов.НайтиСтроки(Новый Структура("documentId",id));
			Для Каждого СтрокаДокумента Из СтрокиДокументов Цикл
				ТаблицаОбъединенныхДокументов.Удалить(СтрокаДокумента);
			КонецЦикла;
			
			РеквизитОбъект.ЗаписатьДанныеВОбщееХранилище("ОбъединенныеДокументы",ТаблицаОбъединенныхДокументов);
		КонецЕсли;
	КонецЕсли;
	
	//Измерение Объект регистра ЗначенияСвойствОбъектов не позволяет хранить ссылки на документы,
	//сохраняем связь в свою таблицу в ХранилищеОбщихНастроек
	Если СтруктураНастроек.СведенияОКонфигурации.ХранениеСвязиДокументов_СвояТаблица = Истина Тогда
		ЗаписатьОчиститьЗначение_ТаблицаСвязьДокументов(ДокументСсылка,ИсходнаяСсылка,id,spaceId,ТекстОшибки)
	Иначе
		ЗаписатьОчиститьЗначениеСвойстваДокумента(СтруктураНастроек.Свойство_Entera_documentId,ДокументСсылка,ИсходнаяСсылка,id,ТекстОшибки);
		ЗаписатьОчиститьЗначениеСвойстваДокумента(СтруктураНастроек.Свойство_Entera_spaceId,ДокументСсылка,ИсходнаяСсылка,spaceId,ТекстОшибки);	
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ЗаписатьОчиститьЗначениеСвойстваДокумента(Свойство,ДокументСсылка,ИсходнаяСсылка,Значение,ТекстОшибки)
	
	ИмяРегистраСведений = СтруктураНастроек.ИмяРегистраСведений;
		
	Если ИмяРегистраСведений <> Неопределено Тогда
	
		НаборЗаписей = РегистрыСведений[ИмяРегистраСведений].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Свойство.Установить(Свойство);
		
		НаборЗаписей.Отбор.Объект.Установить(?(ЗначениеЗаполнено(ДокументСсылка),ДокументСсылка,ИсходнаяСсылка));
			
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		Если ЗначениеЗаполнено(ДокументСсылка) Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.Объект = ДокументСсылка;
			Запись.Свойство = Свойство;
			Запись.Значение = Значение;
		КонецЕсли;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ДополнитьТекстОшибки(ТекстОшибки,"При записи дополнительного свойства <" + ДокументСсылка + "> возникла ошибка: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;
		
КонецПроцедуры
&НаСервере
Процедура ЗаписатьОчиститьЗначение_ТаблицаСвязьДокументов(ДокументСсылка,ИсходнаяСсылка,documentId,spaceId,ТекстОшибки)

	СвязьДокументов = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","СвязьДокументов");
	
	Если ТипЗнч(СвязьДокументов) <> Тип("ТаблицаЗначений") Тогда
		СвязьДокументов = Новый ТаблицаЗначений;
		СвязьДокументов.Колонки.Добавить("Ссылка");
		СвязьДокументов.Колонки.Добавить("documentId");
		СвязьДокументов.Колонки.Добавить("spaceId");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		СтрокиТаблицы = СвязьДокументов.НайтиСтроки(Новый Структура("Ссылка",ДокументСсылка));
		Если СтрокиТаблицы.Количество() > 0 Тогда
			//вряд ли такое возможно
			НоваяСтрока = СтрокиТаблицы[0];
		Иначе
			НоваяСтрока = СвязьДокументов.Добавить();
		КонецЕсли;
		
		НоваяСтрока.Ссылка = ДокументСсылка;
		НоваяСтрока.documentId = documentId;
		НоваяСтрока.spaceId = spaceId;
		
	Иначе
		//удаляем связь
		СтрокиТаблицы = СвязьДокументов.НайтиСтроки(Новый Структура("Ссылка",ИсходнаяСсылка));
		Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
			СвязьДокументов.Удалить(СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли;
	
	ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","СвязьДокументов",СвязьДокументов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСвязь_ОбъединениеДокументовПортала(Идентификаторы,spaceId,ДокументСсылка,ИсходнаяСсылка,ТекстОшибки)
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаОбъединенныхДокументов = РеквизитОбъект.ПолучитьДанныеИзОбщегоХранилища("ОбъединенныеДокументы");
	
	Если ТипЗнч(ТаблицаОбъединенныхДокументов) <> Тип("ТаблицаЗначений") Тогда
		ТаблицаОбъединенныхДокументов = Новый ТаблицаЗначений;
		ТаблицаОбъединенныхДокументов.Колонки.Добавить("documentId");
		ТаблицаОбъединенныхДокументов.Колонки.Добавить("spaceId");
		ТаблицаОбъединенныхДокументов.Колонки.Добавить("Ссылка");
		ТаблицаОбъединенныхДокументов.Колонки.Добавить("Представление");
	КонецЕсли;
	
	Для Каждого Идентификатор Из Идентификаторы Цикл
		
		//Удаляем существующие, если есть, эта связь нам больше не нужна
		СтрокиДокументов = ТаблицаОбъединенныхДокументов.НайтиСтроки(Новый Структура("documentId",Идентификатор));
		Для Каждого СтрокаДокумента Из СтрокиДокументов Цикл
			ТаблицаОбъединенныхДокументов.Удалить(СтрокаДокумента);
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ДокументСсылка) Тогда
			//Создаем новые
			НоваяСтрока = ТаблицаОбъединенныхДокументов.Добавить();
			НоваяСтрока.documentId = Идентификатор;
			НоваяСтрока.spaceId = spaceId;
			НоваяСтрока.Ссылка = ДокументСсылка;
			НоваяСтрока.Представление = Строка(ДокументСсылка);
			
		Иначе
			//Очистим ссылки в данных портала
			ДанныеПортала = ПолучитьИзВременногоХранилища(АдресХранилищаДанныхПортала);
			ДанныеДокумента = ДанныеПортала.documents.НайтиСтроки(Новый Структура("id",Идентификатор));
			Для Каждого СтрокаДокумента Из ДанныеДокумента Цикл
				СтрокаДокумента.ДокументСсылка = Неопределено;
			КонецЦикла;
			
			ПоместитьВоВременноеХранилище(ДанныеПортала,АдресХранилищаДанныхПортала);
			
		КонецЕсли;
		
	КонецЦикла;
	
	РеквизитОбъект.ЗаписатьДанныеВОбщееХранилище("ОбъединенныеДокументы",ТаблицаОбъединенныхДокументов);
	
	//Для Документа запишем в свойство Entera_documentId его собственный GUID, чтобы понимать, что связанные с ним документы хранятся в этой таблице
	ГУИДДокумента = Строка(ДокументСсылка.УникальныйИдентификатор());
	ЗаписатьОчиститьЗначениеСвойстваДокумента(СтруктураНастроек.Свойство_Entera_documentId,ДокументСсылка,ИсходнаяСсылка,ГУИДДокумента,ТекстОшибки);
	ЗаписатьОчиститьЗначениеСвойстваДокумента(СтруктураНастроек.Свойство_Entera_spaceId,ДокументСсылка,ИсходнаяСсылка,spaceId,ТекстОшибки);	
	
КонецПроцедуры

&НаСервере
Функция ДопРасходы_ЗаполнитьДокументПоОснованию(ДокументСсылка,СтрокиДопРасходов,СтруктураЗаполненияДокумента,ПараметрыМК,ТекстОшибки)
		
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		//Пока заполняем только документ ПоступлениеДопРасходов, если он присутствует в конфигурации
		
		//2024.08.05 ( В УНФ поступление доп. расходов отражается документом ДополнительныеРасходы
		Если Метаданные.Документы.Найти("ПоступлениеДопРасходов") <> Неопределено Тогда
			ИмяМетаданныхДокумента = "ПоступлениеДопРасходов";
		ИначеЕсли Метаданные.Документы.Найти("ДополнительныеРасходы") <> Неопределено Тогда
			ИмяМетаданныхДокумента = "ДополнительныеРасходы";
		// ) 2024.08.05
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В конфигурации не был найден документ отражения поступления доп. расходов";
			Сообщение.Сообщить();
			Возврат Неопределено;
		КонецЕсли;
		
		СуммаВключаетНДС = СтруктураНастроек.ЗаполнениеШапки_СуммаВключаетНДС = Истина;
		
		СуммаДопРасходов = 0;
		СуммаНДСДопРасходов = 0;
		
		Для Каждого СтрокаДопРасходов Из СтрокиДопРасходов Цикл
			СуммаДопРасходов = СуммаДопРасходов + ?(СуммаВключаетНДС,СтрокаДопРасходов.amount,СтрокаДопРасходов.amountWithoutVat);
			СуммаНДСДопРасходов = СуммаНДСДопРасходов + СтрокаДопРасходов.vat;
		КонецЦикла;
		
		Если СуммаДопРасходов > 0 Тогда
			СтрокаДопРасходов = СтрокиДопРасходов[0];
			СтавкаНДС = СтрокаДопРасходов.СтавкаНДССсылка;
		
			ПоступлениеДопРасходовОбъект = Документы[ИмяМетаданныхДокумента].СоздатьДокумент();
			ПоступлениеДопРасходовОбъект.Заполнить(ДокументСсылка);
			ПоступлениеДопРасходовОбъект.Дата = ДокументСсылка.Дата;
			
			СтруктураЗаполненияДопРасходов = Новый Структура;
			
			Если РеквизитСуществует("Перечисления","СпособыРаспределенияДопРасходов","ПоСумме") Тогда
				СтруктураЗаполненияДопРасходов.Вставить("СпособРаспределения",Перечисления.СпособыРаспределенияДопРасходов.ПоСумме);
			КонецЕсли;
						
			СтруктураЗаполненияДопРасходов.Вставить("НомерВходящегоДокумента",СтруктураЗаполненияДокумента.document.number);
			СтруктураЗаполненияДопРасходов.Вставить("ДатаВходящегоДокумента",СтруктураЗаполненияДокумента.document.date);
			СтруктураЗаполненияДопРасходов.Вставить("Сумма",СуммаДопРасходов);
			СтруктураЗаполненияДопРасходов.Вставить("СтавкаНДС",СтавкаНДС);
			СтруктураЗаполненияДопРасходов.Вставить("СуммаНДС",СуммаНДСДопРасходов);
			СтруктураЗаполненияДопРасходов.Вставить("Содержание",СтрокаДопРасходов.name);
			
			СтруктураЗаполненияДопРасходов.Вставить("СуммаВключаетНДС",СуммаВключаетНДС);
			
			СтруктураЗаполненияДопРасходов.Вставить("Комментарий",ДокументСсылка.Комментарий);
			
			ЗаполнитьЗначенияСвойств(ПоступлениеДопРасходовОбъект,СтруктураЗаполненияДопРасходов);
			
			//В УНФ в документе ДополнительныеРасходы заполняется табличную часть Расходы
			Если ИмяМетаданныхДокумента = "ДополнительныеРасходы" Тогда
				Для Каждого СтрокаДопРасходов Из СтрокиДопРасходов Цикл
					
					НоваяСтрока = ПоступлениеДопРасходовОбъект.Расходы.Добавить();
					СтруктураРасход = Новый Структура;
					СтруктураРасход.Вставить("Номенклатура",СтрокаДопРасходов.НоменклатураСсылка);
					СтруктураРасход.Вставить("Количество",СтрокаДопРасходов.quantity);
					СтруктураРасход.Вставить("ЕдиницаИзмерения",СтрокаДопРасходов.ЕдиницаИзмеренияСсылка);
					СтруктураРасход.Вставить("Цена",СтрокаДопРасходов.price);
					СтруктураРасход.Вставить("Сумма",СтрокаДопРасходов.amountWithoutVat);
					СтруктураРасход.Вставить("СтавкаНДС",СтрокаДопРасходов.СтавкаНДССсылка);
					СтруктураРасход.Вставить("СуммаНДС",СтрокаДопРасходов.vat);
					СтруктураРасход.Вставить("Всего",СтрокаДопРасходов.amount);
					
					//расшифровка услуги
					Если СтруктураНастроек.ЗаполнениеТЧ_ОписаниеУслугиИзРаспознанногоДокумента = Истина Тогда
						СодержаниеУслуги = СтрокаДопРасходов.name;
					ИначеЕсли ЗначениеЗаполнено(СтрокаДопРасходов.НоменклатураСсылка) Тогда
						СодержаниеУслуги = СтрокаДопРасходов.НоменклатураСсылка.НаименованиеПолное;
					Иначе
						СодержаниеУслуги = СтрокаДопРасходов.name;
					КонецЕсли;
					
					СтруктураРасход.Вставить("Содержание",СодержаниеУслуги);
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураРасход);
				КонецЦикла;
				
				//Распределяем по сумме
				Попытка
					ПоступлениеДопРасходовОбъект.РаспределитьТабЧастьРасходыПоСумме();
				Исключение
					//Не обрабатываем
				КонецПопытки;
				
			КонецЕсли;
			
			
			ПараметрыМК.Вставить("ДокументОбъект",ПоступлениеДопРасходовОбъект);
			ПараметрыМК.Вставить("ТекстОшибки",ТекстОшибки);
			ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
		
			РеквизитОбъект = РеквизитФормыВЗначение("Объект");
			РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Документ_ПередЗаписьюПоступлениеДопРасходов",ПараметрыМК);
			ЗначениеВРеквизитФормы(РеквизитОбъект,"Объект");
			
			ТекстОшибки = ПараметрыМК.ТекстОшибки;
			
			Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
				
				//E1C-512: Не всех устраивает автоматическая установка времени
				Если СтруктураНастроек.ЗаполнениеШапки_УстанавливатьВремяДокументаАвтоматически = Истина Тогда
					//2021.03.22 ( Установим время документа
					ПоступлениеДопРасходовОбъект.УстановитьВремя();
					// ) 2021.03.22
				КонецЕсли;
				
				Попытка
					ПоступлениеДопРасходовОбъект.Записать();
					ПоступлениеДопРасходовСсылка = ПоступлениеДопРасходовОбъект.Ссылка;
				Исключение
					
				КонецПопытки;
				
				Если ЗначениеЗаполнено(ПоступлениеДопРасходовСсылка) Тогда
					
					//Устанавливаем флаг Оригинал получен
					Если СтруктураНастроек.СозданиеДокумента_УстанавливатьФлагОригиналПолучен = Истина Тогда
			
						ОшибкаУстановкиФлага = УстановитьСтатусДокумента_ОригиналПолучен(ПоступлениеДопРасходовСсылка);
						
						Если ЗначениеЗаполнено(ОшибкаУстановкиФлага) Тогда
							ОписаниеСобытия = "Ошибка при установке флага Оригинал получен для <" + ПоступлениеДопРасходовСсылка + ">: " + КраткоеОписаниеОшибки(ОшибкаУстановкиФлага);
						Иначе
							ОписаниеСобытия = "Флаг Оригинал получен для <" + ПоступлениеДопРасходовСсылка + "> установлен";
						КонецЕсли;
						
						ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
						
					КонецЕсли;
					
					//Проводим заполненный документ
					Если СтруктураНастроек.СозданиеДокумента_ПроводитьЗаполненныеДокументы = Истина Тогда
						Попытка
							ПоступлениеДопРасходовОбъект.Записать(РежимЗаписиДокумента.Проведение);
							
							ОписаниеСобытия = "<" + ПоступлениеДопРасходовОбъект + ">: документ успешно проведен";
							ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"СозданиеДокументов");
						Исключение
							ОписаниеСобытия = "- ошибка при проведении документа <" + ПоступлениеДопРасходовОбъект + ">: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
							ДополнитьТекстОшибки(ТекстОшибки,ОписаниеСобытия);
							ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ОшибкаЗаписи");
						КонецПопытки;
					КонецЕсли;
					
				КонецЕсли;
				
				ПараметрыМК.Вставить("ТекстОшибки",ТекстОшибки);
				ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
				РеквизитОбъект.МодульКастомизации_ОбработатьСобытие("Документ_ПослеЗаписиПоступлениеДопРасходов",ПараметрыМК);
				ТекстОшибки = ПараметрыМК.ТекстОшибки;
				
				Если ПараметрыМК.СтандартнаяОбработка = Истина Тогда
					Возврат ПоступлениеДопРасходовСсылка;
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			ОписаниеСобытия = "Ошибка при заполнении поступления доп. расходов: документ-основание не был записан";
			ДополнитьТекстОшибки(ТекстОшибки,ОписаниеСобытия);
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ОшибкаЗаписи");
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции
&НаСервере
Функция ДопРасходы_ЗаполнитьДокументПоСпискуОснований(СписокОснований,СодержаниеУслуги,СтруктураЗаполнения,ПараметрыМК,ТекстОшибки)
		
	Если ЗначениеЗаполнено(СписокОснований) Тогда
		
		//Пока заполняем только документ ПоступлениеДопРасходов, если он присутствует в конфигурации
		Если Метаданные.Документы.Найти("ПоступлениеДопРасходов") = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В конфигурации не найден документ <Поступление доп. расходов>";
			Сообщение.Сообщить();
			Возврат Неопределено;
		КонецЕсли;
		
		СуммаВключаетНДС = СтруктураНастроек.ЗаполнениеШапки_СуммаВключаетНДС = Истина;
		
		СуммаДопРасходов = 0;
		СуммаНДСДопРасходов = 0;
		
		ПоступлениеДопРасходовОбъект = Документы.ПоступлениеДопРасходов.СоздатьДокумент();
		ПоступлениеДопРасходовОбъект.СпособРаспределения = Перечисления.СпособыРаспределенияДопРасходов.ПоСумме;
		
		Если ЗначениеЗаполнено(СтруктураНастроек.ЗаполнениеТЧ_СпособЗачетаАвансовПоУмолчанию) Тогда
			СтруктураЗаполнения.Вставить("СпособЗачетаАвансов",СтруктураНастроек.ЗаполнениеТЧ_СпособЗачетаАвансовПоУмолчанию);
		ИначеЕсли РеквизитСуществует("Перечисления","СпособыЗачетаАвансов","Автоматически") Тогда
			СтруктураЗаполнения.Вставить("СпособЗачетаАвансов",Перечисления.СпособыЗачетаАвансов.Автоматически);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ПоступлениеДопРасходовОбъект,СтруктураЗаполнения);
		ПоступлениеДопРасходовОбъект.Содержание = СодержаниеУслуги.Содержание;
		ПоступлениеДопРасходовОбъект.СтавкаНДС = СодержаниеУслуги.СтавкаНДС;
		ПоступлениеДопРасходовОбъект.СуммаВключаетНДС = СуммаВключаетНДС;
		
		Для Каждого ЭлементСписка Из СписокОснований Цикл
			ДокументСсылка = ЭлементСписка.Значение;
			Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Лок = "KAZ" Тогда
				ПоступлениеДопРасходовОбъект.ЗаполнитьПоДокументуОснования(ДокументСсылка);
			Иначе
				ПоступлениеДопРасходовОбъект.ЗаполнитьПоПоступлению(ДокументСсылка);
			КонецЕсли;
		КонецЦикла;
		
		РеквизитОбъект = РеквизитФормыВЗначение("Объект");
		МодульСчетаУчетаВДокументах = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("СчетаУчетаВДокументах");
		МодульБухгалтерскийУчетПереопределяемый = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("БухгалтерскийУчетПереопределяемый");
		
		//Заполняем счет учета НДС
		Если МодульСчетаУчетаВДокументах <> Неопределено Тогда
			
			Если МодульБухгалтерскийУчетПереопределяемый <> Неопределено Тогда
			
				Для Каждого СтрокаТаблицы Из ПоступлениеДопРасходовОбъект.Товары Цикл
					Если Не ЗначениеЗаполнено(СтрокаТаблицы.СчетУчетаНДС) Тогда
						
						//Логика из формы документа ПоступлениеДопРасходов
						ДанныеОбъекта = Новый Структура("Организация, Дата, СуммаВключаетНДС, СтавкаНДС, ПрименяетсяМалоценка");
						ЗаполнитьЗначенияСвойств(ДанныеОбъекта,ПоступлениеДопРасходовОбъект);
						ДанныеОбъекта.ПрименяетсяМалоценка = Ложь;

						ДанныеСтроки = Новый Структура("Номенклатура, Количество, Сумма, СтавкаНДС, СуммаНДС, Малоценка, АналитикаУчета, АналитикаУчетаЗаполнена");
						ЗаполнитьЗначенияСвойств(ДанныеСтроки,СтрокаТаблицы);
						
						СведенияОНоменклатуре = МодульБухгалтерскийУчетПереопределяемый.ПолучитьСведенияОНоменклатуре(СтрокаТаблицы.Номенклатура, ДанныеОбъекта, Ложь, Ложь);
						
						СчетаУчетаКЗаполнению = Новый Соответствие;
						СчетаУчетаКЗаполнению.Вставить("Товары.СчетУчетаНДС",Истина);
						
						ЗаполненныеСчета = МодульСчетаУчетаВДокументах.ЗаполнитьРеквизитыПриИзменении(
							Документы.ПоступлениеДопРасходов,
							СчетаУчетаКЗаполнению,
							ДанныеОбъекта,
							"Товары",
							СтрокаТаблицы);
						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			//Шапка документа
			ПоступлениеДопРасходовОбъект.ДополнительныеСвойства.Вставить("ЗаполнитьСчетаУчетаПередЗаписью",Истина);
			Попытка МодульСчетаУчетаВДокументах.ЗаполнитьПередЗаписью(ПоступлениеДопРасходовОбъект,РежимЗаписиДокумента.Запись); Исключение; КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПоступлениеДопРасходовОбъект;
	
КонецФункции

&НаСервереБезКонтекста
Функция УстановитьСтатусДокумента_ОригиналПолучен(ДокументСсылка)
	
	Если Метаданные.РегистрыСведений.Найти("СтатусыДокументов") <> Неопределено
		И Метаданные.Перечисления.Найти("СтатусыДокументовПоступления") <> Неопределено
		И Метаданные.Перечисления.СтатусыДокументовПоступления.ЗначенияПеречисления.Найти("ОригиналПолучен") <> Неопределено Тогда
		
		Организация = Неопределено;
		
		//В свежих версиях бухни УстановитьСтатусыДокумента в качестве статуса принимает на вход Структуру из СтатусыДокументов.НовыеСтатусыДокумента()
		//Пробуем в попытке вызвать функцию НовыеСтатусыДокумента, если вернется структура - передадим ее, если нет - версия конфигурации старая,
		//используем исходный алгоритм установки статуса из перечисления
		Попытка
			//Статус ОригиналПолучен относится к документу ПоступлениеТоваровУслуг,
			//для других типов документов такая операция сбросит предустановленный статус
			ЗначениеСтатуса = РегистрыСведений.СтатусыДокументов.ПолучитьСтатусыДокумента(ДокументСсылка, Организация);
			Если ТипЗнч(ЗначениеСтатуса.Статус) = Тип("ПеречислениеСсылка.СтатусыДокументовПоступления") Тогда
				ЗначениеСтатуса = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
				ЗначениеСтатуса.Статус = Перечисления.СтатусыДокументовПоступления.ОригиналПолучен;
			КонецЕсли;
		Исключение
			ЗначениеСтатуса = Перечисления.СтатусыДокументовПоступления.ОригиналПолучен;
		КонецПопытки;			
		
		Попытка
			РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокумента(ДокументСсылка,ЗначениеСтатуса);
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Возврат ТекстОшибки;
		КонецПопытки;
		
	КонецЕсли;
	
КонецФункции
&НаСервереБезКонтекста
Функция СчетФактура_ДанныеСчетаФактурыУказываютсяВДокументеОсновании(ДокументСсылка)
	
	Результат = Ложь;
	
	Если ДокументСсылка.Метаданные().Реквизиты.Найти("ЭтоУниверсальныйДокумент") <> Неопределено
		И ДокументСсылка.ЭтоУниверсальныйДокумент = Истина Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции


// ================= Отправка документа на распознавание ===================

&НаКлиенте
Процедура СписокДокументовПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	//Не нужно пытаться открыть файл средствами платформы
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
&НаКлиенте
Процедура СписокДокументовПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Отбор_Пространство) Тогда
		ПоказатьОповещениеПользователя("Не выбрано пространство",,"для отправки документа на распознавание");
		Возврат;
	КонецЕсли;
	
	ФайлыДляПередачи = Новый Массив;
	
	Если ЭтоВебКлиент Тогда
		//перетаскивание файла в веб-клиенте не реализовано
	Иначе
		
	
		Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Файл") Тогда
			МассивФайлов = Новый Массив;
			МассивФайлов.Добавить(ПараметрыПеретаскивания.Значение);
		ИначеЕсли ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
			МассивФайлов = ПараметрыПеретаскивания.Значение;
		КонецЕсли;
				
		Если МассивФайлов <> Неопределено Тогда
			
			Для Каждого ФайлМассива Из МассивФайлов Цикл
				Файл = Новый Файл(ФайлМассива.ПолноеИмя);
					
				//При отправке файла с клиента используем ПолноеИмяФайлаНаКлиенте, на сервер отдаем файл через временное хранилище
				ОтправляемыйФайл = Новый Структура;
				ОтправляемыйФайл.Вставить("АдресВХ",ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Файл.ПолноеИмя),Новый УникальныйИдентификатор));
				ОтправляемыйФайл.Вставить("ИмяФайла",Файл.Имя);
				ОтправляемыйФайл.Вставить("ПолноеИмяФайлаНаКлиенте",Файл.ПолноеИмя);
				ОтправляемыйФайл.Вставить("КодированноеИмяФайла",КодироватьСтрокуПараметровНаСервере(Файл.Имя));
				ОтправляемыйФайл.Вставить("РазмерФайла",СформироватьПредставлениеРазмераФайла(Файл.Размер()));
				
				ФайлыДляПередачи.Добавить(ОтправляемыйФайл);
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ФайлыДляПередачи.Количество() > 0 Тогда
		ПоказатьФорму_ОтправляемыеФайлы(ФайлыДляПередачи);				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьДокумент(Команда)
		
	Если Не ЗначениеЗаполнено(Отбор_Пространство) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Пространство не может быть пустым";
		Сообщение.Поле = "Отбор_Пространство";		
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	
	Если ЭтоВебКлиент Тогда
		ПараметрыВызоваНачало = Новый Структура("Обработчик,ДопПараметры","ОбработатьНачалоВыбораФайлов_ВебКлиент",ДопПараметры);
		ПараметрыВызоваЗавершение = Новый Структура("Обработчик,ДопПараметры","ОбработатьВыборФайлов_ВебКлиент",ДопПараметры);
		ПараметрыВызова = Новый Структура("ПараметрыВызоваНачало,ПараметрыВызоваЗавершение",ПараметрыВызоваНачало,ПараметрыВызоваЗавершение);
		_ЗФ_ОбработатьАсинхронныйВызов("ПоместитьФайлы",ПараметрыВызова);
		
	Иначе		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.МножественныйВыбор = Истина;
		
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ДиалогВыбораФайла","ОбработатьВыборФайлов",ДопПараметры,Диалог);
		_ЗФ_ОбработатьАсинхронныйВызов("ДиалогВыбораФайла",ПараметрыВызова);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайлов(Результат,ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		
		ФайлыДляПередачи = Новый Массив;
		
		Для Каждого ФайлМассива Из Результат Цикл
			ОтправляемыйФайл = Новый Структура;
		
			Файл = Новый Файл(ФайлМассива);
			
			//При отправке файла с клиента используем ПолноеИмяФайлаНаКлиенте, на сервер отдаем файл через временное хранилище
			ОтправляемыйФайл.Вставить("АдресВХ",ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Файл.ПолноеИмя),УникальныйИдентификатор));
			ОтправляемыйФайл.Вставить("ИмяФайла",Файл.Имя);
			ОтправляемыйФайл.Вставить("ПолноеИмяФайлаНаКлиенте",Файл.ПолноеИмя);
			ОтправляемыйФайл.Вставить("КодированноеИмяФайла",КодироватьСтрокуПараметровНаСервере(Файл.Имя));
			ОтправляемыйФайл.Вставить("РазмерФайла",СформироватьПредставлениеРазмераФайла(Файл.Размер()));
				
			ФайлыДляПередачи.Добавить(ОтправляемыйФайл);
		КонецЦикла;
		
		ПоказатьФорму_ОтправляемыеФайлы(ФайлыДляПередачи);
						
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьНачалоВыбораФайлов_ВебКлиент(ПомещенныеФайлы,Отказ,ДопПараметры) Экспорт
	Соответствия = Новый Соответствие;
	Для Каждого ФайлДляПередачи Из ПомещенныеФайлы Цикл
		Соответствия.Вставить(Строка(ФайлДляПередачи.ИдентификаторФайла),ФайлДляПередачи.Имя);
	КонецЦикла;
	ДопПараметры.Вставить("Соответствия",Соответствия);
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьВыборФайлов_ВебКлиент(ПомещенныеФайлы,ДопПараметры) Экспорт
	Если ПомещенныеФайлы <> Неопределено Тогда
		
		ФайлыДляПередачи = Новый Массив;
		
		Для Каждого ФайлДляПередачи Из ПомещенныеФайлы Цикл
			
			ИмяФайла = ДопПараметры.Соответствия.Получить(Строка(ФайлДляПередачи.ИдентификаторФайла));
			
			ОтправляемыйФайл = Новый Структура;
			ОтправляемыйФайл.Вставить("АдресВХ",ФайлДляПередачи.Хранение);
			ОтправляемыйФайл.Вставить("ИмяФайла",ИмяФайла);
			ОтправляемыйФайл.Вставить("ПолноеИмяФайлаНаКлиенте",ИмяФайла);
			ОтправляемыйФайл.Вставить("КодированноеИмяФайла",КодироватьСтрокуПараметровНаСервере(ИмяФайла));
			ОтправляемыйФайл.Вставить("РазмерФайла");
			
			ФайлыДляПередачи.Добавить(ОтправляемыйФайл);			
		КонецЦикла;
			
		ПоказатьФорму_ОтправляемыеФайлы(ФайлыДляПередачи);
		
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ПоказатьФорму_ОтправляемыеФайлы(ФайлыДляПередачи)
	
	//E1C-399: Теперь предварительно уточняем по хэшу файлов, отправлялись ли они ранее на распознавание
	ОтправляемыеФайлы_РасчитатьХэшИПроверитьДубликаты(ФайлыДляПередачи);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ФайлыДляПередачи",ФайлыДляПередачи);
	ПараметрыОткрытия.Вставить("ЭтоВебКлиент",ЭтоВебКлиент);
	ПараметрыОткрытия.Вставить("СтруктураНастроек",СтруктураНастроек);
	
	ФормаОтправляемыеФайлы = ПолучитьФорму(ПрефиксИмениФорм + "УФ_ОтправляемыеФайлы", ПараметрыОткрытия, ЭтаФорма);

	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Источник","УФ_ОтправляемыеФайлы");
	ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,Форма","ОбработатьЗакрытиеФормы_СинхронноАсинхронно",ДопПараметры,ФормаОтправляемыеФайлы);
	
	_ЗФ_ОбработатьАсинхронныйВызов("ОткрытьФормуМодально",ПараметрыВызова);	
	
КонецПроцедуры
&НаКлиенте
Процедура ОтправляемыеФайлы_РасчитатьХэшИПроверитьДубликаты(ФайлыДляПередачи)
	
	//Описание метода /api/v1/checkExistence:
	//POST запрос на https://app.entera.pro/api/v1/checkExistence
	//hashList - Array of strings (Список хешей файлов.)
	//spaceId - string <uuid> (ID папки)
	
	ОбщееКоличество = ФайлыДляПередачи.Количество();
	Счетчик = 0;
	
	Для Каждого ФайлДляПередачи Из ФайлыДляПередачи Цикл
		
		Счетчик = Счетчик + 1;
		Прогресс = Счетчик / ОбщееКоличество * 100;
		Состояние("Проверка ранее отправленных файлов...",Прогресс);
		
		СтрокаХэш = ОтправляемыеФайлы_РасчитатьХэшФайлаНаСервере(ФайлДляПередачи.АдресВХ);
		
		ТелоЗапроса = ОтправляемыеФайлы_СформироватьТелоЗапросаПроверкиДубликатов(СтрокаХэш);
		
		МетодAPI = "/api/v1/checkExistence?format=xml";
		РезультатЗапроса = ВыполнитьЗапрос("ПроверитьДубликатыФайловПоХэш","POST",МетодAPI,ТелоЗапроса);
		
		Если РезультатЗапроса.Успешно Тогда
			КонтрольДубликата = РезультатЗапроса.КонтрольДубликата;
		Иначе
			КонтрольДубликата = "Ошибка проверки";
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "[" + Строка(ФайлДляПередачи.ИмяФайла) + "]: ошибка при проверке на повторную отправку" + Символы.ПС + РезультатЗапроса.ТекстОшибки;
			Сообщение.Сообщить();
		КонецЕсли;
		
		ФайлДляПередачи.Вставить("Статус",КонтрольДубликата);
		
	КонецЦикла;
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция ОтправляемыеФайлы_РасчитатьХэшФайлаНаСервере(АдресВХ)
	
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресВХ);
	Хэш = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хэш.Добавить(ДвоичныеДанныеФайла);
	СтрокаХэш = Base64Строка(Хэш.ХешСумма);
	
	Возврат СтрокаХэш;
	
КонецФункции
&НаКлиенте
Функция ОтправляемыеФайлы_СформироватьТелоЗапросаПроверкиДубликатов(СтрокаХэш)
	
	//Пример тела запроса:
	//{
 	//"spaceId": "a64adf64-92fb-4ce2-8b34-e91cc8a9e2fa",
 	//"hashList": [
    //"wfOIhJYF8wxWedftLXD+goZkuFnYIbo1cLkWpHEztBg=",
    //"3XNAvD8BW0IqgV4+OaV1HeAbBk0HhocyK6hk9F2VaYo="
	//]
	//}
	
	ТелоЗапроса = "";
	ТелоЗапроса = ТелоЗапроса + "{" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """spaceId"": """ + Отбор_Пространство + """," + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """hashList"": [""" + СтрокаХэш + """]" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + "}";
	
	Возврат ТелоЗапроса;
	
КонецФункции

&НаКлиенте
Функция ОтправитьДокументНаПортал(ФайлыДляПередачи,УведомлятьНаПочтуОВыполненныхЗаданиях)
		
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ФайлыДляПередачи",ФайлыДляПередачи);
	
	Состояние("Отправка файлов на портал...");
	
	source = ?(ЭтоФреш,"MODULE_1C_FRESH","MODULE_1C");
	
	РезультатЗапроса = ВыполнитьЗапрос("ОтправкаНаРаспознавание","POST","/api/v1/recognitionTasks/multiple?format=xml&source=" + source + "&spaceId=" + Отбор_Пространство,,ПараметрыЗапроса);
	
	Если РезультатЗапроса.Успешно Тогда
		
		// добавить задания распознавания в коллекцию и отслеживать по настройке
		Для Каждого Задание Из РезультатЗапроса.МассивЗаданий Цикл
			
			НоваяСтрока = ЗаданияРаспознавания_Таблица.Добавить();
			НоваяСтрока.recognitionTaskId = Задание.recognitionTaskId;
			НоваяСтрока.ИмяФайла = Задание.ИмяФайла;
			НоваяСтрока.КоличествоФайлов = Задание.КоличествоФайлов;
			
			//E1C-18: уведомление о готовности распознавания при отправке на распознавание
			Если УведомлятьНаПочтуОВыполненныхЗаданиях = Истина Тогда
				
				//POST /api/v1/recognitionTasks/:id/scheduleCompletionNotification
				
				ОписаниеСобытия = "Запрос уведомления о готовности распознавания: recognitionTaskId=[" + Задание.recognitionTaskId + "]";
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"ЗаданияРаспознавания",ОписаниеСобытия,"ЗаданияРаспознавания");	
				
				РезультатЗапроса_Уведомление = ВыполнитьЗапрос("УведомленияНаПочтуОВыполненныхЗаданиях","POST","/api/v1/recognitionTasks/" + Задание.recognitionTaskId + "/scheduleCompletionNotification","{}");
				
				//О результате этого запроса пользователю можно не сообщать, только запишем в лог
				Если РезультатЗапроса_Уведомление.Успешно Тогда
					ОписаниеСобытия = "Успешно: запрос уведомления о готовности распознавания: recognitionTaskId=[" + Задание.recognitionTaskId + "]";
					ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"ЗаданияРаспознавания",ОписаниеСобытия,"ЗаданияРаспознавания");	
				Иначе
					ОписаниеСобытия = "Ошибка: запрос уведомления о готовности распознавания: recognitionTaskId=[" + Задание.recognitionTaskId + "]: " + РезультатЗапроса_Уведомление.ТекстОшибки;
					ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"ЗаданияРаспознавания",ОписаниеСобытия,"ЗаданияРаспознавания");	
				КонецЕсли;
			КонецЕсли;
						
		КонецЦикла;
		
		//Обработка успешной отправки файлов в МК: выполняем на клиенте
		Если ИспользуетсяМК Тогда
			
			// модуль кастомизации
			ПараметрыМК = Новый Структура;
			ПараметрыМК.Вставить("АдресХранилищаДанныхПортала",АдресХранилищаДанныхПортала);
			ПараметрыМК.Вставить("СтруктураНастроек",СтруктураНастроек);
			ПараметрыМК.Вставить("ДопПараметры",Новый Структура);
			ПараметрыМК.Вставить("ФайлыДляПередачи",ФайлыДляПередачи);
			ПараметрыМК.Вставить("СтандартнаяОбработка",Истина);
			
			ИмяСобытия = "ОсновнаяФорма_ПослеУспешнойОтправкиФайловНаРаспознавание";
			
			ОписаниеОбработчика = ИмяСобытия + ": передача клиентского события для обработки в МК";
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Модуль",ОписаниеОбработчика,"ВыполнениеМК_Клиент");
			
			Попытка
				МодульМК_Клиент.ОбработатьКлиентскоеСобытиеОсновногоМодуля(ИмяСобытия,ПараметрыМК);
			Исключение
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				
				Если ПараметрыМК.Свойство("ТекстОшибки") Тогда
					ТекстОшибки = ТекстОшибки + Символы.ПС + ПараметрыМК.ТекстОшибки;
				КонецЕсли;
				
				ОписаниеОбработчика = ИмяСобытия + ": при обработке клиентского события в МК возникла ошибка:" + Символы.ПС + ТекстОшибки;
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,1,"Модуль",ОписаниеОбработчика,"Ошибка");
			КонецПопытки;
			
		КонецЕсли;
		
	Иначе
		СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
	КонецЕсли;
	
	//2019.05.14 (EN-438: теперь задания на распознавание нужно отображать и в списке документов
	//чтобы пользователь мог увидеть какие файлы загрузил а какие нет.
	СписокДокументов_ОтобразитьЗаданияНаРаспознавание();
	// ) 2019.05.14
		
	Возврат РезультатЗапроса;
	
КонецФункции
&НаКлиенте
Процедура СписокДокументов_ОтобразитьЗаданияНаРаспознавание()
	
	Если СтруктураНастроек.Свойство("ОбменДанными_ОтображатьЗаданияРаспознавания")
		И СтруктураНастроек.ОбменДанными_ОтображатьЗаданияРаспознавания = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Задание Из ЗаданияРаспознавания_Таблица Цикл
		
		СтрокиЗадания = Объект.СписокДокументов.НайтиСтроки(Новый Структура("recognitionTaskId",Задание.recognitionTaskId));
		
		Если СтрокиЗадания.Количество() = 0 Тогда
			НоваяСтрокаДокумент = Объект.СписокДокументов.Вставить(0);
			
			НоваяСтрокаДокумент.recognitionTaskId = Задание.recognitionTaskId;
			НоваяСтрокаДокумент.ПредставлениеДокумента = Задание.ИмяФайла;
							
			НоваяСтрокаДокумент.ПространствоИД = Отбор_Пространство;
			
			НоваяСтрокаДокумент.ДокументСтатус = "RECOGNIZING";
			НоваяСтрокаДокумент.ПредставлениеСтатуса = "На распознавании";
			НоваяСтрокаДокумент.ПредставлениеПлательщика = "-";
			НоваяСтрокаДокумент.ПредставлениеПоставщика = "-";
			НоваяСтрокаДокумент.НаправлениеСоздаваемогоДокумента = "-";
			
			НоваяСтрокаДокумент.url = "https://app.entera.pro/spaces/" + Отбор_Пространство + "/documents/recognizing";
			
			НоваяСтрокаДокумент.ДатаЗагрузки = ТекущаяДата();
			НоваяСтрокаДокумент.ДокументЗагрузил = Элементы.Авторизация.Заголовок;				
			
			//2021.11.01 ( Отображаем строку в списке
			НоваяСтрокаДокумент.Документ_СоответствуетОтбору = Истина;
			// ) 2021.11.01
		КонецЕсли;
	КонецЦикла;
	
	Если СтруктураНастроек.ОбменДанными_ОпрашиватьСтатусЗаданийРаспознавания = Истина
		И ЗаданияРаспознавания_Таблица.Количество() > 0 Тогда
		Элементы.НаРаспознаванииАнимация.Видимость = Истина;
		
		//E1C-102: Интервал опроса выполняющихся заданий распознавания вынесен в настройки
		Если СтруктураНастроек.ОбменДанными_ИнтервалОпросаЗаданий = "15 секунд" Тогда
			ИнтервалОпроса = 15;
		ИначеЕсли СтруктураНастроек.ОбменДанными_ИнтервалОпросаЗаданий = "1 минута" Тогда
			ИнтервалОпроса = 60;
		ИначеЕсли СтруктураНастроек.ОбменДанными_ИнтервалОпросаЗаданий = "5 минут" Тогда
			ИнтервалОпроса = 300;
		ИначеЕсли СтруктураНастроек.ОбменДанными_ИнтервалОпросаЗаданий = "10 минут" Тогда
			ИнтервалОпроса = 600;
		Иначе
			//Исходный вариант
			ИнтервалОпроса = 15;
		КонецЕсли;
		// ) E1C-102
	
		ПодключитьОбработчикОжидания("ВыполнитьОбновлениеСтатусовЗаданийРаспознавания",ИнтервалОпроса,Ложь);
	Иначе
		Элементы.НаРаспознаванииАнимация.Видимость = Ложь;
	КонецЕсли;
	
	БыстрыйФильтр_УстановитьОтборПоВыбраннымТипам();
	ПересчитатьИтогиПоСтатусамДокументов();
	
КонецПроцедуры


// ================= Задания распознавания ===================

&НаКлиенте
Процедура ВыполнитьОбновлениеСтатусовЗаданийРаспознавания() Экспорт
		
	Если СтруктураНастроек.ОбменДанными_ОпрашиватьСтатусЗаданийРаспознавания = Ложь Тогда
		ОтключитьОбработчикОжидания("ВыполнитьОбновлениеСтатусовЗаданийРаспознавания");
	КонецЕсли;
	
	Если ДанныеПользователя = Неопределено Тогда //Не авторизовался
		Возврат;
	ИначеЕсли Не ДанныеПользователя.phoneConfirm Тогда
		ПоказатьОповещениеПользователя("Не подтвержден телефон",,"Не удалось получить статус заданий распознавания");
		ОткрытьФормуПодтвержденияТелефона();		
		Возврат;
	КонецЕсли;
	
	Если ЗаданияРаспознавания_Таблица.Количество() > 0 Тогда
				
		УдалитьЗадания = Новый Массив;
		
		Для Каждого ЗаданиеРаспознавания Из ЗаданияРаспознавания_Таблица Цикл
			РезультатЗапроса = ВыполнитьЗапрос("СтатусЗаданияРаспознавания","GET","/api/v1/recognitionTasks/" + ЗаданиеРаспознавания.recognitionTaskId + "?format=xml");
			
			//Сейчас два статуса говорят о том, что распознание документа завершено, RECOGNIZED и ERROR
			Если РезультатЗапроса.Успешно Тогда
				Если РезультатЗапроса.state = "RECOGNIZED" Тогда //распознавание завершено
					УдалитьЗадания.Добавить(ЗаданиеРаспознавания.recognitionTaskId);
					
				ИначеЕсли РезультатЗапроса.state = "ERROR" Тогда //распознавание завершено с ошибками
					УдалитьЗадания.Добавить(ЗаданиеРаспознавания.recognitionTaskId);
					СообщитьСообщение("Ошибка распознавания файла <" + ЗаданиеРаспознавания.ИмяФайла + ">: " + РезультатЗапроса.errorDescription,СтатусСообщения.Важное);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого УдаляемоеЗадание Из УдалитьЗадания Цикл
			КоличествоФайлов = 0;
			УдаляемыеСтроки = ЗаданияРаспознавания_Таблица.НайтиСтроки(Новый Структура("recognitionTaskId",УдаляемоеЗадание));
			Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
				ИмяФайла = УдаляемаяСтрока.ИмяФайла;
				КоличествоФайлов = КоличествоФайлов + УдаляемаяСтрока.КоличествоФайлов;
				ЗаданияРаспознавания_Таблица.Удалить(УдаляемаяСтрока);
			КонецЦикла;
			
			//2019.05.14 (EN-438: теперь задания на распознавание нужно отображать и в списке документов
			//чтобы пользователь мог увидеть какие файлы загрузил а какие нет. Очищаем завершенные задания
			СтрокиЗадания = Объект.СписокДокументов.НайтиСтроки(Новый Структура("recognitionTaskId",УдаляемоеЗадание));
			Для каждого СтрокаЗадания Из СтрокиЗадания Цикл
				Объект.СписокДокументов.Удалить(СтрокаЗадания);
			КонецЦикла;
			// ) 2019.05.14
			
		КонецЦикла;
		
		//В старых конфигурациях может не оказаться этой картинки
		Попытка КартинкаУспешно = БиблиотекаКартинок.Успешно32; Исключение; КонецПопытки;
		
		Если УдалитьЗадания.Количество() = 1 Тогда
			ПоказатьОповещениеПользователя("Распознавание завершено",,ИмяФайла,КартинкаУспешно);
		ИначеЕсли УдалитьЗадания.Количество() > 1 Тогда
			ПоказатьОповещениеПользователя("Распознавание завершено",,"Распознавание " + КоличествоФайлов + " файлов завершено",КартинкаУспешно);
		КонецЕсли;
		
		Если ЗаданияРаспознавания_Таблица.Количество() = 0 Тогда
			ОтключитьОбработчикОжидания("ВыполнитьОбновлениеСтатусовЗаданийРаспознавания");
			Элементы.НаРаспознаванииАнимация.Видимость = Ложь;
			ОбновитьТекстКнопкиБаланс();
		КонецЕсли;
		
	КонецЕсли;
	
	БыстрыйФильтр_УстановитьОтборПоВыбраннымТипам();
	
	ПересчитатьИтогиПоСтатусамДокументов();
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияРаспознаванияКоличествоСтрокНажатие(Элемент, СтандартнаяОбработка)
	ВыполнитьОбновлениеСтатусовЗаданийРаспознавания();
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияРаспознавания_ПолучитьСписокВыполняющихся() Экспорт
				
	Если ЗначениеЗаполнено(Отбор_Пространство) Тогда
		
		РезультатЗапроса = ВыполнитьЗапрос("СписокВыполняющихсяЗаданийРаспознавания","GET","/api/v1/recognitionTasks/running?format=xml&spaceId=" + Отбор_Пространство);
		
		Если РезультатЗапроса.Успешно Тогда
		
			// добавить задания распознавания в коллекцию и отслеживать по настройке
			Для Каждого Задание Из РезультатЗапроса.МассивЗаданий Цикл
				
				СуществующиеЗадания = ЗаданияРаспознавания_Таблица.НайтиСтроки(Новый Структура("recognitionTaskId",Задание.recognitionTaskId));
				
				Если СуществующиеЗадания.Количество() = 0 Тогда
				
					НоваяСтрока = ЗаданияРаспознавания_Таблица.Добавить();
					НоваяСтрока.recognitionTaskId = Задание.recognitionTaskId;
					НоваяСтрока.ИмяФайла = Задание.ИмяФайла;
					НоваяСтрока.КоличествоФайлов = Задание.КоличествоФайлов;
					
				КонецЕсли;
							
			КонецЦикла;
		Иначе
			СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
		КонецЕсли;
		
		СписокДокументов_ОтобразитьЗаданияНаРаспознавание();
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Команда_УскоритьРаспознавание(Команда)
	
	ТекСтрока = Элементы.СписокДокументов.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекСтрока.recognitionTaskId) Тогда
			 
			РезультатЗапроса = ВыполнитьЗапрос("УскорениеРаспознавания","POST","/api/v1/recognitionTasks/" + ТекСтрока.recognitionTaskId + "/speedUp?format=xml","{}");
			
			Если РезультатЗапроса.Успешно Тогда
				ПоказатьОповещениеПользователя("Ускорение распознавания",,"приоритет задания повышен");
			Иначе
				СообщитьСообщение("Запрос ускорения распознавания:" + Символы.ПС + РезультатЗапроса.ТекстОшибки);
			КонецЕсли;
			
		Иначе
			ПоказатьОповещениеПользователя("Ускорение распознавания",,"недоступно для уже распознанных документов");
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Команда_УдалитьДокументНаПортале(Команда)
	
	МассивСтрок = Новый Массив;
	
	Для Каждого ИдентификаторСтроки Из Элементы.СписокДокументов.ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.СписокДокументов.НайтиПоИдентификатору(ИдентификаторСтроки);
		//Задания распознавания не удаляются
		Если СтрокаТаблицы.recognitionTaskId = "" Тогда
			МассивСтрок.Добавить(ИдентификаторСтроки);
		КонецЕсли;
	КонецЦикла;	
	
	Если МассивСтрок.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрок",МассивСтрок);
		
		ТекстВопроса = "Документы в выбранных строках будут удалены
					   |из вашего личного кабинета на сайте entera.pro, продолжить?";
		Кнопки = РежимДиалогаВопрос.ДаНет;
		
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","Продолжить_УдалениеДокументовНаПортале",ДопПараметры,ТекстВопроса,Кнопки);
		_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
	Иначе
		ПоказатьОповещениеПользователя("Удаление документов",,"не выбрано документов, доступных для удаления");
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура Продолжить_УдалениеДокументовНаПортале(Результат,ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ОбщийТекстОшибки = "";
		
		УдаляемыеСтроки = Новый Массив;
		
		Для Каждого ЭлементМассива Из ДопПараметры.МассивСтрок Цикл
			
			СтрокаДокумента = Объект.СписокДокументов.НайтиПоИдентификатору(ЭлементМассива);
			
			РезультатЗапроса = ВыполнитьЗапрос("УдалениеДокументовНаПортале","DELETE","/api/v1/documents/" + СтрокаДокумента.ДокументИД + "?format=xml");
			
			Если РезультатЗапроса.Успешно Тогда
				УдаляемыеСтроки.Добавить(ЭлементМассива);
			Иначе
				ТекстОшибки = СтрокаДокумента.ПредставлениеДокумента + "<" + СтрокаДокумента.ДокументИД
					+ "> ошибка при удалении: " + РезультатЗапроса.ТекстОшибки;
				ДополнитьТекстОшибки(ОбщийТекстОшибки,ТекстОшибки);
				
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"УдалениеДокументов",ТекстОшибки,"УдалениеДокументов");
			КонецЕсли;
		КонецЦикла;
		
		//удаляем из списка успешно удаленные на портале
		Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
			СтрокаДокумента = Объект.СписокДокументов.НайтиПоИдентификатору(УдаляемаяСтрока);
			Объект.СписокДокументов.Удалить(СтрокаДокумента);
		КонецЦикла;
		
		//Уведомляем пользователя
		Если УдаляемыеСтроки.Количество() = 1 Тогда
			ПоказатьОповещениеПользователя("Удаление выполнено",,СтрокаДокумента.ПредставлениеДокумента);
		ИначеЕсли УдаляемыеСтроки.Количество() > 1 Тогда
			ПоказатьОповещениеПользователя("Удаление выполнено",,"Удалено документов: " + УдаляемыеСтроки.Количество());
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбщийТекстОшибки) Тогда
			СообщитьСообщение(ОбщийТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


// ================= Задания уведомлений ===================

&НаСервере
Функция УведомлениеПорталуОСозданииДокументов_ДобавитьДокумент(ДокументСсылка,ДокументИД)
	
	//Чтобы не заводить под это еще одну таблицу используется СписокЗначений, Значение - документ, Представление - идентификатор
	//перебираем Задания на наличие такого идентификатора в представлении
	
	Для Каждого ЭлементСписка Из ЗаданияУведомления Цикл
		Если ЭлементСписка.Представление = ДокументИД Тогда
			//Такой ИД документа уже есть, заменяем на актуальный документ
			ДобавляемыйЭлемент = ЭлементСписка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ДобавляемыйЭлемент = Неопределено Тогда
		ЗаданияУведомления.Добавить(ДокументСсылка,ДокументИД);
	Иначе
		ДобавляемыйЭлемент.Значение = ДокументСсылка;
	КонецЕсли;		
	
КонецФункции
&НаКлиенте
Процедура УведомлениеПорталуОСозданииДокументов_ОпределитьНеобходимостьОтправки() Экспорт
		
	Если ЗаданияУведомления.Количество() > 0 Тогда
		
		// Отправляем по настройке		
		Если СтруктураНастроек.ОбменДанными_ОтправлятьУведомлениеОЗагрузкеАвтоматически = Истина Тогда
			УведомлениеПорталуОСозданииДокументов_Отправить();
			
		Иначе
			//с 2019.06.24 эта часть не выполняется, так как оставлена только автоматическая отправка
			Возврат;
			
			ДопПараметры = Новый Структура;
			ТекстВопроса = "Отправить уведомление порталу об успешном созданнии документов?
						   |(Вывод этого предупреждения можно отключить в настройках обработки)";
			Кнопки = РежимДиалогаВопрос.ДаНет;
			
			ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","УведомлениеПорталуОСозданииДокументов_ОбработатьОпределениеНеобходимостиОтправки",ДопПараметры,ТекстВопроса,Кнопки);
			_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры
&НаКлиенте
Процедура УведомлениеПорталуОСозданииДокументов_ОбработатьОпределениеНеобходимостиОтправки(Результат,ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		УведомлениеПорталуОСозданииДокументов_Отправить();
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Функция УведомлениеПорталуОСозданииДокументов_Отправить() Экспорт
	
	ТелоЗапроса = УведомлениеПорталуОСозданииДокументов_СформироватьТелоЗапроса();
	
	Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
		ПараметрыЗапроса = Новый Структура;
		РезультатЗапроса = ВыполнитьЗапрос("УведомлениеОСозданииДокументов","POST","/api/v1/integrations/1c?format=xml",ТелоЗапроса,ПараметрыЗапроса);
		
		Если РезультатЗапроса.Успешно Тогда
			//Список заданий уже очистили в ОбработатьРезультатЗапроса
		Иначе
			СообщитьСообщение("Отправка уведомления порталу о созданных документах:" + Символы.ПС + РезультатЗапроса.ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатЗапроса;
	
КонецФункции
&НаСервере
Функция УведомлениеПорталуОСозданииДокументов_СформироватьТелоЗапроса()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	Возврат РеквизитОбъект.УведомлениеПорталуОСозданииДокументов_СформироватьТелоЗапроса(ЗаданияУведомления);
	
КонецФункции


// ================= Работа со сканами документов ===================

&НаКлиенте
Функция ЗаполнитьАдресХранилищаСканаДокумента()
	
	Результат = Новый Структура("Успешно,ТекстОшибки,ТребуетсяПовтор",Истина);
	
	СтрокиДокументов = Объект.СписокДокументов.НайтиСтроки(Новый Структура("Пометка",Истина));
	
	ОбщийТекстОшибки = "";
	
	Счетчик = 0;
	
	ТребуетсяПовтор = Ложь;
	
	Для Каждого СтрокаДокумента Из СтрокиДокументов Цикл
		
		Счетчик = Счетчик + 1;
		Прогресс = Счетчик / СтрокиДокументов.Количество() * 100;
		Состояние("Получение сканов документов от портала...",Прогресс);
		
		ОписаниеСобытия = "Получение с портала файла скана для документа [" + СтрокаДокумента.ДокументИД + "]";
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ПолучениеСкана");
		
		РезультатЗапроса = ПолучитьПечатнуюФормуСканаДокумента(СтрокаДокумента.ДокументИД,СтрокаДокумента.ПредставлениеДокумента);
		
		Если РезультатЗапроса.Успешно Тогда
			Если РезультатЗапроса.ТребуетсяПовтор Тогда
				ТребуетсяПовтор = Истина;
				ДополнитьТекстОшибки(ОбщийТекстОшибки,РезультатЗапроса.ТекстОшибки);
			Иначе
				СтрокаДокумента.АдресХранилищаСканаДокумента = РезультатЗапроса.АдресВХ;
				СтрокаДокумента.ИмяФайлаСканаДокумента = РезультатЗапроса.ИмяФайла;
			КонецЕсли;
		Иначе
			ДополнитьТекстОшибки(ОбщийТекстОшибки,РезультатЗапроса.ТекстОшибки);
		КонецЕсли;
		
		//Также если используется настройка комплектов документов, нужно получить скан дочернего документа
		Если СтруктураНастроек.СозданиеДокумента_ИспользоватьПоискКомплектов = Истина Тогда
			
			Если ЗначениеЗаполнено(СтрокаДокумента.parentId) Тогда
			
				СтрокиСвязанногоДокумента = Объект.СписокДокументов.НайтиСтроки(Новый Структура("ДокументИД",СтрокаДокумента.parentId));
				
				Если СтрокиСвязанногоДокумента.Количество() > 0 Тогда
					
					СвязанныйДокумент = СтрокиСвязанногоДокумента[0];
					
					ОписаниеСобытия = "Получение с портала файла скана для связанного документа [" + СвязанныйДокумент.ДокументИД + "]";
					ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ПолучениеСкана");

					
					//E1C-13: для типа документа Чек не получаем печатные формы
					Если СвязанныйДокумент.ДокументТип <> "RECEIPT" Тогда
				
						РезультатЗапроса = ПолучитьПечатнуюФормуСканаДокумента(СвязанныйДокумент.ДокументИД,СвязанныйДокумент.ПредставлениеДокумента);
						
						Если РезультатЗапроса.Успешно Тогда
							Если РезультатЗапроса.ТребуетсяПовтор Тогда
								ТребуетсяПовтор = Истина;
								ДополнитьТекстОшибки(ОбщийТекстОшибки,РезультатЗапроса.ТекстОшибки);
							Иначе
								СвязанныйДокумент.АдресХранилищаСканаДокумента = РезультатЗапроса.АдресВХ;
								СвязанныйДокумент.ИмяФайлаСканаДокумента = РезультатЗапроса.ИмяФайла;
							КонецЕсли;
						Иначе
							ДополнитьТекстОшибки(ОбщийТекстОшибки,РезультатЗапроса.ТекстОшибки);
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли ЗначениеЗаполнено(СтрокаДокумента.childrenId) Тогда
			
				СтрокиСвязанногоДокумента = Объект.СписокДокументов.НайтиСтроки(Новый Структура("ДокументИД",СтрокаДокумента.childrenId));
				
				Если СтрокиСвязанногоДокумента.Количество() > 0 Тогда
				
					СвязанныйДокумент = СтрокиСвязанногоДокумента[0];
					
					ОписаниеСобытия = "Получение с портала файла скана для связанного документа [" + СвязанныйДокумент.ДокументИД + "]";
					ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ПолучениеСкана");

					
					//E1C-13: для типа документа Чек не получаем печатные формы
					Если СвязанныйДокумент.ДокументТип <> "RECEIPT" Тогда
				
						РезультатЗапроса = ПолучитьПечатнуюФормуСканаДокумента(СвязанныйДокумент.ДокументИД,СвязанныйДокумент.ПредставлениеДокумента);
						
						Если РезультатЗапроса.Успешно Тогда
							Если РезультатЗапроса.ТребуетсяПовтор Тогда
								ТребуетсяПовтор = Истина;
								ДополнитьТекстОшибки(ОбщийТекстОшибки,РезультатЗапроса.ТекстОшибки);
							Иначе
								СвязанныйДокумент.АдресХранилищаСканаДокумента = РезультатЗапроса.АдресВХ;
								СвязанныйДокумент.ИмяФайлаСканаДокумента = РезультатЗапроса.ИмяФайла;
							КонецЕсли;
						Иначе
							ДополнитьТекстОшибки(ОбщийТекстОшибки,РезультатЗапроса.ТекстОшибки);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
					
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	//нужно перенести полученные сведения в таблицы данных портала, чтобы были доступны из МК
	ЗаполнитьАдресХранилищаСканаДокументаВДанныхПортала(АдресХранилищаДанныхПортала);
	
	Результат.ТекстОшибки = ОбщийТекстОшибки;
	Результат.ТребуетсяПовтор = ТребуетсяПовтор;
	
	Возврат Результат;
		
КонецФункции
&НаКлиенте
Функция ПолучитьПечатнуюФормуСканаДокумента(ДокументИД,ПредставлениеДокумента) Экспорт
	
	Результат = Новый Структура("Успешно,ТекстОшибки,АдресВХ,ИмяФайла,ТребуетсяПовтор",Истина);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ЗапросФайла",Истина);
	ПараметрыЗапроса.Вставить("ДокументИД",ДокументИД);
	ПараметрыЗапроса.Вставить("ПредставлениеДокумента",ПредставлениеДокумента);
	
	//ссылка на оригинальный файл: https://app.entera.pro/api/v1/documents/{documentId}/file
	//ссылка на сгенерированную печатную форму: https://app.entera.pro/api/v1/documents/:id/printForm
	МетодAPI = "/api/v1/documents/" + ДокументИД + "/printForm?format=xml";
	
	РезультатЗапроса = ВыполнитьЗапрос("ПолучениеФайлаСкана","GET",МетодAPI,,ПараметрыЗапроса);
	
	ТребуетсяПовтор = Ложь;
	
	Если РезультатЗапроса.Успешно Тогда
		Если РезультатЗапроса.Свойство("ПредложитьПовторитьЗапрос") Тогда
			ТребуетсяПовтор = Истина;
			Результат.ТекстОшибки = РезультатЗапроса.ТекстОшибки;
		Иначе
			Результат.АдресВХ = РезультатЗапроса.АдресВХ;
			Результат.ИмяФайла = РезультатЗапроса.ИмяФайла;
		КонецЕсли;
	Иначе
		Результат.Успешно = Ложь;
		ТекстОшибки = РезультатЗапроса.ТекстОшибки;
		Результат.ТекстОшибки = ТекстОшибки;
		
		ОписаниеСобытия = "Получение с портала файла скана для документа [" + ДокументИД + "]: " + ТекстОшибки;
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ПолучениеСкана");
	КонецЕсли;
	
	Результат.ТребуетсяПовтор = ТребуетсяПовтор;
		
	Возврат Результат;
	
КонецФункции
&НаСервере
Процедура ЗаполнитьАдресХранилищаСканаДокументаВДанныхПортала(АдресХранилищаДанныхПортала) Экспорт
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РеквизитОбъект.ЗаполнитьАдресХранилищаСканаДокументаВДанныхПортала(АдресХранилищаДанныхПортала);
	ЗначениеВРеквизитФормы(РеквизитОбъект,"Объект");
	
	ЗаполнитьВСпискеДокументовДополнительныеДанные();
КонецПроцедуры

&НаСервере
Процедура ПрисоединитьФайлы_СканыДокумента(ДокументСсылка,МассивФайлов,ОбщийТекстОшибки,СсылкаНового = Неопределено)
		
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	//2019.12.11 ( Костыль для старых конфигураций, проверено на УТ11.1, поэтому пока выполняем только для нее
	//в ней присутствует общий модуль РаботаСФайлами, но за присоединение отвечает общий модуль ПрисоединенныеФайлы
	Если СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Полн = "УТ11.1"
		//2021.04.07 ( новая БСП с полноценным переходом на РаботаСФайлами, судя по всему, начинается с 11.4
		Или СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Полн = "УТ11.2"
		Или СтруктураНастроек.СведенияОКонфигурации.Конфигурация.Полн = "УТ11.3" Тогда
		// ) 2021.04.07
		
		//счета-фактуры там не предполагают хранения дополнительных файлов, прицепляем скан только к ПТиУ
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
			ОписаниеСобытия = "Прикрепление файла к документу <" + ДокументСсылка + "> пропущено, конфигурация не предполагает хранения доп. файлов для счетов-фактур";
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ПолучениеСкана");
			
			Возврат;
		КонецЕсли;
		
		ПрисоединитьФайлы_СканыДокумента_Модуль_ПрисоединенныеФайлы(ДокументСсылка,МассивФайлов,ОбщийТекстОшибки);
		
		Возврат;
	Иначе
	// ) 2019.12.11
	
		МодульРаботаСФайлами = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("РаботаСФайлами");
	КонецЕсли;
	
	Если МодульРаботаСФайлами <> Неопределено Тогда
		
		ПервыйЭлемент = Истина;
		
		Для Каждого ЭлементМассива Из МассивФайлов Цикл
			
			ДанныеФайла = ЭлементМассива.АдресВХ;
			Если ЭтоАдресВременногоХранилища(ДанныеФайла) Тогда				        
				
				ОписаниеСобытия = "Прикрепление файла " + ЭлементМассива.ИмяФайла + " к документу " + ДокументСсылка;
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ПолучениеСкана");
				
				ПараметрыФайла = Новый Структура("Автор,ВладелецФайлов,ИмяБезРасширения,РасширениеБезТочки,ВремяИзмененияУниверсальное");
				ПараметрыФайла.ВладелецФайлов = ДокументСсылка;
				ПараметрыФайла.ИмяБезРасширения = ЭлементМассива.ИмяФайла;
				
				//Если передали ссылку на файл - присваиваем ее только первому из сохраненных файлов
				Если ПервыйЭлемент Тогда
					ПервыйЭлемент = Ложь;
					НоваяСсылкаНаФайл = СсылкаНового;
				Иначе
					НоваяСсылкаНаФайл = Неопределено;
				КонецЕсли;
									
				Попытка
					МодульРаботаСФайлами.ДобавитьФайл(ПараметрыФайла,ДанныеФайла,,,НоваяСсылкаНаФайл);
				Исключение
					ТекстОшибки = "<" + ДокументСсылка + "> ошибка при выполнении присоединения скана документа: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ДополнитьТекстОшибки(ОбщийТекстОшибки,ТекстОшибки);
					
					ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ТекстОшибки,"ПолучениеСкана");
				КонецПопытки;
				
			Иначе
				ОписаниеСобытия = "При прикреплении файла к документу не был передан адрес во временном хранилище";
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ПолучениеСкана");
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ОписаниеСобытия = "Не обнаружен общий модуль конфигурации <РаботаСФайлами>";
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ПолучениеСкана");
			
		//Общий модуль ПрисоединенныеФайлы является устаревшим, но в старых конфигурациях РаботаСФайлами может отсутствовать
		ПрисоединитьФайлы_СканыДокумента_Модуль_ПрисоединенныеФайлы(ДокументСсылка,МассивФайлов,ОбщийТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ПрисоединитьФайлы_СканыДокумента_Модуль_ПрисоединенныеФайлы(ДокументСсылка,МассивФайлов,ОбщийТекстОшибки)
		
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");	
	
	МодульПрисоединенныеФайлы = РеквизитОбъект._ЗФ_ПолучитьОбщийМодульКонфигурации("ПрисоединенныеФайлы");	

	Если МодульПрисоединенныеФайлы <> Неопределено Тогда
		
		Для Каждого ЭлементМассива Из МассивФайлов Цикл
			
			ДанныеФайла = ЭлементМассива.АдресВХ;
			Если ЭтоАдресВременногоХранилища(ДанныеФайла) Тогда				        
				
				ОписаниеСобытия = "Прикрепление файла " + ЭлементМассива.ИмяФайла + " к документу " + ДокументСсылка;
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ПолучениеСкана");
				
				Попытка
					МодульПрисоединенныеФайлы.ДобавитьФайл(ДокументСсылка, ЭлементМассива.ИмяФайла, , , , ДанныеФайла);
				Исключение
					ТекстОшибки = "<" + ДокументСсылка + "> ошибка при выполнении присоединения скана документа: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ДополнитьТекстОшибки(ОбщийТекстОшибки,ТекстОшибки);
					
					ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ТекстОшибки,"ПолучениеСкана");
				КонецПопытки;
				
			Иначе
				ОписаниеСобытия = "При прикреплении файла к документу не был передан адрес во временном хранилище";
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ПолучениеСкана");
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		ОписаниеСобытия = "Не обнаружен общий модуль конфигурации <ПрисоединенныеФайлы>";
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ПолучениеСкана");
	КонецЕсли;
	
КонецПроцедуры


// ================= Работа с архивом документов ===================

&НаКлиенте
Процедура Команда_ПолучитьАрхивДокументов(Команда)
	
	//POST /api/v1/documents/archive
	//обязательные параметры spaceId/createdDateFrom/createdDateTo
		
	Если Не ЗначениеЗаполнено(Отбор_Пространство) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Пространство не может быть пустым";
		Сообщение.Поле = "Отбор_Пространство";		
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	//2024.09.15: Изначально отбор должен был задан по дате загрузки,
	//теперь обязателен отбор хотя бы по одному из полей дат: Дата документа или Дата создания
	
	Если Не ЗначениеЗаполнено(Отбор_ПериодЗагрузки.ДатаНачала)
		И Не ЗначениеЗаполнено(Отбор_ПериодЗагрузки.ДатаОкончания)
		И Не ЗначениеЗаполнено(Отбор_ПериодДокументов.ДатаНачала)
		И Не ЗначениеЗаполнено(Отбор_ПериодДокументов.ДатаОкончания) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = УникальныйИдентификатор;
		Сообщение.Текст = "Не задан период выгружаемых документов или их даты загрузки!";
		Сообщение.Поле = "Отбор_ПериодЗагрузки";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	МетодAPI = "/api/v1/documents/archive?format=xml";
			
	ТелоЗапроса = СформироватьТелоЗапроса_РеестрАрхивДокументов();
		
	ОписаниеСобытия = "Получение архива документов с [" + Отбор_ПериодЗагрузки.ДатаНачала + "] по [" + Отбор_ПериодЗагрузки.ДатаОкончания + "]";
	ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"Запрос",ОписаниеСобытия,"АрхивДокументов");	
		
	РезультатЗапроса = ВыполнитьЗапрос("ПолучениеАрхиваДокументов","POST",МетодAPI,ТелоЗапроса);
	
	Если РезультатЗапроса.Успешно Тогда
		Попытка КартинкаУспешно = БиблиотекаКартинок.Успешно; Исключение КонецПопытки;
		ПоказатьОповещениеПользователя("Успешно",,"Ссылка для скачивания будет отправлена на электронную почту",КартинкаУспешно);
	Иначе
		ОписаниеСобытия = "Ошибка получения архива документов: " + РезультатЗапроса.ТекстОшибки;
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"Запрос",ОписаниеСобытия,"АрхивДокументов");	
		СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура Команда_ПолучитьРеестрДокументовАрхива(Команда)
	
	//POST /api/v1/documents/export
	
	//2024.09.15: Изначально отбор должен был задан по дате загрузки,
	//теперь обязателен отбор хотя бы по одному из полей дат: Дата документа или Дата создания
	
	Если Не ЗначениеЗаполнено(Отбор_ПериодЗагрузки.ДатаНачала)
		И Не ЗначениеЗаполнено(Отбор_ПериодЗагрузки.ДатаОкончания)
		И Не ЗначениеЗаполнено(Отбор_ПериодДокументов.ДатаНачала)
		И Не ЗначениеЗаполнено(Отбор_ПериодДокументов.ДатаОкончания) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = УникальныйИдентификатор;
		Сообщение.Текст = "Не задан период выгружаемых документов или их даты загрузки!";
		Сообщение.Поле = "Отбор_ПериодЗагрузки";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	МетодAPI = "/api/v1/documents/export?format=xml";
		
	ТелоЗапроса = СформироватьТелоЗапроса_РеестрАрхивДокументов();
		
	ОписаниеСобытия = "Получение реестра документов с [" + Отбор_ПериодЗагрузки.ДатаНачала + "] по [" + Отбор_ПериодЗагрузки.ДатаОкончания + "]";
	ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"Запрос",ОписаниеСобытия,"АрхивДокументов");	
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ЗапросФайла",Истина);
	
	РезультатЗапроса = ВыполнитьЗапрос("ПолучениеРеестраАрхиваДокументов","POST",МетодAPI,ТелоЗапроса,ПараметрыЗапроса);
	
	Если РезультатЗапроса.Успешно Тогда
		ПолучитьФайл(РезультатЗапроса.АдресВХ,РезультатЗапроса.ИмяФайла,Истина);
	Иначе
		ОписаниеСобытия = "Ошибка получения реестра документов: " + ОписаниеОшибки();
		ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"Запрос",ОписаниеСобытия,"АрхивДокументов");	
		СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Функция СформироватьТелоЗапроса_РеестрАрхивДокументов()
	
	ТелоЗапроса = "";
	ТелоЗапроса = ТелоЗапроса + "{" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """filter"": {" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """spaceId"": """ + Отбор_Пространство + """" + Символы.ПС;
	
	Если ЗначениеЗаполнено(Отбор_ПериодЗагрузки.ДатаНачала) Тогда
		ТелоЗапроса = ТелоЗапроса + ",";
		ТелоЗапроса = ТелоЗапроса + """createdDateFrom"": """ + Формат(УниверсальноеВремя(Отбор_ПериодЗагрузки.ДатаНачала),"ДФ=yyyy-MM-ddTHH:mm:ss") + ".000Z" + """" + Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор_ПериодЗагрузки.ДатаОкончания) Тогда
		ТелоЗапроса = ТелоЗапроса + ",";
		ТелоЗапроса = ТелоЗапроса + """createdDateTo"": """ + Формат(УниверсальноеВремя(Отбор_ПериодЗагрузки.ДатаОкончания),"ДФ=yyyy-MM-ddTHH:mm:ss") + ".999Z" + """" + Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор_ПериодДокументов.ДатаНачала) Тогда
		ТелоЗапроса = ТелоЗапроса + ",";
		ТелоЗапроса = ТелоЗапроса + """documentDateFrom"": """ + Формат(УниверсальноеВремя(Отбор_ПериодДокументов.ДатаНачала),"ДФ=yyyy-MM-ddTHH:mm:ss") + ".000Z" + """" + Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор_ПериодДокументов.ДатаОкончания) Тогда
		ТелоЗапроса = ТелоЗапроса + ",";
		ТелоЗапроса = ТелоЗапроса + """documentDateTo"": """ + Формат(УниверсальноеВремя(Отбор_ПериодДокументов.ДатаОкончания),"ДФ=yyyy-MM-ddTHH:mm:ss") + ".999Z" + """" + Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор_Плательщик) Тогда
		ТелоЗапроса = ТелоЗапроса + "," + Символы.ПС  + """customer"": [" + Символы.ПС;
		ПервыйЭлемент = Истина;
		Для Каждого ЭлементОтбора Из Отбор_Плательщик Цикл
			ТелоЗапроса = ТелоЗапроса + ?(ПервыйЭлемент,"",",") + """" + ЭлементОтбора.Значение + """";
			ПервыйЭлемент = Ложь;
		КонецЦикла;
		ТелоЗапроса = ТелоЗапроса + Символы.ПС + "]" + Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор_Поставщик) Тогда
		ТелоЗапроса = ТелоЗапроса + "," + Символы.ПС  + """supplier"": [" + Символы.ПС;
		ПервыйЭлемент = Истина;
		Для Каждого ЭлементОтбора Из Отбор_Поставщик Цикл
			ТелоЗапроса = ТелоЗапроса + ?(ПервыйЭлемент,"",",") + """" + ЭлементОтбора.Значение + """";
			ПервыйЭлемент = Ложь;
		КонецЦикла;
		ТелоЗапроса = ТелоЗапроса + Символы.ПС + "]" + Символы.ПС;
	КонецЕсли;
	
	ЕстьОтборПоТипу = Ложь;
	Для Каждого ТипДокумента Из БыстрыйФильтр_ТипыДокументов Цикл
		Если ТипДокумента.Пометка Тогда
			ЕстьОтборПоТипу = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОтборПоТипу Тогда
		ТелоЗапроса = ТелоЗапроса + "," + Символы.ПС  + """documentType"": [" + Символы.ПС;
		ПервыйЭлемент = Истина;
		Для Каждого ТипДокумента Из БыстрыйФильтр_ТипыДокументов Цикл
			Если ТипДокумента.Пометка Тогда
				ТелоЗапроса = ТелоЗапроса + ?(ПервыйЭлемент,"",",") + """" + ТипДокумента.Значение + """";
				ПервыйЭлемент = Ложь;
			КонецЕсли;
		КонецЦикла;
		ТелоЗапроса = ТелоЗапроса + Символы.ПС + "]" + Символы.ПС;
	КонецЕсли;
	
	ТелоЗапроса = ТелоЗапроса + "}" + Символы.ПС; //filter
	ТелоЗапроса = ТелоЗапроса + "}";
	
	Возврат ТелоЗапроса;
	
КонецФункции


&НаКлиенте
Процедура СписокДокументов_СкачатьОригинал(Команда)
	СписокДокументов_СкачатьФайлДокументаСПортала("ORIGINAL");
КонецПроцедуры
&НаКлиенте
Процедура СписокДокументов_СкачатьPDF(Команда)
	СписокДокументов_СкачатьФайлДокументаСПортала("PDF");
КонецПроцедуры
&НаКлиенте
Процедура СписокДокументов_СкачатьФНСXML(Команда)
	СписокДокументов_СкачатьФайлДокументаСПортала("XML");
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументов_СкачатьФайлДокументаСПортала(ТипФайла)
		
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТипФайла",ТипФайла);
	
	//В веб-клиенте или с одним файлом обойдемся исходной схемой, иначе предложим выбрать каталог для сохранения файлов
	Если Не ЭтоВебКлиент И Элементы.СписокДокументов.ВыделенныеСтроки.Количество() > 1 Тогда
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		Диалог.МножественныйВыбор = Ложь;
		
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ДиалогВыбораФайла","ОбработатьВыборКаталога_СкачатьФайлДокументаСПортала",ДопПараметры,Диалог);
		_ЗФ_ОбработатьАсинхронныйВызов("ДиалогВыбораФайла",ПараметрыВызова);
	Иначе
		ОбработатьВыборКаталога_СкачатьФайлДокументаСПортала("",ДопПараметры);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьВыборКаталога_СкачатьФайлДокументаСПортала(Результат,ДопПараметры)
	
	Если Результат = "" Тогда
		//Просто получаем файлы по исходной схеме
	ИначеЕсли Результат = Неопределено Тогда
		Возврат;
	Иначе
		КаталогСохранения = Результат[0];
	КонецЕсли;
	
	ТипФайла = ДопПараметры.ТипФайла;
	МассивСохраняемыхФайлов = Новый Массив;
	
	//E1C-133
	//Скачивание оригинала файла или zip-архива с оригинальными файлами:
	//GET https://app.entera.pro/api/v1/documents/:id/files
	//Скачивание печатной формы в PDF, которую мы изготавливаем:
	//GET https://app.entera.pro/api/v1/documents/:id/printForm
	//Скачивание ФНС XML на основе распознанных данных работает только для типов документов УПД (UTD), ТОРГ-12 (TORG12), СЧФ (VAT_INVOICE)
	//GET https://app.entera.pro/api/v1/documents/:id/fnsXml
	
	//E1C-209: пакетное получение файлов, выбираем каталог для сохранения
	Для Каждого ИдентификаторСтроки Из Элементы.СписокДокументов.ВыделенныеСтроки Цикл
		
		ТекСтрока = Объект.СписокДокументов.НайтиПоИдентификатору(ИдентификаторСтроки);
	
		Если ТекСтрока <> Неопределено Тогда
			
			ДокументИД = ТекСтрока.документИД;
			
			ОписаниеСобытия = "Получение файла документа [" + ДокументИД + "] в формате [" + ТипФайла + "]";
			ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"Запрос",ОписаниеСобытия,"АрхивДокументов");	
			
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("ЗапросФайла",Истина);
			ПараметрыЗапроса.Вставить("ТипФайла",ТипФайла);
			ПараметрыЗапроса.Вставить("ДокументИД",ДокументИД);
			
			Если ТипФайла = "ORIGINAL" Тогда
				МетодAPI = "/api/v1/documents/" + ДокументИД + "/files?format=xml";
			ИначеЕсли ТипФайла = "PDF" Тогда
				МетодAPI = "/api/v1/documents/" + ДокументИД + "/printForm?format=xml";
			ИначеЕсли ТипФайла = "XML" Тогда
				МетодAPI = "/api/v1/documents/" + ДокументИД + "/fnsXml?format=xml";
			КонецЕсли;
			
			РезультатЗапроса = ВыполнитьЗапрос("ПолучениеРеестраАрхиваДокументов","GET",МетодAPI,"{}",ПараметрыЗапроса);
			
			Если РезультатЗапроса.Успешно Тогда
				//Если выбран каталог сохранения - соберем все файлы и сохраним их после получения в этот каталог
				Если КаталогСохранения = Неопределено Тогда
					ПолучитьФайл(РезультатЗапроса.АдресВХ,РезультатЗапроса.ИмяФайла,Истина);
				Иначе
					МассивСохраняемыхФайлов.Добавить(Новый Структура("АдресВХ,ИмяФайла",РезультатЗапроса.АдресВХ,РезультатЗапроса.ИмяФайла));
				КонецЕсли;
			Иначе
				ОписаниеСобытия = "Ошибка получения файла документа [" + ДокументИД + "]: " + ОписаниеОшибки();
				ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"Запрос",ОписаниеСобытия,"АрхивДокументов");	
				СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
		
	Если МассивСохраняемыхФайлов.Количество() > 0 Тогда
		
		ОшибкиПриСохранении = "";
		
		Для Каждого ДанныеФайла Из МассивСохраняемыхФайлов Цикл
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеФайла.АдресВХ);
			Попытка
				ДвоичныеДанные.Записать(КаталогСохранения + ПолучитьРазделительПутиКлиента() + ДанныеФайла.ИмяФайла);
			Исключение
				ДополнитьТекстОшибки(ОшибкиПриСохранении,ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
		
		Если ОшибкиПриСохранении = "" Тогда
			Попытка КартинкаУспешно = БиблиотекаКартинок.Успешно32; Исключение; КонецПопытки;
			ПоказатьОповещениеПользователя("Успешно",,"Все файлы сохранены в выбранный каталог",КартинкаУспешно);
		Иначе
			СообщитьСообщение("При загрузке файлов в выбранный каталог возникали ошибки:" + Символы.ПС + ОшибкиПриСохранении);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


// ================= Служебные функции и процедуры ===================

&НаСервере
Функция КодироватьСтрокуПараметровНаСервере(КодируемаяСтрока)
	//2021.06.29 ( Выполняем кодирование строки, экранируем от синтаксического контроля старых версий платформ
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	СпособКодирования = РеквизитОбъект._ЗФ_ПолучитьСпособКодированияСтроки();
	Если СпособКодирования <> Неопределено Тогда
		Результат = КодироватьСтроку(КодируемаяСтрока,СпособКодирования);
	Иначе
		Результат = КодируемаяСтрока;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
&НаСервере
Функция РаскодироватьСтрокуПараметровНаСервере(КодируемаяСтрока)
	//2021.06.29 ( Выполняем кодирование строки, экранируем от синтаксического контроля старых версий платформ
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	СпособКодирования = РеквизитОбъект._ЗФ_ПолучитьСпособКодированияСтроки();
	Если СпособКодирования <> Неопределено Тогда
		Результат = РаскодироватьСтроку(КодируемаяСтрока,СпособКодирования);
	Иначе
		Результат = КодируемаяСтрока;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
&НаСервереБезКонтекста
Функция Энтера_РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Результат = Новый Массив;
	
	// Для обеспечения обратной совместимости.
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Строка));
		Иначе
			Результат.Добавить(Строка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 
&НаСервереБезКонтекста
Функция РеквизитСуществует(РазделМетаданных, ОбъектМетаданных, ИмяРеквизита = Неопределено, ИмяТабЧасти = Неопределено) Экспорт
	
	Существует = Ложь;
		
	Если Метаданные[РазделМетаданных].Найти(ОбъектМетаданных) <> Неопределено Тогда
		Если ИмяРеквизита = Неопределено И ИмяТабЧасти = Неопределено Тогда
			Существует = Истина;
		Иначе	
			Если ИмяТабЧасти = Неопределено Тогда
				Если РазделМетаданных = "Перечисления" Тогда
					Если Метаданные[РазделМетаданных][ОбъектМетаданных].ЗначенияПеречисления.Найти(ИмяРеквизита) <> Неопределено Тогда
						Существует = Истина;
					КонецЕсли;
				Иначе
					Если Метаданные[РазделМетаданных][ОбъектМетаданных].Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
						Существует = Истина;
					КонецЕсли;
				КонецЕсли;
			Иначе
				ТабличнаяЧасть = Метаданные[РазделМетаданных][ОбъектМетаданных].ТабличныеЧасти.Найти(ИмяТабЧасти);
				Если ТабличнаяЧасть <> Неопределено И ТабличнаяЧасть.Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
					Существует = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Существует;
КонецФункции
&НаКлиентеНаСервереБезКонтекста
Процедура ДополнитьТекстОшибки(ОбщийТекстОшибки,ТекстОшибки)
	ОбщийТекстОшибки = Строка(ОбщийТекстОшибки) + ТекстОшибки + Символы.ПС;
КонецПроцедуры
&НаКлиентеНаСервереБезКонтекста
Функция КраткоеОписаниеОшибки(ТекстОшибки) Экспорт
	
	КонецСлужебнойИнформации = Найти(ТекстОшибки,"}: ");
	Если КонецСлужебнойИнформации > 0 Тогда
		ТекстОшибки = Сред(ТекстОшибки,КонецСлужебнойИнформации + 3);
	КонецЕсли;				
	
	Возврат ТекстОшибки;
	
КонецФункции
&НаКлиентеНаСервереБезКонтекста
Функция СформироватьПредставлениеРазмераФайла(РазмерДанных) Экспорт
	
	Результат = "";
	
	Если РазмерДанных > 1048576 Тогда
		Результат = "" + Окр(РазмерДанных/1048576,1) + "МБ";
	ИначеЕсли РазмерДанных > 1024 Тогда
		Результат = "" + Окр(РазмерДанных/1024,1) + "КБ";
	ИначеЕсли РазмерДанных = 0 Тогда
		Результат = "0Б";
	Иначе
		Результат = Строка(РазмерДанных) + "Б";
	КонецЕсли;			
	
	Возврат Результат;
	
КонецФункции
&НаСервере
Процедура ДобавитьКнопкуНаФорму(Форма,ИмяКоманды,ИмяКнопки,Синоним,ИмяДействия,ГруппаРодитель = Неопределено, Картинка = Неопределено, Пометка = Ложь) Экспорт
	
	// Добавляем новую команду обработки выбора вида операции.
	Если Команды.Найти(ИмяКоманды) = Неопределено Тогда
		
		Команда = Команды.Добавить(ИмяКоманды);
		Команда.Действие = ИмяДействия;
		
		Если Картинка <> Неопределено Тогда
			Команда.Картинка = Картинка;
		КонецЕсли;
	
	
		Если ГруппаРодитель = Неопределено Тогда
			НоваяКнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"));
		Иначе    
			НоваяКнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), ГруппаРодитель);
		КонецЕсли;
		
		НоваяКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		НоваяКнопка.ИмяКоманды = ИмяКоманды;
		НоваяКнопка.Заголовок = Синоним;
		НоваяКнопка.Пометка = Пометка;
		
	КонецЕсли;

КонецПроцедуры
&НаСервере
Процедура ЗаписатьСобытиеВПротокол(СтруктураНастроек,Уровень,Событие,Описание,Состояние) Экспорт
	
	Если СтруктураНастроек.СистемныеНастройки_ВестиПротоколРаботы = "Нет" Тогда
		Возврат;
		
		//Уровень значимости события
		//2 - Ошибки
		//1 - Ошибки+Запросы
		//0 - Полный		
		
	ИначеЕсли СтруктураНастроек.СистемныеНастройки_ВестиПротоколРаботы = "Ошибки" Тогда
		ФиксируемыйУровень = 2;
	ИначеЕсли СтруктураНастроек.СистемныеНастройки_ВестиПротоколРаботы = "Ошибки+Запросы" Тогда
		ФиксируемыйУровень = 1;
	ИначеЕсли СтруктураНастроек.СистемныеНастройки_ВестиПротоколРаботы = "Полный" Тогда
		ФиксируемыйУровень = 0;
	Иначе
		//такого не бывает, но если вдруг бывает - выходим
		Возврат;
	КонецЕсли;
	
	Если ФиксируемыйУровень <= Уровень Тогда
			
		НоваяСтрока = Объект.ПротоколРаботы.Добавить();
		НоваяСтрока.Дата = ТекущаяДата();
		НоваяСтрока.Событие = Событие;
		НоваяСтрока.Описание = Описание;
		НоваяСтрока.Состояние = Состояние;
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиентеНаСервереБезКонтекста
Процедура СообщитьСообщение(Текст,Поле = Неопределено,ИдентификаторНазначения = Неопределено) Экспорт
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = Текст;
	СообщениеПользователю.Поле = Поле;
	
	Если ТипЗнч(ИдентификаторНазначения) = Тип("УникальныйИдентификатор") Тогда
		СообщениеПользователю.ИдентификаторНазначения = ИдентификаторНазначения;
	КонецЕсли;
	
	СообщениеПользователю.Сообщить();
	
КонецПроцедуры
&НаКлиенте
Функция ЗаполнитьСтруктуруПодключения() Экспорт
	
	СтруктураПодключения = Новый Структура;
	
	СтруктураПодключения.Вставить("Адрес","app.entera.pro");
	СтруктураПодключения.Вставить("АдресСервераАвторизации","id.entera.pro");
	СтруктураПодключения.Вставить("Протокол","https://");
	СтруктураПодключения.Вставить("Порт",Неопределено);
	СтруктураПодключения.Вставить("Токен_Cookie","ENTERA_JWT=");
	
	#Если Не ВебКлиент Тогда
	СтруктураПодключения.Вставить("SSL",Новый ЗащищенноеСоединениеOpenSSL);
	#КонецЕсли
	
	//Отладка	
	Если Отладка_ТестовыйРежим = 1 Тогда
		СтруктураПодключения.Вставить("ТестовыйРежим",Истина);
		СтруктураПодключения.Вставить("Адрес","app-staging1.entera.pro");
		СтруктураПодключения.Вставить("АдресСервераАвторизации","id-staging1.entera.pro");
		СтруктураПодключения.Вставить("Токен_Cookie","ENTERA_JWT_TEST=");
	ИначеЕсли Отладка_ТестовыйРежим = 2 Тогда
		СтруктураПодключения.Вставить("ТестовыйРежим",Истина);
		СтруктураПодключения.Вставить("Адрес","app-test2.entera.pro");
		СтруктураПодключения.Вставить("АдресСервераАвторизации","id-test2.entera.pro");
		СтруктураПодключения.Вставить("Токен_Cookie","ENTERA_JWT_TEST=");
	ИначеЕсли Отладка_ТестовыйРежим = 7 Тогда
		СтруктураПодключения.Вставить("ТестовыйРежим",Истина);
		СтруктураПодключения.Вставить("Адрес","app-test7.entera.pro");
		СтруктураПодключения.Вставить("АдресСервераАвторизации","id-test7.entera.pro");
		СтруктураПодключения.Вставить("Токен_Cookie","ENTERA_JWT_TEST=");
	КонецЕсли;
	
	//напомним в интерфейсе, что мы сейчас работаем на тестовом портале
	Элементы.Обновить.ЦветФона = Отладка_ПолучитьЦветКнопки(Отладка_ТестовыйРежим);
		
	Возврат СтруктураПодключения;
	
КонецФункции


// ================= ОТЛАДКА ===================

&НаКлиенте
Процедура ЗагрузитьДокументПоПрямойСсылке(Команда)
	ПараметрыВызова = Новый Структура("Обработчик,Строка,Подсказка","ОбработатьЗагрузкуДокументаПоПрямойСсылке","00000000-0000-0000-0000-000000000000","Введите ссылку на документ");
	_ЗФ_ОбработатьАсинхронныйВызов("ВводСтроки",ПараметрыВызова);
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьЗагрузкуДокументаПоПрямойСсылке(Результат) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Объект.СписокДокументов.Очистить();
		ПоместитьВоВременноеХранилище(Неопределено,АдресХранилищаДанныхПортала);
		
		СтрокаПараметров = Результат + "?format=xml&include=full&pageSize=100&page=1";
		РезультатЗапроса = ВыполнитьЗапрос("Обновить","GET","/api/v1/documents/" + СтрокаПараметров);
		
		Если РезультатЗапроса.Успешно Тогда
			
			//2019.10.11 ( Если требуются связанные документы и их нет в полученном списке - получаем их дополнительными запросами
			Если СтруктураНастроек.СозданиеДокумента_ИспользоватьПоискКомплектов = Истина Тогда
				СписокСвязанныхДокументов = ПолучитьСписокСвязанныхДокументовДляЗаполнения(АдресХранилищаДанныхПортала);
				
				Если СписокСвязанныхДокументов.Количество() > 0 Тогда
					ОписаниеСобытия = "Получение списка связанных документов [" + СписокСвязанныхДокументов.Количество() + "]";
					ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"Запрос",ОписаниеСобытия,"СвязанныеДокументы");
					
					Состояние("Получение данных связанных документов...",50);
					
					Для Каждого СвязанныйДокумент Из СписокСвязанныхДокументов Цикл
						
						ОбработкаПрерыванияПользователя();
					
						СтрокаПараметров = "?format=xml&include=full";
						РезультатЗапроса = ВыполнитьЗапрос("Обновить","GET","/api/v1/documents/" + СвязанныйДокумент.Значение + СтрокаПараметров);
						
						Если РезультатЗапроса.Успешно Тогда
							ОписаниеСобытия = "Связанный документ получен [" + СвязанныйДокумент.Значение + "]";
							ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"Запрос",ОписаниеСобытия,"СвязанныеДокументы");
						Иначе
							ОписаниеСобытия = "Ошибка при получении связанного документа [" + СвязанныйДокумент.Значение + "]: " + РезультатЗапроса.ТекстОшибки;
							ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"Запрос",ОписаниеСобытия,"СвязанныеДокументы");
							СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
							Возврат;
						КонецЕсли;
						
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			// ) 2019.10.11
			
			Отбор_Пространство = "";
			
			Состояние("Обработка данных портала...",60);
		
			ВыполнитьПоискСсылокПоДаннымПорталаНаСервере();
			
			Состояние("Заполнение списка документов...",70);
			
			ЗаполнитьСписокДокументовНаСервере();
			УстановитьНаправленияДокументов();
			
			БыстрыйФильтр_УстановитьОтборПоВыбраннымТипам();
			
			УстановитьОтборСтрокСпискаДокументов();
			
			ЗаполнитьВСпискеДокументовДополнительныеДанные();
			
			Состояние("Завершено",100);
			
		Иначе
			СообщитьСообщение(РезультатЗапроса.ТекстОшибки);
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Отладка_ТестовыйРежимПриИзменении(Элемент)
	СтруктураПодключения = ЗаполнитьСтруктуруПодключения();
	Элементы.ДекорацияОтступ_ТестовыйРежим.Видимость = Не Отладка_ТестовыйРежим;
КонецПроцедуры
&НаСервереБезКонтекста
Функция Отладка_ПолучитьЦветКнопки(ТестовыйРежим)
	
	Результат = ЦветаСтиля.ЦветФонаКнопки;
	
	Если ТестовыйРежим > 0 Тогда
		Результат = WebЦвета.БледноЗеленый;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


// ================= Протокол работы ===================

&НаКлиенте
Процедура Команда_ВыгрузитьПротокол(Команда)
	
	РезультатВыгрузки = Команда_ВыгрузитьПротоколНаСервере();
	
	Если РезультатВыгрузки.Успешно Тогда
		ИмяФайла = "ENTERA_" + Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd_HH-mm") + ".log";
		ПолучитьФайл(РезультатВыгрузки.АдресВХ,ИмяФайла,Истина);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = УникальныйИдентификатор;
		Сообщение.Текст = "Ошибка при формировании протокола работы: " + РезультатВыгрузки.ТекстОшибки;
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Функция Команда_ВыгрузитьПротоколНаСервере()
	
	Результат = Новый Структура("Успешно,АдресВХ,ТекстОшибки",Истина);
		
	НастройкиДляВыгрузки = СтруктураНастроек;
	
	//удалим из выгрузки данные авторизации
	Если НастройкиДляВыгрузки.Свойство("Логин") Тогда
		НастройкиДляВыгрузки.Удалить("Логин");
	КонецЕсли;
	Если НастройкиДляВыгрузки.Свойство("Пароль") Тогда
		НастройкиДляВыгрузки.Удалить("Пароль");
	КонецЕсли;
	
	//И данные о статусах ЭДО-документов и синонимах ЕИ, они там лишние
	Если НастройкиДляВыгрузки.Свойство("Диадок_СоответствиеСтатусов") Тогда
		НастройкиДляВыгрузки.Удалить("Диадок_СоответствиеСтатусов");
	КонецЕсли;
	Если НастройкиДляВыгрузки.Свойство("СБИС_СоответствиеСтатусов") Тогда
		НастройкиДляВыгрузки.Удалить("СБИС_СоответствиеСтатусов");
	КонецЕсли;
	Если НастройкиДляВыгрузки.Свойство("КодыТиповДокументов") Тогда
		НастройкиДляВыгрузки.Удалить("КодыТиповДокументов");
	КонецЕсли;
	Если НастройкиДляВыгрузки.Свойство("ИсточникиДокументов") Тогда
		НастройкиДляВыгрузки.Удалить("ИсточникиДокументов");
	КонецЕсли;
	Если НастройкиДляВыгрузки.Свойство("СловарьСинонимовЕИ") Тогда
		НастройкиДляВыгрузки.Удалить("СловарьСинонимовЕИ");
	КонецЕсли;	
	
	//сформируем структуру необходимых для анализа данных
	ДанныеДляАнализа = Новый Структура;
	ДанныеДляАнализа.Вставить("ОписаниеКонфигурации",ПолучитьТекстовоеОписаниеКонфигурации());
	ДанныеДляАнализа.Вставить("СтруктураНастроек",НастройкиДляВыгрузки);
	ДанныеДляАнализа.Вставить("Протокол",Объект.ПротоколРаботы.Выгрузить());
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ЗначениеВСтрокуВнутр(ДанныеДляАнализа));
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	Попытка
		ТекстовыйДокумент.Записать(ИмяВременногоФайла);
		Результат.АдресВХ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла),УникальныйИдентификатор);
	Исключение
		Результат.Успешно = Ложь;
		Результат.ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	//Прибираемся
	Попытка УдалитьФайлы(ИмяВременногоФайла); Исключение; КонецПопытки;
	
	Возврат Результат;
	
КонецФункции
&НаСервере
Функция ПолучитьТекстовоеОписаниеКонфигурации() Экспорт
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	ОписаниеКонфигурации = РеквизитОбъект.ПолучитьТекстовоеОписаниеКонфигурации(СтруктураНастроек);
				
	Возврат ОписаниеКонфигурации;
	
КонецФункции
