
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДопПараметры",ДополнительныеПараметрыФормы);
	Параметры.Свойство("СтруктураНастроек",СтруктураНастроек);
	
	Результат = Новый Структура;
	Результат.Вставить("ДопПараметры",ДополнительныеПараметрыФормы);
	
	Если Параметры.Свойство("ЭтоВебКлиент") И Параметры.ЭтоВебКлиент = Истина Тогда
		Элементы.СписокФайловРазмер.Видимость = Ложь;
	КонецЕсли;
	
	Для Каждого ОтправляемыйФайл Из Параметры.ФайлыДляПередачи Цикл
		НоваяСтрока = СписокФайлов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ОтправляемыйФайл);
		НоваяСтрока.Пометка = ОтправляемыйФайл.Статус <> "Дубликат";
	КонецЦикла;
	
	УведомлятьНаПочтуОВыполненныхЗаданиях = СтруктураНастроек.ОбменДанными_УведомлятьНаПочтуОВыполненныхЗаданиях = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспознатьДокументы(Команда)
	
	ОтправляемыеФайлы = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из СписокФайлов Цикл
		Если СтрокаТаблицы.Пометка Тогда
			
			Структура = Новый Структура("ИмяФайла,КодированноеИмяФайла,ПолноеИмяФайлаНаКлиенте,АдресВХ");
			ЗаполнитьЗначенияСвойств(Структура,СтрокаТаблицы);
			
			ОтправляемыеФайлы.Добавить(Структура);
		КонецЕсли;
	КонецЦикла;
	
	Результат.Вставить("ОтправляемыеФайлы",ОтправляемыеФайлы);
	Результат.Вставить("УведомлятьНаПочтуОВыполненныхЗаданиях",УведомлятьНаПочтуОВыполненныхЗаданиях);
	
	ЭтаФорма.Закрыть(Результат);
	
КонецПроцедуры
