
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыборкаОрганизации = Справочники.Организации.Выбрать();
	
	Пока ВыборкаОрганизации.Следующий() Цикл
		Если Не ВыборкаОрганизации.ПометкаУдаления Тогда
			//Могут присутствовать не все реквизиты
			СтруктураДанных = Новый Структура("Наименование,НаименованиеПолное,ИНН");
			ЗаполнитьЗначенияСвойств(СтруктураДанных,ВыборкаОрганизации);
			Организация = ?(ЗначениеЗаполнено(СтруктураДанных.НаименованиеПолное),СтруктураДанных.НаименованиеПолное,СтруктураДанных.Наименование)
				+ ?(ЗначениеЗаполнено(СтруктураДанных.ИНН)," (ИНН " + СтруктураДанных.ИНН + ")","");
			Прервать;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОписаниеКонфигурации = ВладелецФормы.ПолучитьТекстовоеОписаниеКонфигурации();
	
	ТекстОбращения = ТекстОбращения + Символы.ПС + Символы.ПС;
	ТекстОбращения = ТекстОбращения + "Дополнительная информация:" + Символы.ПС;
	ТекстОбращения = ТекстОбращения + "Организация " + ?(ЗначениеЗаполнено(Организация),Организация + " ","")
				   + Символы.ПС + ОписаниеКонфигурации + Символы.ПС;
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	//Описание метода:
	//POST /api/v1/feedback
	//{
	//    "type": "SUPPORT_TICKET",
	//    "comment": "У меня не получается сделать это!"
	//}
	
	//+++ Тип обращения может быть различный, в дальнейшем можно сделать отправку тикета по определенному документу
	ТипОбращения = "SUPPORT_TICKET";
	
	ПараметрыЗапроса = Новый Структура;
	
	ТелоЗапроса = "";
	ТелоЗапроса = ТелоЗапроса + "{" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """type"": """ + ТипОбращения + """," + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """comment"": """ + ЭкранироватьСпецсимволыJSON(ТекстОбращения) + """" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + "}";
	
	МетодAPI = "/api/v1/feedback?format=xml";
	
	РезультатЗапроса = ВладелецФормы.ВыполнитьЗапрос("ТехподдержкаСозданиеТикета","POST",МетодAPI,ТелоЗапроса,ПараметрыЗапроса);
	
	Если РезультатЗапроса.Успешно Тогда
		ПоказатьОповещениеПользователя("Успешно",,"Сообщение специалистам Entera.pro отправлено");
		ЭтаФорма.Закрыть();
	Иначе
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = РезультатЗапроса.ТекстОшибки;
		СообщениеПользователю.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭкранироватьСпецсимволыJSON(Знач Строка) Экспорт
	Строка = СтрЗаменить(Строка,"\","\\");
	Строка = СтрЗаменить(Строка,"""","\""");
	Строка = СтрЗаменить(Строка,Символы.Таб," ");
	Строка = СтрЗаменить(Строка,Символы.ПС,"\n");
	Возврат Строка;
КонецФункции
