
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураНастроек = Параметры.СтруктураНастроек;
	ПрефиксИмениФорм = Параметры.ПрефиксИмениФорм;
	
	//EN-385: Используем эту же форму для отображения информации о балансе страниц и покупке
	Если Параметры.Свойство("ДанныеБаланса") Тогда
		Заголовок = "Информация о балансе";
		Элементы.ГруппаКнопокОбновление.Видимость = Ложь;
		
		ДанныеБаланса = Параметры.ДанныеБаланса;
		ДанныеПользователя = Параметры.ДанныеПользователя;
		
		СтраницаСпискаВерсий = СформироватьHTML_ДанныеБаланса(ДанныеБаланса);
		
	Иначе
		Элементы.ГруппаКнопокПодписка.Видимость = Ложь;
		
		Для Каждого ВерсияОбработки Из Параметры.СписокНовыхВерсий Цикл
			НоваяСтрока = СписокОбновлений.Добавить();
			НоваяСтрока.Идентификатор = ВерсияОбработки.id;
			НоваяСтрока.Версия = ВерсияОбработки.version;
			НоваяСтрока.Описание = ВерсияОбработки.description;
			НоваяСтрока.Важное = ВерсияОбработки.critical = "true";
		КонецЦикла;
		
		//Упорядочим по номеру версии, верхняя будет актуальной
		СписокОбновлений.Сортировать("Версия УБЫВ");
		АктуальнаяВерсия_Идентификатор = СписокОбновлений[0].Идентификатор;
		АктуальнаяВерсия_Номер = СписокОбновлений[0].Версия;
		
		СтраницаСпискаВерсий = СформироватьHTML_ОписаниеНовыхВерсий(СписокОбновлений);
			
		Команды.СкачатьАктуальнуюВерсию.Подсказка = Команды.СкачатьАктуальнуюВерсию.Подсказка + " (1." + АктуальнаяВерсия_Номер + ")";
		Команды.НеНапоминать.Подсказка = Команды.НеНапоминать.Подсказка + " (1." + АктуальнаяВерсия_Номер + ")";
		
		//Скроем кнопку скачивания актуальной версии, если это расширение конфигурации
		Если Параметры.ЭтоРасширениеКонфигурации Тогда
			Если Элементы.Найти("СкачатьАктуальнуюВерсию") <> Неопределено Тогда
				Элементы.СкачатьАктуальнуюВерсию.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора <> Неопределено
		И Найти(ИсточникВыбора.ИмяФормы,"УФ_ПодтверждениеТелефона") > 0 Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры


// ================= Информация об обновлениях ===================

&НаСервере
Функция СформироватьHTML_ОписаниеНовыхВерсий(СписокВерсий)
	
	Текст = "";
	Текст = Текст + "<html><head><title>Список обновлений</title></head>";
	Текст = Текст + "<body>";
	
	Для Каждого ВерсияОбработки Из СписокВерсий Цикл
		
		Текст = Текст + "<p><strong>" + ?(ВерсияОбработки.Важное,"<span style=""color: #ff0000;"">","");
		Текст = Текст + "Версия 1." + ВерсияОбработки.Версия + ?(ВерсияОбработки.Важное," (важное обновление)","");
		Текст = Текст + "</strong>" + ?(ВерсияОбработки.Важное,"</span>","") + "</p>";
		Текст = Текст + "<p style=""margin-left: 40px"">";
		
		Описание = ВерсияОбработки.Описание;
		Описание = СтрЗаменить(Описание,Символы.ПС,"<br>");
		
		Текст = Текст + Описание + "<p>";
		
	КонецЦикла;
	
	Текст = Текст + "</body></html>";
	
	Возврат Текст;
	
КонецФункции

&НаКлиенте
Процедура СкачатьАктуальнуюВерсию(Команда)
	
	РезультатПолученияФайла = ПолучитьФайлВнешнейОбработки(АктуальнаяВерсия_Идентификатор);
	
	Если РезультатПолученияФайла.Успешно Тогда
		ЭтаФорма.Закрыть();
	Иначе
		ВладелецФормы.СообщитьСообщение(РезультатПолученияФайла.ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Функция ПолучитьФайлВнешнейОбработки(modileId)
		
	Результат = Новый Структура("Успешно,ТекстОшибки,АдресВХ,ИмяФайла",Истина);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ЗапросФайла",Истина);
	
	МетодAPI = "/api/v1/moduleVersions/" + modileId + "/file";
	
	РезультатЗапроса = ВладелецФормы.ВыполнитьЗапрос("ПолучениеФайлаВнешнейОбработки","GET",МетодAPI,,ПараметрыЗапроса);
	
	Если РезультатЗапроса.Успешно Тогда
		ПолучитьФайл(РезультатЗапроса.АдресВХ,РезультатЗапроса.ИмяФайла,Истина);
	Иначе
		Результат.Успешно = Ложь;
		ТекстОшибки = "<" + modileId + "> Ошибка при получении файла обработки: " + РезультатЗапроса.ТекстОшибки;
		Результат.ТекстОшибки = ТекстОшибки;
		
		ОписаниеСобытия = "Получение с портала файла внешней обработки [" + modileId + "]: " + ТекстОшибки;
		ВладелецФормы.ЗаписатьСобытиеВПротокол(СтруктураНастроек,0,"СозданиеДокументов",ОписаниеСобытия,"ПолучениеСкана");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура НеНапоминать(Команда)
	НеНапоминатьНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры
&НаСервере
Процедура НеНапоминатьНаСервере()
	ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","НеНапоминатьОВерсии",АктуальнаяВерсия_Номер);
КонецПроцедуры


// ================= Информация о балансе ===================

&НаСервере
Функция СформироватьHTML_ДанныеБаланса(ДанныеБаланса)
	
	Текст = "";
	Текст = Текст + "<html><head><title>Информация о балансе</title></head>";
	Текст = Текст + "<body>";
	
	Если ДанныеБаланса.Безлимитно = Истина Тогда
		Количество = "безлимитно";
	Иначе
		Количество = ДанныеБаланса.Количество;
	КонецЕсли;
	
	//2024.01.23 ( очередное обновление описания "откуда брать данные":
	Если ЗначениеЗаполнено(ДанныеПользователя.clientActiveTransactionList) Тогда
		ДатаОкончания = ДанныеПользователя.clientActiveTransactionList[0].expirationDate;
	Иначе
		ДатаОкончания = ДанныеБаланса.ДатаОкончания;
	КонецЕсли;
	// ) 2024.01.23
	
	Текст = Текст + "Остаток страниц <strong>" + Количество + "</strong> до " + Формат(ДатаОкончания,"ДФ=dd.MM.yyyy") + " г.";
	
	Если ЗначениеЗаполнено(ДанныеПользователя.clientActiveTransactionList) Тогда
		
		Текст = Текст + "<p>";
		Текст = Текст + "<strong>Доступные периоды:</strong><p>";
		
		Для Каждого АктивнаяТранзакция Из ДанныеПользователя.clientActiveTransactionList Цикл
			Если АктивнаяТранзакция.unlimited = Истина Тогда
				Количество = "безлимитно";
			Иначе
				Количество = АктивнаяТранзакция.delta;
			КонецЕсли;
			
			Текст = Текст + "Лимит страниц <strong>" + Количество + "</strong> до " + Формат(АктивнаяТранзакция.expirationDate,"ДФ=dd.MM.yyyy") + " г." + "<p>";
		КонецЦикла;
		
	КонецЕсли;
	
	Текст = Текст + "<p>";
	Текст = Текст + "В тарифах ""Лайт"" предусмотрен лимит - 1200 страниц в квартал.";
	
	Текст = Текст + "</body></html>";
	
	Возврат Текст;
	
КонецФункции

&НаКлиенте
Процедура КупитьПодписку(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗаявкаНаПокупку");
	
	Если ВладелецФормы.ДанныеПользователя <> Неопределено Тогда
		ПараметрыОткрытия.Вставить("НомерТелефона",ВладелецФормы.ДанныеПользователя.phone);
	КонецЕсли;
	
	ФормаПодтверждения = ПолучитьФорму(ПрефиксИмениФорм + "УФ_ПодтверждениеТелефона", ПараметрыОткрытия, ЭтаФорма);
	ФормаПодтверждения.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ФормаПодтверждения.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаПодтверждения.Открыть();
	
КонецПроцедуры
