
// ================= _ЗФ_УФ_ ===================

&НаКлиенте
Функция _ЗФ_ОбработатьАсинхронныйВызов(ТипВызова,ПараметрыВызова)
	
	//Для реализации возможности открытия этой формы внешней обработке на платформах, не поддерживающих ОписаниеОповещения,
	//(не будет пройден синтаксический контроль), обработчики асинхронных вызовов вынесены в эту процедуру.
	//Для прохождения аудита 1С:Фреш эта процедура заменяется на аналогичную, но без методов Вычислить(). Profit!
	
	Если ТипВызова = "Вопрос" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			ПоказатьВопрос(ОписаниеОповещения,ПараметрыВызова.ТекстВопроса,ПараметрыВызова.Кнопки);
		Иначе
			Вопрос(ПараметрыВызова.ТекстВопроса,ПараметрыВызова.Кнопки);
		КонецЕсли;
		
	ИначеЕсли ТипВызова = "ВыборИзМеню" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			
			ЭлементФормы = Неопределено;
			ПараметрыВызова.ДопПараметры.Свойство("ЭлементФормы",ЭлементФормы);
			
			ПоказатьВыборИзМеню(ОписаниеОповещения,ПараметрыВызова.СписокВыбора,ЭлементФормы);
		Иначе
			ВыбратьИзМеню(ПараметрыВызова.СписокВыбора);
		КонецЕсли;
		
	ИначеЕсли ТипВызова = "ВводСтроки" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			ПоказатьВводСтроки(ОписаниеОповещения,ПараметрыВызова.Строка,ПараметрыВызова.Подсказка,ПараметрыВызова.Длина,ПараметрыВызова.Многострочность);
		Иначе
			ВвестиСтроку(ПараметрыВызова.Строка,ПараметрыВызова.Подсказка,ПараметрыВызова.Длина,ПараметрыВызова.Многострочность);
		КонецЕсли;
	
	ИначеЕсли ТипВызова = "ПоместитьФайлы" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещенияНачало = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова_3Параметра"",ЭтаФорма,ПараметрыВызова.ПараметрыВызоваНачало)");
			ОписаниеОповещенияОкончание = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова.ПараметрыВызоваЗавершение)");
			НачатьПомещениеФайлов(ОписаниеОповещенияОкончание,,Истина,УникальныйИдентификатор,ОписаниеОповещенияНачало);
		Иначе
			ПоместитьФайлы(ПараметрыВызова.ПомещаемыеФайлы,Истина,УникальныйИдентификатор);
		КонецЕсли;
				
	ИначеЕсли ТипВызова = "ДиалогВыбораФайла" Тогда
		Если ДоступноОписаниеОповещения Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьРезультатАсинхронногоВызова"",ЭтаФорма,ПараметрыВызова)");
			ПараметрыВызова.ДиалогВыбораФайла.Показать(ОписаниеОповещения);
		Иначе
			ПоместитьФайлы(ПараметрыВызова.ПомещаемыеФайлы,Истина,УникальныйИдентификатор);
		КонецЕсли;
		          
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработатьРезультатАсинхронногоВызова_3Параметра(Результат,Отказ,ПараметрыВызова) Экспорт
	Если ПараметрыВызова.Обработчик = "ОбработатьНачалоВыбораФайлов_ВебКлиент" Тогда
		ОбработатьНачалоВыбораФайлов_ВебКлиент(Результат,Отказ,ПараметрыВызова.ДопПараметры);
	КонецЕсли;	
КонецФункции
&НаКлиенте
Функция ОбработатьРезультатАсинхронногоВызова(Результат,ПараметрыВызова) Экспорт
		
	//Сюда в условия переносятся все присутствующие в форме обработчики результатов асинхронных вызовов
	Если ПараметрыВызова.Обработчик = "ОбработатьВыборИзМеню_ЭкспортИмпорт" Тогда
		ОбработатьВыборИзМеню_ЭкспортИмпорт(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "Продолжить_НастройкиСброс" Тогда
		Продолжить_НастройкиСброс(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ОбработатьВыборФайлов" Тогда
		ОбработатьВыборФайлов(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ОбработатьВыборФайлов_ВебКлиент" Тогда
		ОбработатьВыборФайлов_ВебКлиент(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "ОбработатьВводЗначенияСтроки" Тогда
		ОбработатьВводЗначенияСтроки(Результат,ПараметрыВызова.ДопПараметры);
		
	ИначеЕсли ПараметрыВызова.Обработчик = "Заглушка_ОписаниеОповещения" Тогда
		//Ничего не выполняем
		
	КонецЕсли;
	
КонецФункции


// ================= События формы ===================

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Пространство",Пространство);
	Параметры.Свойство("РегионПространства",РегионПространства);
	Параметры.Свойство("ПрефиксИмениФорм",ПрефиксИмениФорм);
	Параметры.Свойство("ДоступноОписаниеОповещения",ДоступноОписаниеОповещения);
	Параметры.Свойство("ВладелецФормыУникальныйИдентификатор",ВладелецФормыУникальныйИдентификатор);
	Параметры.Свойство("ЭтоФреш",ЭтоФреш);
	Параметры.Свойство("ЭтоРасширениеКонфигурации",ЭтоРасширениеКонфигурации);
	
	//2019.09.09 (
	Если Параметры.Свойство("recognitionSettings")
		И ТипЗнч(Параметры.recognitionSettings) <> Неопределено Тогда
		НастройкиПортала = Параметры.recognitionSettings;
	Иначе
		НастройкиПортала = Новый Соответствие;
	КонецЕсли;
	
	Если ТипЗнч(НастройкиПортала) = Тип("ФиксированноеСоответствие") Тогда
		recognitionSettings = НастройкиПортала;
	Иначе
		recognitionSettings = Новый ФиксированноеСоответствие(НастройкиПортала);
	КонецЕсли;
	// ) 2019.09.09
	
	Если Параметры.Свойство("ИсходнаяСтруктураНастроек") Тогда
		ИсходнаяСтруктураНастроек = Параметры.ИсходнаяСтруктураНастроек;
	Иначе
		ИсходнаяСтруктураНастроек = Новый Структура;
	КонецЕсли;		
	
	// Построить дерево настроек из макета ШаблонНастроек, заполнить их сохраненными пользовательскими,
	//если не нашли - следует предзаполнить для него значения по умолчанию
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	Дерево = РеквизитФормыВЗначение("ДеревоНастроек");	
	РеквизитОбъект.ЗаполнитьДеревоНастроек(Дерево,Пространство,,recognitionSettings);
	ЗначениеВРеквизитФормы(Дерево,"ДеревоНастроек");
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого Строка ИЗ ДеревоНастроек.ПолучитьЭлементы() Цикл
    	Элементы.ДеревоНастроек.Развернуть(Строка.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Пространство) Тогда
		ИмяПространства = " (" + ВладелецФормы.Элементы.Отбор_Пространство.СписокВыбора.НайтиПоЗначению(Пространство).Представление + ")";
	Иначе
		ИмяПространства = "";
		Элементы.СохранитьГлобальныеНастройки.Видимость = Ложь;
	КонецЕсли;
	
	Заголовок = "Настройки" + ИмяПространства;
	
	//Идентификатор владельца формы для передачи сообщений пользователю в основную форму
	ВладелецФормыУникальныйИдентификатор = ВладелецФормы.УникальныйИдентификатор;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	// 2019.01.30 (EN-196: не выдавать запрос на сохранение глобальных настроек	
	РезультатСохранения = СохранитьНастройкиНаСервере(СохранитьГлобальныеНастройки);
		
	Если РезультатСохранения.Успешно Тогда
		
		//2025.11.17 ( Отправляем настройки только если изменились контролируемые значения
		Если ИсходнаяСтруктураНастроек.ЗаполнениеШапки_ИспользоватьДанныеОснованияДляДоговора <> РезультатСохранения.СтруктураНастроек.ЗаполнениеШапки_ИспользоватьДанныеОснованияДляДоговора
			Или ИсходнаяСтруктураНастроек.ЗаполнениеТЧ_ЗаполнятьДанныеГТД <> РезультатСохранения.СтруктураНастроек.ЗаполнениеТЧ_ЗаполнятьДанныеГТД Тогда
		// ) 2025.11.17
			//обновим настройки распознавания на портале
			ОбменНастройками_ОбновитьНастройкиРаспознавания(Пространство,РезультатСохранения.СтруктураНастроек);
		КонецЕсли;
		
		РезультатСохранения.Вставить("recognitionSettings",recognitionSettings);
		
		// 2019.11.15 ( Если установили флаг работы с одной номенклатурой в табличной части,
		//проверим, что она заполнена и очистим список документов формы-владельца
		Если ИсходнаяСтруктураНастроек.Свойство("ЗаполнениеТЧ_СворачиватьТЧВОднуСтроку")
			И РезультатСохранения.СтруктураНастроек.Свойство("ЗаполнениеТЧ_СворачиватьТЧВОднуСтроку")
			И РезультатСохранения.СтруктураНастроек.ЗаполнениеТЧ_СворачиватьТЧВОднуСтроку <> ИсходнаяСтруктураНастроек.ЗаполнениеТЧ_СворачиватьТЧВОднуСтроку Тогда
			РезультатСохранения.Вставить("ОчиститьСписокДокументов",Истина);
			
		//2021.06.05 ( Если был включен-выключен исходящий электронный документооборот - тоже перезаполняем	
		ИначеЕсли ИсходнаяСтруктураНастроек.Свойство("ОбменДанными_ИспользуетсяИсходящийЭлектронныйДокументооборот")
			И РезультатСохранения.СтруктураНастроек.Свойство("ОбменДанными_ИспользуетсяИсходящийЭлектронныйДокументооборот")
			И РезультатСохранения.СтруктураНастроек.ОбменДанными_ИспользуетсяИсходящийЭлектронныйДокументооборот <> ИсходнаяСтруктураНастроек.ОбменДанными_ИспользуетсяИсходящийЭлектронныйДокументооборот Тогда
			РезультатСохранения.Вставить("ОчиститьСписокДокументов",Истина);
		// ) 2021.06.05
		
		КонецЕсли;
		// ) 2019.11.15
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
		Сообщение.Текст = РезультатСохранения.ТекстОшибки;
		Сообщение.Сообщить();
	КонецЕсли;
	
	Оповестить("ЗакрытиеФормы_Настройки",РезультатСохранения);
	ЭтаФорма.Закрыть();
	// ) 2019.01.30
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруНастроекНаСервере(АдресДереваНастроек = Неопределено) Экспорт
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	//Адрес уже заполненного дерева настроек может быть передан из формы стартового помощника
	Если АдресДереваНастроек = Неопределено Тогда
		Дерево = РеквизитФормыВЗначение("ДеревоНастроек");
	Иначе
		Дерево = ПолучитьИзВременногоХранилища(АдресДереваНастроек);
	КонецЕсли;
		
	СтрокиНастроек = Дерево.Строки.НайтиСтроки(Новый Структура("ЭтоГруппа",Ложь),Истина);
	
	СтруктураНастроек = Новый Структура;
	
	ДоступныеТипы = Новый СписокЗначений;
	
	Для Каждого СтрокаНастройки Из СтрокиНастроек Цикл
		СтруктураНастроек.Вставить(СтрокаНастройки.НастройкаИД,СтрокаНастройки.Значение);
		
		//2019.01.30 ( для Номенклатуры нужно позволить пользователю выбирать тип каждой создаваемой Товар/Услуга
		Если СтрокаНастройки.НастройкаИД = "Номенклатура_ТипНоменклатурыТоварУслуга" Тогда
			СтруктураНастроек.Вставить("Номенклатура_ТипНоменклатурыТоварУслуга_СписокВыбора",СтрокаНастройки.СписокВыбора);
		КонецЕсли;
		// ) 2019.01.30
		
		//2019.02.24 (
		Если СтрокаНастройки.НастройкаИД = "ТипДокумента_Поступление" Тогда
			ДоступныеТипы = ЗначениеИзСтрокиВнутрСервер(СтрокаНастройки.СписокВыбора);
		КонецЕсли;
		// ) 2019.02.24
	КонецЦикла;
	
	//2018.12.25 ( если узел не заполнен - поищем существующий
	Если СтруктураНастроек.Свойство("ОбменДанными_УзелОбменаНоменклатурой")
		И Не ЗначениеЗаполнено(СтруктураНастроек.ОбменДанными_УзелОбменаНоменклатурой) Тогда
		Попытка
			СтруктураНастроек.ОбменДанными_УзелОбменаНоменклатурой = РеквизитОбъект.ПолучитьСсылку_УзелОбменаНоменклатурой(Ложь).Ссылка;
		Исключение
			СообщитьСообщение("Ошибка при получении узла обмена <Entera>:" + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	// ) 2018.12.25
	
	//2019.02.08 ( Если вид номенклатуры не заполнен - предзаполним найденным по наименованию
	Если Метаданные.Справочники.Найти("ВидыНоменклатуры") <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(СтруктураНастроек.Номенклатура_ВидНоменклатурыПоУмолчаниюТовар) Тогда
			СтруктураНастроек.Номенклатура_ВидНоменклатурыПоУмолчаниюТовар = ПолучитьВидНоменклатурыПоНаименованию("Товар");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтруктураНастроек.Номенклатура_ВидНоменклатурыПоУмолчаниюУслуга) Тогда
			СтруктураНастроек.Номенклатура_ВидНоменклатурыПоУмолчаниюУслуга = ПолучитьВидНоменклатурыПоНаименованию("Услуг");
		КонецЕсли;
	КонецЕсли;
	// ) 2019.02.08
	
	//сведения о конфигурации и об используемых обработкой типах в ней
	СведенияОКонфигурации = ПолучитьСведенияОТекущейКонфигурации();
	СтруктураНастроек.Вставить("СведенияОКонфигурации",СведенияОКонфигурации);
	СтруктураНастроек.Вставить("ЭтоФреш",ЭтоФреш);
		
	//для ряда конфигураций используем хранение связей в своей таблице в ХранилищеОбщихНастроек
	Если СтруктураНастроек.СведенияОКонфигурации.ХранениеСвязиДокументов_СвояТаблица <> Истина Тогда
	
		//добавим в структуру ссылки на доп. свойства для хранения идентификаторов портала
		СтруктураДопСведений = ПолучитьСтруктуруДопСведенийСвязиОбъектов();
		Для Каждого ЭлементСтруктуры Из СтруктураДопСведений Цикл
			СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ,ЭлементСтруктуры.Значение);
		КонецЦикла;
	КонецЕсли;
	
	//Статусы Диадок
	Диадок_СоответствиеСтатусов = РеквизитОбъект.Диадок_ИнициализироватьСоответствияСтатусов();
	СтруктураНастроек.Вставить("Диадок_СоответствиеСтатусов",Диадок_СоответствиеСтатусов);
	
	//Статусы СБИС
	СБИС_СоответствиеСтатусов = РеквизитОбъект.СБИС_ИнициализироватьСоответствияСтатусов();
	СтруктураНастроек.Вставить("СБИС_СоответствиеСтатусов",СБИС_СоответствиеСтатусов);
	
	//Словарь синонимов единиц измерения
	СловарьСинонимовЕИ = РеквизитОбъект.Классификатор_ИнициализироватьСоответствияСинонимовЕдиницИзмерения();
	СтруктураНастроек.Вставить("СловарьСинонимовЕИ",СловарьСинонимовЕИ);
	
	
	//2019.02.24 ( на портале появились новые типы, предзаполним их, если пользователь еще не установил свои значения
	Если Не ЗначениеЗаполнено(СтруктураНастроек.ТипДокумента_Поступление) Тогда
		СтруктураНастроек.ТипДокумента_Поступление = СведенияОКонфигурации.ДокументПоступления;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураНастроек.ТипДокумента_Акт) Тогда
		СтруктураНастроек.ТипДокумента_Акт = СведенияОКонфигурации.ДокументПоступления;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураНастроек.ТипДокумента_Счет) Тогда
		СтруктураНастроек.ТипДокумента_Счет = СведенияОКонфигурации.ДокументПоступления;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураНастроек.ТипДокумента_Чек) Тогда
		СтруктураНастроек.ТипДокумента_Чек = СведенияОКонфигурации.ДокументПоступления;
	КонецЕсли;
	// ) 2019.02.24
	
	//2019.09.16 ( Заполнение реквизита табличной части ОтражениеВУСН
	Если СтруктураНастроек.ЗаполнениеТЧ_РасходыНУПринимаютсяНеПринимаются = "" Тогда
		ОтражениеВУСН = Неопределено;
		
	ИначеЕсли СтруктураНастроек.ЗаполнениеТЧ_РасходыНУПринимаютсяНеПринимаются = "Принимаются" Тогда
		Если РеквизитОбъект.РеквизитСуществует("Перечисления","ОтражениеВУСН","Принимаются") Тогда
			ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
		КонецЕсли;
		
	ИначеЕсли СтруктураНастроек.ЗаполнениеТЧ_РасходыНУПринимаютсяНеПринимаются = "Не принимаются" Тогда
		Если РеквизитОбъект.РеквизитСуществует("Перечисления","ОтражениеВУСН","НеПринимаются") Тогда
			ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
		КонецЕсли;
		
	КонецЕсли;
	СтруктураНастроек.Вставить("ЗаполнениеТЧ_ОтражениеВУСН",ОтражениеВУСН);
	// ) 2019.09.16
	
	//2019.05.21 ( модуль кастомизации
	Если ЗначениеЗаполнено(СтруктураНастроек.СистемныеНастройки_ДополнительныйМодульКастомизации) Тогда
		ПолучениеМК = МодульКастомизации_ПолучитьДанныеОбработки(СтруктураНастроек.СистемныеНастройки_ДополнительныйМодульКастомизации);
		
		Если ПолучениеМК.Успешно Тогда
			ДанныеОбработки = ПолучениеМК.АдресВХ;
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ПолучениеМК.ТекстОшибки;
			Сообщение.Сообщить();
		КонецЕсли;
		
	КонецЕсли;
	СтруктураНастроек.Вставить("АдресХранилищаДвоичныхДанныхМодуляКастомизации",ДанныеОбработки);
	// ) 2019.05.21
	
	СписокТипов = ЗначениеИзСтрокиВнутр(СтруктураНастроек.Номенклатура_ТипНоменклатурыТоварУслуга_СписокВыбора);
	
	//E1C-4: Создание документов доп. расходов: отключим возможность такого выбора при отсутствии такой необходимости
	Если Не СтруктураНастроек.Свойство("ТипДокумента_ВыбиратьУслугиДляДопРасходов")
		Или СтруктураНастроек.ТипДокумента_ВыбиратьУслугиДляДопРасходов <> Истина Тогда
		//Удалим из списка доступных типов номенклатуры Расходы
		НайденныйЭлемент = СписокТипов.НайтиПоЗначению("Расходы");
		Если НайденныйЭлемент <> Неопределено Тогда
			СписокТипов.Удалить(НайденныйЭлемент);
		КонецЕсли;
	КонецЕсли;
	
	//E1C-257: Агентские услуги
	Если Не СтруктураНастроек.Свойство("ТипДокумента_ИспользуютсяАгентскиеУслуги")
		Или СтруктураНастроек.ТипДокумента_ИспользуютсяАгентскиеУслуги <> Истина Тогда
		//Удалим из списка доступных типов номенклатуры Агентские услуги
		НайденныйЭлемент = СписокТипов.НайтиПоЗначению("АгентскиеУслуги");
		Если НайденныйЭлемент <> Неопределено Тогда
			СписокТипов.Удалить(НайденныйЭлемент);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураНастроек.Вставить("Номенклатура_ТипНоменклатурыТоварУслуга_СписокВыбора",ЗначениеВСтрокуВнутр(СписокТипов));
	
	
	//E1C-79: добавлен поиск по справочнику Номенклатура поставщиков. Если в конфигурации нет справочника НоменклатураПоставщиков/НоменклатураКонтрагентов,
	//то флаг этой настройки всегда должен быть Ложь
	Если СтруктураНастроек.Номенклатура_ИспользоватьНоменклатуруПоставщиков = Истина
		И Метаданные.Справочники.Найти("НоменклатураПоставщиков") = Неопределено
		И Метаданные.Справочники.Найти("НоменклатураКонтрагентов") = Неопределено 
		И Метаданные.Справочники.Найти("Тренд_НоменклатураКонтрагентов") = Неопределено Тогда
		
		СтруктураНастроек.Номенклатура_ИспользоватьНоменклатуруПоставщиков = Ложь;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = Новый УникальныйИдентификатор(ВладелецФормыУникальныйИдентификатор);
		Сообщение.Текст = "В конфигурации отсутствует справочник <Номенклатура поставщиков/контрагентов>, настройка работы с этим справочником была отключена";
		Сообщение.Сообщить();
	КонецЕсли;
	
	//E1C-421: регион пространства добавим в структуру настроек
	СтруктураНастроек.Вставить("РегионПространства",РегионПространства);
	
	//Актуальную структуру помещаем в хранилище для работы с ними внешней печатной формы
	ХранилищеОбщихНастроек.Сохранить("Entera_ВнешняяПечатнаяФорма","СтруктураНастроек",СтруктураНастроек);
			
	Возврат СтруктураНастроек;
	
КонецФункции
&НаСервере
Функция СохранитьНастройкиНаСервере(СохранитьГлобальныеНастройки = Ложь,НоваяСтруктураНастроек = Неопределено) Экспорт
	
	РезультатСохранения = Новый Структура("Успешно,ТекстОшибки",Истина);
	
	//Новая структура настроек может быть передан из формы стартового помощника
	Если НоваяСтруктураНастроек = Неопределено Тогда
		НоваяСтруктураНастроек = ПолучитьСтруктуруНастроекНаСервере();
	КонецЕсли;
	
	//2018.12.19 (	
	ПолнаяСтруктураНастроек = ХранилищеОбщихНастроек.Загрузить("Entera_ЗагрузкаДокументов","ОбщиеНастройки");
	
	ИмяПространства = ?(ЗначениеЗаполнено(Пространство),Пространство,"ПустоеПространство");
		
	Если ПолнаяСтруктураНастроек = Неопределено Тогда
		ПолнаяСтруктураНастроек = Новый Соответствие;
		
	ИначеЕсли ТипЗнч(ПолнаяСтруктураНастроек) = Тип("Структура") Тогда
		ПолнаяСтруктураНастроек = Новый Соответствие;
		
	ИначеЕсли ТипЗнч(ПолнаяСтруктураНастроек) = Тип("Соответствие") Тогда
		
	КонецЕсли;
	
	ПолнаяСтруктураНастроек.Вставить(ИмяПространства,НоваяСтруктураНастроек);
			
	ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","ОбщиеНастройки",ПолнаяСтруктураНастроек);
	// ) 2018.12.19
	
	//Сохраняем избранные настройки
	Дерево = РеквизитФормыВЗначение("ДеревоНастроек");
	СтрокиИзбранное = Дерево.Строки.НайтиСтроки(Новый Структура("Избранное",1),Истина);
	
	ИзбранныеНастройки = Новый Структура;
	Для Каждого СтрокаИзбранное Из СтрокиИзбранное Цикл 
		ИзбранныеНастройки.Вставить(СтрокаИзбранное.НастройкаИД);
	КонецЦикла;
	ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","ИзбранныеНастройки",ИзбранныеНастройки);
	
		
	Если СохранитьГлобальныеНастройки = Истина Тогда
		
		//Сохраняем текущее пространство для выгрузки номенклатуры регламентным заданием
		НоваяСтруктураНастроек.Вставить("Пространство",Пространство);
		
		Попытка
			ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","ОбщиеНастройки",НоваяСтруктураНастроек,,"Entera");
		Исключение
			РезультатСохранения.Успешно = Ложь;
			РезультатСохранения.ТекстОшибки = ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;
	
	РезультатСохранения.Вставить("СтруктураНастроек",НоваяСтруктураНастроек);
	
	Возврат РезультатСохранения;
	
КонецФункции


// ================= Работа с элементов дерева настроек ===================

&НаКлиенте
Процедура ДеревоНастроекПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.ДеревоНастроек.ТекущиеДанные;
	
	//Раньше был ПоказатьВыборИзМеню(СписокВыбора), но с целью избавления от ОписаниеОповещения
	//переделано на заполнение СпискаВыбора элемента
	Элементы.ДеревоНастроекЗначение.СписокВыбора.Очистить();
	
	Если ТекСтрока <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекСтрока.СписокВыбора) Тогда
			Элементы.ДеревоНастроекЗначение.РедактированиеТекста = Истина;
			Элементы.ДеревоНастроекЗначение.РежимВыбораИзСписка = Истина;
			
			СписокВыбора = ЗначениеИзСтрокиВнутрСервер(ТекСтрока.СписокВыбора);
			Для Каждого ЭлементСписка Из СписокВыбора Цикл
				
				//E1C-421: Костыль: для KAZ-конфигураций "визуально" предлагаем поиск по ИИН, а не по ИНН, исключаем вариант с КПП
				Если РегионПространства = "KAZ" Тогда
					Если ЭлементСписка.Значение = "ИНН+КПП" Тогда
						Продолжить;
					КонецЕсли;
					ЭлементСписка.Представление = СтрЗаменить(ЭлементСписка.Представление,"ИНН","ИИН");
				КонецЕсли;
				
				НовыйЭлемент = Элементы.ДеревоНастроекЗначение.СписокВыбора.Добавить();
				ЗаполнитьЗначенияСвойств(НовыйЭлемент,ЭлементСписка);
			КонецЦикла;
			
		ИначеЕсли ТекСтрока.ОписаниеТипа = Новый ОписаниеТипов("Строка")
			Или ТекСтрока.ОписаниеТипа = Новый ОписаниеТипов("Число") Тогда
			Элементы.ДеревоНастроекЗначение.РедактированиеТекста = Истина;
			Элементы.ДеревоНастроекЗначение.РежимВыбораИзСписка = Ложь;
			
		Иначе
			Элементы.ДеревоНастроекЗначение.РежимВыбораИзСписка = Ложь;
			Элементы.ДеревоНастроекЗначение.РедактированиеТекста = Ложь;
		КонецЕсли;
		
		//Добавим кнопку выбора для многострочного режима формирования Назначения платежа
		СвойстваЭлемента = Новый Структура;
		
		Если ТекСтрока.НастройкаИД = "ЗаполнениеШапки_ШаблонНазначенияПлатежа" Тогда
			СвойстваЭлемента.Вставить("КнопкаВыбора",Истина);
		Иначе
			СвойстваЭлемента.Вставить("КнопкаВыбора",Неопределено);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Элементы.ДеревоНастроекЗначение,СвойстваЭлемента);
		
		//2019.04.16 (
		Если ЗначениеЗаполнено(ТекСтрока.ОписаниеТипа) Тогда
			Элементы.ДеревоНастроекЗначение.ОграничениеТипа = ТекСтрока.ОписаниеТипа;
		Иначе
			Элементы.ДеревоНастроекЗначение.ОграничениеТипа = Новый ОписаниеТипов;
		КонецЕсли;
		// ) 2019.04.16
		
		//В УНФ выбор группы выполняется отдельной формой, общей формой выбора группу не выбрать
		Если ТекСтрока.НастройкаИД = "Номенклатура_ГруппаСоздаваемойНоменклатуры"
			Или ТекСтрока.НастройкаИД = "Номенклатура_ГруппаСоздаваемойНоменклатурыУслуги" Тогда
			Элементы.ДеревоНастроекЗначение.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
			
		ИначеЕсли ТекСтрока.НастройкаИД = "Номенклатура_СсылкаДляНовойНоменклатурыПоставщика" Тогда
			Элементы.ДеревоНастроекЗначение.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
					
		ИначеЕсли ТекСтрока.НастройкаИД = "Номенклатура_ВидНоменклатурыПоУмолчаниюТовар"
			Или ТекСтрока.НастройкаИД = "Номенклатура_ВидНоменклатурыПоУмолчаниюУслуга" Тогда
			Элементы.ДеревоНастроекЗначение.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
			
		ИначеЕсли ТекСтрока.НастройкаИД = "ЗаполнениеТЧ_СворачиватьТЧНоменклатура" Тогда
			Элементы.ДеревоНастроекЗначение.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
			
		//2020.02.13 ( Добавлен составной тип для выбора группы/списка групп номенклатуры	
		ИначеЕсли ТекСтрока.НастройкаИД = "Номенклатура_ГруппаДляПоискаПохожейНоменклатуры" Тогда
			Элементы.ДеревоНастроекЗначение.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
			Если ТекСтрока.Значение = Неопределено Тогда
				ТекСтрока.Значение = Новый СписокЗначений;
			КонецЕсли;
			Если ТипЗнч(ТекСтрока.Значение) = Тип("СписокЗначений") Тогда
				ТекСтрока.Значение.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
			КонецЕсли;
		// ) 2020.02.13
		
		Иначе
			Элементы.ДеревоНастроекЗначение.ВыборГруппИЭлементов = ГруппыИЭлементы.Авто;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ДеревоНастроек.ТекущиеДанные;
	
	Если Элементы.ДеревоНастроек.ТекущийЭлемент = Элементы.ДеревоНастроекЗначение
		И Элементы.ДеревоНастроек.ТекущиеДанные.ЭтоГруппа Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
		
	Если Элементы.ДеревоНастроек.ТекущийЭлемент = Элементы.ДеревоНастроекИзбранное Тогда
		Если НЕ ТекСтрока.ЭтоГруппа Тогда
			ТекСтрока.Избранное = Число(Не ТекСтрока.Избранное);
			ТекСтрока.ОтображатьВсегда = ТекСтрока.Избранное;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПередНачаломИзменения(Элемент, Отказ)
	
	ТекСтрока = Элементы.ДеревоНастроек.ТекущиеДанные;
	
	Если Элементы.ДеревоНастроек.ТекущийЭлемент.Имя = "ДеревоНастроекЗначение" Тогда  
		
		Если ТекСтрока.ЭтоГруппа Тогда
			Отказ = Истина;
		КонецЕсли;	
		
		Если ТипЗнч(ТекСтрока.Значение) = Тип("Булево") Тогда
			ТекСтрока.Значение = Не ТекСтрока.Значение;
			Отказ = Истина;
		КонецЕсли;
		
		Если ТекСтрока.ОписаниеТипа = Новый ОписаниеТипов("СписокЗначений") Тогда
			Отказ = Истина;
		КонецЕсли;
		
		//Для внешней обработки модуля кастомизации определим отбор по наименованию
			
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДеревоНастроекЗначениеПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ДеревоНастроек.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		
		//При подключении модуля кастомизации дернем его сразу, чтобы запрос пользователю с галкой "Защита от опасных действий"
		//был выдан сейчас при подключении, чем когда МК будет вызван при заполнении документа
		Если ТекСтрока.НастройкаИД = "СистемныеНастройки_ДополнительныйМодульКастомизации" И ЗначениеЗаполнено(ТекСтрока.Значение) Тогда
			МодульКастомизации_ТестовоеПолучениеДанныхОбработки();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ДеревоНастроек.ТекущиеДанные;
		
	Если ТекСтрока <> Неопределено Тогда
		
		//Значения списка выбора при очистке сбрасываем на самое первое
		Если ЗначениеЗаполнено(ТекСтрока.СписокВыбора) Тогда
			
			СтандартнаяОбработка = Ложь;
						
			СписокВыбора = ЗначениеИзСтрокиВнутрСервер(ТекСтрока.СписокВыбора);
			ТекСтрока.Значение = СписокВыбора[0].Значение;
			
		//Предустановим тип Список значений и значение списка значений Номенклатура	
		ИначеЕсли ТекСтрока.НастройкаИД = "Номенклатура_ГруппаДляПоискаПохожейНоменклатуры" Тогда
			СтандартнаяОбработка = Ложь;
			Элементы.ДеревоНастроекЗначение.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
			ТекСтрока.Значение = Новый СписокЗначений;
			ТекСтрока.Значение.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//Установим дополнительные отборы, при необходимости
	ТекСтрока = Элементы.ДеревоНастроек.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		
		Если ТекСтрока.НастройкаИД = "СистемныеНастройки_ДополнительныйМодульКастомизации" Тогда
		
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Наименование", "Entera: Модуль кастомизации");
			НовыйМассив = Новый Массив();
			НовыйМассив.Добавить(НовыйПараметр);
			НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
			Элемент.ПараметрыВыбора = НовыеПараметры;
			
		//E1C-250: БП30: Выбор в настройках Способ учета НДС любых значений этого перечисления,
		//включая "Списывается, не принимается к НУ", доступный программно из Авансового отчета	
		ИначеЕсли ТекСтрока.НастройкаИД = "ЗаполнениеТЧ_СпособУчетаНДСПоУмолчанию" Тогда
		
			НовыйПараметр = Новый ПараметрВыбора("ОграничениеСпискаВыбора", "НеОграничивать");
			НовыйМассив = Новый Массив();
			НовыйМассив.Добавить(НовыйПараметр);
			НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
			Элемент.ПараметрыВыбора = НовыеПараметры;
			
		//Позволим многострочный ввод с переносами строки для ввода шаблона назначения платежа
		ИначеЕсли ТекСтрока.НастройкаИД = "ЗаполнениеШапки_ШаблонНазначенияПлатежа" Тогда
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ИдентификаторСтроки",ТекСтрока.ПолучитьИдентификатор());
			
			ПараметрыВызова = Новый Структура("Обработчик,Строка,Подсказка,Длина,Многострочность,ДопПараметры",
				"ОбработатьВводЗначенияСтроки",ТекСтрока.Значение,"Шаблон назначения платежа",0,Истина,ДопПараметры);
			
			_ЗФ_ОбработатьАсинхронныйВызов("ВводСтроки",ПараметрыВызова);
			
		Иначе			
			НовыйМассив = Новый Массив();
			НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
			Элемент.ПараметрыВыбора = НовыеПараметры;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводЗначенияСтроки(Результат,ДопПараметры)
	
	Если Результат <> Неопределено Тогда
		ТекСтрока = ДеревоНастроек.НайтиПоИдентификатору(ДопПараметры.ИдентификаторСтроки);
		
		Если ТекСтрока <> Неопределено Тогда
			ТекСтрока.Значение = Результат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеИзСтрокиВнутрСервер(Параметр)
	Возврат ЗначениеИзСтрокиВнутр(Параметр) 
КонецФункции
&НаКлиентеНаСервереБезКонтекста
Процедура СообщитьСообщение(Текст,Поле = Неопределено,ИдентификаторНазначения = Неопределено) Экспорт
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = Текст;
	СообщениеПользователю.Поле = Поле;
	
	Если ТипЗнч(ИдентификаторНазначения) = Тип("УникальныйИдентификатор") Тогда
		СообщениеПользователю.ИдентификаторНазначения = ИдентификаторНазначения;
	КонецЕсли;
	
	СообщениеПользователю.Сообщить();
	
КонецПроцедуры


// ================= Свойство документа для хранения идентификатора портала ===================

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруДопСведенийСвязиОбъектов()
	
	ДопСведения = Новый Структура;
	
	Если Метаданные.РегистрыСведений.Найти("ДополнительныеСведения") <> Неопределено Тогда
		ДопСведения.Вставить("ИмяРегистраСведений","ДополнительныеСведения");
	ИначеЕсли Метаданные.РегистрыСведений.Найти("ЗначенияСвойствОбъектов") <> Неопределено Тогда
		ДопСведения.Вставить("ИмяРегистраСведений","ЗначенияСвойствОбъектов");
	Иначе
		//+++ Где будем хранить в совсем нетиповых?
		ДопСведения.Вставить("ИмяРегистраСведений");
	КонецЕсли;
		
	ДопСведения.Вставить("Свойство_Entera_documentId",ПолучитьСсылкуДополнительныйРеквизит("Entera_documentId"));
	ДопСведения.Вставить("Свойство_Entera_spaceId",ПолучитьСсылкуДополнительныйРеквизит("Entera_spaceId"));
	
	Возврат ДопСведения;
	
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьСсылкуДополнительныйРеквизит(ИмяРеквизита)
	
	ИмяПланаВидовХарактеристик = "ДополнительныеРеквизитыИСведения";
	
	Если Метаданные.ПланыВидовХарактеристик[ИмяПланаВидовХарактеристик].Реквизиты.Найти("Имя") <> Неопределено Тогда
		Попытка
			РеквизитСсылка = ПланыВидовХарактеристик[ИмяПланаВидовХарактеристик].НайтиПоРеквизиту("Имя",ИмяРеквизита);
		Исключение
			СообщитьСообщение("Ошибка при получении дополнительного реквизита <" + ИмяРеквизита + ">:" + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
	Иначе
		Попытка
			РеквизитСсылка = ПланыВидовХарактеристик[ИмяПланаВидовХарактеристик].НайтиПоНаименованию(ИмяРеквизита,Истина);
		Исключение
			СообщитьСообщение("Ошибка при получении дополнительного реквизита <" + ИмяРеквизита + ">:" + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитСсылка) Тогда
		РеквизитОбъект = ПланыВидовХарактеристик[ИмяПланаВидовХарактеристик].СоздатьЭлемент();
		
		Если Метаданные.Справочники.Найти("НаборыДополнительныхРеквизитовИСведений") <> Неопределено Тогда
			ПредопределенныеНаборы = Метаданные.Справочники.НаборыДополнительныхРеквизитовИСведений.ПолучитьИменаПредопределенных();
			
			Если ПредопределенныеНаборы.Найти("Документ_ПоступлениеТоваровУслуг") <> Неопределено Тогда
				НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеТоваровУслуг;
			ИначеЕсли ПредопределенныеНаборы.Найти("Документ_ПриобретениеТоваровУслуг") <> Неопределено Тогда
				НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриобретениеТоваровУслуг;
			КонецЕсли;
		КонецЕсли;
		
		СтруктураЗаполнения = Новый Структура;
		СтруктураЗаполнения.Вставить("Имя",ИмяРеквизита);
		СтруктураЗаполнения.Вставить("Наименование",ИмяРеквизита);
		СтруктураЗаполнения.Вставить("Заголовок",ИмяРеквизита);
		СтруктураЗаполнения.Вставить("НаборСвойств",НаборСвойств);
		СтруктураЗаполнения.Вставить("Виден",Истина);
		СтруктураЗаполнения.Вставить("Доступен",Истина);
		
		ЗаполнитьЗначенияСвойств(РеквизитОбъект,СтруктураЗаполнения);
		
		ДлинаСтроки = Мин(Метаданные.ПланыВидовХарактеристик[ИмяПланаВидовХарактеристик].Тип.КвалификаторыСтроки.Длина,1024);
		КС = Новый КвалификаторыСтроки(ДлинаСтроки);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));

		РеквизитОбъект.ТипЗначения = Новый ОписаниеТипов(Массив,,,,КС);
		
		Попытка
			РеквизитОбъект.Записать();
			РеквизитСсылка = РеквизитОбъект.Ссылка;
		Исключение
			СообщитьСообщение("Ошибка при записи дополнительного реквизита <" + ИмяРеквизита + ">: " + ОписаниеОшибки());
		КонецПопытки;
		
		Если ЗначениеЗаполнено(РеквизитСсылка) И ЗначениеЗаполнено(НаборСвойств) Тогда
			НаборОбъект = НаборСвойств.ПолучитьОбъект();
			НаборОбъект.ДополнительныеРеквизиты.Добавить().Свойство = РеквизитСсылка;
			
			Попытка
				НаборОбъект.Записать();
			Исключение
				СообщитьСообщение("Ошибка при записи набора дополнительных реквизитов: " + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РеквизитСсылка;
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьВидНоменклатурыПоНаименованию(Наименование)
	
	Результат = Справочники.ВидыНоменклатуры.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СправочникВидыНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВидыНоменклатуры КАК СправочникВидыНоменклатуры
	               |ГДЕ
	               |	СправочникВидыНоменклатуры.Наименование ПОДОБНО &Наименование
	               |	И НЕ СправочникВидыНоменклатуры.ПометкаУдаления";
	Если Метаданные.Справочники.ВидыНоменклатуры.Иерархический Тогда
		Запрос.Текст = Запрос.Текст + " И НЕ СправочникВидыНоменклатуры.ЭтоГруппа";
	КонецЕсли;
	Запрос.УстановитьПараметр("Наименование",Наименование + "%");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


// ================= Описание текущей конфигурации ===================

&НаСервере
Функция ПолучитьСведенияОТекущейКонфигурации()
	
	ОписаниеКонфигурации = Новый Структура;
	
	//Определим установку защищенного соединения средствами 1с / WinHTTP
	СисИнфо = Новый СистемнаяИнформация;
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	ВерсияМассив = РеквизитОбъект.Энтера_РазложитьСтрокуВМассивПодстрок(СисИнфо.ВерсияПриложения,".");
	СоединениеСредствамиПлатформы = Не (ВерсияМассив[0] = "8" И ВерсияМассив[1] = "2"); //Запуск на 8.1 не предполагается, 8.3 умеет в HTTPS
	ОписаниеКонфигурации.Вставить("СоединениеСредствамиПлатформы",СоединениеСредствамиПлатформы);
	
	Имя = Метаданные.Имя;
	Версия = Метаданные.Версия;
		
	Конфигурация = РеквизитОбъект.ПолучитьОписаниеКонфигурации();		
	ОписаниеКонфигурации.Вставить("Конфигурация",Конфигурация);
	
	//Сообщаем об отсутствующих типах?
	СообщаемОбОтсутствующихТипах = Истина;
	
	//Или в ряде случаев не забиваем эфир лишними сообщениями?
	Если Конфигурация.Крат = "ITОтдел"
		Или Конфигурация.Крат = "БИТСтоматология"
		Или Конфигурация.Крат = "БИТУМЦ"
		Или Конфигурация.Крат = "Далион"
		Или Конфигурация.Имя = "дсуУАТ"
		Или Конфигурация.Имя = "УправлениеЮвелирнымПроизводством" Тогда
		СообщаемОбОтсутствующихТипах = Ложь;
	КонецЕсли;
	
	//Поступление
	Если Метаданные.Документы.Найти("ПоступлениеТоваровУслуг") <> Неопределено Тогда
		ОписаниеКонфигурации.Вставить("ДокументПоступления","ПоступлениеТоваровУслуг");
		
	ИначеЕсли Метаданные.Документы.Найти("ПриобретениеТоваровУслуг") <> Неопределено Тогда
		ОписаниеКонфигурации.Вставить("ДокументПоступления","ПриобретениеТоваровУслуг");
		
	ИначеЕсли Метаданные.Документы.Найти("ПриходнаяНакладная") <> Неопределено Тогда
		ОписаниеКонфигурации.Вставить("ДокументПоступления","ПриходнаяНакладная");
		
	ИначеЕсли Метаданные.Документы.Найти("ПоступлениеТоваров") <> Неопределено Тогда
		ОписаниеКонфигурации.Вставить("ДокументПоступления","ПоступлениеТоваров");
		
	ИначеЕсли Метаданные.Документы.Найти("ПоступлениеМЗ") <> Неопределено Тогда
		ОписаниеКонфигурации.Вставить("ДокументПоступления","ПоступлениеМЗ");
			
	ИначеЕсли Метаданные.Документы.Найти("Поступление") <> Неопределено Тогда
		ОписаниеКонфигурации.Вставить("ДокументПоступления","Поступление");
		
	ИначеЕсли Метаданные.Документы.Найти("ПоступлениеМатериалов") <> Неопределено Тогда
		ОписаниеКонфигурации.Вставить("ДокументПоступления","ПоступлениеМатериалов");
	
	Иначе
		ОписаниеКонфигурации.Вставить("ДокументПоступления");
		СообщитьСообщение("Не удалось определить документ поступления в текущей конфигурации");
		
	КонецЕсли;
	
	//Реализация
	Если Метаданные.Документы.Найти("РеализацияТоваровУслуг") <> Неопределено Тогда
		ОписаниеКонфигурации.Вставить("ДокументРеализации","РеализацияТоваровУслуг");
		
	ИначеЕсли Метаданные.Документы.Найти("РасходнаяНакладная") <> Неопределено Тогда
		ОписаниеКонфигурации.Вставить("ДокументРеализации","РасходнаяНакладная");
		
	ИначеЕсли Метаданные.Документы.Найти("РеализацияТоваров") <> Неопределено Тогда
		ОписаниеКонфигурации.Вставить("ДокументРеализации","РеализацияТоваров");
		
	ИначеЕсли Метаданные.Документы.Найти("ТребованиеНакладная0315006") <> Неопределено Тогда
		ОписаниеКонфигурации.Вставить("ДокументРеализации","ТребованиеНакладная0315006");
		
	ИначеЕсли Метаданные.Документы.Найти("Реализация") <> Неопределено Тогда
		ОписаниеКонфигурации.Вставить("ДокументРеализации","Реализация");
		
	Иначе
		ОписаниеКонфигурации.Вставить("РеализацияТоваров");
		
		Если СообщаемОбОтсутствующихТипах Тогда
			СообщитьСообщение("Не удалось определить документ реализации в текущей конфигурации");
		КонецЕсли;
		
	КонецЕсли;
	
	//Счет-фактура полученный
	СчетФактураПолученный = Неопределено;
	Если Метаданные.Документы.Найти("СчетФактураПолученный") <> Неопределено Тогда
		СчетФактураПолученный = "СчетФактураПолученный";
	КонецЕсли;
	ОписаниеКонфигурации.Вставить("СчетФактураПолученный",СчетФактураПолученный);
	
	//Счет-фактура выданный
	СчетФактураВыданный = Неопределено;
	Если Метаданные.Документы.Найти("СчетФактураВыданный") <> Неопределено Тогда
		СчетФактураВыданный = "СчетФактураВыданный";		
	ИначеЕсли Метаданные.Документы.Найти("СчетФактураВыписанный") <> Неопределено Тогда
		СчетФактураВыданный = "СчетФактураВыписанный";		
	ИначеЕсли Метаданные.Документы.Найти("СчетФактура") <> Неопределено Тогда
		СчетФактураВыданный = "СчетФактура";		
	КонецЕсли;
	ОписаниеКонфигурации.Вставить("СчетФактураВыданный",СчетФактураВыданный);
	
	Если СообщаемОбОтсутствующихТипах Тогда
		Если Не ЗначениеЗаполнено(СчетФактураПолученный) Тогда
			СообщитьСообщение("Не удалось определить документ <Cчет-фактура полученный> в текущей конфигурации");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СчетФактураВыданный) Тогда
			СообщитьСообщение("Не удалось определить документ <Cчет-фактура выданный> в текущей конфигурации");
		КонецЕсли;
	КонецЕсли;
	
	
	//Типы заполняемых документов
	ТипыЗаполняемыхДокументов = РеквизитОбъект.ПолучитьСписокЗаполняемыхДокументов(Конфигурация);
	ОписаниеКонфигурации.Вставить("ТипыЗаполняемыхДокументов",ТипыЗаполняемыхДокументов);
	
	//Виды операций заполняемых типов документов
	ОписаниеКонфигурации.Вставить("ВидыОперацийЗаполняемыхДокументов",РеквизитОбъект.ПолучитьСписокВидовОперацийЗаполняемыхДокументов(ТипыЗаполняемыхДокументов,Конфигурация));
	
	
	//Ставки НДС
	ОписаниеКонфигурации.Вставить("СтавкиНДС",ЗаполнитьСтруктуруСтавокНДС(Конфигурация));
	
	//Имя реквизита ВидНоменклатуры у справочника Номенклатура
	Если Метаданные.Справочники.Номенклатура.Реквизиты.Найти("ВидНоменклатуры") <> Неопределено Тогда
		Номенклатура_ИмяРеквизитаВидНоменклатуры = "ВидНоменклатуры";
	КонецЕсли;	
	
	//2020.02.21 ( ФитнесКлуб
	ХранениеСвязиДокументов_СвояТаблица = Ложь;
	Если Конфигурация.Крат = "ФитнесКлуб" Тогда
		Номенклатура_ИмяРеквизитаВидНоменклатуры = "ТипНоменклатуры";
		ХранениеСвязиДокументов_СвояТаблица = Истина;
	ИначеЕсли Конфигурация.Крат = "БИТСтоматология" Тогда
		ХранениеСвязиДокументов_СвояТаблица = Истина;
	ИначеЕсли Конфигурация.Крат = "БИТУМЦ" Тогда
		ХранениеСвязиДокументов_СвояТаблица = Истина;
	ИначеЕсли Имя = "ЮвелирныйТорговыйДом" Тогда
		ХранениеСвязиДокументов_СвояТаблица = Истина;
	КонецЕсли;	
	
	ОписаниеКонфигурации.Вставить("Номенклатура_ИмяРеквизитаВидНоменклатуры",Номенклатура_ИмяРеквизитаВидНоменклатуры);
	
	//2019.05.21 ( БГУ: Измерение Объект регистра ЗначенияСвойствОбъектов не позволяет хранить ссылки на документы,
	//сохраняем связь в свою таблицу в ХранилищеОбщихНастроек
	ОписаниеКонфигурации.Вставить("ХранениеСвязиДокументов_СвояТаблица",ХранениеСвязиДокументов_СвояТаблица);
	// ) 2019.05.21	
	
	//Валюта учета
	Если Метаданные.Константы.Найти("ВалютаРегламентированногоУчета") <> Неопределено Тогда
		ВалютаУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ИначеЕсли Метаданные.Константы.Найти("ВалютаУчета") <> Неопределено Тогда
		ВалютаУчета = Константы.ВалютаУчета.Получить();
	КонецЕсли;
	
	ОписаниеКонфигурации.Вставить("ВалютаУчета",ВалютаУчета);
	
	//Валюта договора, обычно ВалютаВзаиморасчетов, УНФ - ВалютаРасчетов
	Если РеквизитОбъект.РеквизитСуществует("Справочники","ДоговорыКонтрагентов","ВалютаВзаиморасчетов") Тогда
		Договор_ИмяРеквизитаВалюта = "ВалютаВзаиморасчетов";
	ИначеЕсли РеквизитОбъект.РеквизитСуществует("Справочники","ДоговорыКонтрагентов","ВалютаРасчетов") Тогда
		Договор_ИмяРеквизитаВалюта = "ВалютаРасчетов";
	КонецЕсли;
	
	ОписаниеКонфигурации.Вставить("Договор_ИмяРеквизитаВалюта",Договор_ИмяРеквизитаВалюта);
	
	//2020.10.07 ( начиная с релиза БП 3.0.83 данные СФ могут быть указаны в самом документе, в этом случае не требуется создание счета-фактуры
	// а реквизиты документа НомерВходящегоДокумента и ДатаВходящегоДокумента являются обязательными. Определять установку этого флага будем по реквизиту выбранного договора
	Договор_ИспользуютсяДанныеУПДВДокументе = Ложь;
	Если РеквизитОбъект.РеквизитСуществует("Справочники","ДоговорыКонтрагентов","СпособВыставленияДокументов") 
		И РеквизитОбъект.РеквизитСуществует("Перечисления","СпособыВыставленияДокументов","УниверсальныйДокумент") Тогда
		Договор_ИспользуютсяДанныеУПДВДокументе = Истина;
	КонецЕсли;
	
	ОписаниеКонфигурации.Вставить("Договор_ИспользуютсяДанныеУПДВДокументе",Договор_ИспользуютсяДанныеУПДВДокументе);
	// ) 2020.10.07
	
	
	//Имя справочника Единицы измерения
	//2021.03.31 (
	Если Конфигурация.Крат = "ITОтдел" Тогда
		Справочник_ЕдиницыИзмерения = "КлассификаторЕдиницИзмерения";
	// ) 2021.03.31
	
	ИначеЕсли Метаданные.Справочники.Найти("ЕдиницыИзмерения") <> Неопределено Тогда	
		Справочник_ЕдиницыИзмерения = "ЕдиницыИзмерения";
		ЕдиницыИзмерения_ВладелецНоменклатура = Метаданные.Справочники.ЕдиницыИзмерения.Владельцы.Содержит(Метаданные.Справочники.Номенклатура);
	ИначеЕсли Метаданные.Справочники.Найти("УпаковкиЕдиницыИзмерения") <> Неопределено Тогда	
		Справочник_ЕдиницыИзмерения = "УпаковкиЕдиницыИзмерения";
	КонецЕсли;	
	ОписаниеКонфигурации.Вставить("ЕдиницыИзмерения_ИмяСправочникаЕдиницыИзмерения",Справочник_ЕдиницыИзмерения);
	ОписаниеКонфигурации.Вставить("ЕдиницыИзмерения_ВладелецНоменклатура",ЕдиницыИзмерения_ВладелецНоменклатура = Истина);
		
	
	//Имя реквизита Родитель у справочника Номенклатура
	Если Метаданные.Справочники.Номенклатура.Иерархический Тогда
		Номенклатура_ИмяРеквизитаРодитель = "Родитель";
	КонецЕсли;
	ОписаниеКонфигурации.Вставить("Номенклатура_ИмяРеквизитаРодитель",Номенклатура_ИмяРеквизитаРодитель);
	
	//Длина наименования номенклатуры для поиска
	ОписаниеКонфигурации.Вставить("Номенклатура_ДлинаНаименованияНоменклатуры",Метаданные.Справочники.Номенклатура.ДлинаНаименования);
	
	//Имя реквизита Артикул
	Если Метаданные.Справочники.Номенклатура.Реквизиты.Найти("Артикул") <> Неопределено Тогда
		Номенклатура_ИмяРеквизитаАртикул = "Артикул";
	КонецЕсли;
	ОписаниеКонфигурации.Вставить("Номенклатура_ИмяРеквизитаАртикул",Номенклатура_ИмяРеквизитаАртикул);
	
	//Имя реквизита Категория
	Если Метаданные.Справочники.Номенклатура.Реквизиты.Найти("КатегорияНоменклатуры") <> Неопределено Тогда
		Номенклатура_ИмяРеквизитаКатегория = "КатегорияНоменклатуры";
	КонецЕсли;
	ОписаниеКонфигурации.Вставить("Номенклатура_ИмяРеквизитаКатегория",Номенклатура_ИмяРеквизитаКатегория);
	
	//Имя реквизита Направление деятельности
	Если Метаданные.Справочники.Номенклатура.Реквизиты.Найти("НаправлениеДеятельности") <> Неопределено Тогда
		Номенклатура_ИмяРеквизитаНаправлениеДеятельности = "НаправлениеДеятельности";
	КонецЕсли;
	ОписаниеКонфигурации.Вставить("Номенклатура_ИмяРеквизитаНаправлениеДеятельности",Номенклатура_ИмяРеквизитаНаправлениеДеятельности);
		
	//Имя реквизита Статья затрат
	Если Метаданные.Справочники.Номенклатура.Реквизиты.Найти("СтатьяЗатрат") <> Неопределено Тогда
		Номенклатура_ИмяРеквизитаСтатьяЗатрат = "СтатьяЗатрат";
	КонецЕсли;
	ОписаниеКонфигурации.Вставить("Номенклатура_ИмяРеквизитаСтатьяЗатрат",Номенклатура_ИмяРеквизитаСтатьяЗатрат);
	
	//Имя реквизита Недействителен (УНФ) 
	Если Метаданные.Справочники.Номенклатура.Реквизиты.Найти("Недействителен") <> Неопределено Тогда
		Номенклатура_ИмяРеквизитаНедействителен = "Недействителен";
	КонецЕсли;
	ОписаниеКонфигурации.Вставить("Номенклатура_ИмяРеквизитаНедействителен",Номенклатура_ИмяРеквизитаНедействителен);
	
	
	//Номенклатура поставщиков
	Если Метаданные.Справочники.Найти("НоменклатураПоставщиков") <> Неопределено Тогда
		НоменклатураПоставщиков_ИмяСправочника = "НоменклатураПоставщиков";
		
	ИначеЕсли Метаданные.Справочники.Найти("НоменклатураКонтрагентов") <> Неопределено Тогда
		НоменклатураПоставщиков_ИмяСправочника = "НоменклатураКонтрагентов";
		
	ИначеЕсли Метаданные.Справочники.Найти("Тренд_НоменклатураКонтрагентов") <> Неопределено Тогда
		НоменклатураПоставщиков_ИмяСправочника = "Тренд_НоменклатураКонтрагентов";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НоменклатураПоставщиков_ИмяСправочника) Тогда
	
		НоменклатураПоставщиков_ДлинаНаименования = Метаданные.Справочники[НоменклатураПоставщиков_ИмяСправочника].ДлинаНаименования;
		Если РеквизитОбъект.РеквизитСуществует("Справочники",НоменклатураПоставщиков_ИмяСправочника,"Артикул") Тогда
			НоменклатураПоставщиков_ИмяРеквизитаАртикул = "Артикул";
		КонецЕсли;
		
		//В УТ-подобных Партнеры, в БП - Контрагенты
		Если Метаданные.Справочники[НоменклатураПоставщиков_ИмяСправочника].Владельцы.Количество() > 0 Тогда
			Если Метаданные.Справочники[НоменклатураПоставщиков_ИмяСправочника].Владельцы.Содержит(Метаданные.Справочники.Контрагенты) Тогда
				НоменклатураПоставщиков_Владелец = "Контрагент";
				
			ИначеЕсли Метаданные.Справочники.Найти("Партнеры") <> Неопределено
				И Метаданные.Справочники[НоменклатураПоставщиков_ИмяСправочника].Владельцы.Содержит(Метаданные.Справочники.Партнеры) Тогда
				НоменклатураПоставщиков_Владелец = "Партнер";
				
			КонецЕсли;		
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеКонфигурации.Вставить("НоменклатураПоставщиков_ИмяСправочника",НоменклатураПоставщиков_ИмяСправочника);
	ОписаниеКонфигурации.Вставить("НоменклатураПоставщиков_ДлинаНаименованияНоменклатуры",НоменклатураПоставщиков_ДлинаНаименования);
	ОписаниеКонфигурации.Вставить("НоменклатураПоставщиков_ИмяРеквизитаАртикул",НоменклатураПоставщиков_ИмяРеквизитаАртикул);	
	ОписаниеКонфигурации.Вставить("НоменклатураПоставщиков_Владелец",НоменклатураПоставщиков_Владелец);
	
	
	//Имя справочника Банки
	Справочник_Банки = Неопределено;
	Если Метаданные.Справочники.Найти("Банки") <> Неопределено Тогда
		Справочник_Банки = "Банки";
	КонецЕсли;
	ОписаниеКонфигурации.Вставить("Банк_ИмяСправочникаБанки",Справочник_Банки);
	
	//Имя справочника Классификатор банков
	Справочник_КлассификаторБанков = Неопределено;
	Если Метаданные.Справочники.Найти("КлассификаторБанков") <> Неопределено Тогда
		Справочник_КлассификаторБанков = "КлассификаторБанков";
	ИначеЕсли Метаданные.Справочники.Найти("КлассификаторБанковРФ") <> Неопределено Тогда
		Справочник_КлассификаторБанков = "КлассификаторБанковРФ";
	КонецЕсли;
	ОписаниеКонфигурации.Вставить("Банк_ИмяСправочникаКлассификаторБанков",Справочник_КлассификаторБанков);
	
	//Имя справочника Банковские счета контрагентов
	Справочник_БанковскиеСчетаКонтрагентов = Неопределено;
	Если Метаданные.Справочники.Найти("БанковскиеСчета") <> Неопределено
		И Метаданные.Справочники.БанковскиеСчета.Владельцы.Содержит(Метаданные.Справочники.Контрагенты) Тогда
		Справочник_БанковскиеСчетаКонтрагентов = "БанковскиеСчета";
		
	ИначеЕсли Метаданные.Справочники.Найти("БанковскиеСчетаКонтрагентов") <> Неопределено
		И Метаданные.Справочники.БанковскиеСчетаКонтрагентов.Владельцы.Содержит(Метаданные.Справочники.Контрагенты) Тогда
		Справочник_БанковскиеСчетаКонтрагентов = "БанковскиеСчетаКонтрагентов";
		
	ИначеЕсли Метаданные.Справочники.Найти("БанковскиеИКазначейскиеСчета") <> Неопределено
		И Метаданные.Справочники.БанковскиеИКазначейскиеСчета.Владельцы.Содержит(Метаданные.Справочники.Контрагенты) Тогда
		Справочник_БанковскиеСчетаКонтрагентов = "БанковскиеИКазначейскиеСчета";
		
	КонецЕсли;
	
	ОписаниеКонфигурации.Вставить("Банк_ИмяСправочникаБанковскиеСчетаКонтрагентов",Справочник_БанковскиеСчетаКонтрагентов);	
	
	
	//E1C-380: Имя реквизита Банк справочника Банковские счета
	БанковскийСчет_ИмяРеквизитаБанк = Неопределено;
	Банк_ИмяРеквизитаБИК = Неопределено;
	
	Если ЗначениеЗаполнено(Справочник_БанковскиеСчетаКонтрагентов) Тогда
		Если Метаданные.Справочники[Справочник_БанковскиеСчетаКонтрагентов].Реквизиты.Найти("Банк") <> Неопределено Тогда
			БанковскийСчет_ИмяРеквизитаБанк = "Банк";
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Справочник_Банки) Тогда
		Если Метаданные.Справочники[Справочник_Банки].Реквизиты.Найти("БИК") <> Неопределено Тогда
			Банк_ИмяРеквизитаБИК = "БИК";
		Иначе
			Банк_ИмяРеквизитаБИК = "Код";
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеКонфигурации.Вставить("БанковскийСчет_ИмяРеквизитаБанк",БанковскийСчет_ИмяРеквизитаБанк);
	ОписаниеКонфигурации.Вставить("Банк_ИмяРеквизитаБИК",Банк_ИмяРеквизитаБИК);
	
	
	СоответствиеТипов = Новый Соответствие;
	
	//Организация
	Если Метаданные.Справочники.Найти("Организации") <> Неопределено Тогда
		Справочник_Организации = "Организации";
		СоответствиеТипов.Вставить("Организации","СправочникСсылка.Организации");
	ИначеЕсли Метаданные.Справочники.Найти("Фирмы") <> Неопределено Тогда
		Справочник_Организации = "Фирмы";
		СоответствиеТипов.Вставить("Организации","СправочникСсылка.Фирмы");
	ИначеЕсли Метаданные.Справочники.Найти("Салоны") <> Неопределено Тогда
		Справочник_Организации = "Салоны";
		СоответствиеТипов.Вставить("Организации","СправочникСсылка.Салоны");
	КонецЕсли;
	
	ОписаниеКонфигурации.Вставить("Организации_ИмяСправочника",Справочник_Организации);
	
	
	//Имя реквизита ИНН, если он присутствует - определение направления документа будет выполняться по нему
	Если ЗначениеЗаполнено(Справочник_Организации) Тогда
		Если РеквизитОбъект.РеквизитСуществует("Справочники",Справочник_Организации,"ИНН") Тогда
			Организации_ИмяРеквизитаИНН = "ИНН";
		ИначеЕсли РеквизитОбъект.РеквизитСуществует("Справочники",Справочник_Организации,"ИдентификационныйНомер") Тогда
			Организации_ИмяРеквизитаИНН = "ИдентификационныйНомер";
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеКонфигурации.Вставить("Организации_ИмяРеквизитаИНН",Организации_ИмяРеквизитаИНН);
	
	
	//Контрагент
	Если Метаданные.Справочники.Найти("Контрагенты") <> Неопределено Тогда
		СоответствиеТипов.Вставить("Контрагенты","СправочникСсылка.Контрагенты");
	КонецЕсли;
	
	//Договор
	Если Метаданные.Справочники.Найти("ДоговорыКонтрагентов") <> Неопределено Тогда
		СоответствиеТипов.Вставить("Договоры","СправочникСсылка.ДоговорыКонтрагентов");
		ОписаниеКонфигурации.Вставить("Договоры_ИмяСправочникаДоговорыКонтрагентов","ДоговорыКонтрагентов");
		Договоры_ВладелецКонтрагенты = Метаданные.Справочники.ДоговорыКонтрагентов.Владельцы.Содержит(Метаданные.Справочники.Контрагенты);
	ИначеЕсли Метаданные.Справочники.Найти("Договоры") <> Неопределено Тогда
		СоответствиеТипов.Вставить("Договоры","СправочникСсылка.Договоры");
		ОписаниеКонфигурации.Вставить("Договоры_ИмяСправочникаДоговорыКонтрагентов","Договоры");
		Договоры_ВладелецКонтрагенты = Метаданные.Справочники.Договоры.Владельцы.Содержит(Метаданные.Справочники.Контрагенты);
	КонецЕсли;
	ОписаниеКонфигурации.Вставить("Договоры_ВладелецКонтрагенты",Договоры_ВладелецКонтрагенты = Истина);	
		
	//ЕдиницаИзмерения
	Если Метаданные.Справочники.Найти("КлассификаторЕдиницИзмерения") <> Неопределено Тогда
		СоответствиеТипов.Вставить("ЕдиницаИзмерения","СправочникСсылка.КлассификаторЕдиницИзмерения");
	КонецЕсли;
		
	//Номенклатура
	Если Метаданные.Справочники.Найти("Номенклатура") <> Неопределено Тогда
		СоответствиеТипов.Вставить("Номенклатура","СправочникСсылка.Номенклатура");
	КонецЕсли;
	
	//НомерГТД
	Если Метаданные.Справочники.Найти("НомераГТД") <> Неопределено Тогда
		СоответствиеТипов.Вставить("НомераГТД","СправочникСсылка.НомераГТД");
	КонецЕсли;
		
	//СтранаПроисхождения
	Если Метаданные.Справочники.Найти("СтраныМира") <> Неопределено Тогда
		СправочникСтраныМира = "СтраныМира";
		СоответствиеТипов.Вставить("СтраныМира","СправочникСсылка.СтраныМира");
	ИначеЕсли Метаданные.Справочники.Найти("КлассификаторСтранМира") <> Неопределено Тогда
		СправочникСтраныМира = "КлассификаторСтранМира";
		СоответствиеТипов.Вставить("СтраныМира","СправочникСсылка.КлассификаторСтранМира");
	КонецЕсли;
	
	ОписаниеКонфигурации.Вставить("СправочникСтраныМира",СправочникСтраныМира);
	
	//E1C-477: ИсточникиПроисхождения
	Если Метаданные.Справочники.Найти("ИсточникиПроисхождения") <> Неопределено Тогда
		СправочникИсточникиПроисхождения = "ИсточникиПроисхождения";
		//Используется все равно справочник НомераГТД
		СоответствиеТипов.Вставить("ИсточникиПроисхождения","СправочникСсылка.НомераГТД");
	КонецЕсли;
	
	ОписаниеКонфигурации.Вставить("СправочникИсточникиПроисхождения",СправочникИсточникиПроисхождения);
		
	Если ЗначениеЗаполнено(Справочник_БанковскиеСчетаКонтрагентов) Тогда
		СоответствиеТипов.Вставить("БанковскиеСчета","СправочникСсылка." + Справочник_БанковскиеСчетаКонтрагентов);
	КонецЕсли;
	
	ОписаниеКонфигурации.Вставить("СоответствиеТипов",СоответствиеТипов);
	
	Возврат ОписаниеКонфигурации;
	
КонецФункции
&НаСервере
Функция ЗаполнитьСтруктуруСтавокНДС(Конфигурация)
	
	//Инициализируем базовые Российские ставки НДС
	//E1C-509: появились счета-фактуры на аванс
	//E1C-541: Обеспечить работу с новой ставкой НДС 22% и 22/122 (для СФ на аванс) PERCENT_22 PERCENT_22_122
	СтавкиНДС = Новый Структура("НДС0,НДС18,НДС10,НДС20,НДС22,НДС5,НДС7,БезНДС,НДС18_118,НДС20_120,НДС22_122,НДС10_110,НДС7_107,НДС5_105");
		
	//Добавляем ставку Казахстана
	СтавкиНДС.Вставить("НДС12");
	СтавкиНДС.Вставить("НДС16");
		
	//Сперва проверяем наличие справочника СтавкиНДС: УНФ, ERP 2.5+, КА 2.6+
	Если Метаданные.Справочники.Найти("СтавкиНДС") <> Неопределено Тогда
		Если Конфигурация.Крат = "ERP"
			Или Конфигурация.Крат = "КА2"
			Или Конфигурация.Крат = "УТ11" Тогда
			
			//Для УТ11 Казахстана извлекаем значения из справочника СтавкиНДС
			Если Конфигурация.Лок = "KAZ" Тогда
				ИмяРеквизита = "Ставка";
				СтавкиНДС.Вставить("НДС0",ПолучитьСтавкуНДСИзСправочника(0,ИмяРеквизита));
				СтавкиНДС.Вставить("НДС18",ПолучитьСтавкуНДСИзСправочника(18,ИмяРеквизита));
				СтавкиНДС.Вставить("НДС10",ПолучитьСтавкуНДСИзСправочника(10,ИмяРеквизита));
				СтавкиНДС.Вставить("НДС20",ПолучитьСтавкуНДСИзСправочника(20,ИмяРеквизита));
				СтавкиНДС.Вставить("НДС22",ПолучитьСтавкуНДСИзСправочника(22,ИмяРеквизита));
				СтавкиНДС.Вставить("НДС12",ПолучитьСтавкуНДСИзСправочника(12,ИмяРеквизита));
				СтавкиНДС.Вставить("НДС16",ПолучитьСтавкуНДСИзСправочника(16,ИмяРеквизита));
				СтавкиНДС.Вставить("БезНДС",Справочники.СтавкиНДС.БезНДС);
				
			Иначе
			
				//Вопрос, долго ли проживет реквизит ПеречислениеСтавкаНДС справочника СтавкиНДС,
				//будем наблюдать за его "развитием". Пока в качестве решения используем получение значения справочника
				//по ссылке на ставку из перечисления СтавкиНДС
				Если Метаданные.Перечисления.Найти("СтавкиНДС") <> Неопределено Тогда
					Если Метаданные.Справочники.СтавкиНДС.Реквизиты.Найти("ПеречислениеСтавкаНДС") <> Неопределено Тогда
						Для Каждого Ставка Из Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления Цикл
							СправочникСтавка = Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС",Перечисления.СтавкиНДС[Ставка.Имя]);
							СтавкиНДС.Вставить(Ставка.Имя, СправочникСтавка);
						КонецЦикла;
					Иначе
						//2021.10.19 ( Отраслевое решение УСО 2.4.13.278 на базе ERP по странному стечению обстоятельств имеет справочник СтавкиНДС,
						//но не имеет в нем ни одного реквизита, а в документах используется перечисление СтавкаНДС. Видимо, не успевают перепилить на справочник
						Для Каждого Ставка Из Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления Цикл
							СтавкиНДС.Вставить(Ставка.Имя, Перечисления.СтавкиНДС[Ставка.Имя]);
						КонецЦикла;
						// ) 2021.10.19
					КонецЕсли;
				КонецЕсли;
				
				//Костыль: некоторые не обновляют конфигурацию (перечисление не добавляется), но добавляют руками ставку 22% в справочник
				Если Не ЗначениеЗаполнено(СтавкиНДС.НДС22) Тогда
					ИмяРеквизита = "Ставка";
					СтавкиНДС.Вставить("НДС22",ПолучитьСтавкуНДСИзСправочника(22,ИмяРеквизита));
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтавкиНДС.НДС7) Тогда
					ИмяРеквизита = "Ставка";
					СтавкиНДС.Вставить("НДС7",ПолучитьСтавкуНДСИзСправочника(7,ИмяРеквизита));
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтавкиНДС.НДС5) Тогда
					ИмяРеквизита = "Ставка";
					СтавкиНДС.Вставить("НДС5",ПолучитьСтавкуНДСИзСправочника(5,ИмяРеквизита));
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли Конфигурация.Крат = "ШтрихМ" Тогда
			ИмяРеквизита = "ПроцентНДС";
			СтавкиНДС.Вставить("НДС0",ПолучитьСтавкуНДСИзСправочника(0,ИмяРеквизита));
			СтавкиНДС.Вставить("НДС18",ПолучитьСтавкуНДСИзСправочника(18,ИмяРеквизита));
			СтавкиНДС.Вставить("НДС10",ПолучитьСтавкуНДСИзСправочника(10,ИмяРеквизита));
			СтавкиНДС.Вставить("НДС20",ПолучитьСтавкуНДСИзСправочника(20,ИмяРеквизита));
			СтавкиНДС.Вставить("НДС22",ПолучитьСтавкуНДСИзСправочника(22,ИмяРеквизита));
			СтавкиНДС.Вставить("НДС5",ПолучитьСтавкуНДСИзСправочника(5,ИмяРеквизита));
			СтавкиНДС.Вставить("НДС7",ПолучитьСтавкуНДСИзСправочника(7,ИмяРеквизита));
			СтавкиНДС.Вставить("БезНДС",Справочники.СтавкиНДС.БезНДС);
			
			СтавкиНДС.Вставить("НДС18_118",ПолучитьСтавкуНДСИзСправочника(18,ИмяРеквизита));
			СтавкиНДС.Вставить("НДС10_110",ПолучитьСтавкуНДСИзСправочника(10,ИмяРеквизита));
			СтавкиНДС.Вставить("НДС20_120",ПолучитьСтавкуНДСИзСправочника(20,ИмяРеквизита));
			СтавкиНДС.Вставить("НДС20_122",ПолучитьСтавкуНДСИзСправочника(22,ИмяРеквизита));
			СтавкиНДС.Вставить("НДС5_105",ПолучитьСтавкуНДСИзСправочника(5,ИмяРеквизита));
			СтавкиНДС.Вставить("НДС7_107",ПолучитьСтавкуНДСИзСправочника(7,ИмяРеквизита));
			
		Иначе
			//2022.10.30 ( Откуда-то нарисовалась Бухгалтерия для Кыргызстана, там в справочнике СтавкиНДС нет реквизитов вообще
			Если Метаданные.Справочники.СтавкиНДС.Реквизиты.Найти("Ставка") <> Неопределено Тогда
			// ) 2022.10.30
			
				ИмяРеквизита = "Ставка";
				СтавкиНДС.Вставить("НДС0",ПолучитьСтавкуНДСИзСправочника(0,ИмяРеквизита));
				СтавкиНДС.Вставить("НДС18",ПолучитьСтавкуНДСИзСправочника(18,ИмяРеквизита));
				СтавкиНДС.Вставить("НДС10",ПолучитьСтавкуНДСИзСправочника(10,ИмяРеквизита));
				СтавкиНДС.Вставить("НДС20",ПолучитьСтавкуНДСИзСправочника(20,ИмяРеквизита));
				СтавкиНДС.Вставить("НДС22",ПолучитьСтавкуНДСИзСправочника(22,ИмяРеквизита));
				СтавкиНДС.Вставить("НДС5",ПолучитьСтавкуНДСИзСправочника(5,ИмяРеквизита));
				СтавкиНДС.Вставить("НДС7",ПолучитьСтавкуНДСИзСправочника(7,ИмяРеквизита));
				
				//Бухгалтерия для Казахстана
				СтавкиНДС.Вставить("НДС12",ПолучитьСтавкуНДСИзСправочника(12,ИмяРеквизита));
				СтавкиНДС.Вставить("НДС16",ПолучитьСтавкуНДСИзСправочника(16,ИмяРеквизита));
				
				Если Метаданные.Справочники.СтавкиНДС.Реквизиты.Найти("НеОблагается") <> Неопределено Тогда
					СтавкиНДС.Вставить("БезНДС",Справочники.СтавкиНДС.НайтиПоРеквизиту("НеОблагается",Истина));
				КонецЕсли;
				
				//2021.03.31 ( Разные конфигурации, в частности, IT Отдел
				Если Не ЗначениеЗаполнено(СтавкиНДС.БезНДС) Тогда
					//E1C-482: ставка "без ндс" с отбором "МестоРеализацииНеРК = Ложь" вместо исходного простого поиска по наименованию
					Если Истина Тогда
						СтавкиНДС.БезНДС = ПолучитьСтавкуНДСИзСправочника(0,ИмяРеквизита,"Без НДС");
					Иначе
						//Исходный вариант
						СтавкиНДС.БезНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
					КонецЕсли;
				КонецЕсли;
				// ) 2021.03.31
			КонецЕсли;
			
		КонецЕсли;
	
	ИначеЕсли Метаданные.Перечисления.Найти("СтавкиНДС") <> Неопределено Тогда
		Для Каждого Ставка Из Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления Цикл
			СтавкиНДС.Вставить(Ставка.Имя, Перечисления.СтавкиНДС[Ставка.Имя]);
		КонецЦикла;
		
		//Костыль для конфигурации Бухгалтерия для Молдовы: там ставка НДС18 просто переименована в НДС 20%,
		//а присутствующая в конфигурации НДС20 переименована в "не используется". Присвоим ставке НДС20 соответствующую ей
		//таким образом ставку НДС18 %)
		Если Метаданные.Имя = "БухгалтерияДляМолдовы" Тогда
			СтавкиНДС.Вставить("НДС20",Перечисления.СтавкиНДС.НДС18);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтавкиНДС;
	
КонецФункции
&НаСервере
Функция ПолучитьСтавкуНДСИзСправочника(РазмерСтавки,ИмяРеквизита = "Ставка",Наименование = "")
		
	//2025.04.02 ( отключил предварительный поиск первого значения с нулевой ставкой, так как может попадать значение БезНДС с МестоРеализацииНеРК = Истина
	//Ставка = Справочники.СтавкиНДС.НайтиПоРеквизиту(ИмяРеквизита,0);
	
	ТекстЗапроса = "Выбрать СтавкиНДС.Ссылка Из Справочник.СтавкиНДС КАК СтавкиНДС Где СтавкиНДС.Ставка = &Ставка И НЕ СтавкиНДС.Расчетная И НЕ СтавкиНДС.ПометкаУдаления";
	
	//2021.06.15 ( ШтрихМ
	Если Метаданные.Справочники.СтавкиНДС.Реквизиты.Найти("Расчетная") <> Неопределено Тогда
		ИмяРеквизитаРасчетнаяСтавка = "Расчетная";
	// ) 2021.06.15 ШтрихМ
	
	ИначеЕсли Метаданные.Справочники.СтавкиНДС.Реквизиты.Найти("РасчетнаяСтавка") <> Неопределено Тогда
		ИмяРеквизитаРасчетнаяСтавка = "РасчетнаяСтавка";
	Иначе
		 ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И НЕ СтавкиНДС.Расчетная","");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И НЕ СтавкиНДС.Расчетная","И НЕ СтавкиНДС." + ИмяРеквизитаРасчетнаяСтавка);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"СтавкиНДС.Ставка","СтавкиНДС." + ИмяРеквизита);
		
	//E1C-482: ставка "без ндс" с признаком "МестоРеализацииНеРК = Ложь"
	Если Метаданные.Справочники.СтавкиНДС.Реквизиты.Найти("МестоРеализацииНеРК") <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + " И СтавкиНДС.МестоРеализацииНеРК <> Истина";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		ТекстЗапроса = ТекстЗапроса + " И СтавкиНДС.Наименование = &Наименование";
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ставка",РазмерСтавки);
	Запрос.УстановитьПараметр("Наименование",Наименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ставка = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Ставка;
КонецФункции


// ================= Экспорт-импорт настроек ===================

&НаКлиенте
Процедура НастройкиЭкспортИмпорт(Команда)
	
	ДопПараметры = Новый Структура;
	
	//В старых конфигурациях может не оказаться этих картинок
	Попытка КартинкаЭкспорт = БиблиотекаКартинок.СохранитьЗначения; Исключение; КартинкаЭкспорт = Новый Картинка; КонецПопытки;
	Попытка КартинкаИмпорт = БиблиотекаКартинок.ВосстановитьЗначения; Исключение; КартинкаИмпорт = Новый Картинка; КонецПопытки;
	Попытка КартинкаСбросить = БиблиотекаКартинок.Задача; Исключение; КартинкаИмпорт = Новый Картинка; КонецПопытки;
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("НастройкиЭкспорт","Выгрузить текущие настройки...",,КартинкаЭкспорт);
	СписокВыбора.Добавить("НастройкиИмпорт","Загрузить сохраненные настройки...",,КартинкаИмпорт);
	СписокВыбора.Добавить("НастройкиСброс","Сбросить текущие настройки...",,КартинкаСбросить);
	
	//2022.03.06 (Добавим возможность загрузки настроек из выгруженного протокола работы, полученного от клиента
	СписокВыбора.Добавить("НастройкиИмпортИзПротокола","Загрузить настройки из протокола работы...",,КартинкаИмпорт);
	// ) 2022.03.06
	
	ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,СписокВыбора","ОбработатьВыборИзМеню_ЭкспортИмпорт",ДопПараметры,СписокВыбора);
	
	_ЗФ_ОбработатьАсинхронныйВызов("ВыборИзМеню",ПараметрыВызова);
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьВыборИзМеню_ЭкспортИмпорт(Результат,ДопПараметры)
	
	Если Результат <> Неопределено Тогда
		
		Если Результат.Значение = "НастройкиЭкспорт" Тогда
			НастройкиЭкспорт();
			
		ИначеЕсли Результат.Значение = "НастройкиИмпорт"
			Или Результат.Значение = "НастройкиИмпортИзПротокола" Тогда
			НастройкиИмпорт(Результат.Значение);
			
		ИначеЕсли Результат.Значение = "НастройкиСброс" Тогда
			НастройкиСброс();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЭкспорт()
	
	АдресВХ = НастройкиЭкспортНаСервере();
		
	Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("АдресВХ",АдресВХ);
		ДопПараметры.Вставить("ИмяФайла","Настройки.xml");
		ДопПараметры.Вставить("РежимВыбораФайла","Сохранение");
		
		Если ВладелецФормы.ЭтоВебКлиент Тогда
			ПолучитьФайл(АдресВХ,ДопПараметры.ИмяФайла,Истина);
			
		Иначе		
			Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
			Диалог.ПолноеИмяФайла = ДопПараметры.ИмяФайла;
			Диалог.Фильтр = "(*.xml)|*.xml";
			Диалог.МножественныйВыбор = Ложь;
			
			ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ДиалогВыбораФайла","ОбработатьВыборФайлов",ДопПараметры,Диалог);
			_ЗФ_ОбработатьАсинхронныйВызов("ДиалогВыбораФайла",ПараметрыВызова);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Функция НастройкиЭкспортНаСервере()
	
	СохраняемаяСтруктураНастроек = ПолучитьСтруктуруНастроекНаСервере();
	
	ФайлНастроек = ПолучитьИмяВременногоФайла("xml");
	
	ОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(СохраняемаяСтруктураНастроек);
    ЗаписьXML = Новый ЗаписьXML;
    ЗаписьXML.ОткрытьФайл(ФайлНастроек);
    ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO); 
	
	ЗаписьXML.Закрыть();
	
	АдресВХ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлНастроек));
	
	//Прибираемся
	Попытка УдалитьФайлы(ФайлНастроек); Исключение; КонецПопытки;
	
	Возврат АдресВХ;
	
КонецФункции

&НаКлиенте
Процедура НастройкиИмпорт(Источник)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("РежимВыбораФайла","Открытие");
	ДопПараметры.Вставить("Источник",Источник);
	
	Если ВладелецФормы.ЭтоВебКлиент Тогда
		ПараметрыВызоваНачало = Новый Структура("Обработчик,ДопПараметры","ОбработатьНачалоВыбораФайлов_ВебКлиент",ДопПараметры);
		ПараметрыВызоваЗавершение = Новый Структура("Обработчик,ДопПараметры","ОбработатьВыборФайлов_ВебКлиент",ДопПараметры);
		ПараметрыВызова = Новый Структура("ПараметрыВызоваНачало,ПараметрыВызоваЗавершение",ПараметрыВызоваНачало,ПараметрыВызоваЗавершение);
		_ЗФ_ОбработатьАсинхронныйВызов("ПоместитьФайлы",ПараметрыВызова);
		
	Иначе		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.МножественныйВыбор = Ложь;
		
		ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ДиалогВыбораФайла","ОбработатьВыборФайлов",ДопПараметры,Диалог);
		_ЗФ_ОбработатьАсинхронныйВызов("ДиалогВыбораФайла",ПараметрыВызова);
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Функция НастройкиИмпортНаСервере(АдресВХ,Источник)
	
	Результат = Новый Структура("Успешно,ТекстОшибки",Ложь,"");
	
	ФайлНастроек = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ);
	ДвоичныеДанные.Записать(ФайлНастроек);
	
	//2022.03.06 ( Настройки могут быть получены из протокола работы
	Если Источник = "НастройкиИмпортИзПротокола" Тогда
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(ФайлНастроек);
		
		СтрокаПротокола = ТекстовыйДокумент.ПолучитьТекст();
		Попытка
			ВыгрузкаПротокола = ЗначениеИзСтрокиВнутр(СтрокаПротокола);
			СтруктураНовыхНастроек = ВыгрузкаПротокола.СтруктураНастроек;
		Исключение
			Результат.ТекстОшибки = "При чтении настроек произошла ошибка, файл протокола имеет некорректный формат (возможно, выгружен в другой конфигурации) или не является протоколом работы.";
		КонецПопытки;
	Иначе
	// ) 2022.03.06
	
		ЧтениеXMLДанных = Новый ЧтениеXML; 
	    ЧтениеXMLДанных.ОткрытьФайл(ФайлНастроек); 
		Попытка
			СтруктураНовыхНастроек = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных);
		Исключение
			Результат.ТекстОшибки = "При чтении настроек произошла ошибка, файл настроек имеет некорректный формат (возможно, выгружен в другой конфигурации).";
		КонецПопытки;
			    	
		//Прибираемся
		Попытка УдалитьФайлы(ФайлНастроек); Исключение; КонецПопытки;
		
	КонецЕсли;
	
	Если ТипЗнч(СтруктураНовыхНастроек) = Тип("Структура") Тогда
		
		Попытка
			РеквизитОбъект = РеквизитФормыВЗначение("Объект");
			
			Дерево = РеквизитФормыВЗначение("ДеревоНастроек");
			Дерево.Строки.Очистить();
			
			РеквизитОбъект.ЗаполнитьДеревоНастроек(Дерево,Пространство,СтруктураНовыхНастроек);
			ЗначениеВРеквизитФормы(Дерево,"ДеревоНастроек");
			
			Результат.Успешно = Истина;
		Исключение
			Результат.ТекстОшибки = "При заполнении настроек из файла произошла ошибка: " + ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НастройкиСброс()
	
	ДопПараметры = Новый Структура;
	
	ТекстВопроса = "Текущие настройки будут замещены настройками по умолчанию, продолжить?";
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ПараметрыВызова = Новый Структура("Обработчик,ДопПараметры,ТекстВопроса,Кнопки","Продолжить_НастройкиСброс",ДопПараметры,ТекстВопроса,Кнопки);
	
	_ЗФ_ОбработатьАсинхронныйВызов("Вопрос",ПараметрыВызова);
	
КонецПроцедуры
&НаКлиенте
Процедура Продолжить_НастройкиСброс(Результат,ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		НастройкиСбросНаСервере();
		
		Для Каждого Строка ИЗ ДеревоНастроек.ПолучитьЭлементы() Цикл
	    	Элементы.ДеревоНастроек.Развернуть(Строка.ПолучитьИдентификатор(), Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция НастройкиСбросНаСервере()
	
	//передадим в качестве существующих настроек пустую структуру, чтобы заполнить значения по умолчанию
	ПустыеНастройки = Новый Структура;
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	Дерево = РеквизитФормыВЗначение("ДеревоНастроек");	
	Дерево.Строки.Очистить();
	РеквизитОбъект.ЗаполнитьДеревоНастроек(Дерево,Пространство,ПустыеНастройки,recognitionSettings);
	ЗначениеВРеквизитФормы(Дерево,"ДеревоНастроек");
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборФайлов(Результат,ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда	
		
		Если ДопПараметры.РежимВыбораФайла = "Сохранение" Тогда
			
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДопПараметры.АдресВХ);
			ДвоичныеДанные.Записать(Результат[0]);			
			
		ИначеЕсли ДопПараметры.РежимВыбораФайла = "Открытие" Тогда
			
			ИмяФайла = Результат[0];
			АдресВХ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла));
			Результат = НастройкиИмпортНаСервере(АдресВХ,ДопПараметры.Источник);
			
			Если Результат.Успешно Тогда
				ПоказатьОповещениеПользователя("Настройки заполнены.");
				
				Для Каждого Строка ИЗ ДеревоНастроек.ПолучитьЭлементы() Цикл
			    	Элементы.ДеревоНастроек.Развернуть(Строка.ПолучитьИдентификатор(), Истина);
				КонецЦикла;
				
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
				Сообщение.Текст = Результат.ТекстОшибки;
				Сообщение.Сообщить();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьНачалоВыбораФайлов_ВебКлиент(ПомещенныеФайлы,Отказ,ДопПараметры) Экспорт
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьВыборФайлов_ВебКлиент(ПомещенныеФайлы,ДопПараметры) Экспорт
	
	Если ПомещенныеФайлы <> Неопределено Тогда
		
		Если ДопПараметры.РежимВыбораФайла = "Открытие" Тогда
		
			АдресВХ = ПомещенныеФайлы[0].Хранение;
			
			Результат = НастройкиИмпортНаСервере(АдресВХ,ДопПараметры.Источник);
				
			Если Результат.Успешно Тогда
				ПоказатьОповещениеПользователя("Настройки заполнены.");
				
				Для Каждого Строка ИЗ ДеревоНастроек.ПолучитьЭлементы() Цикл
			    	Элементы.ДеревоНастроек.Развернуть(Строка.ПолучитьИдентификатор(), Истина);
				КонецЦикла;
				
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
				Сообщение.Текст = Результат.ТекстОшибки;
				Сообщение.Сообщить();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура РедактироватьСопоставления(Команда)
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДоступноОписаниеОповещения",ДоступноОписаниеОповещения);
	
	ФормаРедактирования = ПолучитьФорму(ПрефиксИмениФорм + "УФ_РедактированиеСопоставлений", ПараметрыОткрытия, ЭтаФорма);
	ФормаРедактирования.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ФормаРедактирования.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаРедактирования.Открыть();
КонецПроцедуры


// ================= Обмен настройками с порталом ===================

&НаКлиенте
Процедура ОбменНастройками_ОбновитьНастройкиРаспознавания(ИдентификаторПространства,НовыеНастройки) Экспорт
	
	Если ЗначениеЗаполнено(ИдентификаторПространства) Тогда
		Если ИдентификаторПространства = "ПустоеПространство" Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	ТекущиеНастройкиПортала = recognitionSettings.Получить(ИдентификаторПространства);
		
	Если ТипЗнч(ТекущиеНастройкиПортала) = Тип("Структура") Тогда
		ТекущиеНастройкиПортала.Вставить("kppParse","true"); //+++ Пока так, не вижу смысла на стороне 1с отключать парсинг КПП контрагента
		ТекущиеНастройкиПортала.Вставить("customsDeclarationParse",?(НовыеНастройки.ЗаполнениеТЧ_ЗаполнятьДанныеГТД,"true","false"));
		ТекущиеНастройкиПортала.Вставить("hasTransferBase",?(НовыеНастройки.ЗаполнениеШапки_ИспользоватьДанныеОснованияДляДоговора,"true","false"));
		
		ОбменНастройками_ОтправитьНастройкиНаПортал(ИдентификаторПространства,ТекущиеНастройкиПортала);
	КонецЕсли;
		
КонецПроцедуры
&НаКлиенте
Функция ОбменНастройками_ОтправитьНастройкиНаПортал(ИдентификаторПространства,recognitionSettings)
	
	//Настройки портала содержат информацию о полях, которые нужно парсить
	//
	// PUT /api/v1/spaces/:id/recognitionSettings 
	//"kppParse" : false,
	//"exciseParse": false,
	//"customsDeclarationParse": false
	
	//E1C-484: При пользовательском изменении значения настройки "Заполнять в документе данные основания передачи" в модуле:
	//Если устанавливаем значение "Да", то на портал по данному пространству передается флаг hasTransferBase =TRUE для типов УПД, ТОРГ-12, Акт, счет.
	//Также теперь используем PATCH, передавая захардкоженную коллекцию перечисленных в задаче типов документов,
	//для который будет устанавливаться признак распознавания данных договора документа
	// PATCH /api/v1/spaces/:id/recognitionSettings
	РаспознаваниеДанныхОснования = """tableParseByType"": {
       |""UTD"": {
       |""hasTransferBase"": " + recognitionSettings.hasTransferBase + "},
	   |""TORG12"": {
       |""hasTransferBase"": " + recognitionSettings.hasTransferBase + "},
	   |""OFFER"": {
	   |""hasTransferBase"": " + recognitionSettings.hasTransferBase + "},
       |""CERTIFICATE"": {
	   |""hasTransferBase"": " + recognitionSettings.hasTransferBase + "}
	   |}";
	
	//формируем тело запроса с настройками
	ТелоЗапроса = "{" + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """kppParse"": " + recognitionSettings.kppParse + "," + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + """customsDeclarationParse"": " + recognitionSettings.customsDeclarationParse + "," + Символы.ПС;
	ТелоЗапроса = ТелоЗапроса + РаспознаваниеДанныхОснования;
	ТелоЗапроса = ТелоЗапроса + "}";
	
	МетодAPI = "/api/v1/spaces/" + ИдентификаторПространства + "/recognitionSettings?format=xml";
	РезультатЗапроса = ВладелецФормы.ВыполнитьЗапрос("ОбновлениеНастроекРаспознавания","PATCH",МетодAPI,ТелоЗапроса);
	
	Если РезультатЗапроса.Успешно Тогда
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
		Сообщение.Текст = РезультатЗапроса.ТекстОшибки;
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецФункции


// ================= Подключение модуля кастомизации ===================

&НаСервере
Функция МодульКастомизации_ПолучитьДанныеОбработки(ОбработкаСсылка)
	
	Результат = Новый Структура("Успешно,ТекстОшибки,АдресВХ",Ложь,"");
	
	Попытка
		ОбработкаОбъект = ОбработкаСсылка.ПолучитьОбъект();
		
		//У БИТ.Стоматология реквизит хранилища внешней обработки - ХранилищеВнешнейОбработки
		Если ОбработкаСсылка.Метаданные().Реквизиты.Найти("ХранилищеВнешнейОбработки") <> Неопределено Тогда
			ДвоичныеДанные = ОбработкаОбъект.ХранилищеВнешнейОбработки.Получить();
		Иначе
			ДвоичныеДанные = ОбработкаОбъект.ХранилищеОбработки.Получить();
		КонецЕсли;
		
		Результат.АдресВХ = ПоместитьВоВременноеХранилище(ДвоичныеДанные,Новый УникальныйИдентификатор);		
		Результат.Успешно = Истина;		
	Исключение
		Результат.ТекстОшибки = "При подключении модуля кастомизации произошла ошибка: " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции
&НаСервере
Процедура МодульКастомизации_ТестовоеПолучениеДанныхОбработки()
	
	//Комментарий для аудитора: Для Фреш не выполняется подключение дополнительной внешней обработки "Модуль кастомизации",
	//реквизит ЭтоФреш определяется в процедуре ПриСозданииНаСервере Владельца этой формы
	Если ЭтоФреш Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	ВременнаяСтруктураНастроек = ПолучитьСтруктуруНастроекНаСервере();
	
	ПолучениеМК = РеквизитОбъект._УФ_МодульКастомизации_Получить(ВременнаяСтруктураНастроек);
	
КонецПроцедуры
