
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ПоказателяДляОценкиСостояния.Записывать = Истина;
	Движения.Записать();
	Для Каждого ТекСтрокаПоказатели Из Показатели Цикл
		Движение = Движения.ПоказателяДляОценкиСостояния.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Показатель = ТекСтрокаПоказатели.Показатель;
		Движение.Сумма = ТекСтрокаПоказатели.Сумма;
	КонецЦикла;
    Движения.ПоказателяДляОценкиСостояния.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
