&НаКлиенте
Перем ОповещениеВыполнено; // признак оповещения перед закрытием формы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОповещениеВыполнено = Ложь;
	
	Если ВладелецФормы.СтруктураНастроек <> Неопределено Тогда
		
		УзелОбмена = ВладелецФормы.СтруктураНастроек.ОбменДанными_УзелОбменаНоменклатурой;
		
		Если Не ЗначениеЗаполнено(УзелОбмена) Тогда
			//Не заполнен узел обмена, предложим пользователю создать его автоматически для дальнейшей работы регламентного задания выгрузки номенклатуры
			ДопПараметры = Новый Структура;
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьНастройкуРегламентногоЗадания",ЭтаФорма,ДопПараметры);
			ПоказатьВопрос(ОписаниеОповещения,"В настройке текущего пространства не задан узел обмена номенклатурой.
											  |Настроить эту обработку для периодической автоматической выгрузки номенклатуры?
											  |(будет создан узел обмена и, если не задано, расписание обмена с порталом, 1 раз в день)",РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьНастройкуРегламентногоЗадания(Результат,ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		//Проверяем, заполненые ли логин/пароль в настройках, если нет - просим сперва авторизоваться
		СтруктураНастроек = ВладелецФормы.СтруктураНастроек;
		Если СтруктураНастроек.Свойство("Логин") И ЗначениеЗаполнено(СтруктураНастроек.Логин)
			И СтруктураНастроек.Свойство("Пароль") И ЗначениеЗаполнено(СтруктураНастроек.Пароль) Тогда
			Результат = НастроитьРегламентноеЗаданиеВнешнейОбработки(СтруктураНастроек);
			
			Если Результат.Успешно Тогда
				
				ПоказатьОповещениеПользователя("Успешно",,"Расписание и настройки для регламентного задания сохранены");
				
				//Переносим структуру
				ВладелецФормы.СтруктураНастроек = СтруктураНастроек;
			Иначе
				ВладелецФормы.СообщитьСообщение(Результат.ТекстОшибки);
			КонецЕсли;
			
		Иначе
			ВладелецФормы.СообщитьСообщение("Перед заполнением настроек регламентного задания необходимо авторизоваться на портале в основной форме");
		КонецЕсли;
			
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция НастроитьРегламентноеЗаданиеВнешнейОбработки(СтруктураНастроек)
	
	Результат = Новый Структура("Успешно,ТекстОшибки",Ложь);
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	//Найдем публикацию этой обработки в справочнике внешних обработок для настройки регламеного задания
	Если Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки") <> Неопределено Тогда
		Обработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта","Entera_ЗагрузкаДокументов");
		
		Если ЗначениеЗаполнено(Обработка) Тогда
			НайденныеСтроки = Обработка.Команды.НайтиСтроки(Новый Структура("Идентификатор","1"));
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				//Если установлено расписание выполнения обработки - не изменяем
				Если ЗначениеЗаполнено(НайденныеСтроки[0].РегламентноеЗаданиеGUID) Тогда
					Результат.Успешно = Истина;
					
				Иначе					
					АктуальныеКоманды = Новый ТаблицаЗначений;
					АктуальныеКоманды.Колонки.Добавить("БыстрыйДоступПредставление");
					АктуальныеКоманды.Колонки.Добавить("ВариантЗапуска",Новый ОписаниеТипов("ПеречислениеСсылка.СпособыВызоваДополнительныхОбработок"));
					АктуальныеКоманды.Колонки.Добавить("ЗаменяемыеКоманды");
					АктуальныеКоманды.Колонки.Добавить("Идентификатор");
					АктуальныеКоманды.Колонки.Добавить("ИсходныйНомерСтроки",Новый ОписаниеТипов("Число"));
					АктуальныеКоманды.Колонки.Добавить("Комментарий");
					АктуальныеКоманды.Колонки.Добавить("Модификатор");
					АктуальныеКоманды.Колонки.Добавить("НомерСтроки",Новый ОписаниеТипов("Число"));
					АктуальныеКоманды.Колонки.Добавить("ПоказыватьОповещение",Новый ОписаниеТипов("Булево"));
					АктуальныеКоманды.Колонки.Добавить("Представление");
					АктуальныеКоманды.Колонки.Добавить("РегламентноеЗаданиеGUID",Новый ОписаниеТипов("УникальныйИдентификатор"));
					АктуальныеКоманды.Колонки.Добавить("РегламентноеЗаданиеИспользование",Новый ОписаниеТипов("Булево"));
					АктуальныеКоманды.Колонки.Добавить("РегламентноеЗаданиеПредставление");
					АктуальныеКоманды.Колонки.Добавить("РегламентноеЗаданиеРазрешено",Новый ОписаниеТипов("Булево"));
					АктуальныеКоманды.Колонки.Добавить("РегламентноеЗаданиеРасписание",Новый ОписаниеТипов("СписокЗначений"));
					АктуальныеКоманды.Колонки.Добавить("Скрыть",Новый ОписаниеТипов("Булево"));
					
					АктуальнаяКоманда = АктуальныеКоманды.Добавить();
					ЗаполнитьЗначенияСвойств(АктуальнаяКоманда,НайденныеСтроки[0]);
					
					РасписаниеКоманды = Новый РасписаниеРегламентногоЗадания;
					РасписаниеКоманды.ДатаНачала = ТекущаяДата();
					РасписаниеКоманды.ПериодНедель = 1;
					РасписаниеКоманды.ПериодПовтораДней = 1;
					
					АктуальнаяКоманда.РегламентноеЗаданиеРасписание.Добавить(РасписаниеКоманды);
					АктуальнаяКоманда.РегламентноеЗаданиеИспользование = Истина;
					
					// Создать и зарегистрировать регламентное задание
					ОбработкаОбъект = Обработка.ПолучитьОбъект();
					ОбработкаОбъект.ДополнительныеСвойства.Вставить("АктуальныеКоманды",АктуальныеКоманды);
					
					Попытка
						ОбработкаОбъект.Записать();
						Результат.Успешно = Истина;
					Исключение					
						Результат.ТекстОшибки = "Ошибка при установке расписания выполнения обмена: " + РеквизитОбъект.КраткоеОписаниеОшибки(ОписаниеОшибки());
					КонецПопытки;
					
				КонецЕсли;
			Иначе
				Результат.ТекстОшибки = "Ошибка при установке расписания выполнения обмена: внешняя обработка не имеет команды для выполнения регламентного задания, попробуйте загрузить актуальную версию";
			КонецЕсли;
		Иначе
			Результат.ТекстОшибки = "Ошибка при установке расписания выполнения обмена: внешняя обработка не зарегистрирована в дополнительных обработках данной базы 1с";
		КонецЕсли;
	Иначе
		Результат.ТекстОшибки = "Ошибка при установке расписания выполнения обмена: в конфигурации не найден справочник ДополнительныеОтчетыИОбработки";
	КонецЕсли;
	
	//Включить синхронизацию
	Если Метаданные.Константы.Найти("ИспользоватьСинхронизациюДанных") <> Неопределено Тогда
		Константы.ИспользоватьСинхронизациюДанных.Установить(Истина);
	КонецЕсли;
	
	//Настройки создаются за пользователя, должны включать в себя узел обмена
	Если Результат.Успешно Тогда
		
		Результат = РеквизитОбъект.ПолучитьСсылку_УзелОбменаНоменклатурой(Истина);
		
		УзелОбмена = Результат.Ссылка;
		
		//добавим в настройку автоматического обмена
		Если ЗначениеЗаполнено(УзелОбмена) Тогда
			СтруктураНастроек.Вставить("ОбменДанными_УзелОбменаНоменклатурой",УзелОбмена);
			ХранилищеОбщихНастроек.Сохранить("Entera_ЗагрузкаДокументов","ОбщиеНастройки",СтруктураНастроек,"Entera");			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ОповещениеВыполнено Тогда
		Отказ = Истина;
		ВыполнитьПередЗакрытьФорму();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ОповещениеВыполнено = Истина;
	ЭтаФорма.Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПередЗакрытьФорму()
	
	ОповещениеВыполнено = Истина;
	Результат = Новый Структура();
	
	Оповестить("ЗакрытиеФормы_ВыгрузкаНоменклатуры", Результат);
		
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатуру(Команда)
	ЗаполнитьНоменклатуруНаСервере();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьНоменклатуруНаСервере()
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	СписокНоменклатуры.Загрузить(РеквизитОбъект.ПолучитьТаблицуНоменклатуры(УзелОбмена));
КонецПроцедуры


&НаКлиенте
Процедура Выгрузить(Команда)
	
	Если ЗначениеЗаполнено(ВладелецФормы.Отбор_Пространство) Тогда
		ВладелецФормы.СтруктураНастроек.Вставить("Пространство",ВладелецФормы.Отбор_Пространство);
		
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("Токен",ВладелецФормы.Токен);
		
		Результат = ВыгрузитьНоменклатуруНаСервере(ПараметрыЗапроса,ВладелецФормы.СтруктураНастроек);
		
		Если Результат.Успешно Тогда
			ПоказатьОповещениеПользователя("Завершено",,"Выгружено " + Результат.Выгружено + ", обновлено " + Результат.Обновлено + " элементов номенклатуры");
			
			Если Результат.ТекстОшибки <> "" Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
				Сообщение.Текст = Результат.ТекстОшибки;
				Сообщение.Сообщить();
			КонецЕсли;
			
			ЭтаФорма.Закрыть();
		Иначе
			ВладелецФормы.СообщитьСообщение(Результат.ТекстОшибки);
		КонецЕсли;
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
		Сообщение.Текст = "Пространство не может быть пустым";
		Сообщение.Поле = "Отбор_Пространство";		
		Сообщение.Сообщить();
		
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Функция ВыгрузитьНоменклатуруНаСервере(ПараметрыЗапроса,СтруктураНастроек)
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	МассивНоменклатуры = СписокНоменклатуры.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	Возврат РеквизитОбъект.ВыгрузитьНоменклатуруНаПортал(МассивНоменклатуры,ПараметрыЗапроса,СтруктураНастроек);	
КонецФункции
